{"id": 5, "url": "https://www.cs.jhu.edu/academic-programs/graduate-studies/mse-programs/", "university_name": "Johns Hopkins University", "content": "Secondary Navigation Info For Navigation Utility Navigation Site Navigation Info For Navigation You are here: \n\t\t\t\t\t\t\t\t\tMaster of Science in Engineering in Computer Science (MSE)\t\t\t\t\t\t\t\t Master of Science in Engineering in Computer Science (MSE) Navigation The Computer Science Department in the Whiting School of Engineering (WSE) of Johns Hopkins University offers full-time programs at the Homewood campus in Baltimore. The MSE in Computer Science offers an official concentration in  , its only concentration jointly administered with the Center for Language and Speech Processing. (We also offer a ) Entering students are expected to have completed a program of study equivalent to that required by the BS in computer science. Applicants from other disciplines are expected to have coursework (or equivalent experience) in intermediate programming (C++ and Java), data structures, computer system fundamentals, and mathematical foundations for computer science. The application process is handled through WSE’s   online graduate student . You will find instructions for applying to graduate degree programs for both international and domestic students  . Additionally, please review the  for answers to commonly asked questions. A note about the GRE requirement listed below: The Department of Computer Science reviews applications on a holistic basis; although the GRE is required by the Whiting School of Engineering, scores are not reviewed by the admissions committee and thus are not a factor in final decisions. If you have further questions, feel free to email . \n\t\t\t\t\t\t\t \n\t\t\t\t\t\t For Current Students Policies, resources, forms, course information, and services for graduate students. \n\t\t\t \n\t\t\t \n\t\t Department of Computer Science Footer Navigation Legal Navigation     Site Menu Site Navigation Utility Navigation Secondary Navigation"}
{"id": 7, "url": "https://www.cs.rochester.edu/graduate/masters-program.html", "university_name": "University of Rochester", "content": "University of Rochester Site Navigation Graduate Programs Master’s Program in Computer Science The master’s program offers students a high level of flexibility. Students may focus on one area of computer science, or take courses across the breadth of the field. The degree may be completed on a full-time or part-time basis. For students with an undergraduate degree in computer science or a closely related field, the requirements can usually be completed over the course of three semesters. We welcome applications from students who did not major in computer science but whose undergraduate work demonstrates strong technical skills. This program is for students who intend to complete their studies at the University of Rochester with an MS degree. Students with an undergraduate degree who wish to get their PhD in computer science at Rochester should apply directly to the PhD program. For application and financial support information see the  . Program Requirements Students must complete a minimum of 30 credits. Of these credits: MS students must pass a comprehensive examination (or essay), typically in the last semester before graduation. Some students may need to take one or more 100- or 200-level prerequisite courses. These courses are not counted toward the 30 credit requirement and are typically taken by students who do not have an undergraduate degree in computer science. In any case, at least 18 hours of the 30 must be courses offered by the Department of Computer Science. Students must maintain a GPA of 3.0 by the end of their second semester and throughout the rest of their time in the program, and must obtain a least a 2.0 in each course that counts toward the 30 credit hours. These programs are illustrative examples; students may take any program meeting the general requirements above. The following examples are outlined below: CSC 453: Collaborative Programming and Software Design CSC 455: Software Analysis and Improvement CSC 456: Operating Systems CSC 457: Computer Networks CSC 458: Parallel and Distributed Systems CSC 484: Advanced Algorithms CSC 572: Seminar in Programming Languages CSC 495: Independent Research CSC 484: Advanced Algorithms CSC 486: Computational Complexity CSC 487: Advanced Modes of Computation CSC 444: Logical Foundations of Artificial Intelligence CSC 446: Machine Learning CSC 574: Seminar in Theory of Computation CSC 577: Optimization and Machine Learning CSC 495: Independent Research CSC 484: Advanced Algorithms ECE 404: High Performance Microprocessor-Based Systems CSC 453: Collaborative Programming and Software Design CSC 455: Software Analysis and Improvement CSC 458: Parallel and Distributed Systems ECE 465: Performance Issues in VLSI/IC Design CSC 573: Advanced Topics in Memory Systems CSC 495: Independent Research CSC 440: Data Mining CSC 444: Logical Foundations of Artificial Intelligence CSC 446: Machine Learning CSC 448: Statistical Speech and Language Processing CSC 449: Computer Vision CSC 484: Advanced Algorithms CSC 577: Optimization and Machine Learning CSC 495: Independent Research CSC 444: Logical Foundations of Artificial Intelligence CSC 446: Machine Learning CSC 447: Natural Language Processing CSC 448: Statistical Speech and Language Processing CSC 460: Dialog Systems CSC 484: Advanced Algorithms LIN 461: Phrase Structure Grammars CSC 495: Independent Research CSC 410: Web Programming CSC 412: Human Computer Interaction CSC 416: AR/VR Interaction Design CSC 440: Data Mining CSC 460: Technology and Climate Change CSC 571: Probabilistic Theories of Cognitive Processing BCS 511: Behavioral Methods CSC 495: Independent Research Department of Computer Science Arts, Sciences & Engineering Helpful Links"}
{"id": 6, "url": "https://cse.engin.umich.edu/academics/graduate/", "university_name": "University of Michigan", "content": "Graduate Study in CSE Information for prospective and current PhD and Master’s students Graduate programs Join a vibrant, innovative force in research and academics. Learn about opportunities for PhD and Master’s studies in CSE. Graduate admissions Learn how to apply for graduate study in CSE, what the key deadlines are, and how funding works for your degree program of interest. Current student information Learn about the services offered by the Graduate Programs Office, what you need to do as part of your degree progress, and additional funding opportunities."}
{"id": 1, "url": "https://cs.uchicago.edu/mpcs", "university_name": "University of Chicago", "content": "Defining and building the future of computer science, from theory to applications and from science to society. A state-of-the-art research and teaching facility. The new paradigm of computing, harnessing quantum physics. Defining this emerging field by advancing foundations and applications. Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Opportunities for PhDs to work on world-class computer science research with faculty members. At UChicago CS, we welcome students of all backgrounds and identities. Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. \n\t\t\t \n\t\t \n\t\t \t \n\t\t \t \n\t\t \t \n\t\t \t \n\t\t \t"}
{"id": 3, "url": "https://gradschool.cornell.edu/academics/fields-of-study/subject/computer-science/computer-science-ms-ithaca/", "university_name": "Cornell University", "content": "\n\t\t\t\t\t\t \n\t\t\t\t\t\t \n\t\t\t\t\t Computer Science M.S. (Ithaca) Field of Study Program Description Students wishing to earn a Ph.D. should apply directly to the Ph.D. program. However, it is possible to apply directly to the M.S. program. This is a very small, highly selective, four-semester program for students who wish to deepen their knowledge of computer science through advanced coursework, research, writing, and teaching. The program is ideal for self-motivated students who have expository skills, enjoy the research environment, and like working with undergraduates in introductory courses. Students in the program serve as teaching assistants and receive full tuition plus a stipend. Please refer to the field of study directly for details. Contact Information 110C Gates Hall Cornell University Ithaca, NY  14853 Concentrations by Subject Tuition Visit the Graduate School's Tuition Rates page. Application Requirements and Deadlines Fall: January 15 Learning Outcomes Demonstrate knowledge at the undergraduate level of four core areas in computer science Demonstrate knowledge, understanding, applications, analysis, and evaluation of material at the graduate level in four out of five important core areas of computer science Demonstrate knowledge, understanding, applications, analysis, and evaluation of the three different value systems of the three computer science research styles that differ in how they evaluate and validate research results Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ  (the Cayuga Nation). The Gayogo̱hó꞉nǫ  are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ  dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ  people, past and present, to these lands and waters. \r\nThis land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ  leadership.  Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820\t  © 2024"}
{"id": 4, "url": "https://www.cs.columbia.edu/education/ms/", "university_name": "Columbia University", "content": "M.S. The Master of Science (MS) program is intended for people who wish to broaden and deepen their understanding of Computer Science. Columbia University and the New York City environment provide excellent career opportunities in multiple industries. The program provides a unique opportunity to develop leading-edge in-depth knowledge of specific computer science disciplines. The department currently offers concentration tracks covering eight such disciplines. MS students are encouraged to participate in state-of-the-art research with our research groups and labs. Choose one of the tracks below, view each track webpage for details on requirements.  will be assigned after you select a track in Mice. If you do not yet have a Mice account but are a CS MS student, please contact  . Contact your Track Advisor to get special permission for any course not specifically approved on your  . Students should keep an updated copy of their   on hand for any academic progress reviews with their Faculty and/or Admin advisor. This form will also be requested a few weeks before graduation to verify your program requirements are met. If you are interested in applying a specialized Topics in Computer Science courses (COMS 4995 or COMS 6998) to your Track electives, please view  Students may take multiple sections of COMS 4995 and/or COMS 6998, as each topic title will vary by content each semester. If you aren’t sure if a course is the same, please email your  A list of current and recent Topics Course Descriptions can be found  . In addition to the Computer Science MS Program, we offer the Computer Engineering MS Program jointly with the Electrical Engineering Department. More information about the program can be found in the Computer Engineering section of the SEAS bulletin and on the  . Admitted students will enroll for a total of four semesters. In addition to taking classes already offered at the Journalism and Engineering schools, students will attend a seminar and workshop designed specifically for the dual degree program. The seminar will teach students about the impact of digital techniques on journalism; the emerging role of citizens in the news process; the influence of social media; and the changing business models that will support news gathering. In the workshop, students will use a hands-on approach to delve deeply into information design, focusing on how to build a site, section, or application from concept to development, ensuring the editorial goals are kept uppermost in mind. For more information, please visit the  . Find open faculty positions  . Friday 2:45 pm Zoom Monday 3:00 pm CSB 452 Wednesday 2:00 pm CSB 452 Monday 10:00 am Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an   in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely,   Mary C. Boyce \nDean of Engineering \nMorris A. and Alma Schapiro Professor {{title}} {{title}} {{fullname}}"}
{"id": 2, "url": "https://gradschool.princeton.edu/academics/degrees-requirements/fields-study/computer-science", "university_name": "Princeton University", "content": "Graduate School Main Menu Search \n \n        Jump To:\n       General Information Overview The Department of Computer Science accepts both beginning and advanced graduate students for study and research leading to the degree of Master of Science in Engineering (M.S.E.) and Doctor of Philosophy (Ph.D.). These degree programs are sufficiently flexible to adapt to individual plans of study and research. Apply Applicants are required to select up to two areas of research interest when applying. M.S.E.: Two supplemental essays are required. M.S.E.: If    is required, a minimum of 28 on the speaking subsection is required. Program Offerings Program Offering: Ph.D. The doctoral program in computer science combines coursework and participation in original research. Most students enter the program with an undergraduate degree in computer science, mathematics, or a related discipline. Some entering students may have a master’s degree, but that is not necessary for success in the program. Every admitted Ph.D. student is given financial support in the form of a first-year fellowship. In addition, all admitted Ph.D. students are automatically considered for the prestigious Wu and Upton Fellowships. In preparation for the general examination, the doctoral candidate, in consultation with a faculty adviser, develops an integrated program of study in one of the departmental areas of research. Such preparation usually requires two academic years for students entering with a bachelor’s degree, and one year for students entering with a master’s. Students are required to stand for the general examination at the end of the second year. A total of 6 courses are required. Three courses must be taken to satisfy the core breadth requirement, with one course from each of three main areas of computer science: Systems, Artificial Intelligence (AI), and Theory.  All students must fulfill the core breadth requirements plus one additional course by the end of the second year, demonstrating minimum competence in three main areas. The remaining three courses can be any 400- or 500-level course from any department in the University. Courses taken outside the Department of Computer Science require approval from the student’s academic adviser and the Director of Graduate Studies. All courses must be taken for a grade. A grade of B+ or higher is required to get credit towards course requirements, although at most one B will be accepted for a course that does not satisfy the core breadth requirements. Individual research areas may request additional courses in excess of departmental requirements or may require students in that subfield to complete specific required courses in fulfillment of course requirements. Breadth requirement core course list: Systems Artificial Intelligence Theory The general examination consists of a research seminar prepared under the supervision of a faculty member, followed by an in-depth oral examination on the contents of the seminar and the associated general area of research. The oral examination tests the student's knowledge in a number of topics relevant to the student's research area. These topics are specified beforehand by an examining committee in consultation with the student. The seminar is open to the public, and at least three computer science faculty members must attend. Two are invited by the student; the adviser chooses a  third faculty member who could be in any area of Computer Science or related fields.  The examining committee and the student agree upon a reading list for the exam. This document is to be made available to anyone present in the oral examination, and only questions pertaining to either the material described in the document or presented during the research seminar can be asked during the oral examination. Original research results do not have to be presented, but problems whose solution may lead to a thesis should be discussed. In many cases, the student’s thesis is in the same area as the research seminar, but this is not required. The Master of Arts (M.A.) degree is normally an incidental degree on the way to full Ph.D. candidacy once a student has successfully completed the general examination. The M.A. may also be awarded to students who, for various reasons, leave the Ph.D. program, provided the student has successfully completed the six required courses from the Breadth Requirement. Please note, students admitted to the Ph.D. program who do not wish to complete the program may be considered for an M.S.E. degree with approval from the department and the Graduate School. Ph.D. students who have already been awarded the incidental M.A. are not eligible to earn an M.S.E. For students who entered the Ph.D. Program before Fall 2018: The Master of Arts degree can be awarded after successfully completing all the year 2 requirements -- 3 core courses, one additional course, and passing the general exam.   For students who entered the Ph.D. Program Fall 2018 and after: The Master of Arts degree can be awarded after successfully completing the 6 required courses from the Breadth Requirements. Teaching experience is considered to be a significant part of graduate education. All Ph.D. candidates are therefore required to assist with course instruction for the equivalent of two terms. Pre-FPO The preliminary FPO is a research talk given to the anticipated FPO committee approximately six months before the FPO date. The pre-FPO covers results to date and planned research, and serves as a preliminary critique of the proposed dissertation.  Graduate students will present a public talk followed by a private meeting with the committee.  The outcome of the pre-FPO is not graded. Graduate students are provided with valuable feedback to the committee expects will guide any final work and will be incorporated into the dissertation. FPO Committee must be identical to the Pre-FPO committee; any subsequent changes to the committee require approval from the DGS. The Ph.D. is awarded after the acceptance of the dissertation and completion of the final public oral. Program Offering: M.S.E. The Master's degree at Princeton is a two year, full-time program. All admitted students will initially be enrolled in the Master of Science in Engineering (M.S.E.), thesis-required track. In the spring of year 1, as part of readmission, all students will be given the option to switch to the Master of Engineering (M.Eng.), non-thesis track. Students opting to remain on the M.S.E. track must have a confirmed research adviser and should also have a preliminary thesis proposal. Switching from the M.S.E. track to the M.Eng track will be permitted through January of Year 2. All coursework must be taken for a grade. A minimum of 4 courses must be taken in year 1. If, due to scheduling conflicts,this is not possible, approval by the Director of Graduate Studies is required. In no event will time to degree be extended beyond two years. Funding is normally in the form of teaching assistantships covering the four semesters of the program. Summer funding for M.S.E. candidates in the form of a research assistantship may be offered at the adviser's discretion. Students wishing to continue on for a Ph.D. should apply through the normal application process during the fall of their second year of study. Undergraduate senior thesis and undergraduate independent work courses are not included in this policy. The   is a two year, full-time program of coursework plus submission of an original thesis. Candidates choose a subarea of computer science on which to focus by taking appropriate courses, and writing a thesis under the direction of an adviser. Course requirements are fulfilled by taking six courses for a grade, at least three of which must be 500-level courses. The other eligible courses are 318, 320, 324, 326, 343, 352, 375, or any 400-level course, or 500-level COS course, including COS 597 and 598. You may view a list of approved courses outside of the department   Relevant courses from outside the department may be taken with Director of Graduate Studies consent. Candidates must maintain a B average, with no more than one C allowed. In order to be readmitted for a second year, candidates must have a confirmed thesis adviser and preliminary thesis proposal by the end of the first year. In addition to satisfactory completion of coursework, candidates must prepare and submit an original thesis as well as present a public seminar on the research. The thesis will be reviewed and graded by your adviser plus one additional reader from the Princeton faculty. If the reader is from outside the Computer Science Department, approval by the Director of Graduate Studies is required. The public seminar is an ungraded 20-minute talk, followed by a 10-minute question session, given in the spring of year 2. This will allow your adviser and reader to give preliminary feedback prior to submission of the final thesis. The written thesis should be a research paper of \"scholarly quality\" -- making a novel contribution to scholarship in the field. The thesis should motivate the chosen research problem, evaluate the proposed solution (e.g., via analysis, measurement, simulation, or prototype implementation), and compare the approach to the related work in the field. While there is no specific length requirement, a reasonable target is a typical conference paper (e.g., 10-15 pages in two-column format or 20-40 pages in single-column, double spaced format). Candidates choose a subarea of computer science on which to focus by taking appropriate courses, and writing a thesis under the direction of an advisor. \nIn order to be readmitted for a second year, candidates must have a confirmed thesis advisor and preliminary thesis proposal by the end of the first year. Students remaining in the MSE program should identify a thesis advisor and submit a 350-500 word thesis proposal abstract (approved by the thesis advisor) by the re-enrollment deadline. \nCandidates must prepare and submit an original thesis as well as present a public seminar on the research. The thesis will be reviewed and graded by your adviser plus one additional reader from the Princeton faculty. If the reader is from outside the Computer Science Department, approval by the Director of Graduate Studies is required. The public seminar is an ungraded 20 minute talk, followed by a 10 minute question session, given in the spring of Year 2. This will allow your adviser and reader to give preliminary feedback prior to submission of the final thesis. \nThe written thesis should be a research paper of \"scholarly quality\" -- making a novel contribution to scholarship in the field. The thesis should motivate the chosen research problem, evaluate the proposed solution (e.g., via analysis, measurement, simulation, or prototype implementation), and compare the approach to the related work in the field. While there is no specific length requirement, a reasonable target is a typical conference paper (e.g., 10-15 pages in two-column format or 20-40 pages in single-column, double spaced format).  \nStudents may resubmit their thesis with revisions for final archiving by Dean's Date.  After being graded, one bound copy of the final version must be submitted to Mudd Library and a PDF file is due to the Graduate Coordinator.  Click here to review  . MSE course requirements are fulfilled by completion of   courses: three Core courses and three  . \nCandidates must maintain a B average, with no more than one C allowed. All courses must be taken for a letter grade. Candidates electing to switch to the   degree track are not required to submit a thesis: the following Course Requirements suffice for the degree. MEng course requirements are fulfilled by completion of   courses over two years: three Core courses and five Elective courses. \nCandidates must maintain a B average, with no more than one C allowed.  All courses must be taken for a letter grade.  Students in excellent academic standing who intend to transition to the M.Eng. track may request the department accelerate their two-year program by either one semester or one year, provided all the applicable following conditions are met: 1. Satisfactory performance in all past, current, and future Teaching Assistantship assignments at the University, as evaluated by the Instructor of Record of the course the student is assigned to; \n2. The request must be made in writing to the department   the Faculty Deadline for Submission of Graduate Course Grades at the end of the first semester of study; \n3. : Three courses completed in the first semester, with all A grades (one A- permitted). \n4.   Four courses completed in the first semester, with all A grades (one A- permitted). The department will cancel the request if the student later chooses to remain on the M.S.E. track during their Year 1 reenrollment. Students who accelerate may choose to revert their program of study to its original \nlength by communicating this request in writing to the department.   There is now a special policy that allows current Princeton students to count up to two courses taken as an undergraduate towards a Master's degree in Computer Science at Princeton. Those two courses must be upper-level COS courses that fulfill requirements of the Master's degree and have been taken in excess of the COS requirements for the undergraduate degree. For example, if you take ten COS departmentals as an undergraduate at Princeton, and two of them are advanced classes that satisfy requirements of the Master's program, then you can count both towards a Master's degree if you are accepted into the program.  This is a way to reduce your expected time to completion by approximately one semester. The master’s program is fully funded by teaching assistantships. Master's students are required to hold a full teaching assistantship each semester that they are enrolled. Candidates for the M.S.E. must prepare and submit an original thesis as well as present a public seminar on the research. The thesis will be reviewed and graded by the student’s adviser plus one additional reader from the Princeton faculty. If the reader is from outside the Department of Computer Science, approval by the director of graduate studies is required. The public seminar is an ungraded 20-minute talk, followed by a 10-minute question session, given in the spring of year 2. This will allow the student’s adviser and reader to give preliminary feedback prior to submission of the final thesis. The written thesis should be a research paper of scholarly quality, making a novel contribution to scholarship in the field. The thesis should motivate the chosen research problem, evaluate the proposed solution (e.g., via analysis, measurement, simulation, or prototype implementation), and compare the approach to the related work in the field. While there is no specific length requirement, a reasonable target is a typical conference paper (e.g., 10-15 pages in two-column format or 20-40 pages in single-column, double-spaced format).  Thesis is due to the adviser, reader, and department prior to Deans Date. Students may resubmit their thesis with revisions for final archiving by Dean's Date.  After being graded, a .pdf file is due to the Graduate Coordinator and should be uploaded to ProQuest.  Click here to review  .   Faculty For a full list of faculty members and fellows please visit the department or program website. Permanent Courses \n          Courses listed below are graduate-level courses that have been approved by the program’s faculty as well as the Curriculum Subcommittee of the Faculty Committee on the Graduate School as permanent course offerings. Permanent courses may be offered by the department or program on an ongoing basis, depending on curricular needs, scheduling requirements, and student interest. Not listed below are undergraduate courses and one-time-only graduate courses, which may be found for a specific term through the Registrar’s website. Also not listed are graduate-level independent reading and research courses, which may be approved by the Graduate School for individual students.\n         Footer Princeton University Graduate School \nClio Hall, Princeton, NJ, 08544 \nContact:  \n  © 2024 The Trustees of Princeton University\n"}
