[
  {
    "id": 9,
    "data": "2024-05-17T19:20:31.252633",
    "url": "https://www.stanford.edu/admission/",
    "university_name": "Stanford University",
    "title": "Admission",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Admission Explore the possibilities of a Stanford education. 7,841 Undergraduate students Class of 2027 from 76 countries + 49 states 9,688 Graduate students Undergraduates Undergraduate Admission About 1,700 freshmen and 30 transfer students enroll at Stanford each year. We review each applicant with an eye to academic excellence, intellectual vitality, and personal context. Undergraduate Admission Undergraduate Financial Aid Stanford meets the full financial need of every admitted undergrad who qualifies for assistance. Tuition is covered for undergrads with family incomes under $150,000. Tuition, room, and board are covered for undergrads with family incomes below $100,000. Undergraduate Financial Aid Profile of the Class of 2027 Class of 2027 Graduate Studies Graduate Admission More than 200 degree programs are offered across seven schools at Stanford. Admission requirements vary greatly among them. Graduate Admissions Financing Graduate Study The cost of graduate study at Stanford — and the resources available for financial support — vary by degree, school and enrollment status. About 85% of Stanford graduate students receive financial assistance. Graduate Student Funding Vice Provost for Graduate Education The Office of the Vice Provost for Graduate Education offers information for prospective students of the 200+ graduate degree programs offered at Stanford. Information for Prospective Students Financial Aid We are committed to making a world-class education affordable. About 65% of students receive financial aid toward the cost of attendance Tuition covered for undergrads with family incomes below $150,000 Tuition, room, & board covered for undergrads with family incomes below $100,000 Graduate aid available based on available funds and academic merit More About Financial Aid Applying To Other Programs Summer Session High school students, current Stanford students, and other college students can all apply to participate in eight-week summer academic programs. Summer Session Lifelong Learning Stanford offers valuable opportunities in continuing adult education, executive, and professional programs, and special programs for K-12 students. Continuing Education Programs Postdocs Information for postdoctoral scholars seeking positions at Stanford University. Postdoctoral Positions Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:20:47.589721",
    "url": "https://emergency.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to content Emergency Information Stanford University Menu Home Resources About this site Current Status There is no emergency at this time. Emergency Hotlines 650-725-5555 844-ALERTSU (844-253-7878) For Emergency Assistance Dial 911 (9-911 from campus phones) UPDATE to report of threat on campus February 16, 2024 3:20 pm ALERTSU UPDATE: 2/16/24 at 3:14pm DPS responded to several locations on campus in response to the threat and has since conducted additional investigation. At this time, DPS has no additional information that lends credibility to the threat of a shooting on campus. Please call 911 immediately if you observe any suspicious activity. https://police.stanford.edu/alert ________________________________________ This emergency notification is being sent in compliance with the Clery Act. FAQs about the Clery Act and the AlertSU notifications can be found here: https://police.stanford.edu/pdf/Clery-FAQ.PDF ALERTSU – Report of a threat to commit a shooting February 16, 2024 1:41 pm ALERTSU: 02/16/2024 at 12:40pm, an unidentified person called the non-emergency phone at Palo Alto dispatch stating he was at the entrance to campus and intended to commit a shooting. DPS responded immediately to the area and has been evaluating the veracity of the call. Out of an abundance of caution, we are notifying the community. Call 911 immediately if you observe suspicious activity. ________________________________________ This emergency notification is being sent in compliance with the Clery Act. FAQs about the Clery Act and the AlertSU notifications can be found here: https://police.stanford.edu/pdf/Clery-FAQ.PDF AlertSU AlertSU is the Stanford University emergency notification system. It delivers time-sensitive emergency notifications via phone, email, text messages, and outdoor warning sirens to all members of the Stanford community. Learn more about AlertSU Public Safety Alerts Community Public Safety Alerts include non-emergency alerts about crimes and issues which could potentially affect the larger Stanford community. See community alerts Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:20:49.131777",
    "url": "https://uit.stanford.edu/security/copyright-infringement",
    "university_name": "Stanford University",
    "title": "Report Alleged Copyright Infringement",
    "content": "Skip to content Skip to site navigation Skip to service navigation University IT Navigation menu Explore services View all services View services approved for High Risk Data I want to ... Use video conferencing tools Get IT training Create web forms and surveys Set up email Set up two-step authentication Sponsor a SUNet ID Get software Connect to the network Secure my mobile device Get website hosting Publish a website Get started with IT at Stanford Log into ... Email and calendar Zoom video conferencing Medicine Box file storage Mailing lists Stanford Accounts MyDevices Qualtrics survey tool Google Drive Understanding single sign on View alerts Get support Find answers Report a security incident Request something Get help Open Search Information Security Overview I want to... Report a lost or stolen device Encrypt my computer Secure my mobile device Report alleged copyright infringement Send High Risk Data via email Back up my files and data See all of my devices Request a security review Request a compliance exception Report an incident Travel to a foreign country Use a password manager Avoid identity theft View all security tools and services Guides Getting started System administrator Watch Information Security Awareness Video Protecting sensitive data Responsible AI Other Stanford security resources Stay safe from phishing scams Upcoming events Policies Administrative Guide Information Security Data Security Encryption at Stanford Risk Classifications Risk Classifications: Approved Services Minimum Security Standards Third party security requirements Data Sanitization Payment Card Industry (PCI) Privacy HIPAA FERPA Get involved Bug Bounty Program Internships About Unit Overview Contact Us Report Alleged Copyright Infringement Stanford has designated an agent to receive notifications of alleged copyright infringement in the stanford.edu, stanford.org, stanford.com, sup.org, and supdigital.org domains. If you believe your copyrighted work is being infringed on a Stanford site, please notify the Stanford Information Security Office. Contact information ServiceNow R eport Copyright Infringement Email: DMCA-claim@stanford.edu Phone: +1 650-725-4357 Surface Mail: Information Security Office Stanford University 505 Broadway, 3, 8819 Redwood City, CA 94063 Elements of notification When you notify us of the alleged copyright infringement, please be sure to include the following information: a description of the copyrighted work that is the subject of the claimed infringement (if multiple works are being infringed at a single site, a representative list of such works at that site is adequate); a description of the infringing material and information sufficient to permit Stanford to locate the material; contact information for you, including your address, telephone number, and/or email address; a statement by you that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, or its agent, or the law; a statement by you, signed under penalty of perjury, that the information in the notification is accurate and that you have the authority to enforce the copyrights that are claimed to be infringed; and a physical or electronic signature of the copyright owner or a person authorized to act on its behalf. Failure to include all of the above-listed information may result in a delay of the processing of your complaint. Stanford will terminate the online privileges of users who infringe the copyright of others. More information For more information on the Digital Millennium Copyright Act, please see the U.S. Copyright Office website and the Peer-to-Peer Traffic Advisory Service FAQ . Last modified March 27, 2019 Information Security Report a Lost or Stolen Device Report Alleged Copyright Infringement Peer-to-Peer Traffic Advisory Service FAQ Data Risk Assessment Request a Compliance Exception Report an Incident International Travel Use a Password Manager Computer Equipment Transfer and Disposal Third Party Security Requirements Data Sanitization HIPAA Security and Privacy Policies Avoid Identity Theft Other Stanford Security Resources Related Pages U.S. Copyright Office Computing Policies Open a Help ticket Services Explore all services Cloud Solutions Q&As Get started with IT Practice secure computing Work Anywhere Guide IT perks Support Find answers Request something Get help View system and project status Browser recommendations Tech Resources & Support (for students) University IT About us Organization chart Current job openings Connect News Events Communities of Practice UIT Community (UIT staff only) UIT Web Editors Login Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademark Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:20:49.611999",
    "url": "https://adminguide.stanford.edu/chapters/guiding-policies-and-principles/conflict-interest/ownership-and-use-stanford-trademarks",
    "university_name": "Stanford University",
    "title": "1.5.4 Ownership and Use of Stanford Trademarks and Images",
    "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Administrative Guide Search this site Submit Search Menu Home Chapters 1. Guiding Policies and Principles 2. Human Resources 3. Financial Administration 4. Giving to Stanford 5. Purchasing and Payments 6. Computing 7. Health and Safety 8. Services 9. Organization Charts 10. Student Employment and Assistantships 11. Global Activities About the Guide Change Request Guidelines Frequently Asked Questions Contact What's New Breadcrumb Home Chapters 1. Guiding Policies and Principles 1.5 Conflict of Interest 1.5.4 Ownership and Use of Stanford Trademarks and Images 1.5.4 Ownership and Use of Stanford Trademarks and Images Traversal links for 1.5.4 Ownership and Use of Stanford Trademarks and Images ‹ Previous Next › Skip to main content Secondary Navigation 1. Guiding Policies and Principles 1.1 University Code of Conduct 1.2 University Organization 1.3 Academic Governance 1.4 Academic and Business Relationships With Third Parties 1.5 Conflict of Interest 1.5.1 Political, Campaign and Lobbying Activities 1.5.2 Staff Policy on Conflict of Commitment and Interest 1.5.3 Unrelated Business Activity 1.5.4 Ownership and Use of Stanford Trademarks and Images 1.5.5 Ownership of Documents 1.6 Privacy Policies 1.7 Harassment & Discrimination 1.8 Protection of Minors 1.9 Signature and Financial Approval Authority 2. Human Resources 3. Financial Administration 4. Giving to Stanford 5. Purchasing and Payments 6. Computing 7. Health and Safety 8. Services 9. Organization Charts 10. Student Employment and Assistantships 11. Global Activities Main content start Authority This Guide Memo was approved by the President. Last Updated July 25, 2017 Print Formerly Known As Policy Number: 15.5 This Guide Memo establishes the policies governing use of Stanford's registered trademarks, as well as the use of unregistered names, seals, logos, emblems, images, symbols and slogans that are representative of Stanford (together referred to herein as \"Marks\"). Applicability: This Guide Memo applies to all uses of Stanford's Marks. 1. Marks Stanford’s Marks are owned by Stanford and they are a valuable university asset.  Faculty, students, staff and alumni share in the benefits associated with the Marks, and therefore also share responsibilities to ensure correct use.  Stanford’s Trademark Licensing Office at trademarks@stanford.edu is to be consulted with any questions about Stanford’s Marks and their use. a. Registered Marks A partial list of Stanford’s registered Marks includes, but is not limited to: The word “Stanford” The Block \"S\" with tree emblem The Stanford University seal The Office of the General Counsel maintains a complete list of registered Marks. b. Unregistered Marks A partial list of Stanford’s unregistered Marks includes, but is not limited to: The word “Cardinal” “Farm” or “The Farm” The phrase “Fear the Tree” Block “S” without tree emblem Trademark Licensing maintains a complete list of unregistered Marks. c. Buildings and Landmarks All buildings and landmarks that are generally recognizable as being located on Stanford’s campus or associated with Stanford are considered to be Marks. These images include, but are not limited to: Hoover Tower Memorial Church Palm Drive The Oval The Main Quad Memorial Courtyard Bing Concert Hall Cantor Arts Center Stanford Stadium The Engineering Quad The Knight Management Center 2. Authority The President has delegated authority for approving use of Stanford's Marks as follows: a. Provost For use in connection with educational, research and athletics activities (including courseware and related materials developed for teaching at Stanford) and for special events. b. Vice President for Business Affairs and Chief Financial Officer For use by manufacturers of merchandise and products, in connection with Stanford’s business activities, and by vendors (including promotional use). Only the Vice President for Business Affairs and Chief Financial Officer may grant permission for use of Stanford's Marks on merchandise and products. c. Dean of the School of Medicine For use in connection with Stanford Medicine’s activities. d. Vice President for University Communications For use in film, video, print and digital media, including the University's web pages. e. General Counsel For use in connection with legal affairs. Authority for approving all other uses of Stanford’s Marks remains with the President. These individuals, or their delegates, will collaborate on situations that fall within the scope of authority of more than one office in order to ensure a consistent application of this policy. 3. Use of Marks a. General Stanford’s Marks may only be used by Stanford faculty, staff, students, and alumni as provided in this policy and for no other purposes. Stanford faculty and staff include only those individuals who meet the criteria listed in Sections 1 through 11 of Administrative Guide Memo 2.2.1: Definitions . Students include only individuals currently enrolled in a degree-granting program at Stanford. Alumni include only individuals who have completed at least three quarters of a degree-granting program at Stanford. No other individuals or entities may use Stanford’s Marks without the permission of an individual listed in Section 2, above, or their delegate. b. Faculty and Staff Stanford faculty and staff may only use Stanford’s Marks in connection with Stanford departments, institutes, events, programs, projects, activities, publications and products that are officially sponsored or sanctioned by Stanford. When a faculty or staff member is involved in activities that are not officially sponsored or sanctioned by Stanford (such as independent consulting, outside business activities, civic and volunteer work, and publications), use of Stanford's name and marks is limited to identification of the individual’s Stanford affiliation (e.g., Jane Smith, Professor of History, Stanford University). Stanford’s seal and other emblems may not be used. The Trademark Licensing Office ( trademarks@stanford.edu ) is to be consulted before using Stanford’s Marks on any product, in a book title, in the name of any non-Stanford business or activity, or in the name of a course or program that is not owned by Stanford. Faculty and staff members may not grant permission for use of Stanford’s Marks to individuals and entities outside of Stanford without consultation with the Office of the Vice President for Business Affairs and Chief Financial Officer ( trademarks@stanford.edu ), which will then consult with the appropriate individual with delegated authority as specified in Section 2, above. This prohibition includes granting permission to (a) vendors and others in a business relationship with Stanford, (b) research sponsors, (c) donors, and (d) industrial affiliate program members. All use of Stanford’s Marks in film, video, print and digital media (including in press releases) must comply with this Administrative Guide, as well as the policies established by University Communications ( brandmanager@stanford.edu ). This policy is not intended to limit use of the Stanford’s Marks in situations that fall within the normal scope of Stanford’s activities as a residential academic institution, as a research institution and as an employer. In these instances, Stanford's Marks may be used in accordance with the review processes established by schools, departments, centers and programs so long as the uses approved are consistent with the policies included in this Administrative Guide. c. Students and Alumni Students and alumni may only use Stanford’s Marks as described below: Students and alumni may use Stanford’s name, but no other Marks, to identify their attendance at and degrees from Stanford on resumes and on digital channels such as personal web sites and social media. Undergraduate and graduate students may use Stanford’s name and the Block S with tree emblem on business cards which identify their student status. The approved business card format is included in the Identity Toolkit . Alumni may not use Stanford Marks on business cards. Students and alumni may use Stanford’s Marks in connection with the University-sanctioned activities of student and alumni groups that have received and maintain official ASSU or Stanford Alumni Association recognition, respectively. When the Marks are used in these instances, it must be clear that the activity is either a student activity or an alumni activity, and not a University activity. Only recognized student and alumni groups may produce merchandise that incorporates Stanford Marks. Such merchandise may only be produced in connection with University-sanctioned activities and must comply with all policies and procedures established by the Trademark Licensing Office for licensed product. d. Additional Considerations Use of Stanford’s Marks must comply with the following: In all situations, use of Marks by an authorized individual or entity must be consistent with Stanford’s academic and research mission and its reputation for excellence. All uses of Stanford’s Marks must comply with applicable policies and guidelines, including those included in the Trademark Licensing website , the Identity Toolkit , the Name Use Guidelines , and all other policies and guidelines listed in Section 8, below. All uses of Stanford’s Marks must carry proper trademark designations, as established by the Office of the General Counsel and specified on the Trademark Licensing website. This includes ® on registered marks and TM on unregistered Marks when required. Stanford’s Marks may never be altered or combined with another organization’s name or logo without permission from Stanford’s President, Provost or other individual with delegated authority under Section 2, above. 4. Prohibited Use of Marks The following uses of Stanford’s Marks are not permitted, except as otherwise authorized by (a) this policy, (b) the Name Use Guidelines , (c) other published guidelines or (d) Stanford’s President, Provost or other individual with delegated authority under Section 2, above: By non-Stanford individuals and entities. This includes, but is not limited to, vendors, technology licensees, research funders, donors, industrial affiliate program members, collaborators, partners and guest speakers. In a manner that endorses or implies endorsement of (a) a non-Stanford entity, or (b) the programs, products or services of a non-Stanford entity. By faculty, staff, students, alumni or others in association with any commercial activity or outside venture. In situations which will negatively impact Stanford’s reputation, or which may have the potential to impact negatively Stanford’s reputation. Such situations include, but are not limited to, use of Marks in connection with materials which (i) violate any law or regulation, (ii) have the potential to offend a person or group on the basis of gender, ethnic origin, religion, race, disability or sexual orientation, (iii) could be considered to be pornographic, or (iv) could be considered to be defamatory. In connection with partisan political activities. See Administrative Guide Memo 1.5.1: Political, Campaign and Lobbying Activities . Involvement by individual faculty, staff, students, or alumni in a non-Stanford activity is not a sufficient basis for indicating University sponsorship or endorsement and Marks may not be used in connection with such activities. 5. Trademark Licensing Program All merchandise bearing any Marks must be produced by a licensed vendor and be approved by Stanford’s Trademark Licensing Office. The Trademark Licensing Office will issue or approve all licenses, issue guidelines governing the production, sale and other distribution of licensed merchandise, and manage Stanford’s trademark licensing program. All merchandise produced for sale (including items that are sold to cover the cost of production) will be royalty-bearing at the rate established by the Trademark Licensing Office. Only items that are produced for internal use by Stanford, and are not offered for re-sale, are not royalty-bearing. Net proceeds from Stanford’s trademark licensing program royalties are used to support undergraduate financial aid and the Department of Athletics and Physical Education. 6. Registrations a. Domain Names Domain names that incorporate the words \"Stanford\" or \"Cardinal\" may only be registered in the name of the Board of Trustees of Stanford University and may only be used in connection with activities that are officially sponsored or sanctioned by Stanford. b. Marks Trademarks for the University may only be registered in the name of The Board of Trustees of Leland Stanford Junior University and may only be used in connection with activities that are officially sponsored or sanctioned by Stanford. The Office of the General Counsel is responsible for registration of all trademarks for the University. 7. Enforcement of Rights The University will actively protect its Marks from improper or misleading use by individuals or organizations not associated with Stanford and will ensure that use of Marks by Stanford faculty, students, staff, alumni, schools, departments, institutes, centers and programs conforms to all applicable policies and guidelines. The Office of the General Counsel is responsible for enforcement of Stanford's Marks. 8. Further Information Additional information can be found by contacting the offices listed below: Questions about use of Stanford’s Marks on merchandise or about Stanford’s Trademark Licensing Program should be directed to the Trademark Licensing Office at trademarks@stanford.edu . Questions about use of Stanford’s Marks by vendors, business partners, research and other sponsors, industrial affiliates, foundations and other non-Stanford enterprises should be directed to the Trademark Licensing Office at trademarks@stanford.edu . Questions about use of Stanford’s Marks in connection with Stanford’s educational and research activities should be directed to the Office of the Provost at provost@stanford.edu . Questions about use of Stanford’s Marks for promotional or marketing purposes, in the media, or in digital communications, should be directed to University Communications at brandmanager@stanford.edu . Questions about use of Stanford’s Marks by donors should be directed to the Office of Development at giving.to.stanford@stanford.edu . Questions about use of Stanford Medicine emblems and branding should be directed to the Office of the Dean of the School of Medicine at sombranding@stanford.edu . Questions about use of Stanford Health Care emblems and branding should be directed to brand@stanfordhealthcare.org . Questions about use of Stanford Children’s Health emblems and branding should be directed to marketing@stanfordchildrens.org , and additional information can be found online: http://www.stanfordchildrens.org/en/about/brand . Questions concerning registration of internet domain names should be directed to Web Communications at webcom@stanford.edu . Questions about trademark registrations and enforcement of Stanford’s Marks should be directed to the Office of the General Counsel at trademarkenforcement@stanford.edu . All other questions about use of Stanford's Marks should be directed to the Office of the Vice President for Business Affairs and Chief Financial Officer at trademarks@stanford.edu , which will help identify the correct person or office. Misuse of Stanford’s Marks by non-Stanford entities should be reported to the Office of the General Counsel at trademarkenforcement@stanford.edu . 9. Related Policies and Resources The following policies and resources include related information: https://trademarks.stanford.edu/name-use-guidelines : Additional guidelines for use of Stanford’s Marks by faculty, staff, students, alumni and third parties https://ucomm.stanford.edu/policies/film-photo-video-requests/ : Use of Marks in connection with photographs or film https://trademarks.stanford.edu/name-use-guidelines : Requests to use Marks in advertisements, marketing materials, press releases, movies or television: https://ucomm.stanford.edu/policies/url-name-policy/ : Use of Marks in three-part Internet host names within the Stanford.EDU domain https://ucomm.stanford.edu/policies/social-media-guidelines/ : Use of Marks in social media http://trademarks.stanford.edu : Information on Stanford’s Trademark Licensing Program Research Policy Handbook Chapter 9 :  Use of Marks in connection with Stanford intellectual property Administrative Guide 1.4.1 : Use of Marks in connection with academic and business relationships with third parties Administrative Guide 1.5.1 : Use of Marks in connection with political, campaign and lobbying activities Administrative Guide 8.2: Use of Marks in connection with events and conferences https://identity.stanford.edu/ : Stanford University Design Guidelines and Identity Toolkit http://med.stanford.edu/identity.html : Stanford Medicine Design Guidelines and Identity Toolkit Traversal links for 1.5.4 Ownership and Use of Stanford Trademarks and Images ‹ Previous Next › Related Policies 1.5.1 Political, Campaign and Lobbying Activities In the limited circumstances where individuals must speak or act on behalf of the University regarding political issues, they must do so in accordance with the provisions of this Guide Memo. 1.4.1 Academic and Business Relationships With Third Parties From time to time, the University enters into agreements with various independent entities that may result in an ongoing business or academic relationship with the University. For example, entities with current relationships include Howard Hughes 8.2.1 University Events This Guide Memo summarizes policy on University events held on University property. More detailed information is located at the Office of Special Events & Protocol. Questions about the Guide? Contact the Administrative Guide editor in University Human Resources: Cardinal Hall, 5th Floor, Mail Code 8443 Redwood City, CA 94063 United States Email: guide-editor@lists.stanford.edu If you are a policy owner or designee and need to update a policy, send email to: guide-editor@lists.stanford.edu with your request. If you are ready to request a policy update or housekeeping update for a specific Guide Memo, please refer to the Change Request Guidelines page. Stanford Administrative Guide Address University Human Resources 505 Broadway Cardinal Hall, 5th Floor, Mail Code 8443 Redwood City , CA 94063 United States Policy Chapters 1. Guiding Policies and Principles 2. Human Resources 3. Financial Administration 4. Giving to Stanford 5. Purchasing and Payments 6. Computing 7. Health and Safety 8. Services 9. Organization Charts 10. Student Employment and Assistantships 11. Global Activities Related Resources Cardinal at Work website Faculty Handbook Financial Gateway Graduate Academic Policies and Procedures Handbook HR at Stanford Postdoctoral Scholar Handbook Research Policy Handbook Undergraduate Academic Policies Stanford Safety, Security and Fire Report Stanford Today Academic Staff-Teaching and Other Teaching Staff Handbook Website Feedback Your feedback about the Administrative Guide website will be carefully reviewed. Submit your feedback Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:20:51.359820",
    "url": "https://visit.stanford.edu/basics/index.html",
    "university_name": "Stanford University",
    "title": "The Basics",
    "content": "Skip to content Visitor Information Optional line 2 - add two-line-signature to body class to display Menu Search form Search term Home The Basics Prospective Students Explore Campus Related sites... Community Engagement The Basics Where is Stanford? Silicon Valley Located 35 miles south of San Francisco and 20 miles north of San Jose, Stanford University is in the heart of Northern Californiaâs dynamic \"Silicon Valley,â home to Yahoo!, Google, Hewlett-Packard, and many other cutting-edge companies that were started by and continue to be led by Stanford alumni and faculty. The Bay Area To the west of the Universityâs 8,180-acre campus are the Santa Cruz Mountains and Pacific Ocean, and to the east San Francisco Bay.  Known as The Peninsula , the area is rich in natural beauty, culture, and entertainment. Palo Alto Although the University is virtually a community unto itself and even has its own zip codeâ94305âit calls the City of Palo Alto home. Downtown Palo Alto is a short walk from campus and includes many attractions, as well as many shops and restaurants. Stanford Campus Maps View a searchable campus map and other map resources from Stanford Transportation. Updated on February 27, 2024 9:05 AM CONTENTS Where is Stanford? About Stanford Visitor Center Local Lodging Online Resources Virtual Tours Stanford Mobile App Related Sites Financial Aid Undergraduate Admission Contact Us Connect with us Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:20:57.506629",
    "url": "https://giving.stanford.edu/",
    "university_name": "Stanford University",
    "title": "Giving to Stanford",
    "content": "Skip to main content My Giving (external link) Contact Us Make a Gift (external link) Stanford Giving Menu Areas to Support Why Give How to Make a Gift Give Now Online (external link) Phone or mail Stocks, securities, or wire transfers Memorial or honorary gifts Matching gifts International gifts The Stanford Fund Reunion campaigns Give Over Time New pledge (external link) Make a pledge payment (external link) Give a recurring gift (external link) Plan Your Gift Planned Giving overview Meet the team Bequests and estate plan gifts Life income gifts Donor advised funds Give assets All the ways to make a gift Give through The Stanford Fund to support undergrads. About The Stanford Fund Your Impact Donor Recognition My Giving (external link) Honor rolls (external link) Stanford Loyal Stanford Fund leadership giving Endowed positions Recent estate gifts Founding Grant Society Founders’ Circle Pioneers Pledge All donor communities Give With Your Class Seniors for The Stanford Fund Dollars for Doers Challenge Undergrad reunion campaigns Business school reunion (external link) Law school reunion (external link) Other Ways to Get Involved Ways to volunteer Stanford Fund volunteers Reunion volunteers Stanford Alumni Association (external link) Outreach Volunteer Alumni Link (OVAL) (external link) Read about the many ways you accelerate Stanford’s purposeful impact in the world. Find stories About Office of Development Get to know us Contact us Careers About Giving Gift policies About endowed giving Frequently asked questions Stories We’re here to help you make your biggest impact. Connect with the giving team Search this site Giving to Stanford When you give to Stanford, you drive positive change in the world. Discover why giving matters The Stanford Fund Make a difference in the life of a student. Securities and transfers Make a gift of stock or other securities. Areas to Support Explore opportunities to support the Stanford community. Diversity, equity, inclusion Support inclusion, equity, and access for all. Athletics Support student-athletes today to create leaders for tomorrow. Planned Giving Achieve your philanthropic and financial goals. Why I give “The world needs creative, cross-functional solutions to the existential challenges we face. Stanford is a special place in a constant state of renewal, and it requires work from alumni to keep it special. I want to play my very small part in that.” Calley Means, ’08 Read the latest stories Gift helps expand, reimagine Native American Studies Stanford's Native American Studies program receives a first-of-its-kind gift from Eric and Wendy Schmidt that will further existing offerings and support new ones VanDerveer honored with named court, coachship A women’s basketball assistant coachship to honor former coach Tara VanDerveer was created by a gift from Tashia and John Morgridge, MBA ’57. Donor-funded curriculum transformation projects gain momentum Six teams across campus aim to ensure that all Stanford students can experience belonging and success. See all stories Make your gift Supporting students, fueling groundbreaking research, advancing solutions to societal challenges—your gifts to Stanford drive positive change in the world. Give now (external link) Links to more information Support your cause. Explore giving stories. Talk to a staff member. Stanford Giving Need to get in touch? P.O. Box 20466 Stanford, CA 94309-0466 (650) 724-0627 Talk to the team About Office of Development Office of External Relations (external link) Alumni Association (external link) Careers Make a gift Give now (external link) Gift policies How to make a gift Request help with your gift (external link) FAQs Tax ID 94-1156365 Information for … Advisors Alumni Alumni in reunion Institutional funders (external link) International donors Parents and families Students Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University. Stanford, California 94305. Close Hi, what can we help you find today? Uh oh, it looks like nothing was submitted. Please enter your search terms above and hit enter or click the search icon. Consider browsing by category: Popular topics How to make a gift Talk to the team Planned giving Stocks, securities, or wire transfers Frequently asked questions Get Involved Make a gift (external link) Discover areas to support Support The Stanford Fund Become a volunteer Read donor stories"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:20:59.534026",
    "url": "https://bulletin.stanford.edu/academic-polices/student-conduct-rights/nondiscrimination",
    "university_name": "Stanford University",
    "title": "Stanford University",
    "content": "Skip to main content Stanford University Academic Calendar 2023-24 Schedule of Classes Bulletin Archive Get Help Search . . . Stanford University Home Programs Courses Academic Policies Academic Policies A-Z Academic Progress Requirements Admissions Courses Degree Requirements Enrollment Examinations Financial Aid Grading Graduation Grievances Leaves and Returns Student Conduct and Rights Transfer and Test Credit Tuition and Fees Veterans and Military Benefits Home / Academic Policies / Student Conduct and Rights / Nondiscrimination Policy Nondiscrimination Policy Stanford University admits qualified students of any race, color, national or ethnic origin, sex, age, disability, religion, sexual orientation, gender identity, veteran status, or marital status to all the rights, privileges, programs, and activities generally accorded or made available to students at the University. Consistent with its obligations under the law, in the administration of the University's programs and activities, Stanford prohibits unlawful discrimination on the basis of race, color, national or ethnic origin, sex, age, disability, religion, sexual orientation, gender identity or expression, veteran status, marital status or any other characteristic protected by applicable law; Stanford also prohibits unlawful harassment including sexual harassment and sexual violence.  This policy applies to Stanford programs and activities both on and off-campus, including overseas programs. Contact Information Stanford’s Title IX Coordinator has been designated to handle inquiries regarding regarding this nondiscrimination policy: Kingscote Gardens (2nd floor), 419 Lagunita Drive, Stanford, CA 94305, (650) 497-4955 (voice), (650) 497-9257 (fax), titleix@stanford.edu (email). Individuals may also file complaints directly with the Office for Civil Rights, within the United States Department of Education, by following the information on this website: https://www2.ed.gov/about/offices/list/ocr/complaintintro.html . Quick Links Get Help Academic Calendar Tuition & Fees Enrolling in Courses Bulletin Quick Links About Stanford Share Feedback Schools Doerr School of Sustainability Graduate School of Business Graduate School of Education School of Engineering School of Humanities and Sciences School of Law School of Medicine Stanford University Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:00.010110",
    "url": "https://gradadmissions.stanford.edu",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Graduate Admissions Search this site Submit Search Menu Home Explore Programs How to Apply Eligibility Dates and Deadlines Application Overview Transcripts Test Scores Statements Recommendations Application Fee GRE Fee Reduction Waivers Program Participation Waivers Eligible Programs School-Based Waivers Apply Now FAQ Current Stanford Students Admitted Students Respond to the Offer Requirements of Admission Official Transcripts & Degree Conferral Documents TOEFL Scores & English Placement Test Frequently Asked Questions Welcome Letter Important Dates and Deadlines Funding Graduate Study Estimated Expense Budget Receipt of Aid from Stanford International Students About Welcome to Graduate Admissions Learn about university-wide admission requirements and processes for MA, MS, PhD, and other non-professional graduate programs. How to Apply Main content start Your Starting Point for Graduate Study at Stanford Browse this website to learn about university-wide requirements and processes for admission to MA, MS, PhD, and other non-professional graduate programs in the following Stanford schools: Graduate School of Education | School of Engineering | School of Humanities & Sciences | School of Medicine | Doerr School of Sustainability Explore Graduate Programs Applying to a Professional School? The professional schools have separate admissions offices and applications. Visit their websites below for information about applying to their graduate programs. Graduate School of Business: MBA | MSx | PhD School of Law: JD | Advanced Degrees School of Medicine: MD | MS in Physician Assistant Studies Why Stanford? Consider joining Stanford’s globally diverse graduate community of 9,300 students. Watch Playlist: The Stanford Grad Experience and Advice to Prospective Students Visit Stanford’s Seven Schools See How Diversity Works at Stanford Fund Your Graduate Study Explore Campus Resources Pursue Leadership Development and Funding with Knight-Hennessy Scholars Stanford Graduate Admissions Web Login Visit Campus Map Contact Us Related Links Explore Graduate Programs Graduate Diversity Funding Graduate Study Vice Provost for Graduate Education Knight-Hennessy Scholars Gateways for... Prospective Graduate Students New Graduate Students Stanford Staff (Login Required) Graduate Admissions oversees the application process for non-professional graduate programs (e.g., MA, MS, PhD). To learn about the application processes for professional programs (e.g., JD, MBA, MD), visit the corresponding links on our homepage . Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:01.370036",
    "url": "https://facultypositions.stanford.edu/en-us/listing/",
    "university_name": "Stanford University",
    "title": "Open Faculty Positions",
    "content": "Skip to main content Stanford University Stanford Faculty Positions Applicant login Menu Applicant login Open Faculty Positions Send me jobs like these We will email you new jobs that match this search. Great, we can send you jobs like this, if this is your first time signing up, please check your inbox to confirm your subscription. The email address was invalid, please check for errors. You must agree to the privacy statement Subscribe Recaptcha Privacy agreement Search results Pediatric Otolaryngology Assistant Professor, Associate Professor or Professor Stanford University Seeking Assistant, Associate or Full Professor in the Division of Pediatric Otolaryngology, in the Department of Otolaryngology-Head and Neck Surgery at Stanford University School of Medicine Assistant, Associate or Full Professor: Vascular Neurosurgery Physician Scientist Stanford University 18 Apr 2025 11:55 PM Pacific Daylight Time The Department of Neurosurgery at Stanford University School of Medicine seeks a full-time vascular neurosurgeon at the rank of Assistant, Associate or Full Professor in the University Medical Line based primarily at Stanford University Medical Center. We are particularly interested in candidates who have significant skills as an outstanding surgeon, teacher, and scientist. We are interested in surgeon scientists who are either open vascular neurosurgery trained, or dual trained in open vascular neurosurgery and neuro interventional radiology. Radiation Oncologist for Proton Therapy Program, Open Rank Stanford University The Division of Radiation Therapy in the Department of Radiation Oncology at Stanford University seeks a board eligible or board-certified radiation oncologist to join the Department as an Assistant, Associate or Full Professor in the University Medical Line. We are particularly interested in candidates who have clinical experience and research in proton therapy. This position will be instrumental in the development of the Proton Therapy Program at our Cancer Center in Palo Alto. Sensory Biologist Assistant Professor, Associate Professor or Professor Stanford University Sensory Biologist or Clinician Scientist sought for the Department of Otolaryngology — Head & Neck Surgery at Stanford University (PhD or MD or equivalent) to join as a faculty member at the rank of assistant professor, associate professor or professor in the University Tenure Line, University Medical Line, or the Non-Tenure Line-Research. Pediatric Neonatology Hospitalist Stanford University The Division of Neonatology in the Department of Pediatrics at Stanford University School of Medicine/ Stanford Medicine Children’s Health is recruiting board certified/eligible pediatricians with strong clinical skills in the hospital care of sick newborns and a special interest in neonatal medicine. We currently have openings for full-time, part-time, and moonlighting positions to join the Division as Clinical Assistant Professors, Clinical Associate Professors, or Clinical Professors in the Clinician Educator Line. Pediatric Immunotherapy Clinical Assistant, Associate, Clinical Professor Stanford University The Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University is seeking board certified/eligible Pediatric Oncologists with an interest in CAR-T and Immunotherapy who can contribute to the Division’s clinical and research enterprise at the Assistant, Associate, or Full Professor level in the Clinician Educator lines. Pediatric Oncology Solid Tumor Clinician Educator Stanford University The Department of Pediatrics, Division of Pediatric Hematology/Oncology in the Stanford University School of Medicine, is seeking board certified/eligible applicants at the Assistant, Associate, or Full Professor level in the Clinician Educator or Medical Center lines who can contribute to the Division’s clinical and research enterprise. Areas of emphasis include solid tumors, with a record of successful collaboration and mentorship. Pediatric Hematology Clinician Educator Stanford University The Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University seeks board certified/eligible pediatric hematology applicants who can contribute to the Division’s clinical and research enterprise at the Assistant, Associate, or Full Professor level in the Clinician Educator lines. Gyn and Head & Neck  Radiation Oncologist Stanford University The Division of Radiation Therapy in the Department of Radiation Oncology at Stanford University seeks a board eligible or board-certified radiation oncologist to join the Department as a Clinical Assistant Professor in the Clinician Educator line. We are particularly interested in candidates who have interest and experience with gynecologic brachytherapy. Clinical Pain Scientist Stanford University The Department of Anesthesiology, Perioperative and Pain Medicine seeks a clinical pain research faculty member (open rank) in the University Tenure Line or University Medical Line. Research areas of interest include acute and chronic pain. We are particularly interested in candidates who have programs focusing on clinical trials, regional anesthesia, implementation science, economics, epidemiology, health services research, public health policy, precision medicine, or other high-impact topics. Gastrointestinal Oncology: Assistant, Associate, or Full Professor Stanford University The Division of Oncology in the Department of Medicine at Stanford University invites applications for a position in Gastrointestinal (GI) Oncology in the University Medical Line (UML) at the rank of Assistant Professor, Associate Professor, or Full Professor.  We are seeking a board-certified or eligible Gastrointestinal (GI) oncologist with demonstrated excellence or potential in clinical care, scholarly research, institutional service, education, and mentoring.  A successful candidate will have a commitment to innovative clinical care and high impact research that advances the field of oncology. Intraoperative Neurophysiologic Monitoring (IONM) Stanford University The Division of Intraoperative Neurophysiologic Monitoring (IONM) in the Department of Neurology  at Stanford University seeks a board-certified neurologist to join the Department as Clinical Assistant Professor in the Clinician Educator Line. The major criterion for appointment in the Clinician Educator Line is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill. We are particularly interested in candidates who have general clinical neurophysiology or one of the subspecialty areas, such as EMG, EEG or evoked potentials and are board certified in clinical neurophysiology. Adolescent Medicine Clinician Educator Stanford University The Division of Adolescent Medicine in the Department of Pediatrics at Stanford University School of Medicine/ Stanford Medicine Children’s Health is recruiting a Clinician Educator as a Clinical Instructor, Clinical Assistant Professor, Clinical Associate Professor, or Clinical Professor. The major criterion for appointment as Clinician Educators is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill. Adolescent Medicine Researcher Stanford University The Division of Adolescent Medicine in the Department of Pediatrics at Stanford University seeks an innovative and collaborative researcher to join the Division as an Assistant Professor, Associate Professor, or Professor in the University Tenure Line, University Medical Line or the Non-tenure Line (Research). We are particularly interested in candidates with MD, MD/PhD, PhD (or equivalent degrees). Hematology Physician Scientist Stanford University The Department of Medicine, Division of Hematology, seeks a physician scientist to be appointed as Assistant or Associate Professor in the University Medical Line (UML). The candidates should have an outstanding (or has the potential to have a)  record of accomplishment in clinical care, teaching, and a focused area of research activity in hematologic malignancies with relevance to acute leukemias, myelodysplastic syndromes, or multiple myeloma. The candidates will be considered across broad areas of expertise including clinical trials and translational research with a laboratory component. Computational Biologist/Data Scientist - Open Rank Stanford University The Stanford Cardiovascular Institute and the Division of Cardiovascular Medicine in the Department of Medicine at Stanford University invite applicants for a faculty position at the rank of Assistant, Associate or Full Professor in the Non-Tenure Line (NTL-R) as a Computational Biologist/Data Scientist. Pediatric Surgeon -  Critical Care Surgeon Stanford University The Division of Pediatric Surgery in the Department of Surgery at Stanford University is seeking to fill two full-time academic surgeon positions. These faculty positions will be at the Assistant, Associate, or full Professor level (based on the candidate’s qualifications) in the University Medical Line (UML). We are particularly interested in candidates who have skills in surgical critical care. The primary location for these positions will be at Stanford Children’s Health, with a percentage of time dedicated to one or more of our satellite locations, including Santa Clara Valley Medical Center, Good Samaritan Hospital, California Pacific Medical Center, and John Muir Medical Center. Child Neurology-Pediatric Stroke CE Stanford University The Division of Child Neurology in the Department of Neurology at Stanford University seeks a board-eligible or board-certified child neurologist to join the Department as Clinical Assistant Professor or Clinical Associate Professor in the Clinician Educator Line. We are particularly interested in candidates who are fellowship-trained in pediatric stroke, adult stroke, and/or pediatric neurocritical care. MIPS Translational Medical Imaging Faculty Position Stanford University The Department of Radiology at Stanford University seeks an Assistant Professor, Associate Professor of full Professor in the University Tenure Line or Non-Tenure Line (Research) to join the Molecular Imaging Program at Stanford. Biomedical Informatics/Immunology/Rheumatology Open Rank Stanford University The Divisions of Immunology and Rheumatology and the Stanford Center for Biomedical Informatics Research in the Department of Medicine at Stanford University are seeking to hire an informatician for an appointment at the rank of Assistant, Associate, or Full Professor, with expertise in either translational research or clinical research. The successful candidate will have formal training in biomedical informatics (or a related discipline) and will develop new computational methods that can be applied to areas such as inﬂammatory disease, autoimmune disease, immunologic mechanisms of disease, “omics” research, clinical research, and pre-clinical models of disease. The position will be in the University Tenure Line or University Medical Line, with the expectation that time will be split among research, mentoring/teaching activities, and (for those with the appropriate training) clinical service. More Jobs 69 Current opportunities Pediatric Otolaryngology Assistant Professor, Associate Professor or Professor Stanford University Seeking Assistant, Associate or Full Professor in the Division of Pediatric Otolaryngology, in the Department of Otolaryngology-Head and Neck Surgery at Stanford University School of Medicine Assistant, Associate or Full Professor: Vascular Neurosurgery Physician Scientist Stanford University 18 Apr 2025 11:55 PM Pacific Daylight Time The Department of Neurosurgery at Stanford University School of Medicine seeks a full-time vascular neurosurgeon at the rank of Assistant, Associate or Full Professor in the University Medical Line based primarily at Stanford University Medical Center. We are particularly interested in candidates who have significant skills as an outstanding surgeon, teacher, and scientist. We are interested in surgeon scientists who are either open vascular neurosurgery trained, or dual trained in open vascular neurosurgery and neuro interventional radiology. Radiation Oncologist for Proton Therapy Program, Open Rank Stanford University The Division of Radiation Therapy in the Department of Radiation Oncology at Stanford University seeks a board eligible or board-certified radiation oncologist to join the Department as an Assistant, Associate or Full Professor in the University Medical Line. We are particularly interested in candidates who have clinical experience and research in proton therapy. This position will be instrumental in the development of the Proton Therapy Program at our Cancer Center in Palo Alto. Sensory Biologist Assistant Professor, Associate Professor or Professor Stanford University Sensory Biologist or Clinician Scientist sought for the Department of Otolaryngology — Head & Neck Surgery at Stanford University (PhD or MD or equivalent) to join as a faculty member at the rank of assistant professor, associate professor or professor in the University Tenure Line, University Medical Line, or the Non-Tenure Line-Research. Pediatric Neonatology Hospitalist Stanford University The Division of Neonatology in the Department of Pediatrics at Stanford University School of Medicine/ Stanford Medicine Children’s Health is recruiting board certified/eligible pediatricians with strong clinical skills in the hospital care of sick newborns and a special interest in neonatal medicine. We currently have openings for full-time, part-time, and moonlighting positions to join the Division as Clinical Assistant Professors, Clinical Associate Professors, or Clinical Professors in the Clinician Educator Line. Pediatric Immunotherapy Clinical Assistant, Associate, Clinical Professor Stanford University The Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University is seeking board certified/eligible Pediatric Oncologists with an interest in CAR-T and Immunotherapy who can contribute to the Division’s clinical and research enterprise at the Assistant, Associate, or Full Professor level in the Clinician Educator lines. Pediatric Oncology Solid Tumor Clinician Educator Stanford University The Department of Pediatrics, Division of Pediatric Hematology/Oncology in the Stanford University School of Medicine, is seeking board certified/eligible applicants at the Assistant, Associate, or Full Professor level in the Clinician Educator or Medical Center lines who can contribute to the Division’s clinical and research enterprise. Areas of emphasis include solid tumors, with a record of successful collaboration and mentorship. Pediatric Hematology Clinician Educator Stanford University The Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University seeks board certified/eligible pediatric hematology applicants who can contribute to the Division’s clinical and research enterprise at the Assistant, Associate, or Full Professor level in the Clinician Educator lines. Gyn and Head & Neck  Radiation Oncologist Stanford University The Division of Radiation Therapy in the Department of Radiation Oncology at Stanford University seeks a board eligible or board-certified radiation oncologist to join the Department as a Clinical Assistant Professor in the Clinician Educator line. We are particularly interested in candidates who have interest and experience with gynecologic brachytherapy. Clinical Pain Scientist Stanford University The Department of Anesthesiology, Perioperative and Pain Medicine seeks a clinical pain research faculty member (open rank) in the University Tenure Line or University Medical Line. Research areas of interest include acute and chronic pain. We are particularly interested in candidates who have programs focusing on clinical trials, regional anesthesia, implementation science, economics, epidemiology, health services research, public health policy, precision medicine, or other high-impact topics. Gastrointestinal Oncology: Assistant, Associate, or Full Professor Stanford University The Division of Oncology in the Department of Medicine at Stanford University invites applications for a position in Gastrointestinal (GI) Oncology in the University Medical Line (UML) at the rank of Assistant Professor, Associate Professor, or Full Professor.  We are seeking a board-certified or eligible Gastrointestinal (GI) oncologist with demonstrated excellence or potential in clinical care, scholarly research, institutional service, education, and mentoring.  A successful candidate will have a commitment to innovative clinical care and high impact research that advances the field of oncology. Intraoperative Neurophysiologic Monitoring (IONM) Stanford University The Division of Intraoperative Neurophysiologic Monitoring (IONM) in the Department of Neurology  at Stanford University seeks a board-certified neurologist to join the Department as Clinical Assistant Professor in the Clinician Educator Line. The major criterion for appointment in the Clinician Educator Line is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill. We are particularly interested in candidates who have general clinical neurophysiology or one of the subspecialty areas, such as EMG, EEG or evoked potentials and are board certified in clinical neurophysiology. Adolescent Medicine Clinician Educator Stanford University The Division of Adolescent Medicine in the Department of Pediatrics at Stanford University School of Medicine/ Stanford Medicine Children’s Health is recruiting a Clinician Educator as a Clinical Instructor, Clinical Assistant Professor, Clinical Associate Professor, or Clinical Professor. The major criterion for appointment as Clinician Educators is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill. Adolescent Medicine Researcher Stanford University The Division of Adolescent Medicine in the Department of Pediatrics at Stanford University seeks an innovative and collaborative researcher to join the Division as an Assistant Professor, Associate Professor, or Professor in the University Tenure Line, University Medical Line or the Non-tenure Line (Research). We are particularly interested in candidates with MD, MD/PhD, PhD (or equivalent degrees). Hematology Physician Scientist Stanford University The Department of Medicine, Division of Hematology, seeks a physician scientist to be appointed as Assistant or Associate Professor in the University Medical Line (UML). The candidates should have an outstanding (or has the potential to have a)  record of accomplishment in clinical care, teaching, and a focused area of research activity in hematologic malignancies with relevance to acute leukemias, myelodysplastic syndromes, or multiple myeloma. The candidates will be considered across broad areas of expertise including clinical trials and translational research with a laboratory component. Computational Biologist/Data Scientist - Open Rank Stanford University The Stanford Cardiovascular Institute and the Division of Cardiovascular Medicine in the Department of Medicine at Stanford University invite applicants for a faculty position at the rank of Assistant, Associate or Full Professor in the Non-Tenure Line (NTL-R) as a Computational Biologist/Data Scientist. Pediatric Surgeon -  Critical Care Surgeon Stanford University The Division of Pediatric Surgery in the Department of Surgery at Stanford University is seeking to fill two full-time academic surgeon positions. These faculty positions will be at the Assistant, Associate, or full Professor level (based on the candidate’s qualifications) in the University Medical Line (UML). We are particularly interested in candidates who have skills in surgical critical care. The primary location for these positions will be at Stanford Children’s Health, with a percentage of time dedicated to one or more of our satellite locations, including Santa Clara Valley Medical Center, Good Samaritan Hospital, California Pacific Medical Center, and John Muir Medical Center. Child Neurology-Pediatric Stroke CE Stanford University The Division of Child Neurology in the Department of Neurology at Stanford University seeks a board-eligible or board-certified child neurologist to join the Department as Clinical Assistant Professor or Clinical Associate Professor in the Clinician Educator Line. We are particularly interested in candidates who are fellowship-trained in pediatric stroke, adult stroke, and/or pediatric neurocritical care. MIPS Translational Medical Imaging Faculty Position Stanford University The Department of Radiology at Stanford University seeks an Assistant Professor, Associate Professor of full Professor in the University Tenure Line or Non-Tenure Line (Research) to join the Molecular Imaging Program at Stanford. Biomedical Informatics/Immunology/Rheumatology Open Rank Stanford University The Divisions of Immunology and Rheumatology and the Stanford Center for Biomedical Informatics Research in the Department of Medicine at Stanford University are seeking to hire an informatician for an appointment at the rank of Assistant, Associate, or Full Professor, with expertise in either translational research or clinical research. The successful candidate will have formal training in biomedical informatics (or a related discipline) and will develop new computational methods that can be applied to areas such as inﬂammatory disease, autoimmune disease, immunologic mechanisms of disease, “omics” research, clinical research, and pre-clinical models of disease. The position will be in the University Tenure Line or University Medical Line, with the expectation that time will be split among research, mentoring/teaching activities, and (for those with the appropriate training) clinical service. More Jobs 69 Powered by PageUp Job search Refine search Work type CE - Clinician Educator 53 Non-Tenure Line (Research) 11 University Medical Line 49 University Tenure Line 30 Locations Stanford University 88 VA Palo Alto Health Care System (VAPAHCS) 2 Categories School Doerr School of Sustainability 1 School of Engineering 2 School of Humanities & Sciences 1 School of Medicine 86 Get Help Questions about a job or your application? Find out how to request help Equal Opportunity Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job. Stanford is an equal employment opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity,\r\n                            national origin, disability, protected veteran status, or any other characteristic protected by law. Stanford welcomes applications from all who would bring additional dimensions to the University’s research, teaching, and clinical missions. Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University. Stanford, California 94305."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:03.784129",
    "url": "https://careersearch.stanford.edu/",
    "university_name": "Stanford University",
    "title": "Browse Jobs",
    "content": "Settings Skip to main content Stanford Careers Menu Life at Stanford Life at Stanford Life at Stanford Learn about our array of employee benefits, what makes Stanford life unique, and our commitment to diversity, equity and inclusion. Culture Diversity Benefits How We Hire FAQ Areas of Work Areas of Work Areas of Work Together, we're working towards our collective future. Find your role by browsing our areas of work. Administration Athletics Children Services Communications Facilities Finance and Accounting Food Services Fundraising | Development Health Services IT and Information Analytics Legal Marketing Program and Project Managment Research People | HR Security and Police Student Services Locations Stories Job Search My Submissions My Profile My Submissions Job Search My Profile ☰ Jobs FAQs 🔍  No suggested location found; would you like to perform a keyword search with this location instead? No Yes Sorry, we couldn't find your location.  Please type in a location you are interested in. 🔍 Search Sign Up for Job Alerts! Not ready to apply? Take just a minute to sign up for job alerts. 👥 Sign Up for Job Alerts Browse Jobs Browse jobs by type or location. My Submissions Track your opportunities. My Submissions Jobs FAQs Site Map © Stanford University. All rights reserved. Global Impact We believe in having a global impact Climate and Sustainability Stanford's deep commitment to sustainability practices has earned us a Platinum rating and inspired a new school aimed at tackling climate change. Medical Innovations Stanford's Innovative Medicines Accelerator is currently focused entirely on helping faculty generate and test new medicines that can slow the spread of COVID-19. Technology From Google and PayPal to Netflix and Snapchat, Stanford has housed some of the most celebrated innovations in Silicon Valley. Advancing Education Through rigorous research, model training programs and partnerships with educators worldwide, Stanford is pursuing equitable, accessible and effective learning for all. Working Here We believe you matter as much as the work I love that Stanford is supportive of learning, and as an education institution, that pursuit of knowledge extends to staff members through professional development, wellness, financial planning and staff affinity groups. Nora Cata School of Engineering I get to apply my real-world experiences in a setting that welcomes diversity in thinking and offers support in applying new methods. In my short time at Stanford, I've been able to streamline processes that provide better and faster information to our students. Phillip Cheng Office of the Vice Provost for Student Affairs Besides its contributions to science, health, and medicine, Stanford is also the home of pioneers across disciplines. Joining Stanford has been a great way to contribute to our society by supporting emerging leaders. Denisha Clark School of Medicine I like working in a place where ideas matter. Working at Stanford means being part of a vibrant, international culture in addition to getting to do meaningful work. Laura Lind Office of the President and Provost Getting Started We believe that you can love your job Join Stanford in shaping a better tomorrow for your community, humanity and the planet we call home. 4.2 Review Ratings 81% Recommend to a Friend View All Jobs Resources FAQ Work Arrangement LCA Notifications Disability and Diversity Services Veterans Jeanne Clery Act – Campus Safety Report Image Credit Resources FAQ Work Arrangement LCA Notifications Disability and Diversity Services Veterans Jeanne Clery Act – Campus Safety Report Image Credit Equal Opportunity and Disability Accommodations Consistent with its obligations under the law, the University will provide reasonable accommodations to applicants and employees with disabilities. Applicants requiring a reasonable accommodation for any part of the application or hiring process should contact Stanford University Human Resources by submitting a contact form . Stanford is an equal employment opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. See Admin Guide 1.7.4: Equal Employment Opportunity, Non-Discrimination, and Affirmative Action Policy ; Know Your Rights: Workplace Discrimination is Illegal ; Pay Transparency Non-Discrimination Provision . Equal Opportunity and Disability Accommodations Consistent with its obligations under the law, the University will provide reasonable accommodations to applicants and employees with disabilities. Applicants requiring a reasonable accommodation for any part of the application or hiring process should contact Stanford University Human Resources by submitting a contact form . Stanford is an equal employment opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. See Admin Guide 1.7.4: Equal Employment Opportunity, Non-Discrimination, and Affirmative Action Policy ; Know Your Rights: Workplace Discrimination is Illegal ; Pay Transparency Non-Discrimination Provision . © Stanford University, Stanford California 94305 Stanford Home Maps and Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non Discrimination Accessibility 0 0"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:04.348857",
    "url": "https://wasc.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Accreditation Search this site Submit Search Menu Home 2023 Accreditation Overview Our report Accreditation committees Timeline Standards of Accreditation Standard 1 Standard 2 Standard 3 Standard 4 Student Achievement Overview Aims of a Stanford Education Resources Current accreditation Previous accreditation 2013 Accreditation Institutional Proposal (May 2008) Capacity and Preparatory Review (2010) Educational Effectiveness Review (2012) Steering Committee Members Investigation Subcommittees 2001 Accreditation 1991 Accreditation Distance Education WSCUC reaffirms Stanford's accreditation Read the commission's letter Main content start Accreditation Stanford is accredited by the Western Association of Schools and Colleges Senior College and University Commission (WSCUC). WASC Senior College and University Commission 985 Atlantic Avenue, Suite 100 Alameda, CA 94501 (510) 748-9001 In addition, certain programs of the university have specialized accreditation. For information, contact the Office of the University Registrar . Student Achievement Review information on student completion rates as well as assessments of degree programs. Read more Quick Links Stanford's most recent accreditation letter (2023) 2023 report (TPR) 2012 report (EER) What is WSCUC accreditation? WSCUC Accreditation Handbook Stanford Accreditation Web Login Related Links Stanford Registrar's Office IR&DS WSCUC Website Contact Us For further information regarding Stanford's reaffirmation of accreditation, please contact the Stanford Accreditation Steering Committee at accreditation@stanford.edu An individual may contact the Bureau for Private Postsecondary Education for review of a complaint. The bureau may be contacted at Bureau for Private Postsecondary Education, P.O. Box 980818, West Sacramento, CA 95798-0818, http://www.bppe.ca.gov , phone: (916) 574-8900 or fax (916) 263-1897 Web Accessibility: Stanford University is committed to providing an online environment that is accessible to everyone, including individuals with disabilities. Having trouble accessing any of this content due to a disability? Learn more about accessibility at Stanford and report accessibility issues . Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:09.911273",
    "url": "https://facts.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Stanford University (link is external) Stanford Facts Search this site Submit Search Menu Home About Stanford Welcome to Stanford Campus History Historic Milestones Alumni Academics Schools & Programs Undergraduate Education Graduate Education Faculty Postdoctoral Scholars Research Research & Innovation Technology & Inventions Libraries and Resources Campus Life Student Life Cardinal Athletics The Arts Administration & Finances University Administration Presidents and Provosts Staff Finances Stanford Medicine Search this site Submit Search Stanford Facts Learn more about Stanford University, a place of learning, discovery, and innovation. Founded in 1885, Stanford’s areas of excellence span seven schools along with research institutes, the arts and athletics. Student Enrollment 7,841 undergraduate Class of 2027 profile 9,688 graduate As of Autumn Quarter, 2023 Faculty 2,323 faculty members 20 Nobel laureates are currently members of the Stanford community Campus 8,180 contiguous acres Over 600 buildings Research 7,500+ externally sponsored projects $1.98 billion total budget Established 1885 Opened 1891 Leadership President Richard Saller Provost Jenny Martinez Seven Schools Business Doerr School of Sustainability Education Engineering Humanities and Sciences Law Medicine Endowment $36.5 billion (as of August 31, 2023) Download Download the fact book PDF by clicking on the book image above Stanford University Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:12.171219",
    "url": "https://admission.stanford.edu/",
    "university_name": "Stanford University",
    "title": "Undergraduate Admission",
    "content": "Explore Boldly. Dream Audaciously. Undergraduate Admission Discover Stanford Experience the freedom to be the person you want to be, freedom to dive deep into academic discovery, and freedom to pursue your passions. Faculty and staff will spark and support your inquiry, and your peers will challenge you in a dynamic learning environment where listening and respectful discourse are paramount. Stanford will provide you the opportunity of a lifetime. Academics Tours & Programs Community & Belonging Campus Life Athletics Arts It isn’t just about the courses or the grades. It’s about the human being behind all of it. The cornerstones of resilience—learning, seeking advice, getting perspective and finding community—offer a way for young people to grow as they embark on the next major step in their lives. – Richard H. Shaw, Dean of Undergraduate Admission Application Deadlines OCT 15 Restrictive Early Action Application with Arts Portfolio NOV 1 Restrictive Early Action Standard Application DEC 5 Regular Decision with Arts Portfolio JAN 5 Regular Decision Standard Application MAR 15 Transfer Application with or without Arts Portfolio We look forward to learning about you through your application. Planning for College Applying to Stanford Watch Video A Stanford Education is Possible. Stanford offers comprehensive, need-based financial aid that makes it possible for all admitted undergraduate students to attend — and we do not expect students to borrow to meet their need. Learn how the program works, then use the net price calculator to get an award estimate based on your family’s financial situation. Learn more about financial aid at Stanford News & Announcements Transfer decision release The Office of Undergraduate Admission will release decisions to Transfer applicants on Friday, May 10 at 4 p.m. (PDT). See details Decisions will be available in the Stanford portal . If you have not yet logged in or are having difficulty logging into your portal, reset your credentials by selecting “Forgot Your Password?” from the login page. Testing policy for Fall 2025 applicants For the 2023–24 and 2024–25 admission cycles, Stanford will not require ACT or SAT scores for first-year or transfer applicants. See details Our test optional policy will extend to applicants applying for the Fall 2025 entry term. Stanford is committed to a holistic review of all candidates. We consider the vast array of information provided in and with each student’s application, whether that information includes test scores or not. Students may continue to self-report test scores in their application if they would like. Applications without test scores will not be at a disadvantage. The NCAA Eligibility Center has announced a standardized testing policy for students who intend to play NCAA Division I or II sports: “the NCAA will no longer require standardized testing as part of the eligibility criteria.” top Follow @EngageStanford Programs Admission Forums, Student Programs, and Special Events Brochures Stanford Preview and Viewbook Join the Mailing List Contact Us University Policies Engage with Us Stanford complies with the Jeanne Clery Act and publishes crime statistics for the most recent three-year period. View the full report . Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:12.511586",
    "url": "https://sustainability.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Search this site Submit Search Menu Impact Get Involved A Living Lab Community Commencement Faculty Faculty talks Community Awards Environmental Justice Diversity, Equity & Inclusion About our DEI Vision Community DEI Resources DEI Library Prospective Students Current Students Faculty & Staff Excellence in DEI Awards Meet the DEI Team SURGE SURGE program details FAQs Potential Projects for 2024 Land Acknowledgment Events Alumni Events All Events Get Involved Advance your Career Awards Leadership Dean Arun Majumdar Advisory Council Our Values and Practices How we put our values into practice Field expectations Reporting structures and resources Admissions & education Student Experience Careers Undergraduate Research Opportunities Hopkins Internships - Summer Undergraduate Research Funds (HI-SURF) Mentoring Undergraduates in Interdisciplinary Research (MUIR) Summer Undergraduate Program on Energy Research (SUPER) Sustainability Undergraduate Research in Geoscience and Engineering (SURGE) Admissions Executive Education Field Learning Wrigley Field Program in Hawaii Field Resources Professional Development Academic Professional Program The Pillars FAQs Events Sustainability Graduate Certificates Climate Change Sustainable Energy Sustainability Decision Making FAQs K-12 Outreach Geokids Program Geokids FAQs Young Investigators Internship Options FAQs Postdoctoral Resources The school Departments & Programs Environmental Behavior Sciences Global Environmental Policy Sustainability Accelerator Institutes & Centers Shared Analytical Facilities & Research Resources Industrial Affiliates Programs Research news History News & events Main content start Understanding how wildfires change soil could aid recovery Severe wildfires can drive chemical changes in soil that affect ecosystem recovery and risks to human health. A new study finds broader surveillance and modeling of these changes could inform strategies for protecting lives, property, and natural resources, and managing wildlife. Read how wildfires change soil chemistry Our research Transformative research by our scholars reveals insights into our world and drives ideas to impact. Read about our research and impact Sign up for our monthly newsletter John Kerry shares his ‘unfettered’ optimism on climate May 14, 2024 The 68th Secretary of State and first presidential envoy on climate discussed protests, nuclear energy, and why he left government in a wide-ranging conversation moderated by venture capitalist John Doerr. Stanford Report Events People with gas and propane stoves breathe more unhealthy nitrogen dioxide May 3, 2024 A new study of air pollution in U.S. homes reveals how much gas and propane stoves increase people’s exposure to nitrogen dioxide, a pollutant linked to childhood asthma. Even in bedrooms far from kitchens, concentrations frequently exceed health limits while stoves are on and for hours after burners and ovens are turned off. Stanford News Health and wellbeing Hurricane risk perception drops after storms hit April 9, 2024 Programs and policies that help households go beyond stocking up on food and medical supplies to invest in longer-term protections could overcome the risk perception gap and support adaptation to rising climate-related threats. Stanford News Human behavior Apply now Admissions Graduate certificates Postdoctoral fellowships Arun Majumdar Inaugural Dean, Stanford Doerr School of Sustainability “Mother Earth is begging us to restore the atmosphere, the oceans, and our biodiversity. For our own sake. For the sake of our children and grandchildren.” Read the full text of Majumdar's opening remarks Meet the Dean Learn about the school Our distinctive three-part structure is designed to amplify global impact. Departments and programs generate knowledge Institutes innovate across disciplines The Accelerator drives policy and technology solutions Our community Sustainability challenges affect everyone, and we need to include all voices in creating global solutions. We support a diverse community of faculty, students, and staff through our DEI programming, including our courses , financial aid, and affinity groups . We also hold ourselves accountable by tracking our progress . Meet our people Learn more about our DEI programs News about our people and programs John Kerry shares his ‘unfettered’ optimism on climate May 14, 2024 The 68th Secretary of State and first presidential envoy on climate discussed protests, nuclear energy, and why he left government in a wide-ranging conversation moderated by venture capitalist John Doerr. Stanford Report Events How to get corporate sustainability right May 8, 2024 Mastercard’s chief sustainability officer discusses how companies can avoid greenwashing and align with their social and environmental values. Stanford Woods Institute for the Environment Cities & Society Spotlight: Josheena Naggea May 7, 2024 \"Every time I go home, it's a powerful, grounding experience to visit Blue Bay. I grew up in Mauritius, a small island nation 500 miles east of Madagascar in the Indian Ocean.\" Center for Ocean Solutions Postdoctoral researchers Read all school news Join us There are many ways to join us in our commitment to cultivating deep knowledge and high-impact solutions to pressing planetary challenges. Follow our updates Learn about our advances and impact through email and social media. Follow us Get involved We offer many opportunities to join us in making a difference. Get involved Support our work Your support helps us fund new research, hire faculty, and create solutions. Support us Upcoming events See All Events May 17 Branner Library Monthly Book & Map Exhibit: Asian American and Pacific Islander Heritage Month Exhibition Friday, May 17, 2024 Mitchell Earth Sciences May 17 Scaling Sustainability Innovation Conference/Symposium Friday, May 17, 2024 Stanford Graduate School of Business May 17 QGIS cartography / maps for academic journals Workshop Friday, May 17, 2024 | 9:30am - 12:00pm PDT Branner Earth Sciences Library Earth. Climate. Society. The Stanford Doerr School of Sustainability draws on a deep understanding of Earth, climate, and society to create knowledge and scalable solutions, in collaboration with partners worldwide. Together, we strive to create a future where humans and nature thrive in concert and in perpetuity through excellence in research, education, innovation, and service. Learn how we’ll have an impact Stay connected Get involved Follow us Contact Us Visit Us Facebook LinkedIn Twitter Instagram Threads Quick links Admissions Upcoming events Give Open staff positions Open faculty positions Intranet Login Website feedback Learn more Departments and Programs Stanford Woods Institute for the Environment Precourt Institute for Energy Sustainability Accelerator Stanford land acknowledgement Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:13.021981",
    "url": "https://engineering.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Engineering Search this site Submit Search Menu Admission & Aid Graduate Admission Coterm Coterm Funding and Financial Aid Engineering Coterminal Fellowship Financial Aid Students & Academics Academics Undergraduate Degree Programs Graduate Degree Programs Online Learning Terman Engineering Award Terman Awards 2023-2024 Terman Awards 2022-2023 Terman Awards 2021-2022 Terman Awards 2020-2021 Terman Awards 2019-2020 Terman Award 2018-2019 Terman Awards 2017-2018 Terman Awards 2016-2017 Terman Awards 2015-2016 Terman Awards 2014-2015 Terman Awards 2013-2014 Terman Awards 2012-2013 Terman Awards 2011-2012 Terman Awards 2010-2011 Terman Awards 2009-2010 Terman Awards 2008-2009 Terman Awards 2007-2008 Terman Awards 2006-2007 Terman Awards 2005-2006 Terman Awards 2004-2005 Support and Resources Undergraduate Resources Graduate Resources Tutoring Career Resources Jobs and Internships Student Organizations Terman Engineering Library Global Engineering Programs Global Engineering Internships GEI Program Structure GEI Application Process Internship Host Companies GEI Program Recommendation Travel Information GEI Frequently Asked Questions International Graduate Student Programming Board Event Proposal Form Chinese UGVR Program UGVR Alumni Program Structure Host a UGVR Student About Equity and Inclusion Initiatives About the Equity and Inclusion Initiatives Our Student Community Undergraduate Programs Stanford Summer Engineering Academy (SSEA) SSEA 2024 Staff FAQs Summer Session Grants Additional Calculus for Engineers (ACE) Enroll in ACE Courses Meet Your ACE CAs Become an ACE Course Assistant ACE Course List Contact Us | ACE Leadership Team Prospective Graduate Programs Graduate Pathways to STEM Program At a Glance GPS Frequently Asked Questions Summer Undergraduate Research Fellowship (SURF) Stanford Exposure to Research and Graduate Education (SERGE) Stanford Engineering Research Introductions (SERIS) Fee Waivers Graduate school frequently asked questions Graduate Programs Summer Opportunities in Engineering Research and Leadership (Summer First) NSF Research Exchange Program Dean’s Graduate Student Advisory Council STEM K-12 Education Initiatives Funding and Financial Aid Funding Your Master’s Degree Funding Your PhD Teaching and Course Assistantships Technical Communication Program Consulting Request Form Frequently Asked Questions The Student Experience Faculty & Research Faculty Emeritus Faculty In Memoriam Events Departments Aeronautics & Astronautics Bioengineering Chemical Engineering Civil & Environmental Engineering Computer Science Electrical Engineering Management Science & Engineering Materials Science & Engineering Mechanical Engineering Institutes, Labs and Centers Faculty Awards 2023-2024 Faculty Awards 2022-2023 Faculty Awards 2021-2022 Faculty Awards 2020-2021 Faculty Awards 2019-2020 Faculty Awards 2018-2019 Faculty Awards 2016-2017 Faculty Awards 2015-2016 Faculty Awards 2014-2015 Faculty Awards 2012-2013 Faculty Awards 2011-2012 Faculty Awards 2010-2011 Faculty Awards 2009-2010 Faculty Awards 2008-2009 Faculty Awards 2007-2008 Faculty Awards 2006-2007 Faculty Awards 2005-2006 Get Involved Welcome Engineering Alumni Connect With Your Community Advance Your Career Explore Our Events Jumpstart Your Alumnihood Stanford Engineering Reunion Weekend 2022 Support Engineering Why Give Funding Initiatives making@stanford Equity and Inclusion Initiatives Stanford Data Science & Computation Complex Endowed Professorships Endowed Faculty Scholars Endowed Fellowships Faculty Launch Fund Hasso Plattner Institute of Design (d.school) Engineering Fund Estate and Planned Gifts Pioneers Pledge How to Make Your Gift Development Contacts Industry Collaborations Gift Support Affiliate Programs Sponsored Research Recruiting Executive Education Technology Transfer/Technology Licensing About Dean Dean’s Office Directory Diversity, Equity and Inclusion Visit Location Inside the Engineering Quad Pillars History Persis S. Drell Heroes 2019 Heroes 2018 Heroes George and Alexandra “Sandra” Forsythe Jensen Huang Mae Jemison 2016 Heroes Martin Fisher Reed Hastings Perry McCarty 2015 Heroes Andreas Acrivos Marcian “Ted” Hoff Charles Simonyi 2014 Heroes Kenneth Arrow Sergey Brin Irmgard Flugge-Lotz Edward Ginzton Larry Page Sally Ride 2013 Heroes John A. Blume James H. Clark David Filo Martin Hellman John McCarthy William J. Perry Jerry Yang 2012 Heroes Craig Barrett Andreas Bechtolsheim Morris Chang George Dantzig Theodore Maiman Bradford Parkinson Calvin Quate Stephen Timoshenko 2011 Heroes Vint Cerf Ray Dolby William F. Durand William Hewlett Donald Knuth Charles Litton David Packard Fred Terman SoE-Future Vision Culture Education Impact Research The Catalyst for Collaborative Solutions White Papers The Committee The science of light How the field of photonics is creating a brighter future. Read More Main content start Stanford Engineering has long been at the forefront of groundbreaking research, education and innovation. Through the development and application of engineering principles across disciplines, we are tackling the major challenges of the 21st century. Read the latest about our research News and Information Stanford’s Code in Place introductory programming course offers a new model for large-scale interactive learning School News New drug delivery system could reduce daily diabetes shots to just three a year Health Materials Technology & Society Stanford Engineering announces annual staff award winners School News Meet some of the students, faculty and alumni who make up our community. Student spotlights >> Faculty back stories >> Alumni stories >> Diversity, Equity and Inclusion Central to the School of Engineering’s mission is a commitment to increasing diversity by supporting individuals historically excluded in the field. We welcome a diverse group of faculty, students, and staff in an environment that is nurturing, welcoming and inclusive of individuals from a variety of backgrounds, perspectives and beliefs. Learn more Degree & research opportunities With opportunities for exceptional research and mentorship and an array of majors and classes, students have the opportunity to get the most out of an experience at Stanford. We offer several degree programs , as well as research opportunities with faculty in labs and in worldwide experiences in the field. Start your application here What's it like to be a Stanford Engineering student? Learn more What is Aeronautical and Astronautical Engineering? At Stanford, the Department of Aeronautics and Astronautics integrates multiple engineering disciplines and focuses on structural, aerodynamic, propulsion, and guidance and control challenges posed by aircraft and spacecraft. Learn about Aeronautical and Astronautical Engineering Jump right in Learn more below about how to get involved or stay involved. Subscribe to our email & podcast Read our biweekly email and listen to Stanford Engineering’s Future of Everything podcast to learn all about our latest research. Subscribe to our email Stanford Engineering’s Future of Everything podcast Support engineering Your gift can make a positive change for our people and our research. Giving options Connect with alumni The Stanford Engineering community is made up of 70,000 people who are working to solve global problems. Plug in for lifelong learning opportunities, career support and mentorship opportunities. Learn more Stanford ENGINEERING Web Login Address 475 Via Ortega Stanford , CA 94305 United States Facebook Twitter LinkedIn Youtube Instagram Stanford Engineering News Events Departments Open Faculty Positions Open Staff Positions Intranet Give Visit Contact Us Sign up for our email Your source for the latest from the School of Engineering Subscribe now Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:20.937826",
    "url": "https://humsci.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Dismiss alert Stanford School of Humanities and Sciences Search Search Toggle main menu visibility Mobile site main navigation Prospective Students Guide on Getting Into Grad School A Message from Dean Debra Satz Self-assessment and Selecting Grad Programs Suggested Graduate School Prep Timeline Advice on Non-Traditional Paths Between Undergrad Degrees and Grad Programs Funding Graduate Studies Preparing Your Applications Writing Your Personal Statements Requesting Recommendation Letters Interviewing and Talking with Prospective Faculty How Your Application Is Reviewed Making Your Final Decision Additional Resources H&S Summer Research Programs Current Students Diversity Resources and Programs Fellowships and Funding H&S Dean’s Scholars Fellowship CUNY Exchange Program Sterling Award for Undergraduates Helpful Stanford Resources for Students and Postdocs WINGS (Wellness Information Network for Graduate Students) Academics and Research Centers, Institutes, and Affiliates Explore programs of study in H&S Careers of Humanities Alumni News COVID-19: H&S faculty in the news Events About H&S Dean Dean's Message Past Dean's Messages Dean's Initiatives Diversity and Inclusion H&S Council Senior Associate Deans Administrative Leads Staff National and International Awards American Academy of Arts and Sciences MacArthur Fellowship National Academy of Sciences National Humanities Medal National Medal of Science Nobel Prize Pulitzer Prize H&S Dean's Teaching Awards H&S History H&S Past Deans Stanford Land Acknowledgment Giving Ways to Give Annual Giving to Graduate Education Support World-Class Faculty Strengthen Graduate Scholarship Enhance the Arts Globalize the Curriculum Transform Science Education and Research Expand Our Understanding of the Universe Desktop site main navigation Prospective Students Current Students Academics and Research News Events About Giving Native plants take root in the Muwekma Four Directions Garden at Stanford University. Photo by Ishmael Bruno. New gift will help Stanford reimagine Native American Studies through a 21st-century Indigenous lens Scroll to more content Research and learning are the foundations of discovery. Explore H&S Departments and Programs Chicana/o-Latina/o Studies Center for Comparative Studies in Race and Ethnicity (CCSRE) Theater and Performance Studies Applied Physics Political Science In the Moment The conversation continues after the Democracy and Disagreement session on Israel and Palestine. Featured speakers Salam Fayyad and Alon Tal talk with students, and session moderator Larry Diamond speaks with H&S Dean Debra Satz. Read more about the session and watch the recording . Photo by LiPo Ching/Stanford University News Envisioning the future for Palestinians and Israelis May 7, 2024 Dynamic enzyme acts like a Swiss Army knife for ribosomes May 9, 2024 A ‘magic’ angle between layers in a stacked nanoscale system offers intriguing material properties May 8, 2024 Survival is success in Mexico City’s underground rehab centers May 1, 2024 See all news The School of Humanities and Sciences is the center of a world-class liberal arts education. 49 Departments and Programs 50 Undergraduate Majors 43 Master's Degrees 33 Doctoral Degrees Series Faculty Awards Awards and honors earned by H&S faculty Submit information about a recent or upcoming faculty award or honor. Awards Faculty Richard Meyer receives 2023 Dedalus Foundation Exhibition Catalogue Award Seven faculty elected to American Academy of Arts & Sciences Stanford faculty named AAAS Fellows Rachel Jean-Baptiste awarded 2024 David H. Pinkney Prize Joel Cabrita receives National Institute for the Humanities and Social Sciences book award Two Stanford scholars awarded Guggenheim Fellowship Steven Boxer receives 2024 Ellis R. Lippincott Award Yakov Eliashberg receives 2024 Frontiers of Knowledge Award Rodolfo Dirzo receives 2024 Frontiers of Knowledge Award Two Stanford physicists win grants for ‘tabletop’ experiments with big implications Martha Cyert named a fellow of the American Society for Biochemistry and Molecular Biology Peter Stansky wins 2023 Peter Davison Award Josiah Ober receives 2023 Barry Prize Clayborne Carson honored with 2023 Freedom Award Surya Ganguli named to 2023 Schmidt Science Polymaths Program cohort Shelley Fisher Fishkin receives 2023 American Studies Association lifetime achievement award Physicist Harold Hwang wins McGroddy Prize for New Materials Kathryn Olivarius awarded AHA Prize in American History Kristy Red-Horse elected to the National Academy of Medicine Steven Banik named 2023 Moore Inventor Fellow Stephen Shenker and Leonard Susskind awarded 2023 Dirac Medal Stanford-led collaboration to explore electrodynamics of neutron stars and black holes receives $8M in funding from Simons Foundation Russell Poldrack named 2023 British Academy fellow Steven Banik and Christopher O. Barnes named 2023 Pew Biomedical Scholars Gordon H. Chang awarded 2023-24 research fellowship from The Huntington Lauren O’Connell receives 2023 Camille Dreyfus Teacher-Scholar Award Aron Rodrigue made honorary citizen of Greek city of Didymoteicho David O. Siegmund awarded 2023 C.R. and Bhargavi Rao Prize Gretchen Daily receives 2023 Eminent Ecologist Award Kathryn Gin Lum wins 2023 Merle Curti Intellectual History Award Kathryn Olivarius receives 2023 Frederick Jackson Turner Award Carolyn Bertozzi receives 2023 American Association for Cancer Research award R. Lanier Anderson elected board chair of American Philosophical Association Monika Schleier-Smith honored with 2023 Benjamin Franklin NextGen Award Richard Zare awarded a 2023 Benjamin Franklin Medal Matthew Sommer awarded $60,000 grant from NEH Richard Roberts elected honorary fellow of American Society for Legal History Rowan Dorin awarded 2022 Mary L. Dudziak Digital Legal History Prize View all in series Explore All Series The natural sciences in H&S offer an exciting environment for you to learn and discover new knowledge, methodologies, and technologies; work side by side with world-class faculty mentors and research staff; and help solve today's important problems. Explore the natural science guide. Video file /sites/default/files/2024-01/Montage%20-%20Bass.mp4 Anne T. and Robert M. Bass Biology Research Building Watch the video About The School of Humanities and Sciences is the foundation of a liberal arts education at Stanford. The school encompasses 24 departments and 25 interdisciplinary programs. It is the university's home for fundamental research, where free, open, and critical inquiry is pursued across disciplines. Learn more about H&S Footer Social Links Facebook Twitter Youtube H&S resources Facilities and Capital Planning Faculty Affairs Finance Graduate and Undergraduate Studies Human Resources Information Technology Planning, Compliance, and Administrative Effectiveness Public Relations Research Administration Contact Us Building 1, Main Quad 450 Jane Stanford Way Stanford, CA 94305-2070 Phone: 650-723-2275 Fax: 650-723-3235 Campus Map University resources Report a website problem Stanford Non-Discrimination Policy Stanford University Stanford footer: Top links Stanford Home Maps & Directions Search Stanford Emergency Info Stanford footer: Bottom links Terms of Use Privacy Copyright Trademark Non-Discrimination Accessibility © Stanford University, Stanford, California 94305"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:21.551730",
    "url": "https://community.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Community Engagement Office of External Relations Search this site Submit Search Menu Home Explore Campus Getting to campus Maps Campus Walks Learn K-12 Programs Undergraduate Programs Community College Programs Lifelong Learning Online Learning Resources for Educators Summer Programs Discover Stories Cool Podcasts from Stanford Engage Engaging Regionally OCE Seed Funding 2024 Community Engagement Impact Funds 2023 Seed Funding Projects 2022 Seed Funding Projects 2021 Seed Funding Projects Supporting the Community Engaging Globally Opportunities and Resources for Visiting Appointments Resources for International Visitors with Appointments Community Engagement Map Giving Back Community Partnership Awards Events Stanford Events Veterans Day Supporting Regional Gatherings Contact Us Welcome to Stanford We’re just a walk, a short ride, or a click away. Stanford lives its founding values when we connect with our communities next door – and across the globe. About the Office of Community Engagement Main content start Engage with Stanford The relationships we build invigorate lives and help us solve the challenges we share. Explore Campus Enjoy the many offerings, rich history, and quiet beauty of the campus. Learn how Arts, Athletics, the Dish, and more There’s a lot going on. Check our events, or go at your own pace. Show me! A deep sense of place From the beginning, Stanford, along with the neighboring communities it joined, has grown and developed from rural roots. How we’re connected From using ancestral craft techniques at the Farm to the classical Indian dance showcase by Stanford Noopur, there are activities nearly every day, including dance, film, food, festivals, author readings and workshops. Enjoy Asian American Pacific Islander Heritage month with Saturday's Pasifika Fest from the Pacific Islander Student Association May 18 at Wilbur Field. See the more than 30 events that reflect the many and distinct cultures under the umbrella of “AAPI.” Learning Opportunities Take advantage of Stanford's renowned educational programs and instructors. K - 12 Lifelong Learning Online Learning How do you describe Stanford's engagement with community? Stanford offices, centers, and institutes that engage with the world Where we engage Looking for something? Need to contact us for an answer to your question? Reach us here The Office of Community Engagement is part of the Office of External Relations. Office of External Relations Stanford Community Engagement Office of External Relations Office of External Relations Address Office of Community Engagement Frances C. Arrillaga Alumni Center 326 Galvez Street Stanford , CA 94305 United States Stanford External Relations Admin Login Resources Campus Map Careers Diversity Works Noise and Traffic Management Public Safety \"HeadsUp\" construction information Quick Links Athletics Stanford Arts Stanford Annual Events Stanford Archives Stanford Children's Health Stanford Health Care Stanford University Libraries Undergrad & Graduate Admission Office for Religious & Spiritual Life Sign up for Stanford Report news and information about Stanford Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:22.422071",
    "url": "https://library.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Stanford University Stanford Libraries Library Accessibility My Account Contact Us Menu Keyword Search Search Home Services Services submenu Services A-Z Search and find Borrow and request Off-campus access Instruction support Course reserves Research support Research support submenu Find a subject specialist Subjects A-Z Guides Workshops Increase your research impact Data support and services Explore collections Libraries Libraries submenu Branches and centers Places to study News and events Search Quick Links: My Account Search Results Accessibility Contact Us What can we help you find? Keyword Search Search Search gives results from this site, catalog , articles+ , guides , online exhibits , and EarthWorks . Today's Hours See all hours Highlights Shortlist Announced for the 2024 William Saroyan International Prize for Writing Press release Learning the history of evolution and primatology In the media Tompkins Conservation places archive at the Stanford University Libraries in support of ongoing field studies and research in Chile and Argentina Press release Coming soon Stanford Libraries presents The New Deal & The Federal Writers' Project | Selections from the Bruce and Rachel Jeffer Collection , on view May 6, 2024, through January 26, 2025, in the Peterson Gallery and Munger Rotunda, Cecil H. Green Library, Bing Wing. Learn more about the exhibit Current and upcoming events See more events Oct 25 — Jun 23 Seeing Silicon Valley Exhibition 10/25/2023 October 25, 2023 - June 23, 2024 Open in map Jan 9 — Jun 21 The Apes & Us: A Century of Representations of Our Closest Relatives Exhibition 1/9/2024 January 9, 2024 - June 21, 2024 Open in map Mar 13 — Jun 15 Religion in Manga and Anime: A Poster Exhibition by IntroSems RELIGST 6N Exhibition 3/13/2024 March 13, 2024 - June 15, 2024 Open in map Nuremberg Trial Archives The Taube Archive of the International Military Tribunal at Nuremberg, 1945-1946 (IMT) is now available as the result of a partnership between the Stanford Libraries and the Stanford Center for Human Rights and International Justice. Find out more about the partnership Featured collections See more collections Ruth Asawa Papers The papers of Japanese American artist and educator Ruth Asawa document her art as well as her involvement in arts education, civic art, and arts administration. The collection contains correspondence, notes, portfolios, publicity, articles and publications, design sketches, photographs, and audiovisual media. View the collection Gordon Moore papers, 1958–2005 This collection contains Moore’s Intel lab notebooks, personal and business correspondence, Intel presentations, memos and white papers, personal notes from meetings, greeting cards, photographs, cassette tapes and videos. The materials date from 1958 to 2005, but the majority dates from 1968 to 1999. View the collection Eliasaf Robinson Tel Aviv Collection Assembled over a span of forty years by Eliasaf Robinson, a Tel Aviv native and Israel's most prominent antiquarian bookseller, this collection comprises a rich trove of books, pamphlets, magazines, printed ephemera, posters, postcards, photographs, maps, architectural plans, and original documents about the early history of Tel Aviv, \"the First Hebrew City.\" View the finding aid Kogu me lugu: digital video interviews, 2014 Explore this collection of oral history interviews with members of the Estonian diaspora who have lived under or fled from the Soviet and/or German occupation in Estonia. View the collection Maps of Africa Stanford Libraries is home to a strong collection of maps of Africa, including maps donated by Oscar I. Norwich and Caroline Batchelor as well as maps from the Barry Lawrence Ruderman Collection, the University of Cape Town Collections, and the David Rumsey Map Collection. View the exhibit The Durand-Lesley Propeller Collection The Durand-Lesley propellers in the Terman Library are the surviving artifacts of a famous experiment in early aviation history which defined a process method in engineering research still in use today. Read our article about the collection Latest news See more news Polish scholarly journal devoted to the history of the book and archival collections Story Sabrina Gunn joins Special Collections as the Digital Archivist for the Dianne Feinstein Senatorial Papers Staff news Linnea Shieh promoted to Head, Terman Engineering Library Staff news Web accessibility Stanford University is committed to providing an online environment that is accessible to everyone, including individuals with disabilities. Having trouble accessing any of this content due to a disability? Learn more about accessibility at Stanford and report accessibility issues . Stanford Libraries 557 Escondido Mall Stanford, CA 94305 All locations and hours Contact us Who we are About us Staff directory Department directory Staff publications and research Student job openings Careers Administration General policies Copyright notice System status Support Stanford Libraries Donate Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University. Stanford, California 94305."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:23.407572",
    "url": "https://www.gsb.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Menu The Experience About Stanford GSB About Us The Leadership Dean’s Updates School News & History Commencement Voices Business, Government & Society Centers & Institutes Center for Entrepreneurial Studies Center for Social Innovation Stanford Seed About the Experience Learning at Stanford GSB Experiential Learning Guest Speakers Entrepreneurship Leadership Social Innovation Communication Life at Stanford GSB Collaborative Environment Activities & Organizations Student Services Housing Options International Students The Programs Full-Time Degree Programs MBA Why Stanford MBA Academic Experience Admission Financial Aid MSx Why Stanford MSx Curriculum Admission Financial Aid PhD Academic Experience Admission Financial Aid Research Fellows Program See All Programs Non-Degree & Certificate Programs Executive Education Stanford Executive Program Programs for Organizations The Difference Admission Online Programs Stanford LEAD Stanford Seed Seed Transformation Program Aspire Program Seed Spark Program Faculty & Research Faculty Faculty Profiles Academic Areas Awards & Honors Seminars Conferences Voices Faculty Research Publications Working Papers Case Studies Books Research Hub Research Labs & Initiatives Business Library Data, Analytics & Research Computing Behavioral Lab Research Labs Cities, Housing & Society Lab Golub Capital Social Impact Lab Research Initiatives Corporate Governance Research Initiative Corporations and Society Initiative Policy and Innovation Initiative Rapid Decarbonization Initiative Stanford Latino Entrepreneurship Initiative Value Chain Innovation Initiative Venture Capital Initiative Insights Topics Accounting Career & Success Climate & Sustainability Corporate Governance Culture & Society Economics Education Entrepreneurship Finance & Investing Government & Politics Healthcare Innovation Leadership & Management Marketing Markets & Trade Nonprofit Operations & Logistics Opportunity & Access Organizational Behavior Political Economy Social Impact Technology & AI Opinion & Analysis Magazine Podcasts Email Newsletter Alumni Welcome, Alumni Communities Digital Communities & Tools Regional Chapters Women’s Programs Identity Chapters Find Your Reunion Events Career Resources Job Search Resources Career & Life Transitions Programs & Services Career Video Library Alumni Education Research Resources Volunteering Alumni News Class Notes Alumni Voices Books Giving Contact Alumni Relations Directory Upcoming Events Groups Email My Account Events Admission Events & Information Sessions MBA Program MSx Program PhD Program Alumni Events All Other Events Enter the terms you wish to search for. Change lives. Change organizations. Change the world. Scroll to Explore Stanford Graduate School of Business Our mission is to create ideas that deepen and advance our understanding of management and with those ideas to develop innovative, principled, and insightful leaders who change the world. Voices of Stanford GSB I hope a lot of [AI’s] potential is used to bring people together in the real world. Raph Lee MS ’24 How could people like my parents get access to technology to plug into this digital economy? Paul Yap MBA ’24 The MD/MBA was how I saw myself combining two different fields in my career. Taylor Harris MD/MBA ’24 More Voices Stay in Touch Sign Up for Stanford GSB Updates School News Interim GSB Dean Named as Search Process Begins Professor Peter DeMarzo will serve as interim dean beginning August 1, when Dean Jonathan Levin becomes Stanford’s president. Changemakers: Teaching Young People a Recipe for Success in the Restaurant Industry This founder’s culinary nonprofit aims to help struggling young people find their footing personally and professionally. More News Stanford GSB Community on Social Insights by Stanford Business “AI Will Be as Common in Healthcare as the Stethoscope.” Leading With Values: When Good Intentions Aren’t Enough Why the “Venture Mindset” Is Not Just for Tech Investors Explore Insights 655 Knight Way Stanford, CA 94305 USA Footer contact links Contact Us Visit Us Stay In Touch Follow Us Twitter Facebook Instagram YouTube LinkedIn Footer 1 Companies, Organizations & Recruiters Stanford Community Newsroom Footer 2 Library Jobs MyGSB © Stanford Graduate School of Business Footer legal links Accessibility Non-Discrimination Policy Privacy Policy Terms of Use Stanford University The Experience About Us The Leadership The Dean Priorities for the GSB's Future Updates Advisory Council Members Diversity, Equity & Inclusion DEI Updates See the Current DEI Report Supporting Data Research & Insights Voices Share Your Thoughts Centers & Institutes Center for Entrepreneurial Studies Research Search Funds Search Fund Primer Teaching & Curriculum Faculty & Staff Affiliated Faculty Faculty Advisors Contact Louis W. Foster Resource Center Center for Social Innovation Defining Social Innovation Impact Compass Global Health Innovation Insights Faculty & Staff Faculty Affiliates Contact School Profile Student Awards & Certificates Our Alumni School News & History Changemakers Our History Stanford GSB Deans Dean Jonathan Levin Dean Garth Saloner Dean Robert Joss Dean Michael Spence Dean Robert Jaedicke Dean Rene McPherson Dean Arjay Miller Dean Ernest Arbuckle Dean Jacob Hugh Jackson Dean Willard Hotchkiss Faculty in Memoriam Stanford GSB Firsts Commencement Program Certificate & Award Recipients Learning at Stanford GSB Faculty Teaching Approach Experiential Learning Action Learning Program Analysis and Measurement of Impact The Corporate Entrepreneur: Startup in a Grown-Up Enterprise Data-Driven Impact Designing Experiments for Impact Digital Business Transformation The Founder’s Right Hand Marketing for Measurable Change Product Management Public Policy Lab: Financial Challenges Facing US Cities Public Policy Lab: Homelessness in California Real-Time Analysis and Investment Lab Lab Features Curricular Integration Faculty Contact Guest Speakers View From The Top Entrepreneurship Entrepreneurship Courses Formation of New Ventures Managing Growing Enterprises Startup Garage Beyond the Classroom Explore Beyond the Classroom Stanford Venture Studio Summer Program Botha Chan Innovation Program Awardees Workshops & Events The Five Lenses of Entrepreneurship Leadership Leadership Labs Executive Challenge Arbuckle Leadership Fellows Program Interpersonal Dynamics Facilitation Training Program 2024–25 Program Selection Process Training Schedule Time Commitment Learning Expectations Post-Training Opportunities Faculty Who Should Apply Introductory T-Groups Contact Leadership for Society Program Social Innovation Curriculum Certificate Fellowships Impact Design Immersion Fellowship 2023 Awardees 2022 Awardees 2021 Awardees 2020 Awardees 2019 Awardees 2018 Awardees Social Management Immersion Fund Post-Graduate Career Fellowships Stanford Impact Founder Fellowships and Prizes Stanford Impact Leader Prizes Experiential Learning Social Entrepreneurship Stanford GSB Impact Fund Impact Journeys Economic Development Education Energy & Environment Healthcare Communication Life at Stanford GSB Collaborative Environment Activities & Organizations Student Services Housing Options Stanford GSB Residences International Students Our Campus Environmental Leadership Stanford GSB Artwork A Closer Look California & the Bay Area Voices of Stanford GSB Business, Government & Society Initiative Our Approach Research Priority Issues Business & Beneficial Technology Business & Sustainability Business & Free Markets News Events Business, Government, and Society Forum Get Involved The Programs MBA Program Why Stanford MBA Academic Experience Curriculum First Year Second Year Global Experiences Faculty Joint & Dual Degrees JD/MBA Joint Degree MA Education/MBA Joint Degree MD/MBA Dual Degree MPP/MBA Joint Degree MS Computer Science/MBA Joint Degree MS Electrical Engineering/MBA Joint Degree MS Environment and Resources (E-IPER)/MBA Joint Degree Academic Calendar Student Life & Community Clubs & Activities Diversity Conferences International Students LGBTQ+ Students Military Veterans Minorities & People of Color Partners & Families Students with Disabilities Women Student Support Residential Life Student Voices Alumni Community MBA Alumni Voices A Week in the Life Career Impact Career Support Employment Outcomes Tuition & Financial Aid Cost of Attendance Types of Aid Knight-Hennessy Scholars Program Yellow Ribbon Program BOLD Fellows Fund Application Process Loan Forgiveness Contact the Financial Aid Office Admission Evaluation Criteria Deadlines Application Education Test Scores GMAT & GRE English Language Proficiency Personal Information, Activities & Awards Professional Experience Letters of Recommendation Essays Optional Short Answer Questions Application Fee Reapplication Interviews Deferred Enrollment Joint & Dual Degrees Entering Class Profile Admission Events Event Schedule Ambassadors New & Noteworthy Contact Ask a Question MSx Program Why Stanford MSx See Why Stanford MSx Is MSx Right for You? Career Impact Career Support Alumni Voices MSx Stories Curriculum Leadership Development Career Advancement Entrepreneurship Career Change How You Will Learn Academic Calendar Admission Admission Events Evaluation Criteria Application Requirements Personal Information Education Professional Experience Reference Letters Information for Recommenders Graduate Tests GMAT, GRE & EA English Proficiency Tests Essays Interviews After You’re Admitted Entering Class Profile Student & Family Life Student Life Activities & Organizations Voices Partners & Families Housing Daycare, Schools & Camps Tuition & Financial Aid Cost of Attendance U.S. Citizens and Permanent Residents International Students Application Process Loan Forgiveness Contact PhD Program Fields of Study Accounting Requirements Economic Analysis & Policy Requirements Finance Requirements Marketing Requirements: Behavioral Requirements: Quantitative Operations, Information & Technology Requirements Organizational Behavior Requirements: Macro Requirements: Micro Political Economics Requirements Academic Experience Degree Requirements Coursework Annual Evaluations Field Examination Research Activities Research Papers Candidacy Dissertation Oral Examination Faculty Current Students Research Resources Admission What We Look For Entering Class Profile Application Materials Education & CV GMAT & GRE International Applicants Statement of Purpose Letters of Recommendation Reapplicants Application Fee Waiver Deadline & Decisions Admission Events IDDEAS Financial Aid Student Life Voices Placement Job Market Candidates Academic Placements Contact the PhD Program Stay in Touch Research Fellows Research Community Faculty Mentors Current Fellows Alumni Academic Experience Standard Track Dedicated Track Projects Fellowship & Benefits Admission International Applicants Contact Executive Education Programs for Individuals On-Demand Online Courses Group Enrollment Programs for Organizations Custom Programs Program Formats Developing a Program Catalyst Online Programs Diversity & Inclusion Strategic Transformation Program Experience Contact Client Services The Difference Academic Experience Faculty Campus Experience Live Online Experience Silicon Valley & Bay Area Digital Credentials Faculty Spotlights Participant Spotlights Voices Admission Eligibility International Participants Application Process Stanford Executive Program Stanford Ignite Stanford LEAD Payment & Cancellation Discounts Frequently Asked Questions Contact Faculty & Research Faculty Academic Areas Accounting Economics Finance Marketing Operations, Information & Technology Organizational Behavior Political Economy Awards & Honors Seminars Accounting Classical Liberalism Economics The Eddie Lunch Finance IOPLUS Marketing Operations, Information & Technology Organizational Behavior Political Economy Conferences Accounting Summer Camp Big-Data Initiative in Intl. Macro-Finance Agenda Faculty Videos, Code & Data California Econometrics Conference California Quantitative Marketing PhD Conference California School Conference China India Insights Conference Homo economicus, Evolving Initiative on Business and Environmental Sustainability Political Economics (2023–24) Scaling Geologic Storage of CO2 (2023–24) A Resilient Pacific: Building Connections, Envisioning Solutions Adaptation and Innovation Changing Climate Civil Society Climate Impact Summit Climate Science Corporate Carbon Disclosures Earth’s Seafloor Environmental Justice Finance Marketing Operations and Information Technology Organizations Sustainability Reporting and Control Taking the Pulse of the Planet Urban Infrastructure Watershed Restoration Junior Faculty Workshop on Financial Regulation and Banking Ken Singleton Celebration Marketing Camp Quantitative Marketing PhD Alumni Conference Rising Scholars Conference Agenda Presentations Theory and Inference in Accounting Research Voices Publications Books Working Papers Case Studies Research Labs & Initiatives Cities, Housing & Society Lab Corporate Governance Research Initiative Research Stanford Closer Look Series Quick Guides Core Concepts Surveys Books Journal Articles Working Papers Case Studies Glossary of Terms Executive Education Faculty & Staff Contact Corporations and Society Initiative Golub Capital Social Impact Lab Who We Are Researchers & Students Funders Our Research Research Approach Publications Domain Areas Charitable Giving Education Financial Health Government Services Health Workers & Careers Methods AI & Machine Learning Short Course Adaptive & Iterative Experimentation Incentive Design Social Sciences & Behavioral Nudges Bandit Experiment Application Conferences & Events Get Involved Contact Policy and Innovation Initiative Reading Materials Courses Events Contact Rapid Decarbonization Initiative Research Teaching & Curriculum Energy Entrepreneurship Faculty & Affiliates Contact Email Stanford Latino Entrepreneurship Initiative SOLE Report Research Subscribe Value Chain Innovation Initiative Research Books Case Studies Publications Responsible Supply Chains Faculty & Staff Events Contact Subscribe Venture Capital Initiative Contact Behavioral Lab Conduct Research Current Study Usage Pre-Registration Information Participate in a Study Faculty Publications Lab Staff Contact Data, Analytics & Research Computing Stanford Seed About Seed Leadership Founding Donors Contact Location Information Stanford Seed Programs Seed Transformation Program Curriculum Faculty Participant Profile Network Membership Program Impact Voices Admission Aspire Program Curriculum Participant Profile Seed Spark Program Curriculum Faculty Participant Profile Collaborators Companies & Leaders Meet Seed Entrepreneurs Entrepreneur Profiles Company Spotlights Seed Transformation Network Get Involved Coach Responsibilities Current Coaches How to Apply Consult Meet the Consultants How to Apply Intern Meet the Interns Intern Profiles How to Apply Collaborate Give Discover Impact Research & Studies Research Library News & Insights Program Contacts Library Research Resources Databases & Datasets Research Guides Journals Books Working Papers Case Studies Research Support Research Guides Consultations Research Workshops Career Research Ask Us Services Research Data Services Course Support Course Reserves Course Research Guides Borrow, Renew, Return Material Loan Periods Fines & Other Charges Document Delivery Interlibrary Loan Equipment Checkout Print & Scan MBA & MSx Students PhD Students Other Stanford Students Faculty Faculty Assistants Research Assistants Stanford GSB Alumni Stanford GSB Archive Telling Our Story About Us Staff Directory Hours Library Spaces By Floor Visit History Alumni Alumni Site Help Site Login Site Registration Alumni Directory Alumni Email Privacy Settings & My Profile Communities Digital Communities & Tools Women’s Programs Women’s Circles Success Stories The Story of Circles Support Women’s Circles Stanford Women on Boards Initiative Alumnae Spotlights Insights & Research Regional Chapters Identity Chapters Interest Groups Industry & Professional Entrepreneurial Commitment Group Recent Alumni News Class Notes Alumni Voices Books Reunions Alumni Day Half-Century Club Plan Your Visit Fall Reunions Spring Reunions MBA 25th Reunion Half-Century Club Reunion Reunion Highlights Faculty Lectures Events Award Events Ernest C. Arbuckle Award Alison Elliott Exceptional Achievement Award ENCORE Award Excellence in Leadership Award John W. Gardner Volunteer Leadership Award Robert K. Jaedicke Faculty Award Jack McDonald Military Service Appreciation Award Jerry I. Porras Latino Leadership Award Tapestry Award Student & Alumni Events Career Resources Job Search Resources Executive Recruiters Interviewing Job Boards LinkedIn Land the Perfect Job with LinkedIn Negotiating Networking Elevator Pitch Email Best Practices Resumes & Cover Letters Self-Assessment Career Coaching Long-Term Career & Executive Coaches Whitney Birdwell Ball Margaret Brooks Bryn Panee Burkhart Margaret Chan Ricki Frankel Peter Gandolfo Cindy W. Greig Natalie Guillen Carly Janson Sloan Klein Sherri Appel Lassila Agnes Le Stuart Meyer Tanisha Parrish Virginia Roberson Philippe Taieb Michael Takagawa Terra Winston Johanna Wise Debbie Wolter Jung Yoo Rebecca Zucker Complimentary Coaching Career & Life Transitions New Grads Changing Careers Work-Life Integration Career Breaks Flexible Work Encore Careers Join a Board Programs Career Video Library Contact Alumni Education Research Resources Library Databases D&B Hoovers Data Axle (ReferenceUSA) EBSCO Business Source Global Newsstream Market Share Reporter ProQuest One Business Volunteering Academics & Student Life Student Clubs Entrepreneurial Students Admissions Advisory Boards Stanford GSB Trust Alumni Community Alumni Consulting Team Volunteers Volunteering Opportunities How to Volunteer Springboard Sessions Consulting Projects Leadership Volunteers by Class Year 2020 – 2029 2010 – 2019 2000 – 2009 1990 – 1999 1980 – 1989 1970 – 1979 1960 – 1969 1950 – 1959 1940 – 1949 Past Projects Service Areas Stories & History ACT History ACT Awards Celebration Leadership ACT Governance Structure Building Leadership for ACT Individual Leadership Positions Leadership Role Overview Purpose of the ACT Management Board Contact ACT Business & Nonprofit Communities Reunion Volunteers Giving Impact of Giving Why Give Ways to Give Business School Fund Fiscal Year Report Business School Fund Leadership Council Planned Giving Planned Giving Options Planned Giving Benefits Planned Gifts and Reunions Legacy Partners Donor Recognition Giving News & Stories How to Make a Gift Giving Deadlines Contact the Development Office Development Staff Contact Staff Directory Submit Class Notes Class Secretaries Stanford GSB Alumni Association Membership Board of Directors Insights Accounting Big Data Career & Success Corporate Governance Culture & Society Economics Education Entrepreneurship Finance & Investing Government Health Care Innovation Leadership & Management Marketing Nonprofit Operations & Logistics Operations, Information & Technology Opinion & Analysis Opportunity & Access Organizational Behavior Political Economy Social Impact Sustainability Class Takeaways Subscribe Contact Stanford Business Podcasts All Else Equal: Making Better Decisions If/Then: Business, Leadership, Society Grit & Growth Think Fast, Talk Smart View From The Top Stanford Business Magazine All Issues Spring 2022 Spring 2021 Fall 2021 Autumn 2020 Summer 2020 Winter 2020 Shift Catalyst Value Newsroom In the Media Press Kit For Journalists Events Stanford Community Resources Non-GSB Registration Home Stanford Students Exams Forms Grades DCI Fellows Other Auditors Academic Calendar & Deadlines Attendance Course Materials Frequently Asked Questions Entrepreneurial Resources Plan an Event Venues Campus Drive Grove Campus Drive Lawn CEMEX Auditorium King Community Court Seawell Family Boardroom Stanford GSB Bowl Stanford Investors Common Town Square Vidalakis Courtyard Vidalakis Dining Hall Catering Services Policies & Guidelines Reservations Jobs Faculty Recruiting Accounting Economics Finance Marketing Operations, Information & Technology Organizational Behavior Political Economy Contact Faculty Recruiting Lecturer Positions Postdoctoral Positions Visit Us Dining Accommodations Contact Us Stay in Touch Follow Us Companies, Organizations, & Recruiters Recruit Stanford GSB Talent Post Jobs Interview Candidates CMC-Managed Interviews Recruiter-Managed Interviews Virtual Interviews Host Events Campus & Virtual Off-Campus Search for Candidates Strategies & Resources Think Globally Recruiting Calendar Recruiting Policies Employment Reports Full-Time Employment Entrepreneurship Summer Employment Contact Leverage Stanford GSB Expertise Internships & Experiential Programs Entrepreneurial Summer Program Global Management Immersion Experience Social-Purpose Summer Internships Alumni Consulting Team for Nonprofits Consulting Projects Springboard Sessions Clients Working with ACT Process Overview Project Types Client Eligibility Criteria Client Screening Application Process Contact ACT ACT Leadership Social Innovation & Nonprofit Management Resources Develop Your Organization’s Talent Invest in Stanford GSB Centers & Initiatives Student Fellowships"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:24.166130",
    "url": "https://www.stanford.edu/about/",
    "university_name": "Stanford University",
    "title": "A Societal Mission",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content A Societal Mission Stanford was founded almost 150 years ago on a bedrock of societal purpose. Our mission is to contribute to the world by educating students for lives of leadership and contribution with integrity; advancing fundamental knowledge and cultivating creativity; leading in pioneering research for effective clinical therapies; and accelerating solutions and amplifying their impact. Excellence in research, teaching, and medical care Who we are What drives our faculty, students, and staff is a spirit of possibility, a legacy inherited from our pioneering founders who created Stanford in the memory of their only child to benefit other people’s children. At Stanford, we learn from our past but focus on the future, continually looking for new ways to make the world a better place. We believe strongly in the role that higher education plays in supporting a thriving society. Colleges and universities not only prepare students for their chosen path, but they help create the next generation of citizen leaders and problem solvers. Higher education institutions pursue a distinct and enduring mission in our society, dedicated solely to the creation and dissemination of knowledge. The breadth and richness of the fabric that comprises the world’s institutions of higher learning are integral to long-term human advancement and well-being. Educating tomorrow’s global citizens Stanford provides students the opportunity to engage with big ideas, to cross conceptual and disciplinary boundaries, and to become global citizens who embrace diversity of thought and experience. We offer students broad and deep academic programs across seven schools and multiple fields – including the arts and humanities, natural and social sciences, engineering, sustainability, medicine, law, education, and business. The university’s breadth of excellence and culture of innovation uniquely position it to attract and retain the best faculty in the world, who offer students the knowledge and tools to discover and embrace new ideas, and to prepare for successful careers and lives of service. The need for strong ethical principles to achieve a common good is embedded across our educational offerings. Stanford’s distinguished alumni network and highly engaged alumni community provide students with lifelong access to mentors and peers, who help to create partnerships with the world beyond campus, once again enhancing the collective contributions of our community. Learn more about academics Creating knowledge in an environment of academic freedom Unfettered inquiry is the foundation of research and education. Driven by a deep belief in academic freedom, we continually pose questions and develop new ideas to advance knowledge. Fundamental, curiosity-driven research is central to the university’s mission, and students have extensive opportunities to join Stanford scholars in research that develops new knowledge and deepens understanding of ourselves and the world around us. A hallmark of Stanford is our extensive and vibrant ecosystem of interdisciplinary research. With all seven of Stanford’s schools located on our historic campus and many institutes serving as a hub for collaboration across academic fields, the opportunities for disruptive breakthroughs are numerous and the results are evident. Stanford has had 36 Nobel Prize winners since the university’s founding and is tied among research universities for the most Nobel Prizes won since 2000. We are equally purposeful in thinking actively about the ethical implications of our research and its application in the broader world. Learn more about research Rapidly advancing knowledge into application Building on our culture of interdisciplinary collaboration that drives discovery and innovation, the university is creating “accelerators” to readily support university researchers with funding, infrastructure, technological resources, and external partners so that discoveries made at Stanford can become solutions with impact far beyond campus. Examples include the Innovative Medicines Accelerator, dedicated to reducing the time and cost of making medicines while ensuring more effective treatments are reaching patients, and the Sustainability Accelerator within the Stanford Doerr of Sustainability, the university’s first new school in 70 years and a testament to its commitment to being a leader on climate-related research and education. Work is also ongoing within Stanford’s Graduate School of Education to accelerate more effective and equitable learning solutions, and at the Stanford Impact Labs, which creates an innovative research and development pipeline for the social sciences. Learn more about the Sustainability Accelerator Excellence in clinical care Our medical enterprise, Stanford Medicine, provides access to unparalleled patient care across the San Francisco Bay Area, while its world-class researchers make groundbreaking discoveries that advance medical care across the globe. Comprising the School of Medicine, Stanford Health Care, and Stanford Children’s Health, our medical enterprise focuses on predicting, preventing, and curing disease by tailoring health care to the unique biology and life circumstance of each of us. Stanford Medicine enjoys both physical proximity and strong research ties to the university’s other schools, allowing for strong partnerships among world-class faculty that accelerate tangible health benefits for patients. Learn more about Stanford Medicine Access A deep respect for diversity in all its forms Stanford values diversity in background, experience, interests and perspectives. We see to cultivate a campus environment in which all students have the opportunity to learn from each other’s experiences and to think critically about their own views and preconceptions. The university seeks to provide all students with the opportunity and tools to build community and connection across the racial, socioeconomic, geographical, and political lines that often present barriers to greater understanding, mutual respect, and authentic friendship. Opportunities to foster social responsibility and an abiding appreciation for ethics are integral to the Stanford educational experience. Learn more about admission Financial support that makes a difference We strive to support each student in accessing the full amount of financial aid needed to thrive at Stanford. This commitment to financial equity changes not only the lives of students who receive it, but also the education of those who learn alongside them. Nearly 70 percent of Stanford undergraduates receive some form of financial aid, and those from lower-income families have their tuition, room, and board provided for in full. More than 80 percent of those who receive an undergraduate degree from Stanford graduate with no debt. Learn more about financial aid Community A thriving student life A flourishing residential campus is an integral part of the world-class educational experience Stanford offers. Stanford is home to a community of creative and accomplished people from around the world, from acapella singers to Olympic athletes. Students can choose from among more than 600 student organizations to become involved in, ranging from religious, ethnic, and cultural groups to organizations focusing on the arts and community service, to social, athletic, and recreational activities. And Stanford offers 36 varsity sports – 20 for women and 16 for men – in addition to campus-wide physical education academic classes, fitness and wellness, aquatics, intramurals, adventure programming, and 43 club sports. Learn more about campus life Strong relationships with our neighbors Stanford is proud to be a citizen of Silicon Valley and the Bay Area. We engage and build meaningful relationships with our neighbors through events, public exhibitions and performances in the arts, lectures, and lifelong learning, both on campus and online. We support local parents with access to health information, help K-12 teachers increase interest and involvement in math and science, and provide the local business community with access to lectures by today’s entrepreneurial thought leaders. And our medical enterprise, Stanford Health Care, provides access to unparalleled patient care across the Bay Area, while its world-class researchers make groundbreaking discoveries that advance medical care across the globe. Learn more about community engagement Learn more Stanford was founded in 1885 by California senator Leland Stanford and his wife, Jane, “to promote the public welfare by exercising an influence in behalf of humanity and civilization.” The university is governed by a Board of Trustees, President, Provost, Academic Council and a number of other academic and administrative officers. Leadership and Governance Our History Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:24.918555",
    "url": "https://postdocs.stanford.edu/prospective-postdocs",
    "university_name": "Stanford University",
    "title": "Prospective Postdocs",
    "content": "Skip to content Skip to navigation SUNetID Login SUNetID Login Office of Postdoctoral Affairs All Postdocs. All the Time. Search form Search Navigation menu Main menu Home About Prospective Postdocs Current Postdocs Faculty Mentors Postdoc Admins Prospective Postdocs Stanford has a thriving academic community which includes over 2,400 postdoctoral scholars. Stanford prides itself on recruiting skilled and talented scholars from all over the world and supporting their training to independent careers. If you are considering Stanford for postdoctoral training, explore the full range of faculty and research interests, familiarize yourself with the postdoc benefits, and understand the cost of living in the vibrant and dynamic Bay Area. Considering Stanford? Successful postdoctoral training requires strong mentoring relationships. Postdocs are appointed to a faculty sponsor who supports their training. Use these links to identify the best research and mentoring fit for you. Finding Faculty Mentors How To Apply SOM Faculty List University Faculty List Open Postdoctoral Positions Stanford Life Stanford is in the heart of Silicon Valley, in easy reach of arts, nature, and intellectual pursuits. Cost of Living Campus Life Postdoc Community Housing Quick Links Funding Levels and Guidelines Postdoc Benefits Visas for Postdocs Fellowship Opportunities Postdoctoral Recruitment Initiative in Sciences and Medicine (PRISM) About About Us Postdoc Benefits Open Postdoc Positions Diversity in Postdoctoral Scholar Training Postdoc Emergency Resources Verify Appointments Policy Policy Funding Guidelines Budgeting for Fellowships Contact Us Medical School Office Building (MSOB) 1265 Welch Rd., Suite 100 Stanford, CA 94305-5402 Map to MSOB Building Contact OPA Submit suggestions here! Connect Facebook Twitter Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:26.809448",
    "url": "https://financialaid.stanford.edu/",
    "university_name": "Stanford University",
    "title": "Financial Aid",
    "content": "Skip to content Financial Aid Optional line 2 - add two-line-signature to body class to display Menu Search form Search term Undergraduate Basics Graduate Basics Managing My Aid Loans Information for... Forms Parents Faculty / Staff Financial Aid Making a world-class education possible We meet the full demonstrated need, without loans, for every admitted undergrad who qualifies for financial assistance. Announcements Reporting Outside Scholarships If you will be enrolling as an undergraduate for the 2024-2025 academic year, and you have received your financial aid notification, you can now notify the Financial Aid Office of the outside scholarships that you expect to receive for 2024-2025.  Log on to the Axess portal and go to the Finances page.  From the drop-down menu, choose Financial Aid, then Report Outside Scholarships. Report Outside Scholarships in Axess Stanford Responds to FAFSA Delays  (Updated 5-3-2024) After long delays, the 2024-2025 FAFSA online application process is now functioning well. Please see details in the PDF document linked below, including guidance for parents without Social Security numbers. Stanford Responds to FAFSA Delays Making FAFSA Corrections The FAFSA form is now accepting corrections. How to Correct or Update your 2024-2025 FAFSA Form Applying for Aid Application requirements, forms and deadlines. Note: We cannot confirm receipt of financial aid application requirements for admission applicants until after admission decisions have been released. Undergraduate Students Graduate Students In the Spotlight Finances and Your Stanford Education You can review the slides from our presentation for admitted undergraduate applicants and their families at Admit Weekend in April 2024. The SAVE Repayment Plan Learn about the new Saving on a Valuable Education (SAVE) repayment plan for federal student loan borrowers. Undergrad Student Stipend Policy Review the rules for when and how undergraduate students can receive stipends from Stanford departments. Estimate Aid & Cost See how affordable a Stanford undergraduate education can be for you. Quick Cost Estimator Net Price Calculator Send Documents Use the secure document upload form to send your completed PDF files online to the Financial Aid Office. The upload form is unavailable due to maintenance at this time. Please check back later. Document Upload Form Upload Form is Offline Calendar Spring Quarter Apr 30 Priority filing date for continuing students May 24 Summer bills issued Jun 13 Loan exit counseling for graduating students (time/location TBD) Jun 16 Commencement Jun 20 Summer bills due (undergraduates) Academic Calendar Connect with us Visit Campus Visitor Information Campus Map Apply Undergraduate Admission Graduate Admission Resources Gateway for New Grad Students Student Services Center Mind Over Money Financial Aid Offices Graduate School of Business Law School School of Medicine FAQ AXESS Contact Us Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:27.316968",
    "url": "https://vpge.stanford.edu/gateways/prospective-students",
    "university_name": "Stanford University",
    "title": "Information for Prospective Students",
    "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Office of the Vice Provost for Graduate Education Search this site Submit Search Menu Academic Guidance Advising & Mentoring Advising Policies Advising Expectations Advising Practices & Resources Mentoring Resources Policies & Planning Research Policies Problem Solving & Crisis Intervention School Dean's Office Contacts Faculty Advisory Committee Student & Postdoc Advisory Committee Diversity Initiatives Awards 2023 Recipients 2022 Recipients 2021 Recipients 2020 Recipients 2019 Recipients 2018 Recipients 2017 Recipients 2016 Recipients 2015 Recipients 2014 Recipients Programs & Funding Recruitment Professional Development Programs & Funding Grad Grow Search Grad Grow Competencies Campus Partners Ethnic and Community Centers Career Centers Career Planning Stanford Courses Career Development Courses Communication Courses Leadership & Management Courses Diversity, Equity & Inclusion Courses Teaching & Mentoring Courses Interdisciplinary Courses Professionalism Courses Interdisciplinary Learning Stanford Graduate Summer Institute 2024 SGSI Course Overview 2023 SGSI Course Overview 2022 SGSI Course Overview Networking & Learning Programs & Funding Stanford Courses Fellowships & Funding Graduate Student Funding Other Stanford Fellowships External Funding VPGE Fellowships VPGE Fellowship Policies GFS Entry Information VPGE Funding Opportunities Current VPGE Fellows All 2023 Fellows All 2022 Fellows All 2021 Fellows All 2020 Fellows All 2019 Fellows All 2018 Fellows All 2017 Fellows All 2016 Fellows All 2015 Fellows All 2014 Fellows Graduate Fellowships Faculty Advisory Committee We're expanding what's possible in graduate education. Join us! Information for Prospective Students Main navigation Skip to main content Secondary Navigation New Graduate Students Prospective Students Faculty & Staff Main content start Apply Apply directly to departments and programs via the Graduate Admissions application. Check out Stanford's seven Schools and nearly 100 departments and programs offering graduate degrees. Visit Graduate Admissions Explore Graduate Programs Visit Stanford's Seven Schools Knight-Hennessy Scholars Learn About Recruitment Consider Join Stanford's globally diverse graduate student community of 9,400 students, most living on campus and receiving some form of financial support. See How Diversity Works at Stanford Explore Housing Options Read About Finances Discover How We Cross Disciplinary Boundaries The Stanford Grad Experience and Advice to Prospective Students Engage Find the resources you need to make your transition to graduate studies at Stanford. Learn about how VPGE and our campus partners support student success. Visit the Grad Gateway Discover Professional Development Opportunities Explore Campus Resources Stanford Office of the Vice Provost for Graduate Education Web Login Instagram YouTube Flickr Flickr About VPGE Overview Our Mission Meet the Vice Provost History & Milestones Staff Contact Us Report a website problem Quick Links Calendar Programs Recent News Subscribe to Newsletter Partners New Students Faculty & Staff Prospective Students Bookmarks Graduate Academic Policies Graduate Admissions Graduate Funding Graduate Life Office Office of the Registrar Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:27.791620",
    "url": "https://vpge.stanford.edu/fellowships-funding/graduate-student-funding",
    "university_name": "Stanford University",
    "title": "Graduate Student Funding",
    "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Office of the Vice Provost for Graduate Education Search this site Submit Search Menu Academic Guidance Advising & Mentoring Advising Policies Advising Expectations Advising Practices & Resources Mentoring Resources Policies & Planning Research Policies Problem Solving & Crisis Intervention School Dean's Office Contacts Faculty Advisory Committee Student & Postdoc Advisory Committee Diversity Initiatives Awards 2023 Recipients 2022 Recipients 2021 Recipients 2020 Recipients 2019 Recipients 2018 Recipients 2017 Recipients 2016 Recipients 2015 Recipients 2014 Recipients Programs & Funding Recruitment Professional Development Programs & Funding Grad Grow Search Grad Grow Competencies Campus Partners Ethnic and Community Centers Career Centers Career Planning Stanford Courses Career Development Courses Communication Courses Leadership & Management Courses Diversity, Equity & Inclusion Courses Teaching & Mentoring Courses Interdisciplinary Courses Professionalism Courses Interdisciplinary Learning Stanford Graduate Summer Institute 2024 SGSI Course Overview 2023 SGSI Course Overview 2022 SGSI Course Overview Networking & Learning Programs & Funding Stanford Courses Fellowships & Funding Graduate Student Funding Other Stanford Fellowships External Funding VPGE Fellowships VPGE Fellowship Policies GFS Entry Information VPGE Funding Opportunities Current VPGE Fellows All 2023 Fellows All 2022 Fellows All 2021 Fellows All 2020 Fellows All 2019 Fellows All 2018 Fellows All 2017 Fellows All 2016 Fellows All 2015 Fellows All 2014 Fellows Graduate Fellowships Faculty Advisory Committee Graduate Student Funding Main navigation Skip to main content Secondary Navigation Graduate Student Funding Other Stanford Fellowships External Funding VPGE Fellowships VPGE Fellowship Policies VPGE Funding Opportunities Current VPGE Fellows Main content start The cost of graduate study at Stanford and the resources available for financial support vary by degree, school, and enrollment status. Students are encouraged to plan ahead and anticipate their financial needs. Campus Offices and Resources Your Degree Program Many funding policies and resources are local, so seek out your student services staff, faculty advisor, or faculty director of graduate studies for help or advice first. Financial Aid Office Stanford's main Financial Aid Office (FAO) offers a broad overview of graduate student funding and generates a sample graduate student budget (or estimated “cost of attendance”). The FAO also administers loans and manages Stanford Support Programs such as the Emergency Grant-In-Aid Funds and the Graduate Family Grant Program. The Graduate School of Business, School of Medicine, and Stanford Law School have financial aid offices to serve students pursuing professional degrees. Read the Graduate Basics page Review the Student Budget Learn about Stanford Support Programs Office of the University Registrar The \"Reg Office\" posts annual tuition rates . Student Services Center The Student Services Center can help you understand and pay your bill and provides other student services. Mind Over Money The Mind Over Money program provides workshops. coaching, and extensive personal finance resources, including information about taxes and saving for retirement , to support students' financial wellness during their time at Stanford and beyond. Controller’s Office The Controller’s Office offers information about taxes, student employment, and travel reimbursement. Graduate Academic Policies and Procedures The GAP provides guidelines for graduate financial support, including definitions of typical funding sources and minimum salaries for research and teaching assistants. Read about graduate policies See current assistantship rates Related Links VPGE Fellowships & Funding Other Stanford Fellowships External Funding Stanford Office of the Vice Provost for Graduate Education Web Login Instagram YouTube Flickr Flickr About VPGE Overview Our Mission Meet the Vice Provost History & Milestones Staff Contact Us Report a website problem Quick Links Calendar Programs Recent News Subscribe to Newsletter Partners New Students Faculty & Staff Prospective Students Bookmarks Graduate Academic Policies Graduate Admissions Graduate Funding Graduate Life Office Office of the Registrar Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:33.656583",
    "url": "https://www.stanford.edu/campus-life/",
    "university_name": "Stanford University",
    "title": "Campus Life",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Campus Life Our thriving residential campus is home to a community of creative and accomplished people from around the world. 600+ Organized student groups 81 Undergraduate student residences 14,000+ Students living on campus Student Life Student Affairs Comprising more than 25 offices and centers, Student Affairs provides a broad range of services and support to Stanford students, including leadership development, residential programs, public service, career exploration and community engagement. Student Affairs Housing & Dining Nearly all undergraduates and about 72% of graduate students reside in 81 undergraduate student residences and 151 graduate on-campus residences. Nine dining halls, a teaching kitchen, and organic gardens provide the campus community with healthy, sustainable meals. Residential & Dining Enterprises Community Engagement & Diversity Other programs supporting the student community: Diversity Works Haas Center for Public Service Office for Religious & Spiritual Life Graduate Life Office Arts & Culture The Arts at Stanford Stanford has a rich tradition of fostering creativity and the arts. A vibrant campus “arts district” is situated along Palm Drive near the Oval. The Arts at Stanford Museums The Stanford campus is home to two world-class art museums. Cantor Center for the Visual Arts Anderson Collection Performing Arts Stanford Live presents a wide range of performances and distinctive performing arts experiences. Stanford Live Athletics, Recreation, & Wellness Recreation and Wellness Students, faculty, and staff enjoy state-of-the-art recreational facilities and wellness programs. Recreation & Wellness Cardinal Athletics Stanford students compete in 36 varsity sports and 43 club sports. Cardinal Athletics BeWell Stanford offers incentives, programs, and activities that promote health and wellness. Stanford BeWell Getting Around Biking is a popular way to get around campus. Transit options also include a free campus shuttle and car-share. Public Safety provides police and emergency services 24 hours a day. Campus Map Stanford Transportation Public Safety Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:40.187562",
    "url": "https://facts.stanford.edu/academics/freshmen-class-profile/",
    "university_name": "Stanford University",
    "title": "Class of 2027 Profile",
    "content": "Skip to main content Stanford University (link is external) Stanford Facts Search this site Submit Search Menu Home About Stanford Welcome to Stanford Campus History Historic Milestones Alumni Academics Schools & Programs Undergraduate Education Graduate Education Faculty Postdoctoral Scholars Research Research & Innovation Technology & Inventions Libraries and Resources Campus Life Student Life Cardinal Athletics The Arts Administration & Finances University Administration Presidents and Provosts Staff Finances Stanford Medicine Search this site Submit Search Class of 2027 Profile 1,705 matriculated students 20% First-generation college students High Schools Percentage Public 57% Private 27% Home School 1% International 15% Geographic Diversity U.S. States 49 Non-U.S. Countries* 76 Ethnic Diversity Percentage American Indian or Alaska Native 1% Asian 26% Black or African American 9% Hispanic or Latino** 17% International 14% Native Hawaiian or other Pacific Islander <1% White 21% Two or more races 8% Unknown 4% Gender Balance Percentage Women 50% Men 50% Numbers have been rounded to the nearest whole number. * Non-U.S. countries are determined by international students’ citizenship statuses. * * Includes all reporting Hispanic, Latino, regardless of race. Undergraduates Approximately 7,800 undergraduate students attend Stanford University. Stanford University Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:48.656087",
    "url": "https://ed.stanford.edu/",
    "university_name": "Stanford University",
    "title": "Home",
    "content": "Skip to content Skip to navigation Future Students Current Students Faculty/Staff Alumni Careers Enter your keywords for search News Directory Events Give Toggle navigation Enter your keywords for search Programs & Degrees Admissions & Aid Faculty & Research About Future Students Current Students Faculty/Staff Alumni Careers News Directory Events Give Together,\n        we are Improving lives through learning Learn\n      More You are here Home Home Stanford Graduate School of Education is dedicated to solving education's greatest challenges. Through rigorous research, model training programs and partnerships with educators worldwide, we're pursuing equitable, accessible and effective learning for all. Our Vision Programs We offer undergraduate, MA, PhD and professional learning programs Learn how to apply Doctoral Develop expertise and produce relevant research that improves understanding, policies and practice. Master's Advance your knowledge and skills to become a leading agent for positive change in classrooms and beyond. Undergraduate Engage in a vibrant learning community centered on scholarship that improves lives. Professional Grow your career with high-quality programs online and on-campus. Faculty Our multidisciplinary faculty are leaders in research and teaching Faculty Profiles Victor R. Lee Associate Professor See profile → Amado Padilla Associate Dean for Faculty Affairs See profile → Mitchell L. Stevens Professor See profile → Hariharan Subramonyam Assistant Professor (Research) See profile → Philip Fisher Professor See profile → Teresa LaFromboise Professor See profile → Dora Demszky Assistant Professor See profile → Research May 15, 2024 Research Stories Softening the sharp edges in mathematics K-12 | Science and Math Education | Teaching May 6, 2024 Research Stories 70 years after Brown v. Board of Education, new research shows rise in school segregation Education Policy | Poverty and Inequality | Race and Equity Feb 27, 2024 Research Stories Changing the history course Civics and History | Curriculum and Instruction | Impact See all News and Media Our Community Our faculty, students, alumni and staff focus on improving lives through learning, teaching, discovery and innovation. Learn more about who we are Alvaro Fernandez, MBA '01, MA '02 A learning organism Keep reading Magdalena Gross, Senior Research Associate Learning about complicated histories Keep reading We’re accelerating solutions to the world’s most pressing challenges in\n                        education. The Stanford Accelerator for Learning is the first university-wide initiative on learning. Housed at\n                    the GSE, the Accelerator connects scholars across disciplines and with external partners to bridge\n                    research and practice and bring innovative, scalable learning experiences across the lifespan. Visit the Accelerator website to\n                        learn more. Back to the Top Stanford Graduate School of Education 482 Galvez Mall Stanford, CA 94305-3096 Tel: (650) 723-2109 Contact Admissions GSE Leadership Site Feedback Site Map Web Accessibility GSE IT Career Resources Faculty Open Positions Explore Courses Academic Calendar Office of the Registrar Cubberley Library Webmail StanfordWho StanfordYou 25Live Login Improving lives through learning Facebook Twitter LinkedIn YouTube Flickr Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:49.268956",
    "url": "https://summer.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to main content Courses from June 22, 2024 — August 18, 2024 Search Search Student Type Student Type Undergraduate Graduate High School Gap Year Current Stanford Students Courses Course List About Courses Academic Support Applying Applying Application Process Dates and Deadlines Eligibility Requirements International Students Costs Costs Tuition and Fees Calculator Tuition Grants Student Life Student Life Residential or Commuter Calendar of Events Campus Resources User account menu Apply Now User account menu Apply Now Student Type Student Type Undergraduate Graduate High School Gap Year Current Stanford Students Courses Course List About Courses Academic Support Applying Applying Application Process Dates and Deadlines Eligibility Requirements International Students Costs Costs Tuition and Fees Calculator Tuition Grants Student Life Student Life Residential or Commuter Calendar of Events Campus Resources Search Search Courses from June 22, 2024 — August 18, 2024 Discover Your Potential Here Begin Your Journey I want to live on campus commute to class The quality of instruction, engaging class environment, rigorous curriculum, enriching social activities, and creative approach make Stanford Summer Session a truly unparalleled experience. Alexis, recent Summer Session student Explore. Discover. Transform. Check out Student Life FAQ Tuition & Fees Find Courses Mailing List Contact Us Employment People facebook--teallogo instagram--teallogo youtube--teallogo Stanford Summer Session provides high-achieving and ambitious students a transformative educational experience at a world-class university. By combining challenging academics with a rich array of extra-curricular programming, Stanford Summer Session successfully shares the University’s culture of innovation, academic excellence, and global responsibility. Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 . Group 3 Group Group 2"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:50.827532",
    "url": "https://admission.stanford.edu/afford/",
    "university_name": "Stanford University",
    "title": "Afford",
    "content": "Skip to content Undergraduate Admission Menu Search form Search term Plan Afford Engage Apply Quick Links News & Announcements Application Requirements Tours and Programs Cost of Attendance Admission Volunteers Story 1 Story 2 Story 3 Story 4 Story 5 MAKING A WORLD-CLASS EDUCATION POSSIBLE We meet the full financial need of every admitted undergraduate who qualifies for assistance. Previous Story Next Story Afford A Stanford Education is Affordable. Stanford offers comprehensive, need-based financial aid that makes it possible for all admitted undergraduate students to attend â and we do not expect students to borrow to meet their need. Learn how the program works, then use the net price calculator to get an award estimate based on your familyâs financial situation. Financial Aid at a Glance See How Aid Works Almost half of all Stanford undergraduates receive need-based financial aid. Families earning less than $150,000 with assets typical of that income level pay no tuition. Families earning less than $100,000 with assets typical of that income level pay no tuition or room and board. Learn About Types of Financial Aid Stanford provides financial aid in the form of scholarships, which do not need to be repaid. Federal and state grants, outside scholarships, and student employment are additional sources of funding. We do not expect you to take out student loans to cover your college costs. Estimate Your Cost to Attend Stanford The average need-based scholarship in the current freshman class is more than $70,000. Use the net price calculator tool to see what level of financial aid you can expect to receive if you attend. Students Share Their Stories Jemima grew up as one of six kids, with a mom â her \"rock and shining star\" â who worked the night shift as a nurse. She thought of Stanford as her super-reach school, until she got in and realized it would cost her almost nothing to attend. Cameron comes from Neah Bay, Washington, where his mom is an intake clerk, his dad is a fisherman, and \"everybody knows everybody.\" He was motivated by family and community to get a good college education â but knew his parents wouldn't be able to contribute to covering the cost. Tracie always knew she wanted to be able to provide two things for her kids: braces and a good education. But as her oldest daughter approached the end of high school, she began to worry that she wouldn't be able to afford the cost of college. Programs Admission Forums, Student Programs, and Special Events Brochures Stanford Preview and Viewbook Join the Mailing List Contact Us University Policies Engage with Us Stanford complies with the Jeanne Clery Act and publishes crime statistics for the most recent three-year period. View the full report . Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:51.416705",
    "url": "https://www.stanford.edu/faculty-staff-gateway/",
    "university_name": "Stanford University",
    "title": "Gateway for Faculty & Staff",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Gateway for Faculty & Staff Gateway for Faculty & Staff Resources, offices, and services for Stanford faculty and staff Email & Calendar Launch webmail Axess Timecard, payroll, and more Services & Support Submit a help request Tools Launchpad Google Drive, Slack, Zoom Red Folder Supporting student well-being Search term Search Stanford: Web People Search people Working at Stanford Cardinal at Work Your destination for all employee-related information from University Human Resources Benefits & Rewards Manage health, retirement, and other benefits University Holidays University paid holiday schedule and policies Stanford Careers Explore job openings, sign up for alerts New Staff Welcome Center Onboarding resources for new employees Manager Resources Resources, tools, and training for Stanford managers Faculty Resources Faculty Affairs Faculty appointments, policies, handbook, and updates Faculty Senate Meeting schedule, notes, and announcements Faculty Housing Housing programs for eligible faculty Faculty Development & Diversity Professional development, inclusion, recruitment Faculty Financial Activities Fingate hub for faculty accounts, payroll, expenses On Campus Places to Eat Restaurants and cafes on campus Meal Plans Details on plans, account management Faculty Club Member dining, catering, and guest rooms Staff Groups List of groups and events Stanford Guest House Lodging for Stanford business Conference Services Year-round meeting planning services Safety & Support Public Safety Contact, alerts, and resources Sexual Assault Support & Resources Urgent help, reporting, and safety University Ombuds Confidential assistance with conflict resolution Diversity & Access Resources to ensure equal opportunity and access SHARE Title IX Office Sexual harassment/assault response & education Ethics & Compliance Helpline Report an issue of concern Health & Wellness Stanford BeWell Program details, perks, events Stanford Healthy Living Search and register for classes Recreation & Wellness Fitness and recreation facilities, programs, classes, hours Faculty/Staff Help Center Confidential counseling and other support services WorkLife Office Programs and services to promote work / life balance Windhover Mindfulness and meditation center Mental Health Resources for Students For referrals and consultation Getting to Work Locations Info about our many workplaces Commute Information Plan your commute, free, and discounted transportation Marguerite Shuttle Stanford’s free bus service around campus Parking Parking permits and prices Remote Worker Resources Community of practice for remote workers Campus Map Getting around campus Online Technology University IT Explore campus IT news and services Services & Support Submit a help ticket Getting Started Technology tools and resources to get you started Video Conferencing Zoom, WebEx, others Information Security Protect your information and Stanford’s online assets IT Perks Free and discounted IT services Essential Stanford Software Get software for your office computer Stanford Web Services Web planning, design, development, and maintenance Staff Learning & Growth Learning at Stanford Professional development courses Technology Training Classes, courses, online resources, training sessions Continuing Studies Courses, events, certificates, registration, and policies Academics Academic Calendar Important university dates and deadlines Stanford Libraries Catalog, collections, locations, and services ExploreCourses Online catalog of courses, degrees, policies, and requirements Registrar’s Office Student records, course, and curriculum planning Teaching & Learning Support Support to advance teaching and learning Research Research & Scholarship (DoResearch) Dean of Research resources for scholarly inquiry and research administration Research Training Compliance training courses Institutes, Labs & Centers Stanford’s 15 independent laboratories, centers, and institutes Other Research Centers A listing of other research labs and centers Administration Administrative Offices University governance and listing of administrative units Administrative Policies Administrative Guide and other university-wide policies Brand & Identity Toolkit Visual communications resources and downloads Finance Oracle Financials Stanford’s core financial accounting system Faculty Financial Activities Fingate hub for faculty accounts, payroll, expenses Staff Financial Activities Fingate hub for staff expenses, travel, payroll, purchasing Financial Activities Training Find available courses and training materials Know of a link we should add, change or delete? Let us know! From the President and Provost Visit Stanford Report Stanford Report delivers the daily news and information that faculty and staff need to know to thrive at Stanford. May 7, 2024 Charlotte Pera to co-lead Sustainability Accelerator April 26, 2024 Faculty Senate adjusts calendar of certain academic years May 4, 2022 Stanford Doerr School of Sustainability, university’s first new school in 70 years, will accelerate solutions to global climate crisis July 30, 2019 Stanford faculty recount summer breaks to remember December 20, 2018 Meet our faculty More Upcoming Events More Events Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:51.893649",
    "url": "https://www.stanford.edu/research/",
    "university_name": "Stanford University",
    "title": "Research",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Research From Nobel Prize winners to undergraduates, all members of the Stanford community are engaged in the creation of knowledge. 15 Institutes Cross interdisciplinary boundaries 20 Libraries Hold over 12 million items $1.98 Billion Sponsored research budget The Research Enterprise Stanford’s culture of collaboration drives innovative discoveries in areas vital to our world, our health, and our intellectual life. Interdisciplinary Research At the intersection of disciplines is where new ideas emerge and innovative research happens. Stanford Research Institutes, Labs & Centers Fifteen independent labs, centers, and institutes engage faculty and students from across the university. Independent Laboratories, Centers and Institutes Other Research Centers & Labs Academic departments sponsor numerous other research centers and labs. Listing of Stanford Research Centers Where Research Happens SLAC National Accelerator Laboratory SLAC is a U.S. Department of Energy national laboratory operated by Stanford, conducting research in chemistry, materials and energy sciences, bioscience, fusion energy science, high-energy physics, cosmology and other fields. SLAC National Accelerator Laboratory Hoover Institution The Hoover Institution, devoted to the study of domestic and international affairs, was founded in 1919 by Herbert Hoover, a member of Stanford’s pioneer class of 1895 and the 31st U.S. president. Hoover Institution Stanford Woods Institute for the Environment Working toward a future in which societies meet people’s needs for water, food and health while protecting and nurturing the planet. Stanford Woods Institute Stanford Humanities Center Advancing research into the historical, philosophical, literary, artistic, and cultural dimensions of the human experience. Stanford Humanities Center Stanford Bio-X Biomedical and life science researchers, clinicians, engineers, physicists and computational scientists come together to unlock the secrets of the human body. Stanford Bio-X Freeman Spogli Institute for International Studies (FSI) Understanding problems, policies and processes that cross borders and affect lives around the world. Freeman Spogli Institute More Research Centers Libraries Stanford University Libraries Stanford is home to more than 20 individual libraries, each with a world-class collection of books, journals, films, maps and databases. Stanford University Libraries Online Catalog SearchWorks is Stanford University Libraries’ official online search tool providing metadata about the 8 million+ resources in our physical and online collections. SearchWorks Undergraduate Research Undergraduate Advising and Research (UAR) connects undergraduates with faculty to conduct research, advanced scholarship, and creative projects. Undergraduate Research Research Administration The Office of the Vice Provost and Dean of Research, provides comprehensive information about the research enterprise at Stanford. DoResearch Find A Researcher Search and read profiles of Stanford faculty, staff, students, and postdocs. Find researchers with whom you would like to collaborate. Stanford Profiles Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:52.334621",
    "url": "https://www.stanford.edu/academics/",
    "university_name": "Stanford University",
    "title": "Academics",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Academics Stanford students create and apply knowledge by thinking and doing, preparing for leadership in a rapidly changing world. 2,323 Faculty members 6:1 Student-to-faculty ratio Nearly 200 Graduate fields of study Undergraduate Studies Undergraduate Education Stanford Undergrad is your guide to undergraduate academics and opportunities run by the Vice Provost for Undergraduate Education. Stanford Undergrad Majors Explore the 66 major fields of undergraduate study at Stanford. Explore Majors Undergraduate Facts & Figures Approximately 7,800 undergraduate students attend Stanford. Learn more about the undergraduate program and student body. Facts about the Undergraduate Program Seven schools on one campus offer students boundless opportunities to pursue their passions and collaborate on solving complex global problems. Learn more about our seven schools Graduate Studies Office of the Vice Provost for Graduate Education The VPGE office works collaboratively across the University to ensure that every graduate student has the best possible education. Graduate Education Graduate Facts & Figures Today, 9,688 students are pursuing 14 distinct postbaccalaureate degrees in nearly 200 graduate programs in all seven of Stanford’s schools. Learn more about graduate studies at Stanford. Facts about Graduate Studies Lifelong Learning From Pre-K to College Readiness Stanford offers a wide range of programs, classes, internships, and an entire online high school. Our world-class faculty challenge young people to explore and achieve – through STEM research, internationally focused courses, and arts experiences. Pre-K to College Readiness Professional Development Learn from our expert faculty as you grow your knowledge in your professional sphere or prepare to pivot into a new career. Professional Development Learning for Exploration and Enrichment No matter where you live or work, Stanford offers learning opportunities that empower you to feed your curiosity, seek meaning, and engage wholeheartedly in the world. Learning for Exploration and Enrichment Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:52.807140",
    "url": "https://www.stanford.edu/health-care/",
    "university_name": "Stanford University",
    "title": "Health Care",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Health Care Clinical care, research, and education fuel innovation to advance human health. 1,600+ Faculty physicians New adult hospital Opened in 2019 540,000+ Annual pediatric visits to Stanford Children’s Patient Care We coordinate expertise with the most advanced treatments and technology for the best possible patient outcomes. Stanford Health Care Stanford Medicine delivers unparalleled care for each patient’s unique needs. Our multidisciplinary approach to health care coordinates expertise with the most advanced technology for the best possible outcomes. Stanford Health Care Stanford Children’s Health Stanford Children’s Health is the only health care network in the Bay Area – and one of the few in the country – exclusively dedicated to pediatric and obstetric care. Stanford Children's Health Research We are drawn to the difficult problems, the ones for which prevailing science does not yet have a framework to understand. Medicine Stanford Medicine scientists transform cancer cells into weapons against cancer Medicine Moms’ and babies’ medical data predicts prematurity complications Medicine Potential and pitfalls of smart toilets: Would you use one? Medicine Single drug injection wards off COVID-19 hospitalizations, in Stanford Medicine-led trial More Stanford Medicine Research Education Our strength in interdisciplinary scholarship, our dedicated faculty, and a culture of innovation set the training ground for the next generation of biomedical leaders and pioneers. Stanford School of Medicine With easy access to world-class faculty and coursework in medical science as well as engineering, computer science, education, business, and the humanities, aspiring physicians and scientists can experiment across disciplines and customize their education to match their interests. Stanford School of Medicine Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:53.287206",
    "url": "https://www.stanford.edu/events/",
    "university_name": "Stanford University",
    "title": "Upcoming Events",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Upcoming Events Explore opportunities to engage with people, ideas, art, and education across campus. More Stanford Events Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:55.065831",
    "url": "https://visit.stanford.edu",
    "university_name": "Stanford University",
    "title": "Visitor Information Services",
    "content": "Visitor Information Services Visitor Information Welcome to the Farm Stanford University is a place where pioneering spirit meets 21st-century possibility. Announcements Spring 2024 Tours and Programs for Prospective Undergraduates (Updated 2/12/2024) The schedule of prospective undergraduate tours and programs being offered for Stanford’s 2024 Spring Break week (March 25-29) and for Spring Quarter (April 1 - June 5) was posted for online registration at 12:00pm noon (Pacific Time) on Monday, February 12. See details We strongly encourage prospective undergraduates wishing to visit campus to consider a visit (if possible) that does not fall during the period from March 16 through April 14, when visitor volume is high but student activity and tour availability is limited by final exams, Stanford's own Spring Break, and the beginning of the Spring academic Quarter. These dates fill up quickly. Additional space will be added if/as student staffing allows. The Office of Undergraduate Admission offers a variety of tours and programs – both virtual and in-person – for prospective undergraduate students and their supporters, with expanded offerings on Mondays and Fridays. Additional programming generally includes virtual offerings on a weekly basis. Tours are provided to qualifying organized groups from Tuesday-Thursday based upon availability; group visits require advance booking. The Stanford Visitor Center is generally open from Monday through Friday from 9:00am-5:00pm (with the exception of federal holidays and some breaks between quarters) to provide information about visiting campus. Tours for Approved Groups/Organizations available by reservation (Updated 3/22/2024) Guided tours of campus for groups of prospective undergraduate students (schools, organizations, etc.) are available to approved groups by advance reservation on most weekdays during the academic quarter. See details The Office of Undergraduate Admission is pleased to announce that 45-minute tours are once again provided by advance reservation to qualifying organizations, with tours times available for reservation during the fall on most weekdays (holiday periods excluded) from Week 3 through Week 10 of each academic quarter. Please note that no group tours or visits will be scheduled from March 15 through April 15, 2024 , the period just before, during, and after Stanford's Spring Break. At this point, all new Group Tour requests should be sent to grouptours@stanford.edu . Requests that have already been submitted for fall and beyond will be reviewed and receive responses based upon tour availability and qualifying status. Qualifying organizations: The Office of Undergraduate Admission seasonally offers guided tours by appointment for prospective undergraduate student groups of 10 or more people (up to 100 max) from the following categories: High Schools Community Colleges Not-For-Profit Organizations focused on Access or Exposure to College Qualifying Community Based Organizations Other groups: Middle schools, grade schools, and other qualifying organizations may request approval to visit and park on campus, and can be provided with resources to enjoy a self-guided visit with age appropriate sites, resources, and activities, but we are sorry to say that we are no longer providing staffing for guided tours for these age levels. Please note that we will not grant requests for group visits through commercial or third party tour operators. All requests and communications must come from and and be processed through a qualifying organization. Experience Stanford Stanford 360° Virtual Tour Welcome admitted students and all future applicants! Events Events at Stanford Current Weather Stanford, CA, USA Stanford Station Online Resources Virtual Tours Stanford Mobile App Related Sites Financial Aid Undergraduate Admission Contact Us Connect with us Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:21:55.623433",
    "url": "https://www.stanford.edu/news/",
    "university_name": "Stanford University",
    "title": "Stanford News",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Stanford News Stories about people, research, and innovation across the Farm Arts Artists Alia Farid and Camille Utterback to create new campus artworks Science & Engineering How racism impacts support for affordable housing Science & Technology The surprising relationship between marine worms and the algae that live inside them Earth & Climate How wildfires change soil chemistry Powwow Weekend Indigenous women celebrated at Stanford’s 53rd annual powwow Earth & Climate John Kerry shares his ‘unfettered’ optimism on climate Honors & Appointments 2024 Amy J. Blue Awards announced Earth & Climate Fire at Jasper Ridge honors the past, present, and future More Stanford News Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:22:02.174275",
    "url": "https://profiles.stanford.edu/",
    "university_name": "Stanford University",
    "title": "Search or Browse Profiles",
    "content": "Stanford Profiles Menu Browse Schools Graduate School of Business Graduate School of Education School of Engineering School of Humanities and Sciences School of Medicine Stanford Doerr School of Sustainability Institutes & Research Centers Bio-X Freeman Spogli Institute for International Studies Institute for Computational and Mathematical Engineering (ICME) Institute for Human-Centered Artificial Intelligence (HAI) Institute for Stem Cell Biology and Regenerative Medicine Precourt Institute for Energy SLAC National Accelerator Laboratory Sarafan ChEM-H Stanford Data Science Stanford Institute for Economic Policy Research (SIEPR) Stanford PULSE Institute Stanford Woods Institute for the Environment Wu Tsai Human Performance Alliance Wu Tsai Neurosciences Institute Administration Office of External Relations Office of VP for University Human Resources Office of Vice President for Business Affairs and Chief Financial Officer Stanford University Libraries Vice Provost and Dean of Research Vice Provost for Student Affairs Vice Provost for Undergraduate Education Sign In Edit My Profile Switch to Stanford-only View Search or Browse Profiles at Stanford University Search Schools Graduate School of Business Graduate School of Education School of Engineering School of Humanities and Sciences School of Medicine Stanford Doerr School of Sustainability Institutes & Research Centers Bio-X Freeman Spogli Institute for International Studies Institute for Computational and Mathematical Engineering (ICME) Institute for Human-Centered Artificial Intelligence (HAI) Institute for Stem Cell Biology and Regenerative Medicine Precourt Institute for Energy SLAC National Accelerator Laboratory Sarafan ChEM-H Stanford Data Science Stanford Institute for Economic Policy Research (SIEPR) Stanford PULSE Institute Stanford Woods Institute for the Environment Wu Tsai Human Performance Alliance Wu Tsai Neurosciences Institute Administration Office of External Relations Office of VP for University Human Resources Office of Vice President for Business Affairs and Chief Financial Officer Stanford University Libraries Vice Provost and Dean of Research Vice Provost for Student Affairs Vice Provost for Undergraduate Education About Stanford Profiles Search for faculty, staff, students and postdocs in one place to find information (Expertise, Bio, Research, Publications, and more) on people you would like to collaborate with and contact information to be able to communicate with them directly. Search for Staff to also find information on current roles, professional experience, and project work. Browse a list of people affiliated with an organization by selecting from the available menu options or search for a department or organization by name. Stanford Campus Map Search the Stanford Map Related Resources Search Stanford Web Find an Adult-care doctor Find a Pediatrician or pediatric specialist Tree View of University Org Code Hierarchy Organization Manager Report Accessibility Issues Stanford University SU Home Maps & Directions Search Stanford Terms of Use Copyright Complaints © Stanford University, Stanford, California 94305"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:22:02.998967",
    "url": "https://www.stanford.edu/student-gateway/",
    "university_name": "Stanford University",
    "title": "Gateway for Students",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Gateway for Students Gateway for Students Resources, offices and services that support Stanford students Email & Calendar Launch webmail Axess Register, pay bills, and more Canvas Course management Mental Health Resources for Students Services & Support Submit a help request General Academic Resources ExploreDegrees Information on degrees, requirements, policies ExploreCourses Stanford course catalog Academic Calendar Key academic dates and deadlines University Registrar Student records, grades, degree progress Libraries Collections, study spaces, course reserves Learning Resources Tutoring, coaching, learning hub, and more Stanford Bookstore Textbooks, course materials, technology, and more For Undergraduates Vice Provost for Undergraduate Education Information on degrees, requirements, policies Explore Majors Your launchpad to explore majors and programs For Graduate Students Vice Provost for Graduate Education Information on degrees, requirements, policies Graduate Life Supporting graduate students and their families Postdoctoral Affairs Hub for all postdoctoral appointments Studying Beyond Campus Bing Overseas Studies Stanford programs to study abroad Stanford in Washington Study and learn in the nation’s capital Hopkins Marine Station Marine science programs in Monterey Bay Stanford at Peking University Stanford research and education center in Beijing Bechtel International Center Hub for international students, programs, and events Off-Campus Learning Opportunities Search off-campus research and travel opportunities Student Life Student Affairs Life and experiences outside the classroom ASSU Stanford’s student government association Religious & Spiritual Life Nurturing spiritual and religious life on campus Career Education Explore career paths and opportunities Office of Accessible Education Supporting Stanford students with disabilities Cardinal Service Public service opportunities and programs Mental Health Resources Services & programs to support student well-being Housing and Dining Residential & Dining Enterprises Providing student housing and dining Student Housing Housing options and assignments Dining Halls Dining locations and hours Meal Plans Manage your meal plan and Cardinal Dollars Getting Around Campus Map Searchable online campus map Parking & Transportation Parking permits and commute programs Marguerite Shuttle Campus shuttle routes, schedules Caltrain Train schedules and stops Managing Finances Financial Aid Application requirements, forms, and deadlines My Finances Manage your university bill, funding, and more Student Financial Activities Guide for student employees, travel reimbursement, and more HEOA Consumer Information Consumer information for students Information Technology Tech Resources & Support Virtual tech support via interactive guides, live chat, resources directory, and more Learning Technologies & Spaces In-person tech support for students Stanford Mobile Stanford’s official mobile app Accounts Manage SUNet ID, password, two-step, and more Know of a link we should add, change or delete? Let us know! Student News Stanford Report From the President and Provost Stanford Daily Safety & Support Public Safety 5-SURE Safe Rides Sexual Assault Support & Resources Health & FItness Vaden Health Center Bridge Peer Counseling Recreation & Wellness Community Centers Asian American Activities Center Black Community Services Center El Centro Chicano y Latino Queer Student Resources The Markaz: Resource Center Native American Cultural Center Women’s Community Center First Generation and/or Low-Income Student Success Center Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:22:05.665636",
    "url": "https://campus-map.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Stanford Login Virtual Visitor Tour Let's Get Started! Related Websites Custom Map Maker Maps Portal Parking & Transportation Visitor Information Virtual Visitor Tour Stanford Who Info Links Take a tour Custom Map Maker FAQ Contact Us Beta Copy and paste link: Tip: Easily create your custom maps with Stanford's Custom Map Maker Search Result(s) From To Get Directions Visiting Campus Points of Interest Time Limit Parking 20 Minutes Visitor Parking Public Restrooms Public Arts Life on Campus Eateries Academic Programs Libraries Library Book Returns (24-hr) 24-Hr Study Space (Stanford ID req'd) Housing Service Center Wellness Rooms Outdoor Canopies Recreation Facilities Varsity Facilities Cardinal Print Stanford Shared Instrumentation Facilities Parking & Transportation Time Limit Parking 20 Minutes Visitor Parking Loading Zone Marguerite Stop Permit Parking A Permit Parking C Car-Sharing Vehicle Car Rental Bus Parking Disability Parking EV Charging Station Safety & Security Blue Towers/Emergency Phones Emergency Assembly Points Automated External Defibrillator Suggested Travel Routes Clear Selections Print Area Print Area Print Cancel Search Explore pane Are you looking for additional POI layers? Be sure to log in for our community version. Stanford Login Continue Without Login Stanford Map could not determine your precise location. Please turn ON your location services. [Close] X Close Building Information Close × Take A Tour Video"
  },
  {
    "id": 9,
    "data": "2024-05-17T19:22:06.235687",
    "url": "https://www.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Stanford Explore Stanford Main Content A Societal Mission Stanford was founded almost 150 years ago on a bedrock of societal purpose. Our mission is to contribute to the world by educating students for lives of leadership and contribution with integrity; advancing fundamental knowledge and cultivating creativity; leading in pioneering research for effective clinical therapies; and accelerating solutions and amplifying their impact. More about Stanford Campus News Stories about people, research, and innovation across the Farm Science & Technology The surprising relationship between marine worms and the algae that live inside them Science & Engineering How racism impacts support for affordable housing Earth & Climate John Kerry shares his ‘unfettered’ optimism on climate Earth & Climate How wildfires change soil chemistry Social Sciences Clayman Institute at 50 Powwow Weekend Indigenous women celebrated at Stanford’s 53rd annual powwow More campus news Academics Preparing students to make meaningful contributions to society as engaged citizens and leaders in a complex world Undergraduate Education Rich learning experiences that provide a broad liberal arts foundation and deep subject-area expertise Undergraduate Education Graduate Education Unsurpassed opportunities to participate in the advancement of entire fields of knowledge Graduate education Driving impact Continuing adult education, executive and professional programs, and programs for K-12 students Lifelong Learning Seven schools in which to pursue your passions Medicine Law Humanities & Sciences Engineering Education Sustainability Business More about academics Profile of Hawa Racine Thiam “Before coming to Stanford, I was thinking in terms of understanding. Now I feel that I can start thinking in terms of creating.” Hawa Racine Thiam Assistant Professor of Bioengineering More Research Driving discoveries vital to our world, our health, and our intellectual life 15 Institutes cross disciplinary boundaries 20 Libraries hold over 12 million items $1.98 Billion sponsored research budget More about research Upcoming Events More events Health Care Advancing human health through innovative research, education, and care Stanford Medicine Leading a worldwide revolution in precision health through biomedical research, education, and clinical enterprises Stanford Medicine Stanford Health Care Leveraging expertise and advanced technology  to deliver unparalleled care for each patient’s unique needs Stanford Health Care Stanford Children’s Health The only health care network in the Bay Area – and one of the few in the country – exclusively dedicated to pediatric and obstetric care Stanford Children’s Health More about health care Profile of Meet Nadia Hemmat “Getting into Stanford was just such an amazing shock. But once I got here and became so involved, got to meet all these wonderful people, I feel like I fit right in — and like I belonged here the whole time.” Meet Nadia Hemmat Class of 2023 More Campus Life Building a vibrant community of creative and accomplished people from around the world Student Life A residential campus with diverse housing, exceptional dining, and over 600 student organizations Student Affairs Arts & Culture A rich tradition of fostering creativity and a vibrant arts district on campus Stanford Arts Recreation & Wellness State-of-the-art facilities and fitness programs to encourage movement and play Recreation & Wellness More about campus life Athletics Providing student-athletes the opportunity to achieve excellence both in competition and in the classroom Home of Champions Stanford’s 135 NCAA championships are the most for any university, a product of an unrivaled culture of excellence and continued support from the campus community National Championships Olympic Excellence The Cardinal has produced at least one medalist in every Olympics in which the U.S. has competed since 1912, totaling 296 medals from 177 medalists Medals Multidimensional Impact Stanford student-athletes have achieved local, national, and global impact through community involvement and advocacy Athlete Stories More about athletics Admission Offering extraordinary freedom to explore, to collaborate, and to challenge yourself Explore the possibilities of a Stanford education as you map out your college journey. We look for distinctive students who exhibit an abundance of energy and curiosity in their classes, activities, projects, research, and lives. Stanford meets the full financial need of every admitted undergrad who qualifies for assistance. More than two-thirds of undergrads receive some form of financial assistance. Generally, tuition is covered for families with incomes below $150,000. More about admission Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:22:06.991173",
    "url": "https://alumni.stanford.edu/",
    "university_name": "Stanford University",
    "title": "Stanford Alumni Association",
    "content": "Skip to main content Alumni Directory (external link) Email (external link) Search Events Featured Events All Alumni Events Alumni Community Events (external link) Career Events Student Events University Events (external link) Stanford Athletics Tickets (external link) Reunion Homecoming Reunion 2024 Ways to Volunteer View Schedule Registration Alumni Center Events Host with SAA Event Spaces Planning Resources Introducing Online Class Notes Log in to read Class Notes (external link) Reading & Resources News & Stories Recent Stories STANFORD magazine (external link) Newsletters Read Class Notes (external link) Learn Learning Opportunities Recorded Live Talks (external link) Recommended Podcasts Subscribe to Learn List Career Connections Getting Started Students Career Resources Give Career Support Post or Find Jobs (external link) Post or Find Internships (external link) Connect on Alumni Directory (external link) Alumni Linkedin Group (external link) Racial Justice Resources Our Mission Resources Moving Stanford Forward Racial Justice Events Programs & Perks Perks & Membership Perks for All Alumni Become an SAA Member SAA Membership Card SAA Member Benefits Sierra Programs Summer Family Camp Faculty/Staff Weekend Healthy Living Retreat for Women Memorial Day Weekend Sierra Camp Conference Center (external link) Sierra Programs Updates Travel/Study The Stanford Advantage Find a Destination Experiences Custom Journeys Trip Alerts Shop Wine Collection (external link) Stanford Alumni Fan Shop (external link) Communities Clubs & Groups Discover Alumni Groups Interest & Affinity Groups Professional Groups Regional Groups (U.S.) Regional Groups (International) School Groups (external link) Shared Identity Groups Leader Resources Young Alumni Recent Grad Resources Stanford 10 Undergraduate Students All Undergraduates Frosh Sophomores Juniors Seniors Senior Awards Senior Commencement Events Graduate Students All Graduate Students Grad Student Awards Grad Commencement Volunteer Volunteer Opportunities Leadership Richard W. Lyman Award Multicultural Alumni Hall of Fame Beyond the Farm Join a Project Project Leaders Stanford Associates Grants Awards Associates Designees Board of Governors Trustee Nominations Board Facts Becoming a Trustee Current Trustees (external link) About About Us Get to Know SAA Departments Executive Leadership Jobs (external link) Alumni Center Amenities & Space Dedication & Donors Contact Us Get in Touch Frequently Asked Questions Update Your Contact Info (external link) Submit a Class Note (external link) Submit an Obituary (external link) Introducing Online Class Notes Log in to read Class Notes (external link) Alumni Directory (external link) Email (external link) Search Events Featured Events All Alumni Events Alumni Community Events (external link) Career Events Student Events University Events (external link) Stanford Athletics Tickets (external link) Reunion Homecoming Reunion 2024 Ways to Volunteer View Schedule Registration Alumni Center Events Host with SAA Event Spaces Planning Resources Introducing Online Class Notes Log in to read Class Notes (external link) Reading & Resources News & Stories Recent Stories STANFORD magazine (external link) Newsletters Read Class Notes (external link) Learn Learning Opportunities Recorded Live Talks (external link) Recommended Podcasts Subscribe to Learn List Career Connections Getting Started Students Career Resources Give Career Support Post or Find Jobs (external link) Post or Find Internships (external link) Connect on Alumni Directory (external link) Alumni Linkedin Group (external link) Racial Justice Resources Our Mission Resources Moving Stanford Forward Racial Justice Events Programs & Perks Perks & Membership Perks for All Alumni Become an SAA Member SAA Membership Card SAA Member Benefits Sierra Programs Summer Family Camp Faculty/Staff Weekend Healthy Living Retreat for Women Memorial Day Weekend Sierra Camp Conference Center (external link) Sierra Programs Updates Travel/Study The Stanford Advantage Find a Destination Experiences Custom Journeys Trip Alerts Shop Wine Collection (external link) Stanford Alumni Fan Shop (external link) Communities Clubs & Groups Discover Alumni Groups Interest & Affinity Groups Professional Groups Regional Groups (U.S.) Regional Groups (International) School Groups (external link) Shared Identity Groups Leader Resources Young Alumni Recent Grad Resources Stanford 10 Undergraduate Students All Undergraduates Frosh Sophomores Juniors Seniors Senior Awards Senior Commencement Events Graduate Students All Graduate Students Grad Student Awards Grad Commencement Volunteer Volunteer Opportunities Leadership Richard W. Lyman Award Multicultural Alumni Hall of Fame Beyond the Farm Join a Project Project Leaders Stanford Associates Grants Awards Associates Designees Board of Governors Trustee Nominations Board Facts Becoming a Trustee Current Trustees (external link) About About Us Get to Know SAA Departments Executive Leadership Jobs (external link) Alumni Center Amenities & Space Dedication & Donors Contact Us Get in Touch Frequently Asked Questions Update Your Contact Info (external link) Submit a Class Note (external link) Submit an Obituary (external link) Introducing Online Class Notes Log in to read Class Notes (external link) Events Featured Events All Alumni Events Alumni Community Events (external link) Career Events Student Events University Events (external link) Stanford Athletics Tickets (external link) Reunion Homecoming Reunion 2024 Ways to Volunteer View Schedule Registration Alumni Center Events Host with SAA Event Spaces Planning Resources Introducing Online Class Notes Log in to read Class Notes (external link) Reading & Resources News & Stories Recent Stories STANFORD magazine (external link) Newsletters Read Class Notes (external link) Learn Learning Opportunities Recorded Live Talks (external link) Recommended Podcasts Subscribe to Learn List Career Connections Getting Started Students Career Resources Give Career Support Post or Find Jobs (external link) Post or Find Internships (external link) Connect on Alumni Directory (external link) Alumni Linkedin Group (external link) Racial Justice Resources Our Mission Resources Moving Stanford Forward Racial Justice Events Programs & Perks Perks & Membership Perks for All Alumni Become an SAA Member SAA Membership Card SAA Member Benefits Sierra Programs Summer Family Camp Faculty/Staff Weekend Healthy Living Retreat for Women Memorial Day Weekend Sierra Camp Conference Center (external link) Sierra Programs Updates Travel/Study The Stanford Advantage Find a Destination Experiences Custom Journeys Trip Alerts Shop Wine Collection (external link) Stanford Alumni Fan Shop (external link) Communities Clubs & Groups Discover Alumni Groups Interest & Affinity Groups Professional Groups Regional Groups (U.S.) Regional Groups (International) School Groups (external link) Shared Identity Groups Leader Resources Young Alumni Recent Grad Resources Stanford 10 Undergraduate Students All Undergraduates Frosh Sophomores Juniors Seniors Senior Awards Senior Commencement Events Graduate Students All Graduate Students Grad Student Awards Grad Commencement Volunteer Volunteer Opportunities Leadership Richard W. Lyman Award Multicultural Alumni Hall of Fame Beyond the Farm Join a Project Project Leaders Stanford Associates Grants Awards Associates Designees Board of Governors Trustee Nominations Board Facts Becoming a Trustee Current Trustees (external link) About About Us Get to Know SAA Departments Executive Leadership Jobs (external link) Alumni Center Amenities & Space Dedication & Donors Contact Us Get in Touch Frequently Asked Questions Update Your Contact Info (external link) Submit a Class Note (external link) Submit an Obituary (external link) Introducing Online Class Notes Log in to read Class Notes (external link) Hello, what can we help you find today? Search Clear Search Consider browsing by category: Popular Topics Programs & Resources for Students (external link) Request your official Stanford transcript (external link) Potential COVID Exposures on Campus (external link) Alumni Membership Card (external link) Stanford Alumni Email Contact Information SAA Customer Service (external link) Stanford University Contact Information (external link) SAA Departments Stanford Alumni Welcome Home Step into the virtual home of Stanford’s global community—a place where the Cardinal spirit thrives beyond the palm-lined campus. Reconnect with classmates, discover opportunities, and stay up-to-date on the latest research and ideas coming out of Stanford. Stanford Alumni Association Your Class Notes, Now Online Introducing a new digital portal to read and submit Class Notes. Log in to read Class Notes (external link) Stories News, views, and perspectives from the Stanford community. Grounded (external link) from STANFORD magazine N. Scott Momaday, whose writing sparked a renaissance in Indigenous literature, turns his attention to the earth. Melinda French Gates Will Be 2024 Commencement Speaker at Stanford (external link) from Stanford Report Commencement Weekend will feature an address by Melinda French Gates, co-chair of the Bill & Melinda Gates Foundation and founder of Pivotal Ventures. Discover more from your alumni community. Read stories Optional screen reader text Alumni Magazine—May 2024 (external link) Dig into the current issue of STANFORD magazine. Programming With a Purpose There ’ s something for everyone at Stanford Alumni. We ’ re here to help you connect, learn and grow every step of the way. Career Connections Looking to make a career change or network with other alumni? Don’t miss out on our career resources. See career resources Students Welcome, Stanford students! Don’t miss out on special programming developed just for you. Find student programming Travel/Study Filling Fast! Soak in Jane Austen’s world of Georgian treasures, cruise the moody waters of the British Isles, or discover London and the surrounding countryside. Each trip is all its own, but also connected through the vast histories, landscapes, and cuisines that are unique to the United Kingdom. Jun 10 – to Jun 19 British Isles A cruise through the waterways of Great Britain and Ireland A feast for the heart and mind, this trip has in-depth study, local cuisines, and lush landscapes. The Sea Cloud Spirit, our home on the sea, is a three-masted beauty. Jun 18 – to Jun 26 England Jane Austen and Georgian treasures of South England Follow in the footsteps of the beloved author as we embark on exclusive tours of the houses and settings that made up the backdrop of Austen’s life in southern England. Aug 29 – to Sep 05 London An insider’s tour of English art and culture Enjoy exclusive access to some of London's greatest museums and performing arts venues and visit historic artists’ homes and studios in the surrounding countryside. Explore 2024 trips (external link) Loading... Loading... Sponsors See what SAA offers just for alumni and SAA members. Stanford Alumni Association Frances C. Arrillaga Alumni Center 326 Galvez Street Stanford, CA 94305-6105 Map on Google (external link) Facebook Page LinkedIn Page Twitter Page Instagram Page Youtube Channel Get to Know SAA STANFORD Magazine (external link) Contact Us Help Access SAA Member Card Check your alumni email (external link) My Alumni Account (external link) Give to Stanford (external link) Accessibility Privacy Policy Terms of Use Code of Conduct Stanford University Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305."
  },
  {
    "id": 9,
    "data": "2024-05-17T19:22:07.869042",
    "url": "https://parents.stanford.edu/",
    "university_name": "Stanford University",
    "title": "",
    "content": "Skip to content Families Stanford University Menu Search form Search term Home FAQ Get Involved How Do I Pay? Stay Informed Tips Vital Info Latest News Latest News Q&A With Vice Provost for Undergraduate Education Sarah Church — The Major Declaration Journey April 18, 2023 3:41 pm Spring each year at Stanford shines a spotlight on Major Declaration Season, as undergraduates are required to select a major no later than the spring of their sophomore year. Vice Provost for Undergraduate Education Sarah Church offers insights into the major declaration process and some guidance for parents and families who may be navigating this… Read more Q&A With Vice Provost for Undergraduate Education Sarah Church — The Major Declaration Journey An update on social life on the Farm from Student Affairs' Samuel Santos Jr. November 17, 2022 7:36 am Dear Stanford undergraduate parents, I hope you, and your students here at Stanford, are doing well this fall. Here on the Farm it’s a busy time of many activities, and the height of many students’ academic work for the quarter, with the promise of a restful and restorative winter break not far off. I’m writing… Read more An update on social life on the Farm from Student Affairs' Samuel Santos Jr. Welcome to the new academic year: A message from vice provosts Susie Brubaker-Cole, Sarah Church September 8, 2022 3:15 pm Hello Stanford families, We are thrilled to welcome you to the new academic year! Some students are here with us now for residential student staff training, September Studies, athletics, and more, and many more will be joining us in a few short weeks. We’re excited about fall quarter, and we hope you are, too. As… Read more Welcome to the new academic year: A message from vice provosts Susie Brubaker-Cole, Sarah Church More news Stay Informed Reapproaching Stanford Stanford Report Stanford Magazine Parent News Archive See all Vital Information Public Safety Pertinent Policies Vaden Health Center COVID-19 information for parents and guardians See all Events New Student Orientation Family Weekend Commencement See all Get Involved Parents and Family Engagement Parents’ Club See all Parents' Helpline mykidis@stanford.edu 650-725-0649 In an Emergency emergency.stanford.edu 650-725-5555 844-ALERTSU (844-253-7878) Learn more at AlertSU How Do I Pay? Read more about how students pay for Stanford with the assistance of their families and the university. Stanford + Parents/Guardians The student is at the center — and is the focus — of this important partnership. Our Policy Prospective Parents Helpful Sites Visitor Information Academic calendar New Student Information Undergraduate Education Office of Alcohol Policy and Education Bing Overseas Studies Student Financial Services Financial Aid CashCourse for students Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 ."
  }
]