[{"id": 7, "url": "https://www.cs.rochester.edu/graduate/masters-program.html", "university_name": "University of Rochester", "title": "Graduate Programs", "content": "Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff Hajim School of Engineering & Applied Sciences Department of Computer Science Menu Site Navigation Close Home About Us Overview What is Computer Science? PhD Degrees Conferred Employment Diversity 50th Anniversary Giving Directions Contact Us People Full Directory Faculty Graduate Students Staff Undergraduate Overview Advising Degree Requirements Major Declaration Resources Courses CS Lab Information Research Opportunities URCS Student Groups Applying Graduate Overview Master's Program PhD Program Courses Applying Research Overview Computer Systems Theory Artificial Intelligence Human-Computer Interaction News & Events Recent News Seminars & Talks Newsletter Commencement Graduate Programs Section Navigation Overview Master's Program PhD Program Requirements Thesis Proposal Courses Applying Home Graduate Programs Master’s Program Master’s Program in Computer Science Masters Commencement The master’s program offers students a high level of flexibility. Students may focus on one area of computer science, or take courses across the breadth of the field. The degree may be completed on a full-time or part-time basis. For students with an undergraduate degree in computer science or a closely related field, the requirements can usually be completed over the course of three semesters. We welcome applications from students who did not major in computer science but whose undergraduate work demonstrates strong technical skills. This program is for students who intend to complete their studies at the University of Rochester with an MS degree. Students with an undergraduate degree who wish to get their PhD in computer science at Rochester should apply directly to the PhD program. For application and financial support information see the applying to Rochester page . Program Requirements Students must complete a minimum of 30 credits. Of these credits: All courses must be 400/500-level three- or four-credit courses Up to six hours can be from research credits, supervised by a faculty member MS students must pass a comprehensive examination (or essay), typically in the last semester before graduation. Some students may need to take one or more 100- or 200-level prerequisite courses. These courses are not counted toward the 30 credit requirement and are typically taken by students who do not have an undergraduate degree in computer science. Courses offered by departments other than computer science but that are relevant to the degree may be included in the 30 hours, subject to approval of the graduate education committee. In any case, at least 18 hours of the 30 must be courses offered by the Department of Computer Science. Students must maintain a GPA of 3.0 by the end of their second semester and throughout the rest of their time in the program, and must obtain a least a 2.0 in each course that counts toward the 30 credit hours. Sample Programs of Study These programs are illustrative examples; students may take any program meeting the general requirements above. The following examples are outlined below: Programming Languages and Computer Systems Algorithms and Complexity Computer Architecture Artificial Intelligence and Machine Learning Natural Language Processing Human Computer Interaction Programming Languages and Computer Systems CSC 453: Collaborative Programming and Software Design CSC 455: Software Analysis and Improvement CSC 456: Operating Systems CSC 457: Computer Networks CSC 458: Parallel and Distributed Systems CSC 484: Advanced Algorithms CSC 572: Seminar in Programming Languages CSC 495: Independent Research Algorithms and Complexity CSC 484: Advanced Algorithms CSC 486: Computational Complexity CSC 487: Advanced Modes of Computation CSC 444: Logical Foundations of Artificial Intelligence CSC 446: Machine Learning CSC 574: Seminar in Theory of Computation CSC 577: Optimization and Machine Learning CSC 495: Independent Research Computer Architecture CSC 484: Advanced Algorithms ECE 404: High Performance Microprocessor-Based Systems CSC 453: Collaborative Programming and Software Design CSC 455: Software Analysis and Improvement CSC 458: Parallel and Distributed Systems ECE 465: Performance Issues in VLSI/IC Design CSC 573: Advanced Topics in Memory Systems CSC 495: Independent Research Artificial Intelligence and Machine Learning CSC 440: Data Mining CSC 444: Logical Foundations of Artificial Intelligence CSC 446: Machine Learning CSC 448: Statistical Speech and Language Processing CSC 449: Computer Vision CSC 484: Advanced Algorithms CSC 577: Optimization and Machine Learning CSC 495: Independent Research Natural Language Processing CSC 444: Logical Foundations of Artificial Intelligence CSC 446: Machine Learning CSC 447: Natural Language Processing CSC 448: Statistical Speech and Language Processing CSC 460: Dialog Systems CSC 484: Advanced Algorithms LIN 461: Phrase Structure Grammars CSC 495: Independent Research Human Computer Interaction CSC 410: Web Programming CSC 412: Human Computer Interaction CSC 416: AR/VR Interaction Design CSC 440: Data Mining CSC 460: Technology and Climate Change CSC 571: Probabilistic Theories of Cognitive Processing BCS 511: Behavioral Methods CSC 495: Independent Research Department of Computer Science Location University of Rochester 2513 Wegmans Hall P.O. Box 270226 Rochester, NY 14627 Phone (585) 275-5671 Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996–2022 "}
,
{"id": 7, "url": "https://rochester.edu/", "university_name": "University of Rochester", "title": "", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH $(document).ready(function () { getRandomImage(random_images_array); }); if ($(\".alert\").length > 0) { $(\"body\").addClass(\"has-alert\"); } Your education, your way Students at Rochester forge their own path. Whether it’s through research opportunities, our flexible curriculum, or rich campus culture, there’s plenty of ways to take your education to the next level. $(document).ready(function () { getRandomTestimonial(random_testimonials_array); }); Majors and programs Flexible curriculum Research in action News and updates Exploring the intersection of art and science This annual University competition encourages the Rochester community to showcase the aesthetic beauty that results where science, art, and technology converge. Check out the winners Undergraduates aim to ‘level the field’ for high schoolers applying to college Researchers find that blinking plays a pivotal role in processing information University guidance: Well-being, safety, and campus events Explore more news Keeping a Rochester education affordable 30th in the nation as a 2023 Best Value School (U.S. News & World Report) 71% of undergraduates receive financial aid $300M in scholarships and grants awarded annually 49% of students graduated in 2022 with no loan debt Explore financial aid & scholarships Tradition, ever better Class of 2024: Congratulations on your accomplishments! Commencement Weekend kicks off May 17 with a distinctly Rochester ceremony for all graduates. Celebrations continue through May 19. #UR2024 Discover Commencement Upcoming events May 14 WELLNESS Honeybees and Beekeeping 12 p.m. Virtual Event details May 14 INCLUSION Creating Accessible Digital Documents 2 p.m. Virtual Event details May 17-19 TRADITIONS Commencement Weekend Multiple ceremonies Campus-wide Event details Explore more events Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2024 Helpful links Commencement Weekend Directory Academic Calendar Blackboard Libraries Events Emergency information IT services Human Resources MyPath HRMS Parking Contact us Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = {hjid: 615030, hjsv: 6}; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://www.rochester.edu/emergency/", "university_name": "University of Rochester", "title": "To report an emergency:", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Emergency Information To report an emergency: Pick up a Blue Light Emergency Phone; or Dial 13 from any other University phone; or From a cellphone or other non-University phone, dial (585) 275-3333; or Dial #413 from AT&T/Cingular or Verizon cell phones. Cancellations Call (585) 275-6111 for a recorded message on cancellations and special events. AlertUR The University’s emergency notification system allows for the mass dissemination of critical information via voice, text, and email to undergraduate students during a major emergency. Students, staff, and faculty across all University schools and divisions can input or edit your contact information in the AlertUR system. Text messages are delivered more quickly than voice messages. Adverse weather conditions It is the policy of the University of Rochester to remain in operation and to continue regular services and schedules regardless of adverse weather conditions, transportation or utility problems, or general emergency situations. Exceptions to the policy may be made on a case-by-case basis and can include decisions to reduce services and/or staff. More on winter weather procedures Be prepared: What should you do? Active shooter Medical emergency Severe weather Bomb threat Fire Hazardous materials Shelter-in-place Power failure Important numbers Public Safety Public Safety/Fire/Ambulance Emergency 911 (585) 275-3333 Administrative and Patrol Operations Staff (585) 275-3340 General Information (email) PublicSafety@rochester.edu Special Events (585) 275-3437 Lost/Found Property (585) 275-2552 University Health Service (Recorded message on phone for after-hours care) River Campus Office (585) 275-2662 Medical Center Office (585) 275-2662 Eastman School Office (585) 274-1230 Health Promotion Office (585) 273-5775 University Counseling Center (Recorded message on phone for after-hours care) (585) 275-3113 Employee Assistance Program (585) 475-0432 Environmental Health and Safety (585) 275-3241 Lifeline (Monroe Mobile Crises Team) (585) 275-5151 Sexual Assault Hotline (585) 275-RAPE (275-7273) Rochester Area Rape Crisis Service (585) 546-2777 Alternatives for Battered Women (585) 232-7353 Department of Psychiatry (Alcohol and Drug Dependency Program) (585) 275-3161 Office of the Dean of Students Arts, Sciences and Engineering (585) 275-4085 Medical School (585) 275-4537 Eastman School of Music (585) 274-1106 Simon School (585) 275-8163 School of Nursing (585) 276-4190 Warner School (585) 275-0880 Parking Services River Campus (585) 275-3983 Medical Center (585) 275-4524 Eastman School of Music (585) 274-1170 Medical Center Parking Garage (585) 273-4226 Facilities Customer Service Center (585) 273-4567 University Ombud Office (585) 275-5931 Sexual Harassment for River Campus/Eastman (585) 275-9125 Sexual Harassment for Medical Center (585) 275-4354 Racial Harassment (585) 275-2867 Security Advisory Committee Chair (585) 275-6649 jQuery( document ).ready(function($) { $('.major-tabs .tab#schools').click(function() { $('.active').removeClass('active'); $(this).addClass('active'); $('.schools').addClass('open'); $('.a-z').removeClass('open'); }); $('.major-tabs .tab#a-z').click(function() { $('.active').removeClass('active'); $(this).addClass('active'); $('.schools').removeClass('open'); $('.a-z').addClass('open'); }); $('.owl-carousel').owlCarousel({ loop:true, margin:10, nav:true, items: 1, }); $('#play-pause-button').click(function() { $('body').addClass('open-video'); }); $('.close-button').click(function() { $('body').removeClass('open-video'); }); $('.counter').counterUp({ delay: 10, time: 1000 }); }); Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://rochester.edu/college/webcomm/", "university_name": "University of Rochester", "title": "Homepage", "content": " Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff Arts, Sciences & Engineering Web Communications Menu Site Navigation Close Home People Recommendations Overview Website Elements Content Strategies Web Accessibility Best Practices Web Style Guide How to Submit Edits Article Series Service Request Homepage What information are your site's visitors seeking? Content Strategies What do you want people to do on your site? Content Strategies Who is the most important audience for your site? Content Strategies Web Services We provide web services free of charge for AS&E academic departments, administrative units, and research centers. Learn More Content Development Our team is available to assist you with all of your web content development needs. Learn More Trends and Technologies We provide expert direction and guidance concerning web trends and technologies. Learn More About Us Who We Are As part of AS&E's Deans' Office, the web communications team provides strategic planning for and implementation of AS&E's web presence. We view AS&E's web presence as an evolving, strategic communications program—not simply a series of individual websites. By placing a priority on knowing our business, knowing our users, and effectively leveraging the web as a medium, we can meet user's needs in a way that also achieves AS&E's strategic goals. Our services include: Web strategy consultation and process analysis Web content strategy, including content development and content audits Content editing, coordination, and writing Information architecture Mobile-friendly website design and development Web application development Traffic analysis and user testing Web Content Management System development Training on web-writing best practices Support for approved CMS tools Need help with your website? Please use our service request form or email aseweb@rochester.edu . Report a Digital Accessibility Barrier Web Communications Location University of Rochester Deans' Office Rochester, NY 14627 Email aseweb@rochester.edu Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996–2022 "}
,
{"id": 7, "url": "https://www.rochester.edu/asei/", "university_name": "University of Rochester", "title": "University of Rochester Intranet", "content": " University of Rochester Intranet Arts, Sciences and Engineering This site is a restricted-access network to be used exclusively by Deans, Directors, Faculty, and Staff of the School of Arts and Sciences and Hajim School of Engineering and Applied Sciences . It allows us to share resources such as: policies, forms, and procedures without confidential information being made available to everyone. Unauthorized access is expressly prohibited. Access Public Documents → Intranet Login Need an account? — Forget your password? Please tell us who you are: Faculty/Staff Student URMC Students should work with their undergraduate or graduate coordinator to complete any intranet related tasks. If you believe you need direct access to the intranet please send an explanation , along with your department and URID to asei@lists.rochester.edu Faculty or URMC? Go Back You can access the URMC intranet using a URMC secure internet connection at https://sites.mc.rochester.edu/ To access the URMC intranet, HRMS or your URMC email from home visit the Remote Access Portal Page To get permission to access the Arts, Sciences and Engineering intranet send an explanation of why you need access and your URID to asei@lists.rochester.edu Faculty or Student? Go Back New Users: You must have a valid URID to request an account. Inactive Accounts: Please specify that you would like your account to be reopened. * Name * Email * URID Message Student or URMC? Go Back $(document).ready(function() { $(\"#username\").focus(); var modal_request = new Modal( \"modal_request\", \"modal_large\", \"icon_16_envelope\", \"Contact the System Administrator\", \"Contact the System Administrator\", \"ajax_account_request.php\", \"index.php?request=true\", false ); $(\"a.account_request\").click(modal_request.show_dialog); modal_request.add_button([\"Submit\", modal_request.submit_dialog]); modal_request.add_button([\"Clear\", modal_request.clear_dialog]); modal_request.add_button([\"Close\", modal_request.hide_dialog]); $(\"#faculty_select\").click(function() { $(\".before_form\").hide(); }); $(\"#student_select\").click(function() { $(\".before_form\").hide(); $(\".before_form_student\").show(); }); $(\"#medical_select\").click(function() { $(\".before_form\").hide(); $(\".before_form_medical\").show(); }); $(\".back_to_group\").click(function() { $(\".before_form\").show(); $(\".before_form_medical, .before_form_student\").hide(); }) }); "}
,
{"id": 7, "url": "https://www.rochester.edu/contact/", "university_name": "University of Rochester", "title": "", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Contact us Top resources for contacting the University of Rochester. Campus mailing addresses River Campus (mailing address) University of Rochester 500 Joseph C. Wilson Blvd. Rochester, NY 14627 Medical Center mailing address University of Rochester 601 Elmwood Avenue Rochester, NY 14642 Eastman School of Music mailing address 26 Gibbs St. Rochester, NY 14604 University operator (585) 275-2121 (within the University dial “0”) Emergency information To contact Public Safety : Dial 13 on any campus phone or call (585) 275-3333. How to report an emergency Adverse weather information Maps Search University Maps by campus, location, and keyword. You may also download printable maps. Directory Find contact information for students, faculty, and staff in the online directory . Admissions: How to apply Learn how to apply to our schools . You’ll also find information on tuition and expenses, and contact information for each admissions office. Employment opportunities Explore job opportunities and find top resources for current faculty and staff. Alumni relations Stay connected to the University. Share your feedback on our website Let us know how we’re doing. Send feedback and suggestions . Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://www.rochester.edu/copyright.html", "university_name": "University of Rochester", "title": "", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Copyright information © 1996-2024 • University of Rochester All rights reserved. All content on these Web pages (including but not limited to text, graphics, photos, and multimedia files) unless otherwise noted is copyrighted by the University of Rochester. Reproduction, distribution, or commercial use without written permission of the University is prohibited. To request permission, please contact University Communications . These pages may contain material that is owned and copyrighted by others. Any person wishing to make use of such materials must seek permission to do so directly from the copyright holder. Questions about who owns the copyright for particular content on this site should be addressed to the site author or webmaster. For more information on copyright law and fair use, contact the Copyright Clearance Center or visit the US Copyright Office website at www.copyright.gov . Reporting copyright infringement Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://www.rochester.edu/", "university_name": "University of Rochester", "title": "", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH $(document).ready(function () { getRandomImage(random_images_array); }); if ($(\".alert\").length > 0) { $(\"body\").addClass(\"has-alert\"); } Your education, your way Students at Rochester forge their own path. Whether it’s through research opportunities, our flexible curriculum, or rich campus culture, there’s plenty of ways to take your education to the next level. $(document).ready(function () { getRandomTestimonial(random_testimonials_array); }); Majors and programs Flexible curriculum Research in action News and updates Exploring the intersection of art and science This annual University competition encourages the Rochester community to showcase the aesthetic beauty that results where science, art, and technology converge. Check out the winners Undergraduates aim to ‘level the field’ for high schoolers applying to college Researchers find that blinking plays a pivotal role in processing information University guidance: Well-being, safety, and campus events Explore more news Keeping a Rochester education affordable 30th in the nation as a 2023 Best Value School (U.S. News & World Report) 71% of undergraduates receive financial aid $300M in scholarships and grants awarded annually 49% of students graduated in 2022 with no loan debt Explore financial aid & scholarships Tradition, ever better Class of 2024: Congratulations on your accomplishments! Commencement Weekend kicks off May 17 with a distinctly Rochester ceremony for all graduates. Celebrations continue through May 19. #UR2024 Discover Commencement Upcoming events May 14 WELLNESS Honeybees and Beekeeping 12 p.m. Virtual Event details May 14 INCLUSION Creating Accessible Digital Documents 2 p.m. Virtual Event details May 17-19 TRADITIONS Commencement Weekend Multiple ceremonies Campus-wide Event details Explore more events Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2024 Helpful links Commencement Weekend Directory Academic Calendar Blackboard Libraries Events Emergency information IT services Human Resources MyPath HRMS Parking Contact us Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = {hjid: 615030, hjsv: 6}; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://www.rochester.edu/accessibility.html", "university_name": "University of Rochester", "title": "", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Accessibility at Rochester Committed to equal access for all—in person and online. Resources and support The lists below offer quick access to top resources related to campus, workplace, and digital access. Campus accessibility If a building or other physical space on our campuses is inaccessible, please let the Facilities and Services team know so we can make it right. TOP RESOURCES Disability Services and Support Parking Accessibility Eastman Theatre Accessibility Memorial Art Gallery Accessibility Academic and workplace accessibility The University has a team of dedicated professionals to ensure that members of our community with disabilities have equal access, reasonable accommodation, and full participation in the Rochester experience. TOP RESOURCES Disability Services and Support Access Coordinators Digital accessibility We’re continually working to make our website and other digital spaces as accessible, easy to use, and helpful as possible. Share your feedback and suggestions, or report a barrier to our Digital Accessibility team. TOP RESOURCES Digital and web accessibility Social media accessibility AS&E website accessibility Web Governance Council Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://www.rochester.edu/maps/", "university_name": "University of Rochester", "title": "", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Rochester Maps Interactive map Explore the University’s campuses and buildings. Check out the map Printable maps Eastman School of Music Campus Medical Center + Middle Campus Memorial Art Gallery Mount Hope Campus River Campus South Campus Need more information? CONTACT Contact information Looking to get in touch? Check out our contact page. VISIT Plan your visit Plan ahead for your visit to the University of Rochester. PARKING Parking and shuttles Explore more information about transportation and parking. --> jQuery( document ).ready(function($) { $('.owl-carousel').owlCarousel({ loop:true, margin:10, nav:true, items: 1, }); $('#play-pause-button').click(function() { $('body').addClass('open-video'); }); $('.close-button').click(function() { $('body').removeClass('open-video'); }); $('.counter').counterUp({ delay: 10, time: 1000 }); }); Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://rochester.edu/working/", "university_name": "University of Rochester", "title": "Working at", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Working at Rochester United by a commitment to be ever better Our faculty and staff are vital to our success. Their ingenuity, optimism, and talents are on display every day. Professional success From your job search to retirement, we are here to support you through all phases of your career at Rochester. Career opportunities If you’re looking for a career in higher education or health care, the University of Rochester may offer the perfect opportunity for your background and goals. Search jobs New employees Welcome to the team! Our Employee Orientation website provides you with more details and helpful resources to get you started. Visit the Orientation website Benefits: Total Rewards We offer our employees a comprehensive benefits package–we call it Total Rewards. Explore benefits Work/life balance The University created Well-U to help you live a more balanced life. Telehealth and other online support options are available.` Get support Learning and development The Office of Human Resources and partners across our campuses offer training programs and resources designed to help employees keep their skills current, expand their knowledge, and work better together. Learn and grow A people-centered work culture—now and into the future As part of our Boundless Possibility strategic plan, we’re committed to cultivating an inclusive culture that prioritizes the well-being, development, engagement, success, and diversity of our community. Committed to faculty and staff success Resources for all employees Explore many of the vital resources available for faculty and staff. For faculty and staff Explore resources to help you thrive in your professional and personal life. TOP RESOURCES HRMS (payroll and time entry) MyPath (training and education) Human Resources Parking and transportation Diversity and inclusion University-wide support services COVID-19 resource center For faculty Support programs, funding opportunities, and services are available to support our faculty. TOP RESOURCES Professional development Diversity programs Our commitment to diversity, equity, and inclusion At the University of Rochester, we are united by a commitment to be ever better—Meliora. It is an ideal that informs our shared mission to ensure all members of our community feel safe, respected, included, and valued. View our nondiscrimination statement Explore more resources FIND A JOB Search jobs Explore open positions to see where you might fit. Contact Us Have a question? If you have questions, we’re here to help. See Rochester Discover our city Explore the city we call home. jQuery(document).ready(function ($) { $(\".owl-carousel\").owlCarousel({ loop: true, margin: 10, nav: true, items: 1, }); $(\"#play-pause-button\").click(function () { $(\"body\").addClass(\"open-video\"); }); $(\".close-button\").click(function () { $(\"body\").removeClass(\"open-video\"); }); }); Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://www.rochester.edu/social/", "university_name": "University of Rochester", "title": "Social Media at the University of Rochester", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Social Media at the University of Rochester To learn more about social media best guidelines and best practices, visit the Social Media Guide . Are we missing anyone? Let us know. Schools, Colleges and Hospitals University of Rochester President Sarah Mangelsdorf Hajim School of Engineering and Applied Sciences Eastman School of Music University of Rochester Medical Center UR Medicine School of Medicine and Dentistry Eastman Institute for Oral Health Golisano Children's Hospital Highland Hospital School of Nursing Simon Business School Warner School of Education Memorial Art Gallery Office of Admissions and Financial Aid Admissions Financial Aid Libraries River Campus Libraries --Friends of the University of Rochester Libraries - FURL --Rare Books, Special Collections and Preservation --Rossell Hope Robbins Library Sibley Music Library at Eastman School of Music Bibby Library at Eastman Dental Center Miner Library at School of Medicine and Dentistry Bookstores Barnes & Noble at University of Rochester School of Medicine and Dentistry Bookstore Eastman School of Music Bookstore Alumni University of Rochester Alumni Eastman School of Music Alumni Hajim School of Engineering and Applied Sciences Alumni School of Nursing Alumni School of Medicine and Dentistry Alumni Warner School of Education Alumni Class of 2017 Class of 2016 Class of 2015 Class of 2014 (closed group) Class of 2013 Academic Accounts Center for Advising Services Center for Jewish Studies Center for Education Abroad David T. Kearns Center for Leadership and Diversity Department of Art and Art History Visual and Cultural Studies : Invisible Culture—An Electronic Journal Department of Biochemistry and Biophysics Department of Biomedical Engineering Department of Brain & Cognitive Sciences Department of Chemical Engineering Grad Program Department of Chemistry Chemistry Research Groups: —Bren Lab —Fasan Lab —Matson Lab —Paradine Lab Department of English Department of History Department of Linguistics Department of Philosophy Department of Political Science Department of Religion and Classics Film and Media Studies Frederick Douglass Institute for African American Studies Human-Computer Interaction Humanities Center Institute for Music Leadership Institute for Popular Music Musicology At Eastman Program of Dance and Movement Susan B. Anthony Center Susan B. Anthony Institute for Gender and Women's Studies Undergraduate Program in Biology and Medicine (UPBM) Other Departmental Accounts Career Center College Town Rochester Clinical and Translational Science Institute Dining Eastman Community Music School Fraternity and Sorority Affairs Hopeman Memorial Carillon Information Technology --Tech Store Institute for the Family–URMC Institute for Performing Arts Mail Center Mount Hope Family Center Interfaith Chapel --Christian Fellowship (URCF) --Cru --Fellowship of Christian Athletes - FCA --Hindu Students' Association --Newman Community --Protestant Chapel Community International Services Office Office for Global Engagement Office for Faculty Development and Diversity Open Letter Books Orientation Paul J. Burgett Intercultural Center Pre-College Programs Public Safety Rochester Youth Year ROCMusic Student Fellowships Office Summer Programs Title IX Office Todd Theatre Transportation & Parking Management Well-U University Counseling Center University Health Service UR Ventures UR Sustainable Wilson Commons Student Activities Writing and Speaking Center --Writing Fellows (URCF) --Speaking Fellows --Graduate Writing Project Athletics/Teams/Club Sports Athletics Goergen Athletic Center/ R Club Rocky the Yellowjacket mascot Baseball --Baseball Alumni Basketball - Men's Basketball - Women's Basketball - Women's Club Cheerleading Cross Country and Track & Field Cycling (UR Cycling) UR Equestrian Team Fencing Field Hockey --Field Hockey Fans & Parents Football --Football Alumni Golf - Men's Hockey - Men's Lacrosse - Men's Lacrosse - Women's Lacrosse - Women's Club Rowing - Men's Rowing - Women's Rugby - Men's Rugby - Women's Running Club Sailing Soccer - Men's Soccer - Women's Soccer - Women's Club Softball - Women's Softball - Women's Club Squash - Men's Squash - Women's Swimming and Diving --Swimming and Diving Parents --Masters Swimming Tennis Quidditch - UR Thestrals Ultimate Frisbee - Men's Ultimate Frisbee - Women's Varsity Student Athlete Advisory Committee (VSAAC) Mens' Volleyball Volleyball - Women's --Volleyball Alumni Water Polo Wrestling Greek Organizations Interfraternity Council Alpha Delta Phi (Alpha Delt) Alpha Epsilon Pi (AEPi) Beta Theta Pi (Beta) Chi Phi Delta Kappa Epsilon (DKE) Delta Upsilon (DU) Phi Kappa Tau (Phi Tau) Psi Upsilon (PsiU) Sigma Beta Rho Sigma Phi Epsilon (SigEp) Sigma Nu (SigNu) Panhellenic Alpha Phi Chi Omega Delta Gamma (DG) Gamma Phi Beta (Gamma Phi) Kappa Alpha Theta (Theta) Kappa Delta - Epsilon Rho Phi Sigma Sigma Sigma Delta Tau Multicultural Alpha Kappa Alpha Delta Phi Omega Lambda Pi Chi Omega Phi Beta Omega Psi Phi Phi Iota Alpha Sigma Lambda Upsilon Sigma Psi Zeta Sigma Psi Zeta Zeta Phi Beta Alpha Phi Omega Alpha Kappa Psi Lambda Upsilon Lambda Multicultural Greek Council Student Groups Students' Association Government A Cappella Groups --After Hours --Midnight Ramblers --YellowJackets --Vocal Point --Trebellious Active Minds American Institute of Chemical Engineers American Sign Language Club American Society of Mechanical Engineers - ASME Archery Club Art and Art History Undergraduate Council Asian American Alliance Association for the Development in Interest in the Indian Subcontinent (ADITI) Badminton Club Ballet Performance Group Black Students' Union BLifeUR BCS & Neuroscience Undergraduate Council Catholic Newman Community at the University of Rochester Campus Activities Board Campus Times Charles Drew Pre-Health Society Chess Chinese Students' Association Circle K Class of 2020 (closed group) Class of 2019 (closed group) Class of 2018 (closed group) Class of 2017 (closed group) Class of 2016 (closed group) College Diabetes Network College Democrats College Feminists College Republicans Colleges Against Cancer Community Service Network (CSN) Computer Science Undergraduate Council Creative Arts Club Data Science Undergraduate Council Debate D'Lions Dodgeball Engineers for a Sustainable World Engineers Without Borders Filipino American Students' Association Food Recovery Network Global Water Brigades GlobeMed Golden Key International Honor Society GR Soccer Grassroots GreenSpace Habitat for Humanity Hartnett Gallery Hatha Yoga Her Campus Rochester Hillel at University of Rochester Hong Kong Students Association In Between the Lines Comedy Troupe Indulgence Dance Crew Institute of Electrical and Electronics Engineers Interfraternity Council Invisible Culture: An Electronic Journal for Visual Culture Japanese Students Association Journal of Undergraduate Research (JUR) Kendo and Iaido Korean American Students' Association - KASA Korean Percussion Group Hon Liberty in North Korea [LiNK] Linguistics Undergraduate Council LOGOS Louvre Ma'Frisah Mariachi Meliora Medieval Studies Council Meliora Capital Management LLC Minority Male Leadership Association Minority Student Advisory Board Model United Nations (URMUN) Modern Languages and Cultures Undergraduate Council Muslim Students’ Association National Society of Black Engineers National Society of Collegiate Scholars Naval ROTC No Disclaimers Poetry Group No Jackets Required (NJR) Off Broadway On Campus Optical Society of America Order of Omega Outing Club Panhellenic Association Pan-African Students Association (PASA) Partners in Reading Peers for Animal Wellness and Safety (P.A.W.S.) People First Initiative Pep Band Pickup Soccer Pride Network Psychology Undergrad Council Quiz Bowl Radiance Dance Theater Recreational Ski and Snowboard Club (RecSnow) Res Halls and Housing Interest Groups --Anime Interest Floor --Computer Interest Floor --Douglass Leadership House --Drama House --Goler House Graduate Housing --Hill Court Residence Hall --Inter-Class Living Community --Music Interest Floor --University Park Graduate Housing --Whipple Park Graduate Housing Refugee Student Alliance Relay For Life RICE Crew River Campus Medical Emergency Response Team - R/C MERT ROC Players Rochester Bhangra Rochester Raas Rotaract Royals Dance Team S.A.L.S.A. SALSEROS Satsang Meditation Club SAVVY - Student Association of Vegan and Vegetarian Youth She's the First Sihir Bellydance Ensemble Simulation Gaming Association Slavic Society Society of Hispanic Professional Engineers Society of Crocheting & Knitting Students (SOCKS) Society of Physics Students Society of Undergraduate Biology Students Society of Undergraduate Math Students Society of Undergraduate Public Health Students Society of Women Engineers Solar Splash Spanish and Latino Students' Association - Soñar Despierto Spark Entrepreneurs Spoon University STEM Initiative at the University of Rochester Strong Jugglers Student Association for the Development of Arab Cultural Awareness Students’ Association for Interfaith Cooperation Student Organization for Caribbean Awareness (SOCA) Students for a Democratic Society Students Helping Honduras Student Programming Board Swing Dance Club Tau Beta Pi Taiwanese American Students' Association The Opposite of People (TOOP) Triathlon Club Undergraduate Anthropology Council Undergraduate Film Council Undergraduate Musicians' Council Undergraduate Philosophy Council University of Rochester Israel Council University of Rochester Freshman Orientation Outing Treks (URFoot) University of Rochester Special Olympics UR Baja SAE Team UR BME Society UR Celtic UR Cinema Group UR Concerts UR Consulting Group UR DJs UR History Council UR Humanities Project UR Makers UR Mock Trial UR Persian Association of Rochester Students UR Photography UR Robotics UR Rock Climbing Club UR Roundnet Club UR SEGway (Survivor Empowerment Group) Urban Exploring UR Stand-Up Comedy Club UR Stylez Veterans Alliance UR WRUR Xclusive Step Team Ain Center for Entrepreneurship MS in Technical Entrepreneurship and Management (MS TEAM) Eastman and Music Departments/Ensembles Brass Choir Eastman Musicology Department Eastman Trumpet Studio The Eastman Wind Ensemble Friends of Eastman Opera URMC Departments/Labs Anesthesiology Center for Community Health Colorectal Surgery Department of Microbiology Department of Pathology and Laboratory Medicine Department of Pediatrics Flaum Eye Institute GI Pathology periFACTS Academy Rochester Victory Alliance SONCEW (School of Nursing Center for Employee Wellness) Sports Medicine UR Nutrition in Med Visiting Nurse Service of Rochester and Monroe County Wilmot Cancer Institute jQuery(document).ready(function ($) { $(document).foundation(); var social_options = {multiExpand: true, allowAllClosed: true}; var social_accordion = new Foundation.Accordion($('#social_accordion'), social_options); }); Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://www.rochester.edu/college/academics/search.html", "university_name": "University of Rochester", "title": "Undergraduate Studies", "content": "Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff Arts, Sciences & Engineering Menu Site Navigation Close Home About Us Our Organization The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Meet the Deans Our Faculty Diversity Restorative Practices National Council Giving Contact Us Departments Academic Department Directory Research Centers Libraries Undergraduate Contact Rochester Curriculum Majors & Minors Degree Requirements Research Student Essentials Graduate Contact Admissions Academics Costs & Financial Support Graduate Calendar Registration Fellowships Postdocs Admissions Contact Undergraduate Summer Sessions Part-time Studies Graduate Financial Aid Offices Registrar Bursar Dean of Students Advising Services Learning Center Education Abroad View All Student Life Athletics Housing (ResLife) Dining Services Disability Resources Health Services Counseling Center View All Research Undergraduate Studies Undergraduate About The College Contact Us Departments & Programs Rochester Curriculum College Competencies Declaring your Major Policies and Handbooks Student Essentials Academics Degree Requirements Majors & Minors Clusters Courses Opportunities Undergraduate Research Student Funding Study Abroad Special Programs Home Subject Search Search Majors & Minors Loading... Subject Name Close Filters Degree Type Program Type Division School Filters Related Subjects Showing {{ totalResults }} results Sorry! We can't find a major matching your criteria. No subjects found for: {{props.query}} Here are some links to help you find what you are looking for: View our entire catalog. Create your own custom curriculum Close {{ selectedSubject.name }} Visit Department Site School {{ school }} Programs {{ program.programType }} {{ program.programType }} Visit Department Site Related Subjects {{ related.text }} American Sign Language Anthropology Biochemistry Bioethics Biology Biomedical Engineering Cell and Developmental Biology Creative Writing Ecology and Evolutionary Biology English Literature History Actuarial Studies Black Studies American Studies Applied Mathematics Arabic Archaeology, Technology, and Historical Structures Art History Studio Arts Astronomy Audio and Music Engineering Biophysics Brain and Cognitive Sciences Business Chemical Engineering Chemistry Chinese Biotechnology Citation for Achievement in College Leadership Classical Civilization Classics Clinical Psychology Comparative Literature Computational Biology Computational Linguistics Computer Science Dance Data Science Developmental Psychology Digital Media Studies East Asian Studies Economics Electrical and Computer Engineering Electrical Engineering Engineering Science English English: Selznick Film Preservation Environmental Engineering Environmental Geology Environmental Health Environmental Science Environmental Studies Epidemiology Film and Media Studies Financial Economics French Gender, Sexuality, and Women's Studies Geological Sciences Geomechanics German Greek Health Policy Health Psychology Health, Behavior, and Society Hebrew Engineering and Applied Sciences Interdepartmental Degree Program International Relations Italian Japanese Jewish Studies Journalism Language Documentation and Description Language, Media and Communication Latin Latin American Studies Legal Studies Linguistics Literary Translation Materials Science Mathematical Modeling in Political Science and Economics Mathematics Mathematics and Statistics Mechanical Engineering Medical Anthropology Medieval and Early Modern Studies Medical Physics Microbiology Molecular Genetics Music Music Cognition Neuroscience Optical Engineering Optics Organizational Psychology Philosophy Physics Physics and Astronomy Political Science Psychology Psychology as a Natural Science Psychology as a Social Science Religion Research in Visual Science Russian Russian Studies Social and Emotional Development Music and Linguistics Social-Personality Psychology Spanish Statistics Theater Visual and Cultural Studies Visual Science Writing Studies Environmental Humanities Geosciences Sustainability Polish and Central European Studies British and American Literature Movement Studies Stage Management Community-Engaged Learning Earth and Planetary Sciences Climate Change Science Clinical and Translational Sciences User Experience (UX)/User-Centered Design Politics, Philosophy, and Economics Accounting Business Analytics Marketing Information Systems Finance Entrepreneurship Biological Sciences Creative Expression and Performance Dance Studies Diagnostic Imaging Report a Digital Accessibility Barrier Arts, Sciences & Engineering Location Deans' Office 317 Lattimore Hall University of Rochester P.O. Box 270401 Phone (585) 273-5000 Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996–2022 "}
,
{"id": 7, "url": "https://rochester.edu/college/", "university_name": "University of Rochester", "title": "Homepage", "content": " Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff Arts, Sciences & Engineering Menu Site Navigation Close Home About Us Our Organization The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Meet the Deans Our Faculty Diversity Restorative Practices National Council Giving Contact Us Departments Academic Department Directory Research Centers Libraries Undergraduate Contact Rochester Curriculum Majors & Minors Degree Requirements Research Student Essentials Graduate Contact Admissions Academics Costs & Financial Support Graduate Calendar Registration Fellowships Postdocs Admissions Contact Undergraduate Summer Sessions Part-time Studies Graduate Financial Aid Offices Registrar Bursar Dean of Students Advising Services Learning Center Education Abroad View All Student Life Athletics Housing (ResLife) Dining Services Disability Resources Health Services Counseling Center View All Research Homepage Majors & Minors Search for a degree or related subjects in arts and humanities, engineering, natural sciences, or social sciences. Subject Search Graduate Studies Nationally recognized programs characterized by close contact between students and faculty. Learn More Research Embracing creativity, broadening our understanding of how the world works, and gaining insights into society. Learn More Save the Date Commencement Weekend 2024 The University is delighted to welcome families, friends, and alumni to Rochester to honor the achievements of the Class of 2024 and honorary guests at Commencement Weekend, Friday, May 17, through Sunday, May 19. Visit the Commencement website for schedule information, registration details, FAQs, and updates. Campus Life Rochester students aim to ‘level the field’ for high schoolers applying to college A trio of undergraduates teamed up to bring accessible, high-quality education consulting services to the community. Now, they’re branching out beyond Rochester. More Campus Life News Rochester Curriculum Learn what you love At Rochester, you build your own curriculum with your own unique strengths and interests. There are no required subjects. You study only what you’re passionate about, choosing a major in one of the three divisions of learning and taking thematic three-course clusters in other areas. Learn More In the News More News Meliora University symbols and traditions The University’s symbols—including our motto, mascot, and official flower—have embodied the uniquely Rochester spirit of determination and perseverance. We also cherish our many long-held customs while embracing opportunities to build new traditions that unite us. Learn More Resources For: Current Students > International Students > Graduate Students > Parents > Alumni > AS&E Intranet Users > AS&E Staff > AS&E Faculty > 376 full-time faculty Through innovative research and dedication to professional excellence, our award-winning faculty is the foundation of our university, and our students’ successes. 77 percent of students Are involved in undergraduate research. Students can assist a faculty member on an existing research project, or create a project based on their own ideas. Culture of Respect At the University of Rochester, we are united by a commitment to be ever better—Meliora. It is our guiding principle and it informs our shared values. We put those values into action by ensuring that all members of our community feel safe, respected, included, and valued. In support of that mission, the University is taking a number of important steps to strengthen policies, clarify processes, and expand resources to support diversity, equity, and inclusion efforts. Learn More The College The School of Arts & Sciences The Hajim School of Engineering & Applied Sciences Need help or more information? Contact us . Report a Digital Accessibility Barrier Arts, Sciences & Engineering Location Deans' Office 317 Lattimore Hall University of Rochester P.O. Box 270401 Phone (585) 273-5000 Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996–2022 "}
,
{"id": 7, "url": "https://www.sas.rochester.edu/", "university_name": "University of Rochester", "title": "Homepage", "content": " Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff School of Arts & Sciences Menu Site Navigation Close Home About Us About the School of Arts & Sciences Defining the Future Dean's Corner Giving Contact Us Academics Departments & Programs Centers Degree Options Entrepreneurship Research News Events Sloan Performing Arts Center Overview Location & Accessibility Calendar of Events Ground Plans, Templates & Inventories Homepage Rochester students aim to ‘level the field’ for high schoolers applying to college A trio of undergraduates teamed up to bring accessible, high-quality education consulting services to the community. Continue Reading That’s not Native American art. Or is it? A Rochester art historian on the proliferation of indigenous fakes and replicas—and the blurry line between appropriation and admiration. Continue Reading Why do we blink so much? Researchers find that blinking plays a pivotal role in processing visual information—adding to a growing body of evidence revising our conventional views of vision. Continue Reading Pablo Sierra Silva: Using primary sources to immerse students in the past The history professor leads his class back in time to analyze events that shaped today’s world. Continue Reading Art History Professor Peter Christensen Awarded Berlin Prize Peter Christensen, the Arthur Satz Professor of Humanities, has been named a recipient of the prestigious Berlin Prize, an annual award intended to foster transatlantic dialogue in the arts, humanities, and public policy. Continue Reading Majors & Minors Pursue a degree or take courses in arts and humanities, natural sciences, or social sciences. Learn More Graduate Studies Nationally recognized programs characterized by close contact between students and faculty. Learn More Research Embracing creativity, broadening our understanding of how the world works, and gaining insights into society. Learn More Feature Story Faculty lauded for research and service contributions The US Department of Energy and the European Academy of Sciences are among the organizations recognizing Rochester faculty. More SAS News Announcement Nicole S. Sampson named as new Dean of the School of Arts & Sciences Sampson brings an impressive background in academia and a commitment to excellence in higher education and student success to the role of the Robert L. and Mary L. Sproull Dean of the School of Arts & Sciences. Continue Reading Language, art, culture, and history of Italy Lisio Program in Italian Studies The Arnold Lisio ’56, ’60M (MD) and Anne Moore Lisio Italian Studies Program supports University of Rochester students and faculty in their understanding of and appreciation for the language, art, culture, and history of Italy. The Lisio program funds: Student scholarship prizes Summer fellowships Faculty and program grants Learn More Arts & Humanities Research Natural Sciences Research Social Sciences Research Want more information about the School of Arts and Sciences? Contact us . Report a Digital Accessibility Barrier School of Arts & Sciences Location University of Rochester 317 Lattimore Hall P.O. Box 270401 Rochester, NY 14627 Phone (585) 275-2121 Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996–2022 $(document).ready(function(){ var $slider = $('.hero-header .slider'); $slider.slick('slickPlay'); $slider.find('.slick-play-pause').addClass('slick--is-playing'); }); "}
,
{"id": 7, "url": "https://onlinedirectory.ur.rochester.edu/FacultyStaffDirectory.aspx", "university_name": "University of Rochester", "title": "Faculty/Staff Directory", "content": " Skip to page content Skip to page level navigation Please consider downloading the latest version of Internet Explorer to experience this site as intended. Skip to content Search Search if (top != self) { alert('The URL ' + self.location.href + ' cannot be viewed inside a frame. You will be redirected.'); top.location.replace(self.location.href); } Sys.Application.add_load(AppLoad); function AppLoad() { Sys.WebForms.PageRequestManager.getInstance().add_endRequest(EndRequest); } function EndRequest(sender, args) { // Check to see if there's an error on this request. if (args.get_error() != undefined) { // Let the framework know that the error is handled, // so it doesn't throw the JavaScript alert. args.set_errorHandled(true); } // set the destination textbox value with the ContactName function CallSuccess() { alert('SUCCESS!'); } // alert message on some failure function CallFailed(res, destCtrl) { alert(res.get_message()); } } Faculty/Staff Student Faculty/Staff Directory Basic Search Name: Department: Phone Number: Email Address: Complete Search: Internal User Login Complete directory information is available to faculty, staff, and students after login. University Operator (585) 275-2121 within the University dial \"0\" Emergency numbers Send and receive postal mail Change your directory information Feedback, comments, and suggestions Maps and directions For Printed Reference (All files available as PDFs) Meeting rooms reservations River Campus & Medical Center Telephone and voicemail instructions Faculty/Staff Students Additional Resources (Requires NetId login, if outside University network) University Department Directory Highland Hospital staff directory Paging directory Tunnel maps //<![CDATA[ Sys.Application.add_init(function() { $create(AjaxControlToolkit.FilteredTextBoxBehavior, {\"ValidChars\":\"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ.\\u0027-\\u0026 \",\"id\":\"ctl00_ctl00_MainContent_Content_txtName_FilteredTextBoxExtender\"}, null, null, $get(\"ctl00_ctl00_MainContent_Content_txtName\")); }); Sys.Application.add_init(function() { $create(AjaxControlToolkit.FilteredTextBoxBehavior, {\"ValidChars\":\"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789.\\u0027-\\u0026/ \",\"id\":\"ctl00_ctl00_MainContent_Content_txtDepartment_FilteredTextBoxExtender\"}, null, null, $get(\"ctl00_ctl00_MainContent_Content_txtDepartment\")); }); Sys.Application.add_init(function() { $create(AjaxControlToolkit.FilteredTextBoxBehavior, {\"ValidChars\":\"0123456789-\",\"id\":\"ctl00_ctl00_MainContent_Content_txtPhone_FilteredTextBoxExtender\"}, null, null, $get(\"ctl00_ctl00_MainContent_Content_txtPhone\")); }); Sys.Application.add_init(function() { $create(AjaxControlToolkit.FilteredTextBoxBehavior, {\"ValidChars\":\"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789@-._\\u0027\",\"id\":\"ctl00_ctl00_MainContent_Content_txtEmail_FilteredTextBoxExtender\"}, null, null, $get(\"ctl00_ctl00_MainContent_Content_txtEmail\")); }); //]]> See maps and directions Rochester, NY 14627 Search rochester.edu Accessibility Nondiscrimination Copyright Emergency Information Vision & Values "}
,
{"id": 7, "url": "https://rochester.edu/students/", "university_name": "University of Rochester", "title": "Resources for Students", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Resources for Students Student success is a team effort Even the best and brightest students can benefit from the help, experience, or guidance of others. Dedicated staff at Rochester can help you find and access what you need to succeed. Tradition, ever better Class of 2024: Congratulations on your accomplishments! Commencement Weekend kicks off May 17 with a distinctly Rochester ceremony for all graduates. Celebrations continue through May 19. #UR2024 Discover Commencement Support and services Students will find the help and support they need through a wide range of University services. Services by school Each academic unit at the University offers a range of services to support students. TOP RESOURCES Arts, Sciences & Engineering Eastman School of Music School of Medicine and Dentistry School of Nursing Simon Business School (intranet access only) Warner School of Education University-wide services Here are other helpful student support services available across the University. TOP RESOURCES Office of the Bursar (tuition and fees, refunds, payment plans) Academic calendars Graduate Education Student Employment Office International Services Office Disability Services and Support Libraries Sexual misconduct and Title IX University Counseling Center CARE Network Event Safety and Well-Being COVID-19 Resource Center Explore more student services Arts, Sciences & Engineering Eastman School of Music School of Medicine and Dentistry School of Nursing Simon Business School Warner School of Education Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://rochester.edu/admissions/", "university_name": "University of Rochester", "title": "Admissions at Rochester", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Admissions at Rochester Apply to the University of Rochester We seek and embrace the most tenacious and unconventional applicants from around the world to join our community of doers and disrupters. 7 SCHOOLS See why we’re unique 77% UNDERGRADUATES Engage in student research 200+ ACADEMIC PROGRAMS Find majors and minors Admissions: How to apply Below, you will find details about the University of Rochester admissions process. This includes how to apply to each of our schools, tuition and financial aid information, and advice on the college application process. Arts, Sciences & Engineering (AS&E) Home of the School of Arts & Sciences and the Hajim School of Engineering & Applied Sciences , AS&E is the largest academic division at Rochester with several highly ranked programs, including physics, political science, economics, and engineering. Undergraduate admissions (first-year students, transfer students, DACA/Dreamers, etc.) Graduate education and postdoctoral affairs (each program or department has its own admissions requirements) Continuing studies (part-time students) Financial aid and scholarships Tuition and fees Contact admissions Eastman School of Music The Eastman School of Music is among the world’s leaders in musical composition, performance, and education. Admissions overview Undergraduate admissions Graduate admissions Financial aid Tuition and fees (undergraduate) Tuition and fees (graduate) Contact admissions School of Medicine and Dentistry Housed in one of the nation’s leading academic medical centers, the School of Medicine and Dentistry offers programs in medical and graduate education, residency/fellowships, and postdoctoral positions. Admissions (MD) Admissions (graduate) Financial aid Tuition and fees (MD) Tuition and fees (graduate) Contact admissions (MD) Contact admissions (graduate) School of Nursing The School of Nursing has undergraduate, graduate, and certificate programs that meet the needs of a broad spectrum of nursing and health care professionals. Admissions and aid Tuition and fees Contact admissions Eastman Institute for Oral Health Part of the University’s Medical Center, the Eastman Institute for Oral Health offers advanced postdoctoral dental education and residency programs. Admissions and aid Tuition and fees Contact admissions: Email eiohadmissionsoffice@urmc.rochester.edu. Simon Business School The Simon Business School offers nationally recognized degree programs that go beyond business as usual by embracing data analytics to drive decision-making. Graduate admissions Tuition and financial aid (full-time MBA) Contact admissions Warner School of Education The Warner School’s graduate degrees and advanced certificates in education and human development help learners meet their professional goals while making the organizations and people they serve ever better. Graduate admissions International admissions Scholarships Tuition and fees Contact admissions Degree programs Our 200-plus programs of study run the gamut, from the traditional to the self-designed. In addition to bachelor’s, master’s, and doctoral degrees, we offer several dual degrees and certificates. View our degree programs College application advice Check out these articles with tips and best practices for preparing to apply to college, as well as the college application process. How to write your best college application essay Advice for choosing high school electives Tips for high school juniors: Considering your options How to get into your dream school Need more information? THRIVE Explore campus life Students have many options for housing, dining, and recreation on and off campus. STUDY View our academic programs We have many degree and certificate options, including undergraduate and graduate programs. VISIT US Plan your visit Sign up for a tour of the University of Rochester’s campuses. jQuery(document).ready(function ($) { $(\"#play-pause-button\").click(function () { $(\"body\").addClass(\"open-video\"); }); $(\".close-button\").click(function () { $(\"body\").removeClass(\"open-video\"); }); }); Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://rochester.edu/visit/", "university_name": "University of Rochester", "title": "Visit the University of Rochester", "content": " Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Visit the University of Rochester Discover Rochester for yourself The University of Rochester is a special place to study, live, work, and, of course, visit. 170 miles from Toronto 330 miles from New York City 390 miles from Boston Campus and virtual visits On-campus tour and visit opportunities have returned for prospective students. In addition, virtual tour options are still available. Learn about visiting options Campus Visits: Office of Admissions on River Campus Virtual Visits: Office of Admissions on River Campus Eastman School of Music Getting here We’re closer to Toronto than New York City, so plan your travels accordingly. The Rochester metro area is easily navigable and our main campuses are a short drive or rideshare from the Greater Rochester International Airport, train station, or bus station. Find us on the map Our campuses You’ll find the University’s main campus, the River Campus, and the Medical Center located about two miles south of downtown Rochester. The Eastman School of Music and the Memorial Art Gallery are pillars of the arts scene and festival circuit in the city’s East End and Neighborhood of the Arts. River Campus The 154-acre River Campus—the University’s main academic campus and the home of the River Campus Libraries—is located about two miles south of downtown Rochester by a bend in the Genesee River. MAILING ADDRESS 500 Joseph C. Wilson Boulevard Rochester, NY 14627 GPS/MAPS ADDRESS 252 Elmwood Avenue Rochester, NY River Campus Parking Medical Center A nucleus of medical research, education, and patient care, the Medical Center includes the School of Medicine and Dentistry, the School of Nursing, Strong Memorial Hospital, Golisano Children’s Hospital (the area’s only children’s hospital), Wilmot Cancer Institute, and Eastman Institute for Oral Health. 601 Elmwood Avenue Rochester, NY 14624 Medical Center Parking Directions to Medical Center Locations Eastman School of Music The Eastman School’s downtown campus anchors the city’s cultural district, known as the East End. Expect to find musicians—and music fans—of all stripes in and around this architectural gem for classes, festivals, jam sessions, kaffeeklatsches, and more. 26 Gibbs Street Rochester, NY 14604 Eastman School Parking Memorial Art Gallery Memorial Art Gallery attracts nearly 300,000 visitors a year. Known locally as “MAG,” the gallery’s permanent collection of 10,000-plus works spans 50 centuries of world art, from antiquities to the avant-garde. 500 University Avenue Rochester, NY 14607 MAG Directions and Parking Laboratory for Laser Energetics (South Campus) The quest to unlock controlled nuclear fusion is happening right here at the Laboratory for Laser Energetics, the largest university-based US Department of Energy program in the nation. Tours of the Laser Lab, as it’s colloquially known, are available to the public. 250 East River Road Rochester, NY 14623 LLE Map and Tours Want to learn more before you visit? ADMISSIONS How to apply Find more information about how to apply to our graduate and undergraduate programs, and get details about financial aid and tuition. OUR CITY Discover our community There’s much to love about Rochester. Explore the city we call home. RESEARCH Explore our research Our students, faculty, and staff are at the forefront of cutting-edge work. jQuery(document).ready(function ($) { $(\"#play-pause-button\").click(function () { $(\"body\").addClass(\"open-video\"); }); $(\".close-button\").click(function () { $(\"body\").removeClass(\"open-video\"); }); }); Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff (function (h, o, t, j, a, r) { h.hj = h.hj || function () { (h.hj.q = h.hj.q || []).push(arguments); }; h._hjSettings = { hjid: 615030, hjsv: 6 }; a = o.getElementsByTagName(\"head\")[0]; r = o.createElement(\"script\"); r.async = 1; r.src = t + h._hjSettings.hjid + j + h._hjSettings.hjsv; a.appendChild(r); })(window, document, \"https://static.hotjar.com/c/hotjar-\", \".js?sv=\"); "}
,
{"id": 7, "url": "https://www.hajim.rochester.edu/", "university_name": "University of Rochester", "title": "Build a better world through engineering", "content": " Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff Hajim School of Engineering & Applied Sciences Menu Site Navigation Close Home About Us About the Hajim School Message from the Dean Departments History Alumni Faculty and Staff Awards Giving Contact Us Undergraduate Overview Programs Special Programs Experiential Learning Prospective Students Apply Graduate Overview Programs Research Apply Research Overview Research Centers Sponsor a Design Project Diversity News & Events Recent News Upcoming Events Commencement Newsletters Build a better world through engineering Majors and Minors From certificates to PhDs, explore the degree program offerings from one of the nation’s top engineering schools. Learn More Undergraduate Education We prepare students to thrive as problem solvers and act as good stewards of our future. Learn More Graduate Education Alongside award-winning faculty, our students use state-of-the-art technology to support their unique and self-driven research and education. Learn More Transformational research Across multiple departments and centers, Hajim faculty, students, and staff are developing technological innovations with the capacity to transform our world. Our strong ties and proximity to the University of Rochester Medical Center and the Laboratory for Laser Energetics make opportunities for interdisciplinary research boundless. Discover our research capabilities Experiential learning Active, experiential learning is at the heart of the Hajim School education. We believe the skills and knowledge you gain outside the classroom are as important as what you learn within it. With endless opportunities through research, study abroad programs, internships, and entrepreneurship, you can pursue your own unique and fulfilling path. Explore what’s beyond the classroom Diversity, equity, and inclusion At the Hajim School of Engineering & Applied Sciences, we strive to ensure every individual is respected and valued for the contributions that they bring to our academic mission. Diversity, equity, and inclusion are central to our core values. Find out why you belong here Meliora Making the World Ever Better Engineering is key to solving some of our most difficult societal problems and to developing innovations that will transform society in the years to come. Our students share how the Hajim School is preparing them to change the world for the better. Watch on YouTube Hajim students by the numbers Our undergraduate students are heavily involved in experiential learning opportunities that we feel lead to successful graduates. 92% Participate in a club or student organization 95% Complete at least one internship 96% Are either employed or continuing studies after graduation Let’s keep in touch Want more information about the Hajim School? Follow us on social media or contact us! Facebook YouTube Instagram Contact Us Report a Digital Accessibility Barrier Hajim School of Engineering & Applied Sciences Location University of Rochester 303-309 Lattimore Hall P.O. Box 270076 Rochester, NY 14627 Phone (585) 275-4151 Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996–2022 "}
,
{"id": 7, "url": "https://www.cs.rochester.edu/undergraduate/resources.html", "university_name": "University of Rochester", "title": "Undergraduate Program", "content": "Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff Hajim School of Engineering & Applied Sciences Department of Computer Science Menu Site Navigation Close Home About Us Overview What is Computer Science? PhD Degrees Conferred Employment Diversity 50th Anniversary Giving Directions Contact Us People Full Directory Faculty Graduate Students Staff Undergraduate Overview Advising Degree Requirements Major Declaration Resources Courses CS Lab Information Research Opportunities URCS Student Groups Applying Graduate Overview Master's Program PhD Program Courses Applying Research Overview Computer Systems Theory Artificial Intelligence Human-Computer Interaction News & Events Recent News Seminars & Talks Newsletter Commencement Undergraduate Program Section Navigation Overview Advising Degree Requirements Major Declaration Resources Courses CS Lab Information Research Opportunities URCS Student Groups Applying Home Undergraduate Program Resources Resources Academic Resources BA Planning Sheet BS Planning Sheet Advising Form CSC Independent Study Form Free tutoring by CSUG Learning Center Remote Resources Subject Librarians Poster Printing Prospective Undergraduates Frequently Asked Questions Full Spectrum Series with Dr. Michael L. Scott Hajim School of Engineering Video Apply to the University of Rochester Support Networks for Underrepresented Groups URWiCMiC - UR Women in Computing & Minorities in Computing SHPE - Society of Hispanic Professional Engineers NSBE - National Society of Black Engineers URCS Student Groups Computer Science Undergraduate Council (CSUG) URWiCMiC - UR Women in Computing & Minorities in Computing UR Robotics Social Media Pages URCS Alumni CSUG Facebook CSUG Instagram RocHack UR WiCMiC Facebook Group UR WiCMiC Instagram UR Girls Who Code ROC HCI Facebook URCS YouTube Channel Report a Digital Accessibility Barrier Department of Computer Science Location University of Rochester 2513 Wegmans Hall P.O. Box 270226 Rochester, NY 14627 Phone (585) 275-5671 Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996–2022 "}
,
{"id": 7, "url": "https://onlinedirectory.ur.rochester.edu/ErrorHandler.aspx?aspxerrorpath=/https:/onlinedirectory.ur.rochester.edu/", "university_name": "University of Rochester", "title": "", "content": " Skip to page content Skip to page level navigation Please consider downloading the latest version of Internet Explorer to experience this site as intended. Skip to content Search Search if (top != self) { alert('The URL ' + self.location.href + ' cannot be viewed inside a frame. You will be redirected.'); top.location.replace(self.location.href); } Error occurred An error occurred while attempting to complete your search. What can you do from here Please try your search again by visiting this link Support information An email was sent to technical support with all the information about this error. If you have any further questions email: OnlineDirectorySupport@ur.rochester.edu University Operator (585) 275-2121 within the University dial \"0\" Emergency numbers Send and receive postal mail Change your directory information Feedback, comments, and suggestions Maps and directions For Printed Reference (All files available as PDFs) Meeting rooms reservations River Campus & Medical Center Telephone and voicemail instructions Faculty/Staff Students Additional Resources (Requires NetId login, if outside University network) University Department Directory Highland Hospital staff directory Paging directory Tunnel maps See maps and directions Rochester, NY 14627 Search rochester.edu Accessibility Nondiscrimination Copyright Emergency Information Vision & Values "}
,
{"id": 7, "url": "https://www.rochester.edu/newscenter/", "university_name": "University of Rochester", "title": "", "content": " Skip to content Search News Center University Marketing and Communications Menu Science & Technology Society & Culture Campus Life University News Arts For the media Contact Close Search News Center Search Rochester News Science & Technology Society & Culture Campus Life University News Arts New surface acoustic wave techniques could lead to surfing a quantum internet Researchers develop new methods to couple light to sound waves that glide on surfaces. Making waves Science & Technology May 10, 2024 | 11:02 am Rochester and Albany launch new Center of Excellence in RNA research The joint venture between the University of Rochester and University at Albany will drive economic development through research and training. Read more topics: Center for RNA Biology, Department of Biology, Lynne Maquat, Medical Center, research funding, School of Arts and Sciences, School of Medicine and Dentistry, Society & Culture May 8, 2024 | 08:35 pm NATO at 75—powerful and necessary, or costly and obsolete? Created as a counterweight to the Soviet Union and Eastern Bloc, the military alliance may be more important now than ever. Political scientist Randall Stones explains why. Read more topics: Department of Political Science, global engagement, Randall Stone, School of Arts and Sciences, The Arts May 8, 2024 | 01:49 pm Musical documentary with Rochester roots gets a Pulitzer Prize nod Paper Pianos , a live-performance musical documentary written and co-created by the International Theatre Program’s Nigel Maister, tells the story of an Afghan musician and refugee Milad Yousufi. Read more topics: alumni, awards, Department of English, Eastman School of Music, Humanities Center, International Theatre Program, Nigel Maister, School of Arts and Sciences, Campus Life May 1, 2024 | 07:56 am Rochester students aim to ‘level the field’ for high schoolers applying to college A trio of undergraduates teamed up to bring accessible, high-quality education consulting services to the community. Now, they’re branching out beyond Rochester. Read more topics: admissions, community engagement, Science & Technology May 2, 2024 | 01:24 pm Did a magnetic field collapse trigger the emergence of animals? Evidence suggests a weak magnetic field millions of years ago may have fueled the proliferation of life. Read more topics: Department of Earth and Environmental Sciences, John Tarduno, research finding, School of Arts and Sciences, Campus Life May 3, 2024 | 07:59 am Coursework: Engineering students put their skills to the test in design capstones Rochester students invent solutions for project sponsors ranging from major league sports teams to researchers in Costa Rica. Read more topics: Class of 2024, Department of Biomedical Engineering, Department of Mechanical Engineering, global engagement, Goergen Institute for Data Science, Hajim School of Engineering and Applied Sciences, School of Nursing, undergraduate research, Society & Culture April 25, 2024 | 07:12 am That’s not Native American art. Or is it? A Rochester art historian on the proliferation of indigenous fakes and replicas—and the blurry line between appropriation and admiration. Read more topics: Department of Art and Art History, Graduate Program in Visual and Cultural Studies, Janet Berlo, research finding, School of Arts and Sciences, Campus Life May 1, 2024 | 02:03 pm Art of Science competition attracts record number of entries. Here are this year’s winners. The annual event encourages University community members to explore the intersection of science, art, and technology. Read more topics: Hajim School of Engineering and Applied Sciences, River Campus Libraries, School of Arts and Sciences, In Photos April 30, 2024 | 12:56 pm April 2024 in Photos From totality to Springfest and everything in between, here’s how we spent April at the University of Rochester. Read more topics: Eastman School of Music, events, Hajim School of Engineering and Applied Sciences, River Campus Libraries, School of Arts and Sciences, sustainability, University news University News April 30, 2024 | 08:31 am Awards and honors highlight accomplishments of Rochester’s faculty University of Rochester faculty regularly earn accolades for their contributions to research, scholarship, education, and community engagement. Read more topics: awards, Eastman School of Music, faculty, global engagement, Hajim School of Engineering and Applied Sciences, Laboratory for Laser Energetics, Medical Center, School of Arts and Sciences, School of Nursing, University News April 21, 2024 | 08:11 pm Kate Sheeran named Eastman School of Music Dean Sheeran, who is a graduate of Eastman, will be the school’s eighth dean and the first woman to hold the role. Read more topics: alumni, appointments, Eastman School of Music, staff, University News April 19, 2024 | 10:58 am Stanford’s Laura Carstensen ’78 to deliver 2024 Commencement address Carstensen is a research psychologist and internationally renowned expert on aging and the effects on well-being of extended lifetimes. Read more topics: alumni, Class of 2024, commencement, events, Return to the top of the page Boundless Possibility Explore our 2030 Strategic Plan See maps and directions Rochester, NY 14627 Search rochester.edu Accessibility Nondiscrimination Copyright Emergency Information Vision & Values © University of Rochester 1996-2024 /* <![CDATA[ */ \"use strict\";var _createClass=function(){function defineProperties(target,props){for(var i=0;i<props.length;i++){var descriptor=props[i];descriptor.enumerable=descriptor.enumerable||!1,descriptor.configurable=!0,\"value\"in descriptor&&(descriptor.writable=!0),Object.defineProperty(target,descriptor.key,descriptor)}}return function(Constructor,protoProps,staticProps){return protoProps&&defineProperties(Constructor.prototype,protoProps),staticProps&&defineProperties(Constructor,staticProps),Constructor}}();function _classCallCheck(instance,Constructor){if(!(instance instanceof Constructor))throw new TypeError(\"Cannot call a class as a function\")}var RocketBrowserCompatibilityChecker=function(){function RocketBrowserCompatibilityChecker(options){_classCallCheck(this,RocketBrowserCompatibilityChecker),this.passiveSupported=!1,this._checkPassiveOption(this),this.options=!!this.passiveSupported&&options}return _createClass(RocketBrowserCompatibilityChecker,[{key:\"_checkPassiveOption\",value:function(self){try{var options={get passive(){return!(self.passiveSupported=!0)}};window.addEventListener(\"test\",null,options),window.removeEventListener(\"test\",null,options)}catch(err){self.passiveSupported=!1}}},{key:\"initRequestIdleCallback\",value:function(){!1 in window&&(window.requestIdleCallback=function(cb){var start=Date.now();return setTimeout(function(){cb({didTimeout:!1,timeRemaining:function(){return Math.max(0,50-(Date.now()-start))}})},1)}),!1 in window&&(window.cancelIdleCallback=function(id){return clearTimeout(id)})}},{key:\"isDataSaverModeOn\",value:function(){return\"connection\"in navigator&&!0===navigator.connection.saveData}},{key:\"supportsLinkPrefetch\",value:function(){var elem=document.createElement(\"link\");return elem.relList&&elem.relList.supports&&elem.relList.supports(\"prefetch\")&&window.IntersectionObserver&&\"isIntersecting\"in IntersectionObserverEntry.prototype}},{key:\"isSlowConnection\",value:function(){return\"connection\"in navigator&&\"effectiveType\"in navigator.connection&&(\"2g\"===navigator.connection.effectiveType||\"slow-2g\"===navigator.connection.effectiveType)}}]),RocketBrowserCompatibilityChecker}(); /* ]]> */ /* <![CDATA[ */ var RocketPreloadLinksConfig = {\"excludeUris\":\"\\/newscenter(\\/(?:.+\\/)?feed(?:\\/(?:.+\\/?)?)?$|\\/(?:.+\\/)?embed\\/|\\/(index.php\\/)?(.*)wp-json(\\/.*|$))|\\/refer\\/|\\/go\\/|\\/recommend\\/|\\/recommends\\/\",\"usesTrailingSlash\":\"1\",\"imageExt\":\"jpg|jpeg|gif|png|tiff|bmp|webp|avif|pdf|doc|docx|xls|xlsx|php\",\"fileExt\":\"jpg|jpeg|gif|png|tiff|bmp|webp|avif|pdf|doc|docx|xls|xlsx|php|html|htm\",\"siteUrl\":\"https:\\/\\/www.rochester.edu\\/newscenter\",\"onHoverDelay\":\"100\",\"rateThrottle\":\"3\"}; /* ]]> */ /* <![CDATA[ */ (function() { \"use strict\";var r=\"function\"==typeof Symbol&&\"symbol\"==typeof Symbol.iterator?function(e){return typeof e}:function(e){return e&&\"function\"==typeof Symbol&&e.constructor===Symbol&&e!==Symbol.prototype?\"symbol\":typeof e},e=function(){function i(e,t){for(var n=0;n<t.length;n++){var i=t[n];i.enumerable=i.enumerable||!1,i.configurable=!0,\"value\"in i&&(i.writable=!0),Object.defineProperty(e,i.key,i)}}return function(e,t,n){return t&&i(e.prototype,t),n&&i(e,n),e}}();function i(e,t){if(!(e instanceof t))throw new TypeError(\"Cannot call a class as a function\")}var t=function(){function n(e,t){i(this,n),this.browser=e,this.config=t,this.options=this.browser.options,this.prefetched=new Set,this.eventTime=null,this.threshold=1111,this.numOnHover=0}return e(n,[{key:\"init\",value:function(){!this.browser.supportsLinkPrefetch()||this.browser.isDataSaverModeOn()||this.browser.isSlowConnection()||(this.regex={excludeUris:RegExp(this.config.excludeUris,\"i\"),images:RegExp(\".(\"+this.config.imageExt+\")$\",\"i\"),fileExt:RegExp(\".(\"+this.config.fileExt+\")$\",\"i\")},this._initListeners(this))}},{key:\"_initListeners\",value:function(e){-1<this.config.onHoverDelay&&document.addEventListener(\"mouseover\",e.listener.bind(e),e.listenerOptions),document.addEventListener(\"mousedown\",e.listener.bind(e),e.listenerOptions),document.addEventListener(\"touchstart\",e.listener.bind(e),e.listenerOptions)}},{key:\"listener\",value:function(e){var t=e.target.closest(\"a\"),n=this._prepareUrl(t);if(null!==n)switch(e.type){case\"mousedown\":case\"touchstart\":this._addPrefetchLink(n);break;case\"mouseover\":this._earlyPrefetch(t,n,\"mouseout\")}}},{key:\"_earlyPrefetch\",value:function(t,e,n){var i=this,r=setTimeout(function(){if(r=null,0===i.numOnHover)setTimeout(function(){return i.numOnHover=0},1e3);else if(i.numOnHover>i.config.rateThrottle)return;i.numOnHover++,i._addPrefetchLink(e)},this.config.onHoverDelay);t.addEventListener(n,function e(){t.removeEventListener(n,e,{passive:!0}),null!==r&&(clearTimeout(r),r=null)},{passive:!0})}},{key:\"_addPrefetchLink\",value:function(i){return this.prefetched.add(i.href),new Promise(function(e,t){var n=document.createElement(\"link\");n.rel=\"prefetch\",n.href=i.href,n.onload=e,n.onerror=t,document.head.appendChild(n)}).catch(function(){})}},{key:\"_prepareUrl\",value:function(e){if(null===e||\"object\"!==(void 0===e?\"undefined\":r(e))||!1 in e||-1===[\"http:\",\"https:\"].indexOf(e.protocol))return null;var t=e.href.substring(0,this.config.siteUrl.length),n=this._getPathname(e.href,t),i={original:e.href,protocol:e.protocol,origin:t,pathname:n,href:t+n};return this._isLinkOk(i)?i:null}},{key:\"_getPathname\",value:function(e,t){var n=t?e.substring(this.config.siteUrl.length):e;return n.startsWith(\"/\")||(n=\"/\"+n),this._shouldAddTrailingSlash(n)?n+\"/\":n}},{key:\"_shouldAddTrailingSlash\",value:function(e){return this.config.usesTrailingSlash&&!e.endsWith(\"/\")&&!this.regex.fileExt.test(e)}},{key:\"_isLinkOk\",value:function(e){return null!==e&&\"object\"===(void 0===e?\"undefined\":r(e))&&(!this.prefetched.has(e.href)&&e.origin===this.config.siteUrl&&-1===e.href.indexOf(\"?\")&&-1===e.href.indexOf(\"#\")&&!this.regex.excludeUris.test(e.href)&&!this.regex.images.test(e.href))}}],[{key:\"run\",value:function(){\"undefined\"!=typeof RocketPreloadLinksConfig&&new n(new RocketBrowserCompatibilityChecker({capture:!0,passive:!0}),RocketPreloadLinksConfig).init()}}]),n}();t.run(); }()); /* ]]> */ "}
,
{"id": 7, "url": "https://admissions.rochester.edu/applying/how-to-apply/", "university_name": "University of Rochester", "title": "", "content": " Skip to content Search Undergraduate Admissions Connect Apply Visit MyROC Connect Apply Visit MyROC Home Applying How to Apply First-Year Students Transfer Students International Students Dates & Deadlines Interviewing Testing Policies Veteran Resources Visit Campus Visits Virtual Visits Rochester in Your Area Contact Your Counselor ROCemmendations Admitted Students Research Rochester Academics & Research The Rochester Curriculum Majors and Minors Student Research Combined Degree Programs Research & Innovation Grants Academic Opportunities Campus Life Our Campus Student Groups University Facts City of Rochester Student Resources Financial Aid Pre-College Programs Admitted Students Close Search Undergraduate Admissions Search How to Apply Home Applying How to Apply Be a Yellowjacket We invite you—the curious, the capable, and the engaged—to apply to our diverse and talented community of doers and disrupters. Our promise to you is a holistic, integrated review of your unique academic ability, extracurricular engagement, and ethical character. We strive to admit students who’ll work to make each other, the University, and the world ever better. Rochester’s quest for Meliora As one of the world’s leading research universities, Rochester’s mission is to help our students and scholars learn, discover, heal, create, and make the world ever better . Embedded in that ideal are the values we share: equity, leadership, integrity, openness, respect, and accountability. What we look for in a Yellowjacket As a charter member of the Character Collaborative , we evaluate applicants within the unique context of their environment and their opportunities inside and outside of school. Highly trained admission professionals assess their academic achievement, extracurricular engagement, and ethical character, in order to admit a diverse group of students who will work to make each other, the University, and the world ever better in alignment with Rochester’s mission and values. Our holistic review process for undergraduate applicants includes, but intentionally goes beyond, numerical representations of academic performance, though we certainly expect strong performance in challenging academic coursework. We hope to understand much more about each applicant than simply their grades and standardized test scores. The students for whom Rochester is the best fit are driven by their intellectual curiosity and seek out opportunities for growth. Our admission criteria connect directly to our students’ undergraduate experiences and outcomes through the College Competencies , Rochester’s framework for students to tell their story and serve as leaders in our shared future. They were created to ensure Rochester students are prepared with the skills employers and society seek in 21st Century college graduates. Show us who you are We value the individuality of our students and the ways they have already, or intend to customize their educational experiences to explore broadly AND dig deeply into specific academic areas. As students prepare to apply or interview for admission, we encourage them to consider the following: What are you interested in? What makes you interesting? What are your values? How have you improved yourself and your community? How will you make the world better? Supplemental Essay Prompts for 2023-24 Application Cycle Both parts must be completed as part of the application process. Part 1 – 250 word limit The University of Rochester motto of Meliora – or “ever better” – deeply integrates critical core values into all that we do. These core values of equity, leadership, integrity, openness, respect and accountability define not only who we are, but also who we hope to become. Please use the space below to highlight a time, creative idea or research experience when you put into action one or more of these characteristics in order to make yourself, your community or the world ever better. Part 2 (choose 1) – 200 word limit American social reformer, abolitionist, writer and statesman Frederick Douglass said, “Some know the value of education by having it. I knew its value by not having it.” Explain ways in which your background, educational experience, and opportunities have directly influenced you and your ability to do good in the world. What specific moments of growth, lessons learned, and resilience in your life have prepared you to promote positive change for your community and the world? Dr. Donna Strickland, University of Rochester alum and 2018 Nobel Prize winner in Physics said, “There’s no point in me being anything other than me.” The University of Rochester encourages each student to embrace the intersectionality of their identity and create their own individual curricular path and experience. What qualities and experiences make you the best version of yourself? What unique elements of your background, perspectives, and experiences will you bring to our community? Susan B. Anthony, champion of abolition and women’s rights, once said “Organize, agitate, educate must be our war cry.” As you look to join our community of doers and disruptors, in what ways do you envision using both the curricular flexibility and co-curricular opportunities to invoke change for marginalized groups? How has your unique lived experience shaped you and prepared you to be a changemaker here? The University of Rochester benefactor, entrepreneur, photography pioneer and philanthropist George Eastman said, “What we do during our working hours determines what we have; what we do in our leisure hours determines what we are.” How have the ways you’ve spent your time enabled you to grow as a person? What challenges have helped define you and your role within your community(s)? First-year applicants Apply online for early or regular decision using either the Common Application or Coalition for College Application. Transfer applicants We accept transfer students for both the fall and spring semesters, with applications reviewed on a rolling basis. International applicants Not a US citizen or permanent resident? Apply as an international student, which may mean some additional steps. Check your application status Once you have submitted your application, use MyROC, our online undergraduate admissions portal, to monitor your application status, upload materials, see admissions decisions, get merit scholarship notifications, and more. Log in to MyROC Helpful links Dates & Deadlines Interviewing Testing Policies Veteran Resources Financial Aid Contact Us Connect with us to get to know us Follow On Facebook Follow on Facebook X/Twitter Follow on X/Twitter Instagram Follow on Instagram YouTube Follow on Youtube Return to the top of the page Boundless Possibility Explore our 2030 Strategic Plan See maps and directions Rochester, NY 14627 Search rochester.edu Contact Us Admissions Blog Join Our Mailing List Online Publications Accessibility Nondiscrimination Policy Copyright Emergency Information Vision & Values Local & National Partners Parents & Families Counselors Alumni Volunteers © University of Rochester 1996-2024 /**/ "}
,
{"id": 7, "url": "https://www.rochester.edu/diversity/eoc/nondiscrimination-statement/", "university_name": "University of Rochester", "title": "", "content": " Skip to content Search Office of Equity and Inclusion EXPLORE MORE Office of Equity and Inclusion Get Help University Resources Harassment and Discrimination Sexual Misconduct Affirmative Action Education and Training Faculty and Staff Students and Alumni Community Engagement Recognition and Celebrations Programming and Events 21-Day Equity Challenge 2024 Daily Challenges 2024 Speakers Annual Diversity Conference Celebrating Juneteenth Presidential Stronger As One Diversity Awards REAL Conversations Tana Grady-Weliky Lecture Series Quick Links Policies Reports Events Calendar Diversity Dashboards 2020 Celebration Contact us Office of Equity and Inclusion Get Help University Resources Harassment and Discrimination Sexual Misconduct Affirmative Action Education and Training Faculty and Staff Students and Alumni Community Engagement Recognition and Celebrations Programming and Events 21-Day Equity Challenge 2024 Daily Challenges 2024 Speakers Annual Diversity Conference Celebrating Juneteenth Presidential Stronger As One Diversity Awards REAL Conversations Tana Grady-Weliky Lecture Series Quick Links Policies Reports Events Calendar Diversity Dashboards 2020 Celebration Contact us Nondiscrimination Statement The University of Rochester prohibits and will not engage in discrimination and harassment on the basis of age, color, disability, domestic violence victim status, ethnicity, gender identity or expression, genetic information, marital status, familial status or an individual’s reproductive health decision making, military/veteran status, national origin, race (including hair style), religion/creed (including religious attire and facial hair), sex, sexual orientation, citizenship status, or any other status protected by law (anyone individually, a “Protected Class”). Discrimination or harassment (including hostile work environment harassment) based on protected status is illegal, will not be tolerated, and is considered misconduct that will be subject to discipline. The University is committed to fostering, cultivating, and preserving a culture of diversity, equity, and inclusion, a central tenet of our institutional vision and values . This commitment extends to policies and practices for admissions, recruitment, and employment in accordance with the principles of equal opportunity and Affirmative Action and in compliance with applicable law. The University complies with all federal and state laws that prohibit discrimination based on the protected categories listed above, including Title IX of the Education Amendments of 1972, which prohibits sex discrimination (including sexual harassment and violence based on sex) in the University’s educational programs and activities, and Section 504 of the Rehabilitation Act of 1973, which prohibits discrimination on the basis of disability. Inquiries concerning the application of Title IX and sex-based complaints should be referred to the University’s Title IX staff by emailing titleix@rochester.edu or contacting the Title IX Coordinator or a deputy coordinator ). Julia Green, associate vice president for civil rights compliance and Title IX coordinator, can be reached at julia.green@rochester.edu or by calling (585) 275-1654. Her office is located in 147A Wallis Hall on the River Campus. Questions about compliance with Section 504 can be addressed to the University’s Office of Disability Services and Support , by emailing disability@rochester.edu or contacting the Director of Disability Compliance . Questions regarding the application of Title IX and Section 504 can also be directed to the U.S. Department of Education’s Office of Civil Rights (OCR) at its New York office at (646) 428-3800 or its national headquarters at (800) 421-3481; TTY: (800)-877-8339, or www.ed.gov/ocr/ . Boundless Possibility Explore our 2030 Strategic Plan See maps and directions Rochester, NY 14627 Search rochester.edu Accessibility Nondiscrimination Copyright Emergency Information Vision & Values © University of Rochester 1996-2024 Search Office of Equity and Inclusion Search (function (b, o, i, l, e, r) { b.GoogleAnalyticsObject = l; b[l] || (b[l] = function () { (b[l].q = b[l].q || []).push(arguments) }); b[l].l = +new Date; e = o.createElement(i); r = o.getElementsByTagName(i)[0]; e.src = '//www.google-analytics.com/analytics.js'; r.parentNode.insertBefore(e, r) }(window, document, 'script', 'ga')); ga('create', 'UA-2917298-1'); ga('send', 'pageview'); "}
,
{"id": 7, "url": "https://www.rochester.edu/advancement/", "university_name": "University of Rochester", "title": "", "content": " University of Rochester For Alumni Give How to give What to support Programs Contact Make a Gift For Alumni Give How to give What to support Programs Contact Make a Gift Search: Congratulations, Class of 2024! Learn more about this year’s Commencement activities, May 17–19 Congratulations, Class of 2024! Learn more about this year’s Commencement activities, May 17–19 Supporting families with palliative care The Cummins family turned to Highland Hospital’s palliative care team for support as they navigated difficult medical decisions for two important family members. With donor support, Highland plans to expand its palliative care unit to offer dedicated space to help families during life’s most challenging moments. .embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } .embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Supporting families with palliative care The Cummins family turned to Highland Hospital’s palliative care team for support as they navigated difficult medical decisions for two important family members. With donor support, Highland plans to expand its palliative care unit to offer dedicated space to help families during life’s most challenging moments. Featured stories Show us your town Tokyo entrepreneur Yohay Wakabayashi ’10, ’11S (MS) shares some of his favorite things to do in one of the world’s top destinations for culture and cuisine. Navigating the first-gen experience The First-Generation Network connects students with alumni who have walked a similar path. Nurturing minds, transforming lives Natalie Lewis ’22N and Evelyn Santos ’23N (MS) are nursing champions for their communities. Inspiring and supporting nurses Jessica Tambe ’22N (MS), RN, SCRN, receives the Excellence in Neuroscience Education Award. Nursing student spotlight Victoria Thomas, former dental hygienist, finds a new path in health care leadership. Q&A with Ethan King ’27 This optics major, a capella performer, and scholarship recipient excels in and out of the classroom. Read more stories Celebration of Scholarships On April 21, 2024, our 15th annual event brought together students, donors, and University of Rochester leaders. Scholarship recipients shared their stories. Donors talked about why they give. University leaders discussed why scholarship support is so essential—now and forever. Learn more and be inspired. /* addon: Events row */ @charset \"UTF-8\";/*! normalize.css v8.0.0 | MIT License | github.com/necolas/normalize.css */html{line-height:1.15;-webkit-text-size-adjust:100%}body{margin:0}h1{font-size:2em;margin:.67em 0}a{background-color:transparent}b{font-weight:bolder}code{font-family:monospace,monospace;font-size:1em}sub{font-size:75%;line-height:0;position:relative;vertical-align:baseline}sub{bottom:-.25em}[type=button],[type=reset],[type=submit]{-webkit-appearance:button}[type=button]::-moz-focus-inner,[type=reset]::-moz-focus-inner,[type=submit]::-moz-focus-inner{border-style:none;padding:0}[type=button]:-moz-focusring,[type=reset]:-moz-focusring,[type=submit]:-moz-focusring{outline:1px dotted ButtonText}[type=checkbox],[type=radio]{box-sizing:border-box;padding:0}[type=number]::-webkit-inner-spin-button,[type=number]::-webkit-outer-spin-button{height:auto}[type=search]{-webkit-appearance:textfield;outline-offset:-2px}[type=search]::-webkit-search-decoration{-webkit-appearance:none}::-webkit-file-upload-button{-webkit-appearance:button;font:inherit}details{display:block}[hidden]{display:none}html{box-sizing:border-box;font-size:100%}*,::after,::before{box-sizing:inherit}body{margin:0;padding:0;background:#fefefe; ;-webkit-font-smoothing:antialiased;}.is-visible{display:block!important}.is-hidden{display:none!important}[type=color],[type=date],[type=datetime-local],[type=datetime],[type=email],[type=month],[type=number],[type=password],[type=search],[type=tel],[type=text],[type=time],[type=url],[type=week]{display:block;box-sizing:border-box;width:100%;height:2.4375rem;margin:0 0 1rem;padding:.5rem;border:1px solid #b8b8b8;border-radius:0;background-color:#fefefe;box-shadow:inset 0 1px 2px rgba(10,10,10,.1);font-family:inherit;font-size:1rem;font-weight:400;line-height:1.5;color:#0a0a0a;transition:box-shadow .5s,border-color .25s ease-in-out;appearance:none}[type=color]:focus,[type=date]:focus,[type=datetime-local]:focus,[type=datetime]:focus,[type=email]:focus,[type=month]:focus,[type=number]:focus,[type=password]:focus,[type=search]:focus,[type=tel]:focus,[type=text]:focus,[type=time]:focus,[type=url]:focus,[type=week]:focus{outline:0;border:1px solid #565656;background-color:#fefefe;box-shadow:0 0 5px #b8b8b8;transition:box-shadow .5s,border-color .25s ease-in-out}[type=button],[type=submit]{appearance:none;border-radius:0}::placeholder{color:#b8b8b8}[type=checkbox],[type=file],[type=radio]{margin:0 0 1rem}[type=file]{width:100%}dd,div,dl,h1,h2,h3,h4,h5,h6,li,ol,p,th,ul{margin:0;padding:0}p{margin-bottom:1rem;font-size:inherit;line-height:1.6;text-rendering:optimizeLegibility}em,i{font-style:italic;line-height:inherit}b{font-weight:700;line-height:inherit}.h1,.h2,.h3,.h4,.h5,.h6,h1,h2,h3,h4,h5,h6{font-family:proxima-nova,Helvetica,Roboto,Arial,sans-serif;font-style:normal;font-weight:700;color:inherit;text-rendering:optimizeLegibility}.h1,h1{font-size:1.5rem;line-height:1.4;margin-top:0;margin-bottom:.5rem}.h2,h2{font-size:1.25rem;line-height:1.4;margin-top:0;margin-bottom:.5rem}.h3,h3{font-size:1.1875rem;line-height:1.4;margin-top:0;margin-bottom:.5rem}.h4,h4{font-size:1.125rem;line-height:1.4;margin-top:0;margin-bottom:.5rem}.h5,h5{font-size:1.0625rem;line-height:1.4;margin-top:0;margin-bottom:.5rem}.h6,h6{font-size:1rem;line-height:1.4;margin-top:0;margin-bottom:.5rem}@media print,screen and (min-width:40em){.h1,h1{font-size:3rem}.h2,h2{font-size:2.5rem}.h3,h3{font-size:1.9375rem}.h4,h4{font-size:1.5625rem}.h5,h5{font-size:1.25rem}.h6,h6{font-size:1rem}}a{line-height:inherit;color:#283faf;text-decoration:none;cursor:pointer}a:focus,a:hover{color:#223697}dl,ol,ul{margin-bottom:1rem;list-style-position:outside;line-height:1.6}li{font-size:inherit}ul{margin-left:;list-style-type:disc}ol{margin-left:0.0rem}ol ol,ol ul,ul ol,ul ul{margin-left:0.0rem;margin-bottom:0}dl{margin-bottom:1rem}code{padding:.125rem .3125rem .0625rem;border:1px solid #b8b8b8;background-color:#f4f4f4;font-family:Consolas,\"Liberation Mono\",Courier,monospace;font-weight:400;color:#0a0a0a}.text-left{text-align:left}.text-right{text-align:right}.text-center{text-align:center}.text-justify{text-align:justify}@media print,screen and (min-width:40em){.medium-text-left{text-align:left}.medium-text-right{text-align:right}.medium-text-center{text-align:center}.medium-text-justify{text-align:justify}}@media print,screen and (min-width:64em){.large-text-left{text-align:left}.large-text-right{text-align:right}.large-text-center{text-align:center}.large-text-justify{text-align:justify}}@media print{*{background:0 0!important;box-shadow:none!important;color:#000!important;text-shadow:none!important}a,a:visited{text-decoration:none}a[href]:after{content:\" (\" attr(href) \")\"}a[href^='#']:after,a[href^='javascript:']:after{content:''}@page{margin:.5cm}h2,h3,p{orphans:3;widows:3}h2,h3{page-break-after:avoid}}.row{max-width:78.125rem;margin-right:auto;margin-left:auto}.row::after,.row::before{display:table;content:' ';flex-basis:0;order:1}.row::after{clear:both}.row .row{margin-right:-.625rem;margin-left:-.625rem}@media print,screen and (min-width:40em){.row .row{margin-right:-.9375rem;margin-left:-.9375rem}}@media print,screen and (min-width:64em){.row .row{margin-right:-.9375rem;margin-left:-.9375rem}}.row:not(.expanded) .row{max-width:none}.column,.columns{width:100%;float:left;padding-right:.625rem;padding-left:.625rem}@media print,screen and (min-width:40em){.column,.columns{padding-right:.9375rem;padding-left:.9375rem}}.column,.column:last-child:not(:first-child),.columns,.columns:last-child:not(:first-child){float:left;clear:none}.column:last-child:not(:first-child),.columns:last-child:not(:first-child){float:right}.column.end:last-child:last-child,.end.columns:last-child:last-child{float:left}.column.row.row,.row.row.columns{float:none}.row .column.row.row,.row .row.row.columns{margin-right:0;margin-left:0;padding-right:0;padding-left:0}@media print,screen and (min-width:40em){.medium-1{width:8.33333%}.medium-push-1{position:relative;left:8.33333%}.medium-pull-1{position:relative;left:-8.33333%}.medium-2{width:16.66667%}.medium-push-2{position:relative;left:16.66667%}.medium-pull-2{position:relative;left:-16.66667%}.medium-3{width:25%}.medium-push-3{position:relative;left:25%}.medium-pull-3{position:relative;left:-25%}.medium-4{width:33.33333%}.medium-push-4{position:relative;left:33.33333%}.medium-pull-4{position:relative;left:-33.33333%}.medium-5{width:41.66667%}.medium-push-5{position:relative;left:41.66667%}.medium-pull-5{position:relative;left:-41.66667%}.medium-6{width:50%}.medium-push-6{position:relative;left:50%}.medium-pull-6{position:relative;left:-50%}.medium-7{width:58.33333%}.medium-push-7{position:relative;left:58.33333%}.medium-pull-7{position:relative;left:-58.33333%}.medium-8{width:66.66667%}.medium-push-8{position:relative;left:66.66667%}.medium-pull-8{position:relative;left:-66.66667%}.medium-9{width:75%}.medium-push-9{position:relative;left:75%}.medium-pull-9{position:relative;left:-75%}.medium-10{width:83.33333%}.medium-push-10{position:relative;left:83.33333%}.medium-pull-10{position:relative;left:-83.33333%}.medium-11{width:91.66667%}.medium-push-11{position:relative;left:91.66667%}.medium-pull-11{position:relative;left:-91.66667%}.medium-12{width:100%}.medium-up-1>.column,.medium-up-1>.columns{float:left;width:100%}.medium-up-1>.column:nth-of-type(1n),.medium-up-1>.columns:nth-of-type(1n){clear:none}.medium-up-1>.column:nth-of-type(1n+1),.medium-up-1>.columns:nth-of-type(1n+1){clear:both}.medium-up-1>.column:last-child,.medium-up-1>.columns:last-child{float:left}.medium-up-2>.column,.medium-up-2>.columns{float:left;width:50%}.medium-up-2>.column:nth-of-type(1n),.medium-up-2>.columns:nth-of-type(1n){clear:none}.medium-up-2>.column:nth-of-type(2n+1),.medium-up-2>.columns:nth-of-type(2n+1){clear:both}.medium-up-2>.column:last-child,.medium-up-2>.columns:last-child{float:left}.medium-up-3>.column,.medium-up-3>.columns{float:left;width:33.33333%}.medium-up-3>.column:nth-of-type(1n),.medium-up-3>.columns:nth-of-type(1n){clear:none}.medium-up-3>.column:nth-of-type(3n+1),.medium-up-3>.columns:nth-of-type(3n+1){clear:both}.medium-up-3>.column:last-child,.medium-up-3>.columns:last-child{float:left}.medium-up-4>.column,.medium-up-4>.columns{float:left;width:25%}.medium-up-4>.column:nth-of-type(1n),.medium-up-4>.columns:nth-of-type(1n){clear:none}.medium-up-4>.column:nth-of-type(4n+1),.medium-up-4>.columns:nth-of-type(4n+1){clear:both}.medium-up-4>.column:last-child,.medium-up-4>.columns:last-child{float:left}.medium-up-5>.column,.medium-up-5>.columns{float:left;width:20%}.medium-up-5>.column:nth-of-type(1n),.medium-up-5>.columns:nth-of-type(1n){clear:none}.medium-up-5>.column:nth-of-type(5n+1),.medium-up-5>.columns:nth-of-type(5n+1){clear:both}.medium-up-5>.column:last-child,.medium-up-5>.columns:last-child{float:left}.medium-up-6>.column,.medium-up-6>.columns{float:left;width:16.66667%}.medium-up-6>.column:nth-of-type(1n),.medium-up-6>.columns:nth-of-type(1n){clear:none}.medium-up-6>.column:nth-of-type(6n+1),.medium-up-6>.columns:nth-of-type(6n+1){clear:both}.medium-up-6>.column:last-child,.medium-up-6>.columns:last-child{float:left}.medium-up-7>.column,.medium-up-7>.columns{float:left;width:14.28571%}.medium-up-7>.column:nth-of-type(1n),.medium-up-7>.columns:nth-of-type(1n){clear:none}.medium-up-7>.column:nth-of-type(7n+1),.medium-up-7>.columns:nth-of-type(7n+1){clear:both}.medium-up-7>.column:last-child,.medium-up-7>.columns:last-child{float:left}.medium-up-8>.column,.medium-up-8>.columns{float:left;width:12.5%}.medium-up-8>.column:nth-of-type(1n),.medium-up-8>.columns:nth-of-type(1n){clear:none}.medium-up-8>.column:nth-of-type(8n+1),.medium-up-8>.columns:nth-of-type(8n+1){clear:both}.medium-up-8>.column:last-child,.medium-up-8>.columns:last-child{float:left}.medium-pull-0,.medium-push-0{position:static;margin-right:0;margin-left:0}.medium-pull-0,.medium-pull-0:last-child:not(:first-child),.medium-push-0,.medium-push-0:last-child:not(:first-child){float:left;clear:none}.medium-pull-0:last-child:not(:first-child),.medium-push-0:last-child:not(:first-child){float:right}}@media print,screen and (min-width:64em){.large-1{width:8.33333%}.large-push-1{position:relative;left:8.33333%}.large-pull-1{position:relative;left:-8.33333%}.large-2{width:16.66667%}.large-push-2{position:relative;left:16.66667%}.large-pull-2{position:relative;left:-16.66667%}.large-3{width:25%}.large-push-3{position:relative;left:25%}.large-pull-3{position:relative;left:-25%}.large-4{width:33.33333%}.large-push-4{position:relative;left:33.33333%}.large-pull-4{position:relative;left:-33.33333%}.large-5{width:41.66667%}.large-push-5{position:relative;left:41.66667%}.large-pull-5{position:relative;left:-41.66667%}.large-6{width:50%}.large-push-6{position:relative;left:50%}.large-pull-6{position:relative;left:-50%}.large-7{width:58.33333%}.large-push-7{position:relative;left:58.33333%}.large-pull-7{position:relative;left:-58.33333%}.large-8{width:66.66667%}.large-push-8{position:relative;left:66.66667%}.large-pull-8{position:relative;left:-66.66667%}.large-9{width:75%}.large-push-9{position:relative;left:75%}.large-pull-9{position:relative;left:-75%}.large-10{width:83.33333%}.large-push-10{position:relative;left:83.33333%}.large-pull-10{position:relative;left:-83.33333%}.large-11{width:91.66667%}.large-push-11{position:relative;left:91.66667%}.large-pull-11{position:relative;left:-91.66667%}.large-12{width:100%}.large-up-1>.column,.large-up-1>.columns{float:left;width:100%}.large-up-1>.column:nth-of-type(1n),.large-up-1>.columns:nth-of-type(1n){clear:none}.large-up-1>.column:nth-of-type(1n+1),.large-up-1>.columns:nth-of-type(1n+1){clear:both}.large-up-1>.column:last-child,.large-up-1>.columns:last-child{float:left}.large-up-2>.column,.large-up-2>.columns{float:left;width:50%}.large-up-2>.column:nth-of-type(1n),.large-up-2>.columns:nth-of-type(1n){clear:none}.large-up-2>.column:nth-of-type(2n+1),.large-up-2>.columns:nth-of-type(2n+1){clear:both}.large-up-2>.column:last-child,.large-up-2>.columns:last-child{float:left}.large-up-3>.column,.large-up-3>.columns{float:left;width:33.33333%}.large-up-3>.column:nth-of-type(1n),.large-up-3>.columns:nth-of-type(1n){clear:none}.large-up-3>.column:nth-of-type(3n+1),.large-up-3>.columns:nth-of-type(3n+1){clear:both}.large-up-3>.column:last-child,.large-up-3>.columns:last-child{float:left}.large-up-4>.column,.large-up-4>.columns{float:left;width:25%}.large-up-4>.column:nth-of-type(1n),.large-up-4>.columns:nth-of-type(1n){clear:none}.large-up-4>.column:nth-of-type(4n+1),.large-up-4>.columns:nth-of-type(4n+1){clear:both}.large-up-4>.column:last-child,.large-up-4>.columns:last-child{float:left}.large-up-5>.column,.large-up-5>.columns{float:left;width:20%}.large-up-5>.column:nth-of-type(1n),.large-up-5>.columns:nth-of-type(1n){clear:none}.large-up-5>.column:nth-of-type(5n+1),.large-up-5>.columns:nth-of-type(5n+1){clear:both}.large-up-5>.column:last-child,.large-up-5>.columns:last-child{float:left}.large-up-6>.column,.large-up-6>.columns{float:left;width:16.66667%}.large-up-6>.column:nth-of-type(1n),.large-up-6>.columns:nth-of-type(1n){clear:none}.large-up-6>.column:nth-of-type(6n+1),.large-up-6>.columns:nth-of-type(6n+1){clear:both}.large-up-6>.column:last-child,.large-up-6>.columns:last-child{float:left}.large-up-7>.column,.large-up-7>.columns{float:left;width:14.28571%}.large-up-7>.column:nth-of-type(1n),.large-up-7>.columns:nth-of-type(1n){clear:none}.large-up-7>.column:nth-of-type(7n+1),.large-up-7>.columns:nth-of-type(7n+1){clear:both}.large-up-7>.column:last-child,.large-up-7>.columns:last-child{float:left}.large-up-8>.column,.large-up-8>.columns{float:left;width:12.5%}.large-up-8>.column:nth-of-type(1n),.large-up-8>.columns:nth-of-type(1n){clear:none}.large-up-8>.column:nth-of-type(8n+1),.large-up-8>.columns:nth-of-type(8n+1){clear:both}.large-up-8>.column:last-child,.large-up-8>.columns:last-child{float:left}.large-pull-0,.large-push-0{position:static;margin-right:0;margin-left:0}.large-pull-0,.large-pull-0:last-child:not(:first-child),.large-push-0,.large-push-0:last-child:not(:first-child){float:left;clear:none}.large-pull-0:last-child:not(:first-child),.large-push-0:last-child:not(:first-child){float:right}}.column-block{margin-bottom:1.25rem}.column-block>:last-child{margin-bottom:0}@media print,screen and (min-width:40em){.column-block{margin-bottom:1.875rem}.column-block>:last-child{margin-bottom:0}}.switch{height:2rem;position:relative;margin-bottom:1rem;outline:0;font-size:.875rem;font-weight:700;color:#fefefe;user-select:none}.switch-active{position:absolute;top:50%;transform:translateY(-50%)}.switch-active{left:8%;display:none}.switch.large{height:2.5rem}table{border-collapse:collapse;width:100%;margin-bottom:1rem;border-radius:0}@media screen and (max-width:63.99875em){table.stack th{display:block}}table.scroll{display:block;width:100%;overflow-x:auto}.table-scroll{overflow-x:auto}.badge{display:inline-block;min-width:2.1em;padding:.3em;border-radius:50%;font-size:.6rem;text-align:center;background:#283faf;color:#fefefe}.badge.primary{background:#283faf;color:#fefefe}.badge.secondary{background:#767676;color:#fefefe}.badge.warning{background:#ffae00;color:#0a0a0a}.badge.alert{background:#cc4b37;color:#fefefe}.card{display:flex;flex-direction:column;flex-grow:1;margin-bottom:1rem;border:1px solid #f4f4f4;border-radius:0;background:#fefefe;box-shadow:none;overflow:hidden;color:#565656}.card>:last-child{margin-bottom:0}.card-section{flex:1 0 auto;padding:1rem}.card-section>:last-child{margin-bottom:0}.card-image{min-height:1px}.media-object{display:flex;margin-bottom:1rem;flex-wrap:nowrap}.media-object-section{flex:0 1 auto}.media-object-section:first-child{padding-right:1rem}.media-object-section:last-child:not(:nth-child(2)){padding-left:1rem}.media-object-section>:last-child{margin-bottom:0}.media-object-section.main-section{flex:1 1 0px}.position-left{top:0;left:0;height:100%;overflow-y:auto;width:250px;transform:translateX(-250px)}.position-left.is-transition-push{box-shadow:inset -13px 0 20px -13px rgba(10,10,10,.25)}.position-right{top:0;right:0;height:100%;overflow-y:auto;width:250px;transform:translateX(250px)}.position-right.is-transition-push{box-shadow:inset 13px 0 20px -13px rgba(10,10,10,.25)}.position-top{top:0;left:0;width:100%;overflow-x:auto;height:250px;transform:translateY(-250px)}.position-top.is-transition-push{box-shadow:inset 0 -13px 20px -13px rgba(10,10,10,.25)}.position-bottom{bottom:0;left:0;width:100%;overflow-x:auto;height:250px;transform:translateY(250px)}.position-bottom.is-transition-push{box-shadow:inset 0 13px 20px -13px rgba(10,10,10,.25)}.sticky-container{position:relative}.sticky{position:relative;z-index:0;transform:translate3d(0,0,0)}.float-left{float:left!important}.float-right{float:right!important}.float-center{display:block;margin-right:auto;margin-left:auto}#content[tabindex=\"-1\"]:focus{outline:0}.comment-content:after,.comment-content:before{content:\"\";display:table;table-layout:fixed}.comment-content:after{clear:both}.sticky{display:block}.page{margin:0}.page-content{margin:1.5em 0 0}.comment-content a{word-wrap:break-word}object{max-width:100%}.custom-logo-link{display:inline-block}body{height:100vh;position:relative;overflow-x:hidden}body{color:#565656}code{font-size:9pt;display:inline-block;margin-bottom:20px}section{padding:75px 2.5%;width:100%;margin:0 auto}@media print,screen and (min-width:40em){section{padding:150px 0;width:100%;padding: 0px}}body h1,body h6,h2,h3,h4,h5{font-weight:700;color:#212121;position:relative;font-family:proxima-nova,sans-serif}@media print,screen and (min-width:40em){body h1,body h6,h2,h3,h4,h5{text-align:left}}body h1{font-size:3.375rem;line-height:54px;margin-bottom:50px}body h2{font-size:3rem;line-height:48px;margin-bottom:50px}body h3{font-size:2rem;line-height:34px;margin-bottom:30px}body h4{font-size:1.625rem;line-height:28px;margin-bottom:20px}h1.line,h2.line,h3.line,h4.line,h5.line,h6.line{padding-top:15px;width:fit-content}h1.line:before,h2.line:before,h3.line:before,h4.line:before,h5.line:before,h6.line:before{content:'';width:50%;height:8px;background-color:#00205b;display:inline-block;position:absolute;top:0;left:0}@media print,screen and (min-width:40em){h1.line:before,h2.line:before,h3.line:before,h4.line:before,h5.line:before,h6.line:before{left:2px}}h1.line.yellow:before,h2.line.yellow:before,h3.line.yellow:before,h4.line.yellow:before,h5.line.yellow:before,h6.line.yellow:before{background-color:#ffc70a}p{color:#212121;font-size:1.25rem;line-height:1.6;font-weight:400;letter-spacing:-.1px}p a{color:#212121;transition:color .25s linear;background-image:none;background-position:0 100%;background-repeat:repeat-x;background-size:100% .1rem;text-decoration:none}p a:hover{color:#283faf}ol,ul{padding-left:0px}ol li,ul li{color:#212121;line-height:36px}ol li ul,ul li ul{list-style-type:circle;padding-left:0;margin-bottom:10px}ol li ul li,ul li ul li{font-size:.9rem;line-height:10px}ol.inline,ul.inline{display:inline-block;display:flex;flex-wrap:wrap;flex-direction:row;padding-left:0;margin-left:0}ol.inline li,ul.inline li{padding:10px 0;margin:0 5%}ol li ul{list-style:lower-roman}.toggle{display:inline-block;width:40px;height:40px;position:absolute;right:5px;top:5px}@media (min-width:998px){.toggle{display:none}}.toggle span{width:75%;height:5px;display:block;background:#283faf;margin-bottom:5px;position:absolute;left:12.5%;-webkit-border-radius:4px;-moz-border-radius:4px;border-radius:4px}.toggle span:nth-of-type(1){top:5px}.toggle span:nth-of-type(2){top:13px}.cta{color:#283faf;padding:0;font-weight:700;opacity:.85;position:relative;text-decoration:none;background-image:none}.cta:after{content:'';width:30%;height:3px;background-color:#283faf;left:0;display:inline-block;bottom:-5px;position:absolute;transition:.25s cubic-bezier(.66,-.39,.41,1.35)}.cta:hover{opacity:1;color:#283faf;text-decoration:none}.cta:hover:after{width:100%}.search-toggle{display:none}@media (min-width:998px){.search-toggle{display:inline-block}}.search-toggle .icon{height:auto;width:auto;display:inline-block}.search-toggle .icon:hover i{color:#283faf}.search-toggle .icon i{font-size:1.35rem}.fill{display:block;width:100%}.full-image{height:50vh;background-size:cover}.full-image.full-height{height:100vh}.line-below{display:inline-block;width:100%;position:relative}.line-below.primary:after{background-color:#283faf}.line-below.secondary:after{background-color:#ffc70a}.line-below:after{content:'';width:100%;height:10px;position:absolute;left:0;bottom:0;z-index:1;-webkit-transform:scaleX(0);-ms-transform:scaleX(0);transform:scaleX(0);-webkit-transform-origin:100% 50%;-ms-transform-origin:100% 50%;transform-origin:100% 50%;transition:-webkit-transform .5s cubic-bezier(.23,1,.32,1);transition:transform .5s cubic-bezier(.23,1,.32,1);transition:transform .5s cubic-bezier(.23,1,.32,1),-webkit-transform .5s cubic-bezier(.23,1,.32,1)}.line-below:hover:after{-webkit-transform:scaleX(1);-ms-transform:scaleX(1);transform:scaleX(1);-webkit-transform-origin:0 50%;-ms-transform-origin:0 50%;transform-origin:0 50%}.line-left{display:inline-block;width:100%;position:relative}.line-left.primary:after{background-color:#283faf}.line-left.secondary:after{background-color:#ffc70a}.line-left:after{content:'';width:10px;height:100%;position:absolute;left:0;top:0;z-index:1;-webkit-transform:scaleX(0);-ms-transform:scaleX(0);transform:scaleX(0);transition:-webkit-transform .5s cubic-bezier(.23,1,.32,1);transition:transform .5s cubic-bezier(.23,1,.32,1);transition:transform .5s cubic-bezier(.23,1,.32,1),-webkit-transform .5s cubic-bezier(.23,1,.32,1)}.line-left:hover:after{-webkit-transform:scaleX(1);-ms-transform:scaleX(1);transform:scaleX(1)}.deck{font-size:1.85rem;padding-right:50px;line-height:36px;font-weight:600;margin-bottom:2rem}.icon{width:50px;height:50px;display:flex;flex-direction:row;align-items:center;border-radius:5px;position:relative}.icon.fb i{position:relative;bottom:-7px;right:-5px;font-size:2.25rem}.icon i{color:#565656;display:block;margin:0 auto;font-size:2rem}.icon.yellow{background:#ffc70a;transition:border-radius .4s}.icon.yellow:after{background:#283faf;z-index:0}.icon.yellow:hover{border-radius:0}.icon.yellow:hover i{color:#fff}.icon.yellow i{color:#212121;z-index:1}.icon.black{background:#212121}.icon.black i{color:#fff}.icon.border-yellow{border:1px solid #ffc70a}.icon.border-yellow i{color:#ffc70a}.icon.border-black{border:1px solid #212121}.icon.border-black i{color:#212121}.icon.circle{border-radius:50%}.icon.square{border-radius:0}[type=color],[type=date],[type=datetime-local],[type=datetime],[type=email],[type=month],[type=number],[type=password],[type=search],[type=tel],[type=text],[type=time],[type=url],[type=week]{box-shadow:none;border-radius:3px}.card{border-radius:5px;border:1px solid #c2c2c2}.card.no-border{border:none}.card.image-left,.card.image-right{flex-direction:row}.card.image-left .card-image,.card.image-right .card-image{flex-basis:50%;overflow:hidden;flex-basis:50%;overflow:hidden;display:inline-block}.card.image-left .card-content,.card.image-right .card-content{flex-basis:50%}.card .card-content{padding:15px}.primary-font{font-family:proxima-nova,sans-serif}.secondary-font{font-family:utopia-std,serif}.primary-color{color:#00205b!important}.secondary-color{color:#ffc70a}section.alert{background:#272727;padding:150px 0 75px;position:relative;z-index:10;margin-bottom:-100px;display:inline-block}@media (min-width:1024px){section.alert{padding:75px 0;margin-bottom:0}}section.alert .icon{margin:0 auto}section.alert .icon i{font-size:4rem;color:#ffc70a}@media (min-width:1024px){section.alert .icon i{font-size:3.5rem}}section.alert .content{color:#fff;font-family:proxima-nova,sans-serif;text-align:center}@media (min-width:1024px){section.alert .content{text-align:left}}section.alert .content .alert-title{font-size:30px;font-weight:900;line-height:32px;margin:30px 0 20px;color:#fff;display:inline-block}section.alert .content .alert-title:hover{color:#ffc70a;text-decoration:none}@media (min-width:1024px){section.alert .content .alert-title{margin:0 0 20px 0}}section.alert .content .alert-date{font-style:italic;font-size:16px;margin-bottom:30px}section.alert .content .alert-content{font-size:1.3rem}section.alert .content .alert-content .alt-link{opacity:.85;color:#fff;text-decoration:}section.alert .content .alert-content .alt-link:hover{color:#ffc70a;opacity:1}section.alert .content .alert-content a:hover{color:#ffc70a!important}section.alert{padding:110px 30px 25px!important}@media (min-width:1024px){section.alert{padding:35px 0!important}}section.alert .content .alert-content{font-size:1rem!important;text-align:left!important}.cta_two{padding:10px 20px;font-weight:900;font-size:1.25rem;transition:.35s cubic-bezier(.23,1,.32,1);width:100%;text-align:center;display:inline-block}.cta_two i{margin-left:5px;position:relative;top:-1px;right:0;transition:margin-left .35s cubic-bezier(.23,1,.32,1),right .35s cubic-bezier(.23,1,.32,1);font-size:.75rem}@media print,screen and (min-width:40em){.cta_two{width:auto}}.cta_two.yellow{background:#ffc70a;color:#292929}.cta_two.yellow:hover i{color:#ffc70a}.cta_two.black{background:#212121;color:#fff}.cta_two.black:hover i{color:#212121}.cta_two:hover{background:0 0;color:#212121}.cta_two:hover i{margin-left:10px;right:-2px;transition:.35s cubic-bezier(.23,1,.32,1)}.cta_sub span{font-weight:900;transition:.35s cubic-bezier(.23,1,.32,1);color:#212121;font-size:1rem;padding:5px 0;margin:25px auto;width:fit-content;width:-moz-fit-content;position:relative;display:inline-block;display:block}.cta_sub span:after{position:absolute;left:0;bottom:0;width:0%;height:2px;background-color:#ffc70a;content:'';transition:.25s cubic-bezier(.66,-.39,.41,1.35)}.cta_sub span:hover:after{width:100%}@media print,screen and (min-width:40em){.cta_sub span{float:right;margin-top:40px;display:inline-block}}@media print,screen and (min-width:64em){.cta_sub span{font-size:1.25rem}}.cta_sub span:after{width:100%}.cta_sub span:hover{color:#212121;background:#ffc70a;padding:5px 10px}.cta_sub span:hover i{margin-left:10px;color:#212121}.cta_sub span i{margin-left:5px;position:relative;top:-2px;right:0;transition:margin-left .35s cubic-bezier(.23,1,.32,1),right .35s cubic-bezier(.23,1,.32,1);font-size:.75rem}.animate .section-title{opacity:0;transform:translateX(-25px);transition:.4s;transition-delay:.3s}.animate .cta_sub{opacity:0;transform:translateX(25px);transition:.4s;transition-delay:.3s}.animate.transition-in .section-title{opacity:1;transform:translateX(0)}.animate.transition-in .cta_sub{opacity:1;transform:translateX(0)}.news{padding:100px 2.5% 75px;z-index:1;position:relative}.news .column:nth-of-type(2),.news .columns:nth-of-type(2){margin:20px 0}@media (min-width:768px){.news .column:nth-of-type(2),.news .columns:nth-of-type(2){margin:0}}@media (min-width:768px){.news .column,.news .columns{width:33%}}.news .column.news-title,.news .news-title.columns{width:100%}@media (min-width:768px){.news .column.news-title,.news .news-title.columns{width:50%}}@media print,screen and (min-width:40em){.news{padding:100px 0 75px}}.news .top-row{margin-top:25px;margin-bottom:25px;position:relative;display:flex;flex-wrap:wrap}.news .top-row .news-items:nth-of-type(1){transform:translateX(-25px)}.news .top-row .news-items:nth-of-type(2){transform:translateX(0)}.news .top-row .news-items:nth-of-type(3){transform:translateX(25px)}.news .bottom-row{position:relative;display:flex;flex-wrap:wrap}.news .bottom-row .news-items:nth-of-type(1){transform:translateX(-25px)}.news .bottom-row .news-items:nth-of-type(2){transform:translateX(0)}.news .bottom-row .news-items:nth-of-type(3){transform:translateX(25px)}.news .news-items{position:relative;margin-bottom:10px;opacity:0;transition:.35s;transition-delay:.2s;display:inline-flex;flex-direction:column;height:inherit;min-height:100%;height:inherit;background:#fff;width:100%}.news .news-items .cat{font-size:1rem;font-weight:100;color:#212121;padding:5px 10px;background:#ffc70a;position:relative;width:fit-content;width:-moz-fit-content;margin-bottom:20px}@media all and (-ms-high-contrast:none),(-ms-high-contrast:active){.news .news-items .cat{display:table}}.news .news-items:hover .news-item--text .title{color:#ffc70a}.news .news-items .news-item--image{width:100%;height:350px;overflow:hidden;background:#212121}@media (min-width:768px){.news .news-items .news-item--image{height:225px}}@media (min-width:998px){.news .news-items .news-item--image{height:250px}}@media (min-width:1255px){.news .news-items .news-item--image{height:350px}}.news .news-items .news-item--text{height:50%;position:relative;bottom:0;background:#fff;padding:20px 10px 45px 30px;transition:.4s cubic-bezier(.8,-.08,.36,1.35)}.news-item--text .title{font-family:proxima-nova,sans-serif;font-size:1.3rem;line-height:22px;color:#212121;margin-bottom:20px;transition:.4s cubic-bezier(.8,-.08,.36,1.35);font-weight:900;width:90%}@media print,screen and (min-width:64em){.news-item--text .title{font-size:1.4rem;line-height:28px}}.news-item--text .text{font-size:1.15rem;width:90%;color:#565656}.transition-in .news-items{opacity:1;transform:translateX(0)!important}.events{;background:#f4f4f4}.events .cta_two{margin-top:0;margin-bottom:50px}@media print,screen and (min-width:40em){.events .cta_two{margin-top:30px}}.events .events-row{display:flex;flex-direction:column}@media print,screen and (min-width:64em){.events .events-row{flex-direction:row}}.events .events-items{font-family:proxima-nova; margin-top:25px;position:relative;transition:.5s;opacity:0;transition-delay:.2s;display:inline-flex}.events .events-items:nth-of-type(1){transform:translateX(-35px)}.events .events-items:nth-of-type(1) .events-item--text{background:#303030}.events .events-items:nth-of-type(1) .events-item--text .title{color:#fff}.events .events-items:nth-of-type(1) .events-item--text .date{font-family:proxima-nova; color:#ffffff;border-color:#ffffff}.events .events-items:nth-of-type(1) .events-item--text .time{color:#fff}.events .events-items:nth-of-type(1) .events-item--text .event{color:#ffffff}.events .events-items:nth-of-type(1) .events-item--text .location{color:#fff}.events .events-items:nth-of-type(2) .events-item--text{background:#ffffff}.events .events-items:nth-of-type(2) .events-item--text .title{color:#303030}.events .events-items:nth-of-type(2) .events-item--text .date{color:#303030; border-color: #303030}.events .events-items:nth-of-type(2) .events-item--text .time{color:#303030}.events .events-items:nth-of-type(2) .events-item--text .event{color:#303030}.events .events-items:nth-of-type(2) .events-item--text .location{color:#303030}.events .events-items:nth-of-type(3){transform:translateX(35px)}.events .events-items:nth-of-type(3) .events-item--text{background:#ffc70a} .events-item1--text{background:#ffc70a}.events .events-items:nth-of-type(3) .events-item--text .title{color:#303030}.events .events-items:nth-of-type(3) .events-item--text .date{color:#303030}.events .events-items:nth-of-type(3) .events-item--text .time{color:#303030}.events .events-items:nth-of-type(3) .events-item--text .location{color:#303030}.events .events-items:nth-of-type(3) .events-item--text .event{color:}.events .events-items:nth-of-type(3) .events-item--text .event:after{background:#ffffff}.events .events-items:nth-of-type(3) .events-item--text .event:hover{color:#ffffff}.events .events-items:hover .event{padding:25px 55px}.events .events-items:hover .event:after{transform:translateX(0)}.events .events-items:hover:nth-of-type(1) .event{color:#303030}.events .events-items:hover:nth-of-type(3) .event{color:#ffffff}.events .events-items .events-item--text{position:relative;padding:45px;transition:.5s;width:100%}@media print,screen and (min-width:64em){.events .events-items .events-item--text{padding:50px}}@media screen and (min-width:75em){.events .events-items .events-item--text{padding:65px}}.events .transition-in.events-items{opacity:1;transform:translateX(0)}.events-item--text .title{font-family:proxima-nova,sans-serif;font-size:1.65rem;line-height:28px;color:#303030;font-weight:900;margin-bottom:30px;transition:.4s cubic-bezier(.8,-.08,.36,1.35)}.events-item--text .title span{display:block;text-transform:uppercase;font-weight:100;font-size:1.2rem}@media print,screen and (min-width:64em){.events-item--text .title{font-size:1.65rem;line-height:28px}}@media screen and (min-width:75em){.events-item--text .title{font-size:1.7rem;line-height:30px}}@media screen and (min-width:115em){.events-item--text .title{font-size:2rem;line-height:34px}}.events-item--text .event_information{position:relative;width:100%;margin-bottom:30px}.events-item--text .date{color:#565656;font-size:1.15rem;font-weight:900;margin:0 0 20px 0;padding-bottom:5px;border-bottom:1px solid #000}@media print,screen and (min-width:64em){.events-item--text .date{font-size:1.25rem}}.events-item--text .date i{padding-right:10px}.events-item--text .time{font-size:1.1rem;margin:0 0 10px 0;color:#565656}.events-item--text .time i{padding-right:10px}.events-item--text .location{font-size:1.1rem;margin:0;color:#565656;width:90%;padding-left:26px;line-height:22px}.events-item--text .location i{font-size:1.45rem;padding:0 10px 0 2px;position:absolute;left:0}.events-item--text .event{position:absolute;bottom:0;left:0;right:0;padding:25px 75px;color:#212121;font-weight:900;overflow:hidden;transition:.35s}.events-item--text .event:after{content:'';width:100%;position:absolute;background:#ffc70a;height:100%;top:0;left:0;z-index:0;transform:translateX(-101%);transition:.35s}.events-item--text .event span{position:relative;z-index:1;display:block;width:100%}.events-item--text .event span i{position:absolute;right:0;top:10px;transition:margin-left .35s cubic-bezier(.23,1,.32,1),right .35s cubic-bezier(.23,1,.32,1);font-size:.75rem}.stripe{padding:0 0 65px;margin:0;position:relative;width:100%}@media (max-width:998px){.stripe{background:#ffc70a!important}}@media print,screen and (min-width:64em){.stripe{padding:100px 0 65px}}.stripe .row{display:flex;flex-wrap:wrap}.stripe .row .columns{display:inline-flex}.stripe .row .columns .stripe-content{display:inline-flex;flex-direction:column;justify-content:center;padding:0 5%}@media print,screen and (min-width:64em){.stripe{background:#fff;background:-moz-linear-gradient(top,#fff 0,#f1f1f1 50%,#e1e1e1 51%,#f4f4f4 100%);background:-webkit-linear-gradient(top,#fff 0,#f1f1f1 50%,#e1e1e1 51%,#f4f4f4 100%);background:linear-gradient(to bottom,#fff 0,#f1f1f1 50%,#e1e1e1 51%,#f4f4f4 100%)}}.stripe .stripe-video{position:relative;z-index:1;transform:translateX(-50px);opacity:0;transition:.35s}.stripe .stripe-video:after{content:'';left:0;top:0;position:absolute;width:100%;height:100%;background:#000;background:linear-gradient(0deg,#000 0,rgba(0,0,0,0) 35%)}@media print,screen and (min-width:40em){.stripe .stripe-video{height:75vh;min-height:600px;overflow:hidden}}@media screen and (min-width:115em){.stripe .stripe-video{height:auto}}.stripe .stripe-video video{width:100%;position:relative}@media print,screen and (min-width:40em){.stripe .stripe-video video{width:auto;height:100%;left:-25%}}@media screen and (min-width:90em){.stripe .stripe-video video{left:0}}@media screen and (min-width:115em){.stripe .stripe-video video{width:110%;height:auto}}.stripe .stripe-video #media-open{position:absolute;bottom:30px;right:30px;z-index:1;border:2px solid #fff;transition:.3s;cursor:pointer}.stripe .stripe-video #media-open .watch-title{font-family:proxima-nova,sans-serif;color:#fff;position:absolute;left:-175px;width:175px;font-weight:700;transform:translateX(0);opacity:1;transition:.3s;font-size:1.35rem}.stripe .stripe-video #media-open:hover{opacity:1;background:#283faf;border-color:#283faf}.stripe .stripe-video #media-open:hover .watch-title{transform:translateX(-10px)}.stripe .stripe-video #media-open:hover i{color:#fff}.stripe .stripe-video #media-open i{color:#fff;font-size:1.5rem;position:relative}.stripe .stripe-video #media-open .fa-play{display:block;right:-2px;top:1px}.stripe .stripe-video.stripe-video:after{display:none}.stripe .stripe-content{width:90%;margin:30px auto 0;opacity:0;transition:.35s;transition-delay:.2s}@media print,screen and (min-width:64em){.stripe .stripe-content{width:100%}}@media screen and (min-width:90em){.stripe .stripe-content{width:70%;max-width:620px;padding:0 0 0 80px;margin:0}}.stripe .stripe-content:after{content:'';position:absolute;height:55vh;background:#ffc70a;width:100%;right:0;top:0;z-index:0}@media print,screen and (min-width:64em){.stripe .stripe-content:after{width:55%;height:100%}}.stripe .stripe-content h2{font-size:2.65rem;margin-bottom:60px;line-height:42px;color:#212121;width:90%;z-index:1;padding-top:30px}@media print,screen and (min-width:40em){.stripe .stripe-content h2{padding-top:0;font-size:3rem;line-height:56px}}@media screen and (min-width:75em){.stripe .stripe-content h2{font-size:3.65rem;line-height:64px}}.stripe .stripe-content h2,.stripe .stripe-content h3,.stripe .stripe-content h4,.stripe .stripe-content h5,.stripe .stripe-content h6{position:relative;z-index:1}.stripe .stripe-content p{position:relative;z-index:1}.stripe .cta_sub{position:relative;margin-top:50px;float:left;padding-left:0;z-index:1;transition:none;width:fit-content;width:-moz-fit-content}.stripe .cta_sub span:after{display:none!important}.stripe .cta_sub span{margin:0 auto;padding:5px 10px;border:2px solid #303030;color:#303030;float:left;transition:.25s cubic-bezier(.66,-.39,.41,1.35)}.stripe .cta_sub span i{transition:.1s}.stripe .cta_sub:hover{color:#ffc70a}.stripe .cta_sub:hover span{padding:5px 20px;color:#ffc70a;background:#303030}.stripe .cta_sub:hover i{color:#ffc70a}#video-section{position:fixed;height:100vh;top:0;left:0;right:0;background:rgba(0,0,0,0);transform:translateY(-100%);transition:background .3s,transform 10ms .4s;z-index:1000}#video-section .video-section--inner{position:relative;background:#fff;width:95%;z-index:1;padding:50px 25px 25px 25px;transform:translateY(-100%);transition:.6s cubic-bezier(.8,-.05,.36,1.05);margin:0 auto;max-width:1075px}.open-video #video-section{transform:translateY(0);background:rgba(0,0,0,.8);transition:transform 10ms,background .3s .01s}.open-video #video-section .video-section--inner{transform:translateY(25px)}.transition-in.stripe-video{opacity:1;transform:translateX(0)}.transition-in.stripe-content{opacity:1}.stripe-two{position:relative;padding-top:0}@media print,screen and (min-width:40em){.stripe-two{top:-50px;margin-bottom:-100px}}.stripe-two .stripe-two--image{padding:0;opacity:0;transform:translateY(30px);transition:.4s .5s}@media print,screen and (min-width:40em){.stripe-two .stripe-two--image{height:600px;overflow:hidden;padding-right:.625rem;padding-left:.625rem}}.stripe-two .stripe-two--text{background:#fff;position:relative;padding-top:35px}.stripe-two .stripe-two--text .section-title{opacity:0;transform:translateY(30px);transition:.4s;transition-delay:.5s}.stripe-two .stripe-two--text .column:nth-of-type(2),.stripe-two .stripe-two--text .columns:nth-of-type(2){opacity:0;transform:translateY(30px);transition:.4s;transition-delay:.75s}@media screen and (min-width:75em){.stripe-two .stripe-two--text{max-width:70%;top:-50px;padding:35px}}@media screen and (min-width:115em){.stripe-two .stripe-two--text{max-width:50%}}.stripe-two .stripe-two--text .cta_sub{margin-top:20px}.transition-in .stripe-two--image{opacity:1;transform:translateY(0)}.transition-in.stripe-two--text .section-title{opacity:1;transform:translateY(0)}.transition-in.stripe-two--text .column:nth-of-type(2),.transition-in.stripe-two--text .columns:nth-of-type(2){opacity:1;transform:translateY(0)}@media print,screen and (min-width:64em){.card-row{padding:1rem 0}}.four_search{position:relative;display:block}.four_search .fa-search{position:absolute;top:21px;right:110px;display:inline-block;font-size:1.15rem;opacity:1;color:#fff;text-indent:0}body{transition:.35s cubic-bezier(.23,1,.32,1);left:0}.search-close{display:none;position:absolute;top:40px;right:30px;cursor:pointer;color:#303030;transition:.35s}.search-close:hover{color:#283faf}.search-close i{font-size:2rem}.cta_main{position:relative;padding:0;font-weight:900;transition:.35s;margin:0;width:fit-content;width:-moz-fit-content;display:block;margin:0 auto}.cta_main:hover{background:0 0}.cta_main:hover span{background:#ffc70a;color:#212121}.cta_main:hover span i{color:inherit;margin-left:5px}.cta_main span{position:relative;z-index:1;display:block;width:fit-content;color:#212121;border:2px solid #ffc70a;background:0 0;padding:5px 20px;transition:.25s cubic-bezier(.66,-.39,.41,1.35);float:none;margin:0 auto}.cta_main span i{position:relative;top:-1px;transition:margin-left .35s cubic-bezier(.23,1,.32,1),right .35s cubic-bezier(.23,1,.32,1);font-size:.75rem;margin-left:3px}.card-section{background:#f4f4f4;padding:100px 0}.image-section .section-image{margin-top:3.5rem}.section-image.w-cta{height:600px;overflow:hidden;position:relative;display:inline-block;background:#000}.border-top{border-top:1px solid #f4f4f4}.list-row{margin-bottom:3rem}.list-section .list-item .list-item--inner{margin-bottom:3rem;padding-left:2rem}.list-section .list-item .list-item--inner h4{font-size:1.3rem}.list-section .list-item .list-item--inner ul{list-style:none;padding:0;margin:0}.list-section .list-item .list-item--inner ul li{padding-left:20px;margin:10px 0;border-left:3px solid #ffc70a;line-height:30px}.list-content{list-style:none;padding:0;margin:0}.list-content h5{text-transform:uppercase;font-weight:100;font-size:1.25rem;margin-bottom:15px}.list-content h4{margin-bottom:5px}.list-content p{font-size:1rem}.list-content ul{padding-left:25px;list-style:disc}.list-content ul li{padding:5px 0;margin:0 auto;line-height:20px;border:none;font-size:1.15rem}.list-content li{padding:30px 0 20px;margin:20px auto;line-height:26px;position:relative;border-top:1px solid #f4f4f4}.list-content li:first-of-type{padding-top:0;margin-top:0;border-top:0}.list-content li .list-content--information{display:inline-block;width:90%}.list-content li .list-content--information .title_one{font-size:1.8rem;opacity:.45;margin-bottom:15px}.list-content li .cta_sub{float:none}.list-title{font-size:2.5rem;font-weight:900;color:#212121;width:fit-content;position:relative;line-height:36px}.item-list{counter-reset:items;list-style-type:none}.item-list .cta_sub{float:none;margin-top:10px;padding:0}.item-list .cta_sub:hover{padding:0 10px}.staff{padding-top:50px;padding-bottom:50px}.staff a{display:inline-block}.staff .person-image{overflow:hidden}.person-information{padding-left:10px}.person-information h4{transition:.35s cubic-bezier(.23,1,.32,1)}.person-information p{font-weight:700;font-size:.9rem;line-height:20px;margin-top:5px;width:90%;color:#4e4e4e}.section-one{background:#fff;padding:0 0 25px 0;position:relative;z-index:1}.section-one{padding:0 2.5% 50px 2.5%} @import url(https://p.typekit.net/p.css?s=1&k=ziq2akc&ht=tk&f=137.139.140.173.174.175.176.143.144.145.147.148.156.157.161.162.13378.13379.13380.18220.18223&a=9842748&app=typekit&e=css);@font-face{font-family:proxima-nova;src:url(https://use.typekit.net/af/b683e3/00000000000000003b9b306c/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n9&v=3) format(\"woff2\"),url(https://use.typekit.net/af/b683e3/00000000000000003b9b306c/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n9&v=3) format(\"woff\"),url(https://use.typekit.net/af/b683e3/00000000000000003b9b306c/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n9&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:900}@font-face{font-family:proxima-nova;src:url(https://use.typekit.net/af/949f99/00000000000000003b9b3068/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff2\"),url(https://use.typekit.net/af/949f99/00000000000000003b9b3068/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff\"),url(https://use.typekit.net/af/949f99/00000000000000003b9b3068/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:700}@font-face{font-family:proxima-nova;src:url(https://use.typekit.net/af/4c4052/00000000000000003b9b3069/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i7&v=3) format(\"woff2\"),url(https://use.typekit.net/af/4c4052/00000000000000003b9b3069/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i7&v=3) format(\"woff\"),url(https://use.typekit.net/af/4c4052/00000000000000003b9b3069/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i7&v=3) format(\"opentype\");font-display:auto;font-style:italic;font-weight:700}@font-face{font-family:proxima-nova;src:url(https://use.typekit.net/af/576d53/00000000000000003b9b3066/27/l?subset_id=2&fvd=n6&v=3) format(\"woff2\"),url(https://use.typekit.net/af/576d53/00000000000000003b9b3066/27/d?subset_id=2&fvd=n6&v=3) format(\"woff\"),url(https://use.typekit.net/af/576d53/00000000000000003b9b3066/27/a?subset_id=2&fvd=n6&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:600}@font-face{font-family:proxima-nova;src:url(https://use.typekit.net/af/f7d492/00000000000000003b9b3067/27/l?subset_id=2&fvd=i6&v=3) format(\"woff2\"),url(https://use.typekit.net/af/f7d492/00000000000000003b9b3067/27/d?subset_id=2&fvd=i6&v=3) format(\"woff\"),url(https://use.typekit.net/af/f7d492/00000000000000003b9b3067/27/a?subset_id=2&fvd=i6&v=3) format(\"opentype\");font-display:auto;font-style:italic;font-weight:600}@font-face{font-family:proxima-nova;src:url(https://use.typekit.net/af/705e94/00000000000000003b9b3062/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff2\"),url(https://use.typekit.net/af/705e94/00000000000000003b9b3062/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff\"),url(https://use.typekit.net/af/705e94/00000000000000003b9b3062/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:400}@font-face{font-family:proxima-nova;src:url(https://use.typekit.net/af/5c70f2/00000000000000003b9b3063/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"woff2\"),url(https://use.typekit.net/af/5c70f2/00000000000000003b9b3063/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"woff\"),url(https://use.typekit.net/af/5c70f2/00000000000000003b9b3063/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"opentype\");font-display:auto;font-style:italic;font-weight:400}@font-face{font-family:proxima-nova-condensed;src:url(https://use.typekit.net/af/0ff5e1/00000000000000003b9b3078/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff2\"),url(https://use.typekit.net/af/0ff5e1/00000000000000003b9b3078/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff\"),url(https://use.typekit.net/af/0ff5e1/00000000000000003b9b3078/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:700}@font-face{font-family:proxima-nova-condensed;src:url(https://use.typekit.net/af/519896/00000000000000003b9b3079/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i7&v=3) format(\"woff2\"),url(https://use.typekit.net/af/519896/00000000000000003b9b3079/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i7&v=3) format(\"woff\"),url(https://use.typekit.net/af/519896/00000000000000003b9b3079/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i7&v=3) format(\"opentype\");font-display:auto;font-style:italic;font-weight:700}@font-face{font-family:proxima-nova-condensed;src:url(https://use.typekit.net/af/30f4b6/00000000000000003b9b3070/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n3&v=3) format(\"woff2\"),url(https://use.typekit.net/af/30f4b6/00000000000000003b9b3070/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n3&v=3) format(\"woff\"),url(https://use.typekit.net/af/30f4b6/00000000000000003b9b3070/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n3&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:300}@font-face{font-family:proxima-nova-condensed;src:url(https://use.typekit.net/af/8e2bbd/00000000000000003b9b3072/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff2\"),url(https://use.typekit.net/af/8e2bbd/00000000000000003b9b3072/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff\"),url(https://use.typekit.net/af/8e2bbd/00000000000000003b9b3072/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:400}@font-face{font-family:proxima-nova-condensed;src:url(https://use.typekit.net/af/5364bc/00000000000000003b9b3073/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"woff2\"),url(https://use.typekit.net/af/5364bc/00000000000000003b9b3073/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"woff\"),url(https://use.typekit.net/af/5364bc/00000000000000003b9b3073/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"opentype\");font-display:auto;font-style:italic;font-weight:400}@font-face{font-family:proxima-nova-extra-condensed;src:url(https://use.typekit.net/af/4a329e/00000000000000003b9b3089/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i7&v=3) format(\"woff2\"),url(https://use.typekit.net/af/4a329e/00000000000000003b9b3089/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i7&v=3) format(\"woff\"),url(https://use.typekit.net/af/4a329e/00000000000000003b9b3089/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i7&v=3) format(\"opentype\");font-display:auto;font-style:italic;font-weight:700}@font-face{font-family:proxima-nova-extra-condensed;src:url(https://use.typekit.net/af/7b18df/00000000000000003b9b3088/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff2\"),url(https://use.typekit.net/af/7b18df/00000000000000003b9b3088/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff\"),url(https://use.typekit.net/af/7b18df/00000000000000003b9b3088/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:700}@font-face{font-family:proxima-nova-extra-condensed;src:url(https://use.typekit.net/af/bcf2f4/00000000000000003b9b3083/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"woff2\"),url(https://use.typekit.net/af/bcf2f4/00000000000000003b9b3083/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"woff\"),url(https://use.typekit.net/af/bcf2f4/00000000000000003b9b3083/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"opentype\");font-display:auto;font-style:italic;font-weight:400}@font-face{font-family:proxima-nova-extra-condensed;src:url(https://use.typekit.net/af/0dfb3d/00000000000000003b9b3082/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff2\"),url(https://use.typekit.net/af/0dfb3d/00000000000000003b9b3082/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff\"),url(https://use.typekit.net/af/0dfb3d/00000000000000003b9b3082/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:400}@font-face{font-family:utopia-std;src:url(https://use.typekit.net/af/9ff5df/0000000000000000000131a3/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff2\"),url(https://use.typekit.net/af/9ff5df/0000000000000000000131a3/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff\"),url(https://use.typekit.net/af/9ff5df/0000000000000000000131a3/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:400}@font-face{font-family:utopia-std;src:url(https://use.typekit.net/af/aeaf25/0000000000000000000131a2/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"woff2\"),url(https://use.typekit.net/af/aeaf25/0000000000000000000131a2/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"woff\"),url(https://use.typekit.net/af/aeaf25/0000000000000000000131a2/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=i4&v=3) format(\"opentype\");font-display:auto;font-style:italic;font-weight:400}@font-face{font-family:utopia-std;src:url(https://use.typekit.net/af/6ebf8d/0000000000000000000131a0/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff2\"),url(https://use.typekit.net/af/6ebf8d/0000000000000000000131a0/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff\"),url(https://use.typekit.net/af/6ebf8d/0000000000000000000131a0/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:700}@font-face{font-family:utopia-std-caption;src:url(https://use.typekit.net/af/a59f0f/00000000000000000001304a/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff2\"),url(https://use.typekit.net/af/a59f0f/00000000000000000001304a/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"woff\"),url(https://use.typekit.net/af/a59f0f/00000000000000000001304a/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n7&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:700}@font-face{font-family:utopia-std-caption;src:url(https://use.typekit.net/af/e05473/00000000000000000001304d/27/l?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff2\"),url(https://use.typekit.net/af/e05473/00000000000000000001304d/27/d?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"woff\"),url(https://use.typekit.net/af/e05473/00000000000000000001304d/27/a?primer=7cdcb44be4a7db8877ffa5c0007b8dd865b3bbc383831fe2ea177f62257a9191&fvd=n4&v=3) format(\"opentype\");font-display:auto;font-style:normal;font-weight:400} body{background-color:transparent}.main{background-color:transparent}.content{height:auto!important}@page{margin-bottom:1.5cm;margin-top:1.5cm} @font-face{font-family:'Open Sans';font-style:normal;font-weight:400;src:url(https://fonts.gstatic.com/s/opensans/v18/mem8YaGs126MiZpBA-UFWJ0bf8pkAp6a.woff2) format('woff2');unicode-range:U+0460-052F,U+1C80-1C88,U+20B4,U+2DE0-2DFF,U+A640-A69F,U+FE2E-FE2F}@font-face{font-family:'Open Sans';font-style:normal;font-weight:400;src:url(https://fonts.gstatic.com/s/opensans/v18/mem8YaGs126MiZpBA-UFUZ0bf8pkAp6a.woff2) format('woff2');unicode-range:U+0400-045F,U+0490-0491,U+04B0-04B1,U+2116}@font-face{font-family:'Open Sans';font-style:normal;font-weight:400;src:url(https://fonts.gstatic.com/s/opensans/v18/mem8YaGs126MiZpBA-UFWZ0bf8pkAp6a.woff2) format('woff2');unicode-range:U+1F00-1FFF}@font-face{font-family:'Open Sans';font-style:normal;font-weight:400;src:url(https://fonts.gstatic.com/s/opensans/v18/mem8YaGs126MiZpBA-UFVp0bf8pkAp6a.woff2) format('woff2');unicode-range:U+0370-03FF}@font-face{font-family:'Open Sans';font-style:normal;font-weight:400;src:url(https://fonts.gstatic.com/s/opensans/v18/mem8YaGs126MiZpBA-UFWp0bf8pkAp6a.woff2) format('woff2');unicode-range:U+0102-0103,U+0110-0111,U+0128-0129,U+0168-0169,U+01A0-01A1,U+01AF-01B0,U+1EA0-1EF9,U+20AB}@font-face{font-family:'Open Sans';font-style:normal;font-weight:400;src:url(https://fonts.gstatic.com/s/opensans/v18/mem8YaGs126MiZpBA-UFW50bf8pkAp6a.woff2) format('woff2');unicode-range:U+0100-024F,U+0259,U+1E00-1EFF,U+2020,U+20A0-20AB,U+20AD-20CF,U+2113,U+2C60-2C7F,U+A720-A7FF}@font-face{font-family:'Open Sans';font-style:normal;font-weight:400;src:url(https://fonts.gstatic.com/s/opensans/v18/mem8YaGs126MiZpBA-UFVZ0bf8pkAg.woff2) format('woff2');unicode-range:U+0000-00FF,U+0131,U+0152-0153,U+02BB-02BC,U+02C6,U+02DA,U+02DC,U+2000-206F,U+2074,U+20AC,U+2122,U+2191,U+2193,U+2212,U+2215,U+FEFF,U+FFFD} .title{height:auto;} .events-item--text1 .event1::after { content: ''; width: 100%; position: absolute; background: #ffc70a!important; height: 100%; top: 0; left: 0; z-index: 0; transform: translateX(-101%); transition: .35s; } .events-item--text2 .event2::after { content: ''; width: 100%; position: absolute; background: #ffc70a!important; height: 100%; top: 0; left: 0; z-index: 0; transform: translateX(-101%); transition: .35s; } .events-item--text3 .event3::after { content: ''; width: 100%; position: absolute; background: #303030!important; height: 100%; top: 0; left: 0; z-index: 0; transform: translateX(-101%); transition: .35s; } .events .events-items:nth-of-type(3) .events-item--text .event { color: #303030 } .events .events-items:nth-of-type(2) .events-item--text .event { color: #303030 } .events .events-items:nth-of-type(3) .events-item--text .date { bored-color: #303030; } .events .events-items:hover:nth-of-type(3) .event { color: #ffffff; } .events .events-items:hover:nth-of-type(2) .event { color: #303030; } Upcoming events Explore more events May–June ENGAGEMENT Dandelion Days Various locations See event details May 22 PROFESSIONAL DEVELOPMENT Panel on debt capital markets with the Real Estate Network 8:30 – 10:30 a.m. (ET) Polsinelli Law Firm See event details June 14 RESEARCH The Rochester Forum 9 a.m. - 1:30 p.m. (ET) Memorial Art Gallery See event details Experience Rochester events Explore all events The Sloan Performing Arts Center The 30,000-square-foot Sloan Performing Arts Center had its soft opening at the end of August, adding a much-anticipated new building to the University of Rochester’s River Campus in time for the fall semester. The building will be fully functional by the end of the calendar year. The Sloan Center is made possible thanks to the generosity of University Life Trustee Thomas Sloan ’65, ’67 (MS) and Linda Sloan ’67 and other lead donors. Read more about the Sloan Center and get a behind-the-scenes look at artist Jay Yan’s installation of a specially commissioned mosaic that will span most of the building’s interior. Read more The Sloan Performing Arts Center The 30,000-square-foot Sloan Performing Arts Center had its soft opening at the end of August, adding a much-anticipated new building to the University of Rochester’s River Campus in time for the fall semester. The building will be fully functional by the end of the calendar year. The Sloan Center is made possible thanks to the generosity of University Life Trustee Thomas Sloan ’65, ’67 (MS) and Linda Sloan ’67 and other lead donors. Read more about the Sloan Center and get a behind-the-scenes look at artist Jay Yan’s installation of a specially commissioned mosaic that will span most of the building’s interior. Read more Catch us on social Catch us on social Contact advcomm@rochester.edu giftoffice@admin.rochester.edu (585) 273-2700 Larry and Cindy Bloch Alumni and Advancement Center 300 East River Road Rochester, NY 14627 Explore Alumni website Careers and internships Schools and programs How to give Helpful links Advancement executive team Advancement intranet University of Rochester home URMC home Diversity, equity & inclusion Nondiscrimination & Title IX © University of Rochester 1999-2023 window.dataLayer = window.dataLayer || []; function gtag(){dataLayer.push(arguments);} gtag('js', new Date()); gtag('config', 'UA-2917298-1'); WordPress PopUp Plugin /* <![CDATA[ */ var thickboxL10n = {\"next\":\"Next >\",\"prev\":\"< Prev\",\"image\":\"Image\",\"of\":\"of\",\"close\":\"Close\",\"noiframes\":\"This feature requires inline frames. You have iframes disabled or your browser does not support them.\",\"loadingAnimation\":\"https:\\/\\/www.rochester.edu\\/advancement\\/wp-includes\\/js\\/thickbox\\/loadingAnimation.gif\"}; /* ]]> */ /* <![CDATA[ */ var onionbuzz_lng = {\"Correct\":\"Correct!\",\"Wrong\":\"Wrong!\",\"Question\":\"Question\",\"Slide\":\"Slide\",\"email_form_thank_you\":\"Thank you, your sign-up request was successful! Please check your e-mail inbox.\",\"email_form_valid_email\":\"Enter valid email.\",\"quiz_noresult_i_got\":\"I got\",\"quiz_noresult_of\":\"of\",\"quiz_noresult_right\":\"right\",\"quiz_noresult_you_checked\":\"You checked\",\"quiz_noresult_i_checked\":\"I checked\",\"quiz_noresult_out_of\":\"out of\",\"quiz_noresult_on_this_list\":\"on this list!\",\"quiz_score\":\"Score:\"}; /* ]]> */ /* <![CDATA[ */ var mkdLike = {\"ajaxurl\":\"https:\\/\\/www.rochester.edu\\/advancement\\/wp-admin\\/admin-ajax.php\"}; /* ]]> */ /* <![CDATA[ */ var vcData = {\"currentTheme\":{\"slug\":\"onyx-2\"}}; /* ]]> */ "}
]