[
  {
    "id": 10,
    "date": "2024-05-22T19:35:55.161131",
    "url": "https://www.upenn.edu/admissions",
    "university_name": "University of Pensylvania",
    "title": "Breadcrumb",
    "content": "Skip to main content Go to site search Go to primary navigation Go to resources navigation Penn Home Toggle Site Navigation Toggle Site Search Academics More Academics Undergraduate Graduate Schools Global Initiatives Interdisciplinary Online Learning Off-campus Learning Libraries Admissions & Aid Athletics Research & Innovation More Research & Innovation Research Enterprise Research News Life at Penn More Life at Penn Arts & Culture Community Involvement More Community Involvement Penn & Philadelphia Diversity Groups & Organizations Housing & Dining Health & Wellness Safety & Security More Safety & Security Emergency Contacts Emergency Preparedness Spirituality & Religion About More About Office of the President Trustees & Administration In Principle and Practice History Securing a Sustainable Future More Securing a Sustainable Future Climate Investments Sustainability Initiatives Research & Teaching News & Announcements News, Media, & Communication Services FAQ Policies Facts Toggle Site Search Resources Current Students Faculty & Staff Parents Alumni Visitors A-Z Directory Webmail Services Give to Penn Search Search Close Breadcrumb Home / Admissions & Aid Admissions & Aid Penn (also known as UPenn) is committed to making its inclusive, innovative, and impactful Ivy League education available to the best and brightest students, regardless of their economic circumstances. A generous financial aid budget and inclusive aid policies make matriculating at Penn an attainable goal for students from the widest possible range of backgrounds. Every day, Penn embodies this truth: Our unique perspectives and backgrounds brought together make us strong, resilient, and singularly prepared to define the future. Applying to Penn The college application process is a meaningful journey that encourages students to reflect on themselves, their community, and their interests. Your voice matters, and we can’t wait to hear your story. Undergraduate Admissions When applying to Penn, undergraduates are asked to choose one of the University’s four undergraduate schools (the College, Wharton, Penn Engineering, or Penn Nursing), or a coordinated dual-degree, accelerated, or specialized program that will serve as home base throughout their academic journey. All admitted students will be admitted to the specific school or program for which they applied. Preparing for First-Year Admission Penn accepts the Common Application and Coalition Application. There is no preference for either format and both applications are treated equally in Penn’s process. Penn is also a proud QuestBridge partner institution. Preparing for Transfer Admission As with first-year admissions, the Common Application and Coalition Application are accepted for those wishing to transfer to Penn, and the use of the following resources are encouraged: Checklist and Deadlines, Curricular Requirements, Eligibility Guidelines, Transfer Credit. Graduate Admissions Penn’s graduate and professional programs are housed in 12 schools on one campus. Each graduate program has a separate admissions process. Applicants apply directly to the program of interest. All questions about the admissions process should be directed to the program of interest. Undergraduate Admissions CONTACT Admissions Visitor Center Claudia Cohen Hall, Ground Floor 249 S. 36th Street Philadelphia, PA 19104-6376 (215) 898-7507 Contact Us Graduate Admissions Contact Penn does not have a central Office of Graduate Admissions. All questions about the admissions process should be directed to your academic program of interest. Grant-based Financial Aid The cornerstone of Penn’s initiative to increase access for students from all socioeconomic backgrounds is its grant-based financial aid program. Since 2004, the University has awarded $3.1 billion in undergraduate aid to more than 25,000 students. Forty-five percent of traditional undergraduate students received grant-based financial aid in 2022-23. Ongoing gifts from generous alumni and supporters are expanding Penn’s robust undergraduate grant-based financial aid program and growing graduate and professional student aid to minimize the burden of debt. Penn's All-Grant Policy Graduate Admissions Offices School of Arts & Sciences The Wharton School Annenberg School for Communiciation School of Dental Medicine Stuart Weitzman School of Design Graduate School of Education School of Engineering and Applied Science Penn Carey Law Perelman School of Medicine School of Nursing School of Social Policy & Practice School of Veterinary Medicine Talking admissions with Whitney Soule As vice provost and dean of admissions, Soule is challenged daily with thinking strategically about undergraduate enrollment at Penn—from recruitment to application processes and all that goes into admitting a class, to how financial aid and retention fits into the mix. Read More Penn Virtual Tour From West Philadelphia to the comfort of your own home, we invite you to explore Penn through a virtual tour of our historic campus. Get a glimpse inside our state-of-the-art classrooms, hear from current students and faculty, and catch live performances by members of our community as you stroll down Locust Walk. Penn Virtual Tour Philadelphia, PA 19104 Telephone: (215) 898-5000 Contact Us Maps Parking Navigate Alumni Athletics Diversity Health Care Libraries Online Learning Penn Global Penn's Heritage As America’s first university, Penn has a history that dates back to 1740 and shares many ties with the colonial city of Philadelphia and the birth of our nation. Our History Disclaimer Emergency Services Nondiscrimination Privacy Policy Report Accessibility Issues and Get Help Report Copyright Infringement Back To Top"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:36:51.320107",
    "url": "https://accessibility.web-resources.upenn.edu/get-help",
    "university_name": "University of Pensylvania",
    "title": "Need Help?",
    "content": "Skip to main content Web Accessibility at Penn Expand\n        Web Accessibility at Penn menu Digital Accessibility Policy News and Updates Testing for Accessibility Expand\n        Testing for Accessibility menu Automated Testing Manual Testing Design and Usability Testing Resources Expand\n        Resources menu FAQ Captioning For Developers For Faculty For Content Creators For Designers Working with Vendors Accessible Documents Training and Events Expand\n        Training and Events menu Calendar Past Events Need Help? Expand\n        Need Help? menu Get Help Report issues or Give Feedback Schedule Training or Consultation Need Help? Penn's Accessibility Team is committed to providing the assistance and guidance to support you. Training and support Office Hours (currently remote): Office Hours are held Tuesday-Thursday, 3:00 PM to 5:00 PM. Use our Office Hours Scheduler to put time on our calendar! Any and all questions are welcome. Trainings, workshops, or consultation: If you or your staff would like to set up training(s), please contact web-accessibility@upenn.edu or use our Training webform . No matter what you'd like to cover, the Accessibility team will work with you to develop a training or workshop that meets your needs. Faculty and staff assistance Questions about existing sites or content should be directed to respective local computing departments. For assistance: Contact web-accessibility@upenn.edu for any questions or support you need. We can assist you with working with outside vendors, performing QA, reviewing code and design deliverables, and any other need. If unsure of who to contact regarding an accessibility issue, please reach out to the Office of the Affirmative Action and Equal Opportunity Programs or web-accessibility@upenn.edu and your concern will be routed to the appropriate party to respond. Students Weingarten Center The Weingarten Center provides academic support services and programs for undergraduate, graduate, and professional students at Penn through its two offices, the Office of Learning Resources and Disability Services . The services and programs of both offices are free and confidential. Disability Services Disability Services, specifically, provides comprehensive, professional services and programs for students who self-identify with disabilities to ensure equal academic opportunities and participation in University-sponsored programs. Go to Penn Today to read about how technology is making education more accessible . Academic Support Academic Support provides professional instruction in university relevant skills such as academic reading, writing, study strategies, and time management to the Penn student community. Report an Issues or Give Feedback Please alert us immediately of any problems you encounter any issues or feedback you have on our sites. Report Issue or Give Feedback Form Copyright Disclaimer Privacy Policy Report Accessibility Issues and Get Help ©2024 University of Pennsylvania"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:12.001291",
    "url": "https://www.publicsafety.upenn.edu/contact/",
    "university_name": "University of Pensylvania",
    "title": "Contact Public Safety",
    "content": "More information will be posted here when it becomes available. Menu Back Close Site Navigation SubMenu Title About DPS About Our Division DPS Leadership Our Mission Diversity, Equity, & Inclusion UPPD Information and Statistics News and Events Departments Office of the Vice President Finance & Administration Fire & Emergency Services Information & Security Technology PennComm Emergency Communications Center Penn Police (UPPD) Security Services Special Services Emergency Preparedness UPennAlert Emergency Notification System About PennReady Emergency Procedures Emergency Procedures Bulletins Clery Act Clery Act & Crime Reporting Crime Log Public Safety Services DPS Top 10 List 24/7 Walking Escort Service Penn Alternative Response Unit (AR-1) Penn Guardian The HELP Line Self-Defense & Empowerment Courses Learn DPS Top 10 List Safety Strategies Videos Contact DPS Location & Contact Information DPS Forms Search Division of Public Safety Headquarters 4040 Chestnut Street, Philadelphia, PA 19104 Emergencies: 215-573-3333 511 (campus phone) General Information 215-898-7297 More Contact Info Update Your UPennAlert Info Register for PennGuardian Opens in a new window Opens an external site Opens an external site in a new window Opens a file in a new window Contact Public Safety Emergencies: 215-573-3333 Send us a message! Call 215-573-3333 if you need immediate assistance. We encourage you to share your contact information so we may follow up with you about your question or concern. This form is reviewed during business hours; we will respond within 2 business days. What type of comment would you like to leave? Question Comment Concern What about us would you like to comment on? Enter your comments in the space below: Tell us how to get in touch with you (optional): Name First Last Email Phone Hidden D0 N0t F1ll In Check Me CAPTCHA Emergencies 215-573-3333 511 (campus phone) General Information 215-898-7297 Special Services 215-898-4481 (215-898-6600 off-hours) HELP Line 215-898-HELP (4357) DPS Headquarters 4040 Chestnut Street, Philadelphia, PA 19104 Walking Escort 215-898-WALK (9255) Penn Transit Ride 215-898-RIDE (7433) UPennAlert PennGuardian Contact Us Another Way Send Us Feedback Special Event Security Request Form Records Requests Self-defense and Empowerment Courses Request a Special Property Check Presentation Request Form Student Project Request Form Silent Witness Form Police Complaint Form Report a Crime Commend a Member of DPS Annual CSA Clery Crime Form for 2023 Statistics Foreign Language The Division of Public Safety’s PennComm operations center supports non-English speakers with the use of AT&T’s Language Line, which permits ESL speakers to contact the emergency number (215/573.3333) and communicate with an emergency dispatcher in over 120 different languages. Additionally, the Language Line can be employed by any UPPD officer in a face-to-face interaction, where the ESL speaker can request to communicate to the Penn Police in his/her own native language via a phone call. Administrative Directory Office of the Vice President 215-898-7515 Anderson, Kathleen Shields Vice President for Public Safety 215-898-7515 Greenberg, Nora Nienhagen Chief of Staff 215-898-7517 Ritchey, Stacy Lutner Director, Communications 215-746-3811 Fleming, Brandi Falco Executive Assistant 215-898-7515 Finance & Administration 215-898-6696 Melleby, William Director, Finance and Administration 215-898-6696 Doyle, Michael Business Administrator 215-898-4606 Pringle, Tracy HR Coordinator (215) 898-8855 Tokarczyk, Gregory Building Administrator 215-898-0429 Tyler, Leslie Finance Administrative Coordinator 215-898-6445 Fire & Emergency Services 215-573-7857 Janda, Eugene Chief, Fire & Emergency Services 215-898-6922 Baldini, Christopher Safety Specialist 215-898-2389 Bickel, Stephen Safety Specialist 215-573-7858 Chris Abate Safety Specialist 215-573-5662 Comas, Joseph Deputy Chief 215-898-6921 Farrington, Laura Project Coordinator 215-746-7472 Gonzalez, Daniel Safety Specialist 215-573-7810 Nieves, Michelle Administrative Coordinator 215-573-7857 Poissant, Matthew Safety Specialist 215-573-6686 Seeger, Joseph Safety Specialist 215-573-8259 Penn Police Department 215-573-3333 Williams, Gary Chief of Police 215-898-9935 Belisairo, Michael Captain, Commanding Officer of Staff and Administrative Services 215-898-4607 Bittner, William Lieutenant 215-573-6684 Busch, CaseyAnn Lieutenant, Commanding Officer of Logistics and Special Events 215-573-6684 Detective Department 215-898-4485 Dougherty, Michael Lieutenant 215-573-6684 Farrell, Theodore Detective Supervisor 215-573-9220 Ferdman, Joseph Lieutenant 215-573-6684 Guercio, Paul Detective Supervisor 215-573-9292 Malloy, Andrew Lieutenant, Administrative Commander 215-573-6684 Marano, Joseph Records Management System Administrator 215-573-1355 Marcial, Jennifer Senior Records Administrator 215-898-4482 Morrin, Michael Deputy Chief of Investigations 215-898-9010 Morrison, Diedre Administrative Coordinator 215-898-9935 Mosley, Dennis Sergeant, Court Liaison & Fleet Management 215-898-9002 Quigley, Patrick Detective, JNET CLEAN/TAC Officer 215-898-7252 Records Department 215-898-4482 Vandervort, Christian Captain, Patrol Operations 215-898-0292 Visco, Nicole Sergeant, Professional Standards and Training Supervisor 215-573-5681 Walker, Dinorah Detective, UPPD Training Coordinator 215-898-7856 Watson, Jovanne Records Administrator 215-898-4482 Wood, Derrick Deputy Chief, Police Operations 215-746-0127 PennComm 215-898-9441 Corcoran, Matthew Director, PennComm Emergency Communications Center 215-573-8515 Boyd, Sandy Training Supervisor 215-898-6527 Special Services 215-898-4481 (215-898-6600 off-hours) Wigginton, Paige Director, Special Services 215-898-4481 Cardella, Tracy Victim Advocate 215-898-9001 Dever, Susan Support Specialist 215-898-8762 Watson, Perdetha Detective / Safety & Education 215-573-3253 Zebley, Kyhisha Sergeant / Outreach & Case Management Officer 215-898-2762 Security Services 215-573-6670 Forman, Josh Director of Security Services 215-573-0644 Duch, Chanda Administrative Coordinator 215-573-6670 Toombs, Sidney General Manager / Allied Universal Security Services 215-573-9225 Security Technology 215-573-6670 Fox, George V. Executive Director, Information and Security Technology 215-898-4484 Duch, Chanda Administrative Coordinator 215-573-6670 Fleming, Ian Systems Administrator 215-573-9784 Kern, David Associate Director 215-898-9528 Leddy, John Sr. Security Systems Administrator 215-573-3847 Nguyen, Kiem Systems Administrator (215) 573-8258 Wenzel, John Security Tech Proj. Manager (215) 573-7801 Williams, Mark Project Manager 215-898-6269 Zharko, Stas IT Support Specialist 215-573-8038 Stay in Touch with DPS! Sign up for special announcements, traffic advisories and more. Subscribe 4040 Chestnut Street Philadelphia, PA 19104 Emergencies 215-573-3333 | 511 (campus phone) General Information 215-898-7297 UPennAlert PennGuardian Visit Our Twitter Page Visit Our Instagram Page Explore About DPS Emergency Preparedness Safety Resources News and Events Contact Search Report Accessibility Issues and Get Accessibility Help Departments Office of the Vice President Finance & Administration Fire & Emergency Services Penn Police Department PennComm Emergency Communications Center Security Services Information & Security Technology Special Services"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:12.872468",
    "url": "https://global.upenn.edu/",
    "university_name": "University of Pensylvania",
    "title": "Utility Navigation",
    "content": "Skip to main content announcement At this time, we recommend all Penn-affiliated travel to Israel, West Bank, Gaza, and Lebanon be deferred.  If you are planning travel to any of these locations, please reach out to travelsafety@pobox.upenn.edu for the most up to date risk assessment and insurance exclusions. As a reminder, it is required that all Penn-affiliated trips are registered in MyTrips .  If you have questions, please contact travelsafety@pobox.upenn.edu . International Travel Guidance Utility Navigation Utility Links University of Pennsylvania Office of the Provost Penn Global Secondary Nav Penn Global For Penn Students For Penn Faculty For Alumni & Friends Group Created with Sketch. Group Created with Sketch. search Group Created with Sketch. full menu Primary Nav Penn Global About News Map Campus Resources Grants Support Drawer Menu Penn Global About Explore Back to main menu Our Strategic Framework Our Offices Explore Back to main menu Office of the Vice Provost for Global Initiatives Explore Back to main menu Our Team Perry World House Penn Biden Center Penn Abroad International Student & Scholar Services Global Support Services Our Team News Map Explore Back to main menu Penn in Africa Penn in Asia Penn in Latin America and the Caribbean Explore Back to main menu Penn in Latin America & the Caribbean (PLAC) Explore Back to main menu Who We Are What We Do Explore Back to main menu Annual PLAC Symposium Explore Back to main menu 2022 PLAC Symposium Pulitzer International Reporting Student Fellowship Connect with PLAC Penn in Oceania Penn in the Middle East Penn in Northern America Campus Explore Back to main menu Global at Penn's Schools Global Centers & Programs Resources Grants Explore Back to main menu Global Engagement Fund China Research and Engagement Fund India Research and Engagement Fund Holman Africa Research and Engagement Fund Apply for a Convening Grant Apply for a Research Grant Manage My Grant Grants Database Support Search Group Created with Sketch. Bringing the World to Penn and Penn to the World Penn Global provides strategic direction to the University of Pennsylvania on its global endeavors, with a focus on the efficient investment of university resources. Encompassing seven reporting offices, Penn Global leverages its broad and deep expertise to advise the University on its global activities and to collaborate with Penn’s schools, centers, communities and partners to deliver a comprehensive suite of global programming that generates positive impact around the world. Meet the Penn Global Offices What Are You Looking For? Penn Global Offices International Student & Scholar Services Penn Abroad Perry World House Penn Biden Center Office of the Vice Provost for Global Initiatives Global Support Services Penn Global Finance & Administration Information To Help You... Travel Abroad Explore the resources and services available to prepare the Penn community for their travel abroad. Make an Impact Engage with Penn centers and programs to broaden the university's impact across the globe. Support Your Global Activities Discover the resources and services available to support the business and administrative functions of Penn's global activities. Fund Your Global Activities Learn about the opportunities designed to provide financial and logistical assistance to the Penn community for their global endeavors. Penn Global News See All News Two international students honored with the 2024 Penn Global Student Citizenship Award by \n  Penn Today Read More Penn Global Awards $1.5 million in Research and Engagement Awards by \n  Penn Global Read More Penn Abroad director on making study abroad accessible and her first passport stamp by \n  Penn Today Read More @PennGlobal Follow Us 10th Anniversary Highlights (AY2022-2023) Celebrating 10 Years of Penn Global Celebrating Penn Global's 10th anniversary Looking back at 10 years of global engagement Celebrating Penn's international students Recognizing the work and impact of our partners Reconnecting with stakeholders abroad Advancing Penn's global engagement Assessing the future of global higher education Bringing the world to Penn & Penn to the world Celebrating Penn Global's 10th anniversary 2022 marked 10 years since the inception of Penn Global - a decade since the adoption of the University’s first global strategic framework. To commemorate, Penn Global hosted a series of events to highlight the transformative impact of Penn Global on the University and celebrate Penn’s commitment to global engagement. View Photos from Events Looking back at 10 years of global engagement The hub for all things global on campus looks back at its impact over the decade and ahead to what the next 10 years of research, policy, and engagement with the world will bring. Read More at Penn Today Celebrating Penn's international students Penn’s campus community includes students from all parts of the globe, bringing their unique experiences and soaking in all the University has to offer. Read More at Penn Today Recognizing the work and impact of our partners In October 2022, Penn Global hosted a reception to celebrate its 10th anniversary and recognize the deep impact of our many campus partners and international stakeholders in advancing Penn's global mission. View Photos from the Reception Reconnecting with stakeholders abroad Penn Global traveled around the world to reconnect with the Penn community abroad and engage students, alumni and global partners around the University's global mission, and celebrate the Penn's long-standing commitment to global engagement. View More Photos on Instagram Advancing Penn's global engagement As part of Penn's global mission, UPIASI, CASI, and Penn Global partnered to host the Penn India Engagement Forum in Delhi, India in January 2023 to address the challenges and opportunities in India's post-Covid recovery and onward development. Read More at ANI Assessing the future of global higher education Organized by Penn Global and the Graduate School of Education, the conference brought together leaders from higher education, government, corporations and other entities to consider the range of challenges and opportunities acing globally oriented colleges and universities. Read More at Penn Today Bringing the world to Penn & Penn to the world Our mission is to bring the world to Penn and Penn to the world. Learn how Penn Global has helped to shape the University as a global institution over the last 10 years as it prepares for the next ten years of global engagement. View Video on YouTube 01 / 08 3539 Locust Walk University of Pennsylvania Philadelphia, PA 19104 global@upenn.edu Penn WebLogin ©2024 University of Pennsylvania, Philadelphia, PA 19104 Footer Menu Office of the Provost Report Accessibility Issues and Get Help Privacy Policy"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:14.188098",
    "url": "https://diversity.upenn.edu/",
    "university_name": "University of Pensylvania",
    "title": "Diversity and Inclusion",
    "content": "Skip to main content Go to site search Go to primary navigation Go to resources navigation Toggle Site Navigation Toggle Site Search Diversity at Penn More Diversity at Penn Facts and Figures Policies Reporting Forms More Reporting Forms Bias Incident Reporting Form Inclusive Best Practice Form Reports Stories Timeline Programs More Programs Academic Programs Administrative and Co-Curricular Diversity Offices, School Specific Initiatives and Student Organizations Resources More Resources Affiliated With Resource Centers Arts Organizations Religious Organizations School-Affiliated Organizations Student Affairs Student Government, Consultation Councils and Advisory Boards News & Events More News & Events Events News Videos Toggle Site Search Resources Current Students Faculty & Staff Parents Alumni Visitors A-Z Directory Webmail Services Penn Home Search Search Close Diversity and Inclusion University of Pennsylvania Across 12 Schools, more than 25,000 students, and more than 4,000 faculty members, we become one university: a wide-ranging, ever-changing community that draws its strength from a multitude of races, ethnicities, genders, sexual orientations, historical traditions, ages, religions, disabilities, veteran status, interests, perspectives, and socioeconomic backgrounds. Featured Programs & Resources Supplier Diversity and Inclusion Program Fueling Business Growth is tied to a multi-faceted action plan aimed at strengthening relationships, and expanding access to resources, with local, diverse and minority-owned businesses. Projects for Progress - Office of Social Equity and Community Penn’s Projects for Progress was launched in 2020 and has awarded funding of up to $100,000 to support the efforts of teams of students, faculty, and staff designed to promote equity and inclusion and to make a direct impact in Philadelphia. iCommunicate Intercultural Training ISSS (International Student & Scholar Services) offers 3 tracks of iCommunicate trainings. Request a training for your group, office or department. Open to all Penn students, scholars, faculty and staff. Greenfield Intercultural Center (GIC) For 35 years, GIC has served as Penn’s resource for enhancing student’s intercultural knowledge, competency, and leadership. The center offers experiential courses for credit, signature intercultural programs, and other services related to diversity and intercultural education. A Brief Overview of Antisemitism Read the report Penn Medicine Service in Action - Community Impact Report Annual report News & Events President’s Engagement  and President’s Innovation Prizes Communities for Childbirth, founded by Seungwon (Lucy) Lee C’23, was among the 2023 President’s Engagement and President’s Innovation Prize winners. The international organization empowers maternal and child health in Jinja, Uganda. Penn & Slavery Augmented Reality App The student-developed app takes users on a tour of slavery's legacy at Penn in six stops, each telling a story through an augmented reality (AR) experience. The tour relates to specific locations on Penn's University City Campus. Dinners Across Differences The University launched a new initiative - Dinners Across Differences - which strives to encourage dialogue and bring people together in informal conversations over shared meals. The dinners will be organized within one School to discuss issues of importance and interest to that School’s community. More information will be forthcoming. School of Arts and Sciences 60-Second Lectures In 2023 topics ranged from antisemitism to genetic ancestry tests and race. Disclaimer Emergency Services Privacy Policy Report Accessibility Issues and Get Help Report Copyright Infringement Philadelphia, PA 19104 Telephone: (215) 898-5000"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:21.124708",
    "url": "https://penntoday.upenn.edu/news/talking-admissions-whitney-soule",
    "university_name": "University of Pensylvania",
    "title": "",
    "content": "Skip to main content Open Search Bar Close Search Penn Today Logo Open Navigation Menu Arts, Humanities,\n            & Social Sciences Sports Campus & Community Education, Business, &\n            Law Health Sciences Science & Technology Search Search Icon Topics Arts,\n                Humanities, & Social Sciences Sports Campus &\n                Community Education,\n                Business, & Law Health Sciences Science &\n                Technology News News Archive Penn in the News Newsletters Announcements University Communications Staff University Communications website Penn Home A-Z Directory Calendar Maps Offices and\n                Services Webmail Events See all → 5/18 Hands on History The Center for the Analysis of Archaeological Materials welcomes 11th and 12th grade students to examine the materials and techniques used in ancient mold making. This event is free to high school students; lunch is provided. 10:00 a.m. - 2:30 p.m. Penn Museum, 3260 South St. 5/20 268th Commencement The 268th Commencement at the University of Pennsylvania will feature the conferral of degrees, the awarding of honorary degrees, greetings by University officials, and remarks by Commencement speaker Siddhartha Mukherjee, a renowned physician, researcher, and best-selling author. All Day Franklin Field 5/23 Vahe Sarkissian Vahe Sarkissian, who plays Armenian music and electric guitar, performs inside The Lounge. 8:00 p.m. World Cafe Live, 3025 Walnut St. 6/28 Wawa Welcome America Day As part of Wawa Welcome America, the largest July 4th celebration in the U.S., Penn Museum offers free admission to its galleries. Online reservations are required. 10:00 a.m. - 5:00 p.m. Penn Museum, 3260 South St. Close Open Search Bar Close Search Penn Today Logo Talking admissions with Whitney Soule Penn Today Logo Open Navigation Menu Search Search Icon Campus & Community Talking admissions with Whitney Soule As vice provost and dean of admissions, Soule is challenged daily with thinking strategically about undergraduate enrollment at Penn—from recruitment to application processes and all that goes into admitting a class, to how financial aid and retention fits into the mix. Whitney Soule, vice provost and dean of admissions. (Image: Lisa Godfrey) More than three decades ago, Whitney Soule started working in admissions at Bates College, her alma mater. She didn’t know it at the time but it would become her lifelong passion, a career that has led her to Connecticut College and Bowdoin College, and now to Penn . As Penn’s vice provost and dean of admissions, a role she took on last July, she is challenged daily with thinking strategically about undergraduate enrollment at the University—from recruitment to application processes and all that goes into admitting a class, to how financial aid and retention fits into the mix. It is a complex job she doesn’t take lightly, but it’s still one she appreciates every day. “I hope everybody loves their job, but I really do think my job is the best,” Soule says. At the end of March, Soule announced the regular decision admits for the Class of 2026 , which help build, ultimately, a class of 2,400 students across Penn’s four undergraduate schools. Soule said the University’s 270th class is a standout because of the students’ “intellect, character, integrity, and persistence.” “We read through nearly 55,000 applications—55,000 individual stories—to get to this point,” Soule says. “The 2,400 who will come here are creating a new chapter for Penn.” Soule sat down with Penn Today to talk more about the University’s newest class, how the admissions office works, what pressing challenges exist in the field today, and much, much more. Talk to me a bit about yourself and how you got into admissions work. Right when I graduated from undergrad, I worked for the American Red Cross for about a year in Maine, and then took a job with Bates College, my alma mater, in the admissions office. When I was a student at Bates, I did all the things—I was an overnight host for visiting students, I was a tour guide, and I was on hand for different admissions events where they needed student points of view or student support. I really enjoyed it. The first position that I had in admissions at Bates was meant to be a nine-month role, because somebody was leaving unexpectedly in August, and they needed to hire somebody to get through that academic year. I immediately loved everything about it. I also had a dean who was great with staff development and introducing us to the different aspects he had to think about as a dean. I got exposure as a new staff person to the idea of not just how we recruit, but also where we recruit, how to read, how we choose, and how all those things influenced getting a class that Bates was looking for. I found all of that intricacy to be really stimulating and 30 years later, here I am. What specifically led you to Penn? I had spent my whole career working for small, residential liberal arts colleges. That was my undergraduate education and I really endorse that environment and that kind of education delivery. Yet Penn was really attractive as an opportunity because of its scale. My work and my leadership development has evolved over time around thinking about inclusive practices and determining better ways of building out a pathway to higher education. In particular, considering how selective institutions can be adaptable and mindful as we are thinking more broadly about the potential. Coming to Penn with its history, reputation, and resources represented an opportunity for impact greater than anything I could have imagined. It’s a really enticing and stimulating opportunity. When speaking with then-President Amy Gutmann and then-Provost Wendell Pritchett about this role, and their emphasis on impact, innovation, and inclusion, I was like, ‘That’s my heart.’ Those three pillars mean so much to me and if that’s the pulse of Penn, then I want in on that. When it comes to college admissions at Penn or in general, what are the biggest challenges being faced today? There are so many. I think one of the longstanding challenges that requires our full attention is the cost of attending and completing a four-year degree, whether that is at Penn or an entirely different kind of institution. Cost is so tied to opportunity and completion, and so the more resourced an institution is in being able to support students financially—to attract them, enroll them, and then help them financially sustain their experience—is really, really critical. We have to be able to get the financial piece right to be behind our ideas for access. There are incredibly motivated, curious, and intellectual young minds all over the world, and if they don’t see higher ed or don’t see Penn as a place they can communicate with, we can’t show them how affordable it can be. Recruitment is a big part of admissions, right? Yes, and recruitment has so many components to it. Some aspects are very straightforward where we are connecting directly with students. We are doing programming with high schools, we are going to college fairs, we are getting ourselves to where the students are and bringing the information and the resources and the conversation to them. With COVID, a lot of that has been done virtually, too, which has added a degree of accessibility, which we will keep even post-pandemic. We are also working closely with organizations that are connected to students. We have relationships with organizations like QuestBridge , which does recruitment and outreach to students who are primarily low income and likely to be first generation to college. We connect with them as a partner school and they connect us to students. We also work with College Horizons, an organization that supports Native American students on the path to college. We purchase names through a number of different sources and do what you might think of cold calling outreach, where we send electronic or paper materials. Plus so many more outreach efforts. What are some ways you’ve seen college admissions change over your career? There have been a lot of things that are responding to the opportunity of technology. Back in the early ’80s the Common Application began to be used—at the time it was a paper application—which allowed students to use one application to apply to a number of schools, to cut down on some of the repetitive work for students. This made it more comfortable for students to apply to more schools, but at that point students were still more likely to only be applying to schools that they knew either because they knew somebody who went there or somebody that they trusted had told them about it, or they had heard about it in the news. Other than that, there were guidebooks to search for institutions. When things became available on the web, it was easier for students to start to learn about places they’d never heard of before. It also became easier when applications went online to apply to more places. More and more schools accepted the Common Application, which meant that students could then apply to more schools than they had before. This has a benefit of accessibility, which is critical. It also has made application pools larger, which diminishes the admit rate, which makes people feel anxious, so students apply to more places, and so on. The anxiety about whether it’s possible to get in is mostly wrapped around a small proportion of schools, those that are the most selective. In reality, the majority of higher education institutions admit a great proportion of students. Getting into an institution of higher education is not as complicated as it might sound, but it does come with a whole bunch of other complications such as cost, as I was saying earlier. So there is plenty of anxiety to spread around. A benefit of the applicant growth, though, is that we have been reaching more students who are first generation in their families to go to college, or who are low income, and those who have been underrepresented in our applicant pool. Talk a bit about the process for admissions, in sifting through applications and ultimately choosing a class? On the one hand it’s very straightforward and on the other hand, it’s very complicated. There are about 55,000 undergraduate applications, and we have an undergraduate class of 2,400. So, the most direct answer is we need to read them all and select applicants that we think are a great match for Penn. When I say ‘match’ I mean the students have a good understanding of Penn and what they might want to do when they get here, and that we understand those interests and how they might align with the Penn community. Our applicants have really interesting perspectives, ideas, and skillsets, and our goal is to learn more about them as we bring together the next incoming class. These interesting characteristics, however, represent most of the applicant pool, so that’s not easily getting us down to a class of 2,400, so we must consider more pieces. The 2,400 fill out the four undergraduate schools, each with their own enrollment size and each one of those schools has particular programs and interests that they’re developing. When we are reading, we are thinking critically about each of the school’s goals, spaces available, how they want to see this particular class this year come together, and so on. How many people at Penn are reading for a typical admissions cycle? There are 28, but it’s important to understand that our admissions office has about 60 people in it. To make what we’ve already talked about work, from recruitment to reviewing applications, it includes a highly skilled operations team that is managing finance, project and event management, client care, applicant care, technology, and more. We have a very skilled team to support recruitment and selection. We also have a marketing and communications team that is essential for us to have cogent, representative messaging and materials that are connected and helps students who are really trying to understand not just what Penn is, but how it’s different from other schools. I know financial aid is closely tied to admissions. Talk to me a bit about that. We’re not in the same reporting stream, but financial aid is so central to how we recruit, what we can say, and how students understand the opportunity of Penn. We have to communicate closely with financial aid around what our policies are and how we’re messaging them so that we are being articulate and thorough in how we are explaining the resources that are available. Having an intimate understanding of the financial aid policies and benefits is a responsibility of any admissions office. What sets Penn apart is that we are able to admit students knowing we can meet their full need entirely with grants and without assigning any loans. At the same time, we are able to help support students financially with what they might need outside of their financial aid package, too. What are some of your goals, in the short term and long term? The system by which students are applying to college was created and built decades and decades ago. The substance of what is required hasn’t really changed very much over time, even though our applicant pool has changed dramatically in important ways, representing backgrounds and points of view and opportunity areas that were not part of the original design of how to apply to college. It’s really important for us to be looking critically at how these processes serve both what we need to understand about applicants when we’re reviewing them to make sure we’re making a great selection for Penn, but also that they are serving the needs of how students can best present themselves to us for that evaluation. There is no easy answer there. For instance, nearly 1,000 schools are part of the Common Application, and hundreds share the Coalition Application, so we agree to some shared process around what an application includes. If you want to change something really significant, it is not as simple as just doing it on your own as an institution. Penn has made some slight changes, though, correct? Something Penn was able to do this year that I am proud of—and that had immediate impact—was changing our recommendation letter requirements. We used to require students to submit a school counselor recommendation and two teacher recommendations. This year, in place of the second teacher recommendation, we invited a recommendation from any adult—so while it could be from another teacher, it could be from a job supervisor or a coach or a friend’s parent. We realized during COVID, but even prior to COVID, not all students know their teachers very well, in a way that can generate the kind of specificity we’re looking for. We thought this would offer an additional avenue for students to choose people who they trusted outside of their high school teachers. This is just a small example of how there are opportunities to change, and we are open to them. I know Penn also announced this year’s newest class a bit differently than usual. At the time of releasing the admissions decisions on March 31, we did not publish or refer to our admit rate and we also did not publish or refer to some of the demographic proportions of the students that we admitted in the way that we had before. It is not that those things aren’t important—the admit rate, for example, holds a source of pride for students who’ve been admitted and it feels really special to have gotten a spot—but we also know that the admit rate decline among schools like ours is also part of this anxiety churn. It was an opportunity for us not to contribute to that at the time that we were admitting students. Instead, we took the opportunity to talk about who—really who the students are—we admitted. We referenced their commitments to research, service, jobs, and so forth rather than what they represented or how few of them were admitted. We understand that our choices have influence, and this was a way that we wanted to talk about our admitted students that was really important to us. It is also important that when students are looking at Penn, that they understand that it is a diverse place, so we know the demographic information is important. When we have our class settled, which represents who’s actually enrolling, we will be able to put that up on our website and people will be able to see what our class looks like. Are you still working on settling the class? May 2 was the deposit deadline so we usually have the majority of the class settled in at this point. Then, we’ll have some students who will ask to take a gap year, so then they’re not in this class, they will be in the next class. We have some students who might be offered an opportunity to enroll elsewhere off that school’s waitlist, and so those students leave our class. We bring some students into our class off the waitlist, if we have the room. Those last little pieces will settle over the summer. Thinking about the class as it is right now, what comes to mind? I am really excited about this class. Thinking about how we are measured externally for diversity—around our international population, our students who come from underrepresented racial and ethnic backgrounds, and our first generation to college students—this class is really going to demonstrate progress for Penn in those areas. But beyond those categories, I’m truly in awe of the applicants to Penn. I mean, just the exceptional minds of young people who have found Penn, who have connected to Penn through recruitment with us, have gone through the effort of applying, and are there for us to think about and review is truly remarkable. Thinking about the group that is becoming the class at Penn and knowing how they spend their time, what they chose to highlight in their applications, what they’re excited about when they get here, it is so human, and individual, and personal. It is one of the things I love most about the work. It’s truly thrilling, and I can’t wait to welcome these remarkable students at Convocation. Credits Lauren Hertzler Writer Date May 23, 2022 Subtopics Faculty , Admissions , Q&A Share Twitter Facebook LinkedIn Twitter Facebook Read Next To Penn’s Class of 2024: ‘The world needs you’ Campus & Community Class of 2025 relishes time together at Hey Day An iconic tradition at Penn, third-year students were promoted to senior status. Arts, Humanities, & Social Sciences Picturing artistic pursuits Hundreds of undergraduates take classes in the fine arts each semester, among them painting and drawing, ceramics and sculpture, printmaking and animation, photography and videography. The courses, through the School of Arts & Sciences and the Stuart Weitzman School of Design, give students the opportunity to immerse themselves in an art form in a collaborative way. Campus & Community Penn celebrates operation and benefits of largest solar power project in Pennsylvania Solar production has begun at the Great Cove I and II facilities in central Pennsylvania, the equivalent of powering 70% of the electricity demand from Penn’s academic campus and health system in the Philadelphia area. Education, Business, & Law Investing in future teachers and educational leaders The Empowerment Through Education Scholarship Program at Penn’s Graduate School of Education is helping to prepare and retain teachers and educational leaders. Penn Today Logo logo-new-2 If there’s news at Penn, you’ll find it here. We strive to bring you faculty, staff,\n          and student profiles, research updates, and the latest happenings on campus. Office of University Communications Suite 200 3901 Walnut Street Philadelphia, PA 19104-3608 215.898.8721 upnews@pobox.upenn.edu Facebook Instagram Twitter LinkedIn Flickr YouTube © 2024 Penn Today, University of Pennsylvania Penn Homepage Disclaimer Emergency Services Privacy Policy Report Accessibility Issues and Get Help Report Copyright Infringement"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:22.840034",
    "url": "https://admissions.upenn.edu/virtual-tour",
    "university_name": "University of Pensylvania",
    "title": "Site Navigation",
    "content": "Skip to main content Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Search Close Menu Close Search keywords Search Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Virtual Tour We invite you to explore Penn's home in West Philadelphia through a virtual tour of our historic campus. Get a glimpse inside our state-of-the-art classrooms, hear from current students and faculty, and catch live performances by members of our community as you stroll down Locust Walk. Navigate Section Launch Experience Interested in learning more about Penn? Check out more online events and resources here . 1 College Hall, Room 1, Philadelphia, PA 19104-6376 Footer Menu Join the mailing list Contact Us Accessibility Privacy Policy NACAC Partnership Agreement"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:24.813642",
    "url": "https://cms.business-services.upenn.edu/transportation/",
    "university_name": "University of Pensylvania",
    "title": "Penn Transportation & Parking is dedicated to providing",
    "content": "COMMUTER INFORMATION AND RESOURCES :University Increases discount for Employee Commuter Program to 50%. Learn more about the new discount and other commuting resources. Skip Navigation Skip to Footer Penn Home Business Services Home Campus Maps Group 15 Created with Sketch. s Search About Overview Test Item Our Initiatives AVI Transponders Green Parking Lot offers commuting alternatives Facilities Improvements Fleet Rebranding Electric Charging Stations Our Network Sustainable Transportation Policies Commuter Transit Reimbursement Exception Policy Commuter Transit Reimbursement Exception Policy Form Meet Our Team Penn Transit Services Information Overview of Penn Transit Options Advertising on Penn Transit Riders' Rights  & Responsibilities Navigating Penn Transit Commuter Services Information Parking Services Information General Information - Parking Pay or Appeal a Ticket Low Emission Vehicles Alerts and Updates Signup for Transportation or Parking Notifications News and Announcements Share a Ride Van Pooling Discounts and Benefits Car-Sharing Discounts and Benefits Emergency Ride Home Walking & Biking Walking Escort Service Resources for Cyclists Bike Commuter Reimbursement Program Bike Sharing on Campus Campus Bike Policies Bike Safety Services for Penn Departments Maintenance Services Charter Services Overview Policies and Cancellation Charter Vehicle Rates Charter Vehicle Options Request Charter Vehicle Charter Vehicle Reservation Form VIP and Event Parking Requests Pay for Parking Violations Pay and Appeal a Ticket Contact Us Penn Transit Commuter Services Penn Parking Provide Feedback FAQs Commuter FAQs Transit FAQs Parking FAQs Group 15 Created with Sketch. s Menu Search Live Maps Penn Transit Live Map Transportation Map Transit Stop Descriptions Transit Route and Area Descriptions Parking Map Parking Lot Descriptions Biking Map Permits & Passes Information on Commuter Benefits Health Equity Commuter Card Commuter Discounts for New Jersey Travel Student PennPass Cost of a PennPass New Jersey Transit Student Discount WageWorks VISA Debit Card Replaces Transit Checks Update/Apply for Commuter Discounts Update/Apply for Commuter Card Benefit Information on Parking Permits Event and VIP Parking Requests Event and VIP Parking Form Cancel a Permit Suspended Permit Lost or Stolen Parking Credentials Lost or Damaged Parking Credentials Hangtag Information Snow Emergencies Parking Safety Faculty & Staff Monthly Parking Permits Evening & Weekend Permits Student Parking Rates Student Parking Permits Occasional Parking Occasional Parking Application Form Motorcycle Parking Health Equity Commuter Parking Card 24 Hour Parking 2023-2024 Parking Rates Update/Apply for Parking Schedules & Options PennTransit Mobile Penn Bus West Penn Bus East Penn Bus North Penn Accessible Transit On-Request Evening Shuttles Penn FMC Shuttle Pennovation Works LUCY Bus Penn-Drexel Bus Share PennTransit Mobile, our new app, allows you to find your quickest mode of travel right from your phone. Download it today. Learn More Penn Transportation & Parking is dedicated to providing safe, convenient, sustainable and accessible transit, commuter, and parking services to the Penn community. See our Initiatives Penn Transportation & Parking is committed to promoting sustainable commuting practices through a variety of initiatives within Penn’s Climate and Sustainability Action Plan. See our sustainable transportation Initiatives Penn Transportation & Parking values the collaborative relationships it has with outside organizations that contribute to the creation of a robust, integrated transit system for the campus community. See our network PennTransit Mobile, our new app, makes choosing travel to, from and around campus easier than ever! Download it today. Learn More Group 15 Created with Sketch. s Alerts & Updates For more information See transportation options See parking options News & Announcements Announcing Penn Bus North & Other Service Enhancements Penn Transit has a new fixed-route pilot service called Penn Bus North as well as other service enhancements. Read more ... PennTransit Mobile is now live Riders of Penn Transit’s on-request shuttle services will need to begin using our new app – PennTransit Mobile . Read more ... See all News & Announcements Group 14 Created with Sketch. Trending FAQs What is Penn Accessible Transit? See all FAQs Quick Links PennTransit Mobile Find Visitor Parking Pay a Parking Violation Penn Transit #520 3401 Grays Ferry Avenue Philadelphia, PA 19146-2701 transit@upenn.edu 215-898-7433 (RIDE) Commuting Services/Parking Suite 447A 3401 Walnut Street Philadelphia, PA 19104 parking@upenn.edu 215-898-8667 News & Announcements Alerts and Updates FAQs Give us Feedback Privacy Report accessibility issues and get help"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:25.660790",
    "url": "https://facilities.upenn.edu/maps",
    "university_name": "University of Pensylvania",
    "title": "",
    "content": "Skip to main content Skip to search by name of building Skip to primary navigation Go to the PennAccess page for information about accessible entrances for each building Top Navigation Service Request Penn Homepage Penn Sustainability Penn Connects Main navigation About FRES Overview Organizational Chart Departments Campus History Campus Plan News Vendor Information Directions to FRES Services Maintenance and Renovation Campus and Building Plans Landscape Planned Events Real Estate Signage Moving Services Standards & Policies Standards Policies Safety Procedures Sustainability Energy Management Built Environment Waste Management and Recycling Collaborative Efforts Capital Process Initiate a Project Capital Planning Facilities Renewal Maps Campus Map Building Locations PennAccess Accessibility Info Public Art Discover Penn Public Parking Bicycle Resources Printable Maps Map Penn Map: Main Select One All Buildings Annenberg School for Communication Arts and Sciences Athletics Current Construction Dental Medicine Education Engineering and Applied Science Galleries + Performing Centers Libraries Nursing Penn Carey Law Penn Connects Penn Hospitals Perelman School of Medicine Social Policy and Practice Off Campus: CA Off Campus: NJ Off Campus: PA Student Housing Veterinary Medicine Weitzman School of Design Wharton: Philadelphia Discover Penn Public Parking Public Art Facilities & Real Estate Services 3101 Walnut St Philadelphia, Pa 19104 Emergency/Vehicular Address: 3160 Chestnut Street (proceed to the glass Pavilion at end of the parking lot) © 2024 University of Pennsylvania Report accessibility issues and get help » Webmaster Contact » Table of Contents About FRES Overview Organizational Chart Departments Campus History Campus Plan News Vendor Information Directions to FRES Services Maintenance and Renovation Campus and Building Plans Landscape Planned Events Real Estate Signage Moving Services Standards & Policies Standards Policies Safety Procedures Sustainability Energy Management Built Environment Waste Management and Recycling Collaborative Efforts Capital Process Initiate a Project Capital Planning Facilities Renewal Maps and Locations Campus Map Building Locations PennAccess Accessibility Info Public Art Discover Penn Public Parking Bicycle Resources Printable Maps Building Contacts Penn Community Penn Homepage Top Navigation Service Request Penn Homepage Penn Sustainability Penn Connects"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:33.437198",
    "url": "https://www.law.upenn.edu/admissions/",
    "university_name": "University of Pensylvania",
    "title": "A dynamic, cross-disciplinary legal education",
    "content": "Skip to main content For Alumni For Students For Faculty For Staff Library Support the Law School Search Consumer Information (ABA Required Disclosures) Search Penn Carey Law Academics A dynamic, cross-disciplinary legal education Academics Degree Requirements Joint Degrees & Certificates Legal Practice Skills Registrar Clinics & Externships Journals Academic Support Program International Affairs Future of the Profession Initiative Legal Education Programs Executive Education Academic Calendar Learning Outcomes Advocacy Competitions Admissions Begin your journey Admissions JD Admissions LLM & Graduate Programs Master in Law Financial Aid Visiting Penn Carey Law ABA Careers Fostering the professional success of students and alumni Careers For Current Students For Employers For Alumni Employment Statistics Calendar Equity & Inclusion Cultivating a diverse and inclusive intellectual community Equity and Inclusion Access Anti-Bias Support & Reporting Toolkit Anti-Bias Programs Dialogue Initiatives Sadie Scholars Program Resources Community Voices Events Our Team Faculty & Research Transformative work from renowned interdisciplinary scholars Faculty & Research Faculty Directory Research & Scholarship Centers & Institutes Academic Fellowships Faculty In the News Public Interest A community anchored in service Public Interest Toll Public Interest Center Pro Bono Public Interest Events Government Support for Public Interest Seeking Pro Bono Services? Clinics & Externships News The intellectual vitality of our community News Recently Featured In the News Calendar Faculty Perspectives Pathways to the Profession Academics Degree Requirements Joint Degrees & Certificates Legal Practice Skills Registrar Clinics & Externships Journals Academic Support Program International Affairs Future of the Profession Initiative Legal Education Programs Executive Education Academic Calendar Learning Outcomes Advocacy Competitions Admissions JD Admissions LLM & Graduate Programs Master in Law Financial Aid Visiting Penn Carey Law ABA Careers For Current Students For Employers For Alumni Employment Statistics Calendar Equity and Inclusion Access Anti-Bias Support & Reporting Toolkit Anti-Bias Programs Dialogue Initiatives Sadie Scholars Program Resources Community Voices Events Our Team Faculty & Research Faculty Directory Research & Scholarship Centers & Institutes Academic Fellowships Faculty In the News Public Interest Toll Public Interest Center Pro Bono Public Interest Events Government Support for Public Interest Seeking Pro Bono Services? Clinics & Externships News Recently Featured In the News Calendar Faculty Perspectives Pathways to the Profession For Alumni For Students For Faculty For Staff Library Support the Law School Consumer Information (ABA Required Disclosures) Home Admissions Your Future Begins Here Admissions JD Our JD program offers a unique, highly experiential education that is well-respected across the globe, with graduates that go on to lead their fields in private, public, government, and academic work. JD Admissions How to Apply Entering Class Profile Financial Aid Master in Law For emerging and established professionals and graduate students who want a world-class, cross-disciplinary education around their area of interest and the law. ML Admissions How to Apply FAQs Financial Aid LLM & Grad Programs Our world-renowned LLM Program educates leading lawyers, judges, diplomats and scholars from across the globe. LLM SJD LLCM Financial Aid Connect with Us Our Penn Carey Law Admissions team looks forward to speaking with prospective applicants virtually this Fall. While we are unable to welcome visitors in the building at this time, we are pleased to offer a variety of online resources that delve into the admissions process and the Penn Carey Law community. Most events require registration to attend so please take the time to register where appropriate. All times are ET unless otherwise indicated. JD LLM & Grad Program Master in Law Committed to Equity & Inclusion The Law School is committed to an inclusive, impactful, and innovative legal education where unique perspectives and backgrounds together make our community prepared to tackle the most pressing legal issues. Learn more our Office of Equity & Inclusion Explore the University Take a stroll down Locust Walk, sit and chat with Ben on the Bench, cheer on the Quakers, and become a part of Penn’s many unique and historic traditions. Explore Penn Reach Out to Us Master in Law (ML) Executive Director, Master in Law Program master@law.upenn.edu JD Admissions contactadmissions@law.upenn.edu LLM & Graduate Programs gradadms@law.upenn.edu University of Pennsylvania Carey Law School 3501 Sansom Street Philadelphia, PA 19104 215.898.7483 Centers & Institutes Library Academic Calendar Event Calendar Administration Penn Contact Support Us Jobs Copyright 2024 University of Pennsylvania Carey Law School. All Rights Reserved. Report Accessibility Issues and Get Help | The Fine Print Site Login"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:35.798893",
    "url": "https://www.vet.upenn.edu/education/admissions",
    "university_name": "University of Pensylvania",
    "title": "Education at Penn Vet",
    "content": "UPENN About Who We Are Campuses News Room Diversity at Penn Vet Our History Events Education VMD Admissions Incoming VMD Students Graduate Programs Dual Degree Programs Continuing Education Clinical Training Research Training Accreditation Research Areas of Research Centers, Laboratories & Initiatives Clinical Trials | VCIC Academic Departments Core Resources & Facilities News, Events & Conferences One Health Giving Meet the Team People Faculty Faculty/Clinician Search Alumni Find a VMD Contact Penn Vet Vet Hospitals New Bolton Center Care for horses & livestock/farm animals Emergencies Appointments Clinical Services Diagnostic Laboratories Facilities Get Directions News & Events Referring Veterinarians Ryan Veterinary Hospital Care for cats, dogs & other companion animals Ryan Hospital Guidelines Emergencies Appointments Clinical Services Diagnostic Laboratories Facilities Get Directions About Ryan Hospital Referring Veterinarians Contact New Bolton Center Kennett Square, PA Emergencies & Appointments: 610-444-5800 Directions Ryan Hospital Philadelphia, PA Emergencies: 215-746-8911 Appointments: 215-746-8387 Directions facebook instagramm LinkedIn Home Education Education at Penn Vet Penn Vet is a world leader in educating future veterinarians and researchers, setting the standard in curricular excellence. We define tomorrow's veterinary leaders through the diversity and breadth of our educational offerings. Since the first graduating class in 1887, Penn Vet has had more than 6,000 veterinarians pursue careers like, veterinary medicine, research, and public health. They have done so in both private and non-profit sectors such as pharmaceutics, biotech, and public policy. The majority of Pennsylvania's practicing veterinarians are Penn Vet grads. Their most vital tasks include ensuring food safety, and care to our animal agriculture industry. Take that next step in making an impact. For students like Alexis Massey (V’26) and David Vega (V’26), the impact of a scholarship lasts far beyond the four years it takes to earn a VMD; it is a gift that transcends a lifetime. Discover the many aspects of education at Penn Vet VMD Admissions Looking to study at Penn Vet? Visit our Admissions section... The VMD Curriculum The VMD Curriculum is unique. Find out how it works... Financial Matters Learn about costs, tuition, fees, and how to pay for your education... Student Life There's more to school than class. Check out student life options... Graduate Programs Interested in animal welfare? Explore our graduate programs... Dual-Degree Programs Reach beyond your VMD. Look into dual-degrees... Continuing Education It doesn't end with a VMD. Learning is a life-long pursuit... Supplemental Information Form Access the Supplemental Information Form System now... Questions? admissions@vet.upenn.edu or 215-898-5434. Penn Vet Accreditation Read about Penn Vet's Accreditation... Resources Apply to Penn Vet Maps & Directions Contact Penn Vet Accreditation Careers Penn Vet Library Staff Portal Emergency Information Student Portal Connect Facebook Flickr LinkedIn YouTube RSS Legal Report Accessibility Issues and Get Help Copyright Info Privacy Disclaimer ©2024 University of Pennsylvania, School of Veterinary Medicine 3800 Spruce Street - Philadelphia, PA 19104"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:46.354887",
    "url": "https://sp2.upenn.edu/admissions/",
    "university_name": "University of Pensylvania",
    "title": "ADMISSIONS",
    "content": "logo Academics ACADEMICS Master’s Programs Master of Social Work MS in Social Policy MSSP+DA MS in Nonprofit Leadership Certificate Programs and Specializations MSW Certificate Programs & Specializations MSSP Certificate Programs NPL Certificate Programs Doctoral Programs PhD in Social Welfare Doctorate in Clinical Social Work Interdisciplinary Partnerships MSW/Certificate in Jewish Communal Service NPL/Center for Social Impact Strategy Executive Program NPL/Certificate in Jewish Communal Service NPL/Certificate in Jewish Nonprofit Management NPL/MA in Hebrew Letters NPL/MA in Jewish Communal Service NPL/Master of Social Welfare Dual Degree Programs Submatriculation for Penn Undergraduates MSW Dual Degree Programs MSSP Dual Degree Programs NPL Dual Degree Programs Continuing Education: OpenSP2 Academics The world needs leaders equipped with tools to make a difference. The School of Social Policy & Practice (SP2) will prepare you to become one of those leaders, as a policy maker, practitioner, educator, activist, and more. Learn More Admissions ADMISSIONS How to Apply Master of Social Work MS in Social Policy MS in Nonprofit Leadership PhD in Social Welfare Doctorate in Clinical Social Work Financial Aid Social Justice Scholars Tuition and Fees Admissions Events Accepted Students Admissions Begin your journey to become part of the next generation of changemakers for social innovation, justice, and impact at the School of Social Policy & Practice (SP2). Learn More Apply Now Research RESEARCH Areas of Research Children, Women & Family Well-Being Climate Inequality Data-Driven Policy Analysis + Evidence-Based Practice Economic Security Health Equity, Mental Health & Aging Identity, Immigration & Racism Mass Incarceration, Homelessness, Substance Use Social Innovation, Philanthropy & Nonprofit Management Research Centers & Projects Visiting Students and Scholars Research Cutting-edge research leads to innovation and impact. Research at SP2 is led by renowned faculty who are highly respected practitioners, educators, and mentors. Learn More Faculty FACULTY Faculty News Faculty Directory Faculty Resources Students STUDENTS Student News Accepted Students Student Life & Resources Philadelphia SP2 Mentor Collective Libraries Diversity, Equity, and Inclusion Health & Wellness Student Organizations Career & Professional Development Academic and Writing Support Academic Resources Master of Social Work MS in Social Policy MS in Nonprofit Leadership PhD in Social Welfare Doctorate in Clinical Social Work Global Opportunities Academic Policies and Procedures Students Our close-knit community is committed to progress, innovation, and social justice. Learn More Alumni ALUMNI Alumni News Career Services Networking Be a Mentor Get Involved Nonprofit Leadership Alumni Association Dean’s Alumni Advisory Board Alumni Events Alumni Our students graduate committed to bringing innovation and passion to the pursuit of justice and positive social impact. Learn More Info For… INFO FOR Students Accepted Students Staff Faculty Community Partners Media Visitors ABOUT About Who We Are Why Sp2? Quick Facts SP2 Board Inclusion Dean’s Welcome News Events APPLY NOW GIVE Give Giving Opportunities Your Impact Search ADMISSIONS Begin your journey to become part of the next generation of changemakers for social innovation, justice, and impact at the School of Social Policy & Practice (SP2). How to Apply Discover the admissions requirements and steps needed to apply to SP2’s highly respected degree programs. HOW TO APPLY TO SP2 MASTER OF SOCIAL WORK ADMISSIONS MS in Social Policy Admissions MS in Nonprofit Leadership Admissions PhD in Social Welfare Admissions Doctorate in Clinical Social Work Admissions SP2 Programs Enhance your degree or boost your professional skills at SP2. Learn more about our degree programs, dual degrees, certificates and specializations, continuing education programs, and more. Master of Social Work MS in Social Policy MS in Social Policy + Data Analytics for Social Policy Certificate MS in Nonprofit Leadership PhD in Social Welfare Doctorate in Clinical Social Work Dual Degree Programs Certificate Programs & Specializations Interdisciplinary Partnerships Continuing Education: OpenSP2 Connect With Us We’d love the chance to meet you, answer your questions, and demonstrate why SP2 is the ideal place to study your passions. Information Sessions Pre-Application Appointments Recruitment Events Contact Us TUITION Tuition and Fees Find out more about the cost of attending SP2, from tuition and fees to living in dynamic (and affordable) Philadelphia. LEARN MORE Financial Aid Funding Your Education We will connect you with financial aid, scholarships, loans, work study programs, fellowships, and other resources that make an SP2 education accessible and affordable. LEARN MORE “Here at SP2, we are looking for critical thinkers committed to making impactful change in our world. Each year, I look forward to welcoming a new cohort of students knowing that they will be impacting societal change on many levels.” – Mary Mazzola , Associate Dean, Enrollment Management and Global Outreach Events 06/01 MSW Licensure Seminar Final summary and ending MORE > Events 07/01 Advanced Standing Orientation Orientation for the Advanced Standing cohort! MORE > Events 08/26 Convocation Required for all incoming SP2 student our five degree programs. MORE > Contact Us SP2 Admissions 215 746 1934 215 746 1300 (fax) apply@sp2.upenn.edu Office of Financial Aid 215 898 5535 finaid@sp2.upenn.edu Related Links ACADEMICS > REQUEST INFORMATION > ACCEPTED STUDENTS > ADMISSIONS STAFF > FINANCIAL AID STAFF > Footer DIRECTORY NEWS EVENTS POLICIES & PROCEDURES SP2 Academic Calendar EMPLOYMENT CONTACT US DISCLAIMER PRIVACY STATEMENT REPORT ACCESSIBILITY ISSUES/GET HELP ACCESS SP2 SHAREPOINT SCHOOL OF SOCIAL POLICY & PRACTICE 3701 Locust Walk Philadelphia, PA 19104-6214 PHONE: 215 898 5512 FAX: 215 573 2099 FOLLOW US pennsp2 View May 20 Open Some snapshots of #PennSP2`s Alumni Weekend celebrations in Caster courtyard! Our Friday night Alumni Reception 🎓 and Sunday Jazz Brunch 🎷 brought live music, delicious food, and great company. Thanks to our alumni, friends, and 2024 graduates who came out to celebrate! 🎶 🎉 💙  #PennAlumni #PennGrad ... pennsp2 View May 19 Open Congratulations to the #PennSP2 Class of 2024 and thank you to our Commencement speaker, SP2 Senior Leadership Fellow Douglas M. Brooks, MSW! 🎊 🎈 ... pennsp2 View May 18 Open As today`s #PennSP2 Commencement ceremony approached, the Class of 2024 took a journey from the pre-commencement reception with families at the Inn at Penn to class photos backstage at the Palestra. 🎈 💙 ... Facebook LinkedIn Instagram YouTube Twitter"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:47.473073",
    "url": "https://www.gse.upenn.edu/admissions",
    "university_name": "University of Pensylvania",
    "title": "Search form",
    "content": "Skip to main content Toggle navigation University of Pennsylvania Graduate School of Education About Penn GSE & Our Impact Penn GSE Environmental Justice Statement Philadelphia Impact Global Initiatives Diversity & Inclusion Catalyst @ Penn GSE Penn GSE Leadership Contact Us Academics & Research Program Finder Academic Divisions & Programs Professional Development & Continuing Education Teacher Programs & Certifications Undergraduates Dual and Joint Degrees Faculty Directory Research Centers, Projects & Initiatives Lectures & Colloquia Books & Publications Academic Journals Admissions & Financial Aid Application Requirements & Deadlines Tuition & Financial Aid Campus Visits & Events International Students Options for Undergraduates Non-Degree Studies Contact Admissions / Request Information Student Experience Life at Penn GSE Penn GSE Career Paths Living in Philadelphia DE&I Resources for Students Student Organizations Career & Professional Development News & Events News Archive Events Calendar The Educator's Playbook Find an Expert Explore by Topic Philadelphia Impact Global Initiatives Race, Equity & Inclusion Counseling & Psychology Education Innovation & Entrepreneurship Education Policy & Analysis Higher Education Language, Literacy & Culture Leadership Teaching & Learning Alumni & Supporters Support Penn GSE Connect Contact Development & Alumni Relations IES Fellows Find a Program Request Info Apply Make a Gift Info For Alumni Current Students Staff & Faculty Donors Employers Search form Search Admissions & Financial Aid You are here Home > Admissions & Financial Aid Take Your Next Steps Consistently ranked in the top 10 by U.S. News & World Report , the Graduate School of Education at the University of Pennsylvania is a national leader in education research and preparing educators to be leaders and innovators—locally, nationally, and worldwide. Program Finder Request Information Apply Online How to Apply Start your application today. Review the requirements needed to complete a successful application. Learn More Tuition & Financial Assistance Penn GSE is committed to making your graduate education affordable, and we offer generous scholarships, fellowships, and assistantships. Scholarships and Fellowships Admissions Events May 22 Global Higher Education Management (Online) Virtual Information Session Wednesday, May 22, 2024 - 11:00am to 12:00pm ET Virtual Join us to learn more about Penn GSE's Online program in Global Higher Education Management. This program develops and connects university leaders from around the world who are committed to improving and enhancing higher education institutions. May 23 Penn Chief Learning Officer Virtual Information Session May 30 SALT Professional Development Fair May 31 Friday Virtual Chat View all Admissions Events International Applicants > In addition to our standard application requirements, students with international coursework are required to submit supplemental requirements that may include course-by-course evaluations and/or test scores from the TOEFL or IELTS. Discover resources regarding student visa applications, scholarship opportunities, and more. Penn Undergrads > Get a head start on your graduate education while completing your undergraduate degree, or begin to explore your interest with a minor in urban education—at no additional cost. Non-Degree Studies > Explore graduate-level courses at Penn GSE for personal or professional development—no GRE required. Class Profile Data reflects all students enrolled in our degree (Ed.D., Master's, and Ph.D.) and certification-only programs as of the Fall 2023 term. Total Students Ph.D. 105 Ed.D. 275 Master's 1,231 Enrollment Status Full-time students 78% Part-time students 22% Age Range Ph.D. students 23-48 Ed.D. students 26-70 Master's students 21-62 Program Format Traditional 72% Executive 25% Online 3% International Students International students 38% Countries represented 49 Languages Spoken 67 Domestic Students Domestic students 62% African-American 20% Asian-American 14% Hispanic or Latino/a 11% More than one Race/Ethnicity 3% Unknown 1% Contact Information Office of Admissions & Financial Aid University of Pennsylvania Graduate School of Education 3700 Walnut Street Philadelphia, PA 19104 (215) 898-6415 admissions@gse.upenn.edu finaid@gse.upenn.edu Request Info Online Application University of Pennsylvania Graduate School of Education 3700 Walnut Street Philadelphia, PA 19104 (215) 898-6415 admissions@gse.upenn.edu About Admissions & Financial Aid Find a Program Visiting Campus Alumni Diversity & Inclusion Faculty Directory Open Faculty Positions Support Penn GSE Academic Calendar Events Calendar Career & Professional Development Canvas Access PennInTouch Libraries Registrar/Student Records Office Webmail One Penn GSE Business Office Facility Services Human Resources Information Technology Staff Directory U@Penn Store Report accessibility issues and request help © 2024 Penn Graduate School of Education Facebook Twitter Vimeo LinkedIn Instagram Disclaimer | Privacy Policy | Penn GSE Equal Opportunity & Harassment Policies"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:49.846477",
    "url": "https://www.nursing.upenn.edu:443/admissions/",
    "university_name": "University of Pensylvania",
    "title": "Admissions",
    "content": "Apply Give News & Events Information For Students Alumni Parents Faculty & Staff Search Close search Search Go to search results A world-class city filled with art and culture and an incredible campus that offers cutting edge resources–that’s what students receive at Penn Nursing. And that’s just the start. Penn Nursing and the wider university offer something for everyone, as well as a lifelong community. Penn Nursing is globally known for educating dynamic nurses—because our School values evidence-based science and health equity. That’s where our expertise lies, whether in research, practice, community health, or beyond. Everything we do upholds a through-line of innovation, encouraging our exceptional students, alumni, and faculty share their knowledge and skills to reshape health care. Penn Nursing students are bold and unafraid, ready to embrace any challenge that comes their way. Whether you are exploring a career in nursing or interested in advancing your nursing career, a Penn Nursing education will help you meet your goals and become an innovative leader, prepared to change the face of health and wellness. Penn Nursing is the #1-ranked nursing school in the world. Its highly-ranked programs help develop highly-skilled leaders in health care who are prepared to work alongside communities to tackle issues of health equity and social justice to improve health and wellness for everyone. Penn Nursing’s rigorous academic curricula are taught by world renowned experts, ensuring that students at every level receive an exceptional Ivy League education . From augmented reality classrooms and clinical simulations to coursework that includes experiential global travel to clinical placements in top notch facilities, a Penn Nursing education prepares our graduates to lead. About At a Glance Who We Are Mission and Values Social Justice Sustainability History Legacy of Leadership Our Leadership Dean Faculty Senate Faculty Senate Committees Board of Advisors Our Faculty Emeriti & Retired Faculty Diversity, Equity, and Inclusion Our Commitment Accreditation Admissions How To Apply General FAQs International Applicants Ask Us Anything Admissions Events Visit Penn Nursing Directions Financial Aid Undergraduate Graduate PhD External Scholarships Current Students Contact Financial Aid Admitted Students BSN Students Master of Professional Nursing Students Streamlined MSN Students MSN & DNP Students PhD Students Contact Us Request Information Guidance Counselors Academics A Penn Nursing Education Learning Through Simulation Anatomy-Physiology Lab Team Care Mentorship Study Abroad Submatriculation Undergraduate Honors Program Undergraduate Programs Bachelor of Science in Nursing Major in Nutrition Minors Dual Degrees Master’s Programs Master of Science in Nursing Master of Professional Nursing Master of Science in Nutrition Science Minors Dual Degrees Certificates Doctoral Programs Doctor of Nursing Practice DNP Scholarly Projects Doctor of Philosophy in Nursing Dual Degrees Our Expertise Research Research Centers Faculty Research Interests Student Research Faculty Publications Innovation Design Thinking for Health Innovation Accelerator Innovation Colloquiums Nurse Innovation Fellowship Meet the Fellows FAQs Apply Now Summer Innovation Institute Practice Faculty in Practice Academic Practice Partners Preceptors Resources Preceptors of the Year Request More Information Global Health Student Opportunities Semester Abroad Programs Short Term & Independent Programs Internship & Fellowship Programs International Visitors Partnerships Peace Corps World Health Organization Penn Global Nursing Fellowship For Alumni For Host Organizations Vingroup-Penn Alliance Global Bites Travel Resources Community Engagement Community Partnerships Student Initiatives Community Service Courses Student Life The Student Experience Organizations Traditions Cultural Resources Service & Support Admissions Admissions How To Apply General FAQs International Applicants Ask Us Anything Admissions Events Visit Penn Nursing Directions Financial Aid Undergraduate Graduate PhD External Scholarships Current Students Contact Financial Aid Admitted Students BSN Students Master of Professional Nursing Students Streamlined MSN Students MSN & DNP Students PhD Students Contact Us Request Information Guidance Counselors There are so many reasons you might choose to become a Penn Nurse. Is it the prospect of studying with renowned faculty at one of the nation’s elite research universities? Or is it the access to world-class clinical and research opportunities? It could be our incredibly ambitious, tight-knit, and supportive student body . Or the fact that our alumni are leading nursing science and practice, and are changing the face of healthcare everyday, in every setting imaginable. We hope you’ll join us. Take the next step We are your resource Penn Nursing’s Admissions and Financial Aid teams are here to guide you. From planning a visit to answering questions about the application and aid, we will be your #1 resource while taking these next steps. Learn more about our programs View our upcoming admissions events to understand more about our academic programs that interest you, meet the faculty, and be introduced to the curriculum. View upcoming events Are you ready to begin your application? View our frequently asked questions or see what you need to apply. Start an application Upcoming Admissions Events June 14\t\t\t\t | 12:00pm Spring 2024 Graduate Programs Info Session View all events For Nine Consecutive Years, Penn Nursing is Ranked the #1 Nursing School in the World The University of Pennsylvania School of Nursing (Penn Nursing) holds its number one spot as the world’s leading nursing school according to a recent ranking by QS World University . The rankings highlight the world’s top universities in 55 different subject areas from 1,559 institutions, of which 64 universities are new to the rankings. Read More For Nine Consecutive Years, Penn Nursing is Ranked the #1 Nursing School in the World Director of Harvard Global Nursing Leadership Program to be 2024 Penn Nursing Commencement Speaker Stephanie Ferguson, PhD, RN, FAAN , the Director of the Harvard Global Nursing Leadership Program and Professor of the Practice of Health Policy and Management at the Harvard T.H. Chan School of Public Health , will serve as the 2024 Penn Nursing commencement speaker. The event will take place at 3:00 PM EST on Monday, May 20, 2024, at the Kimmel Center for the Performing Arts . Read More Director of Harvard Global Nursing Leadership Program to be 2024 Penn Nursing Commencement Speaker Become a Penn Nurse 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement Related Links Annual Security & Fire Safety Report Take the next step View Programs Plan a Visit See Yourself Here follow along @pennursing Facebook Twitter Instagram LinkedIn YouTube Contact Us Careers Maps & Directions School Directory Privacy Policy Nondiscrimination Statement Report Accessibility Issues & Get Help Logins: Web Support Sharepoint Login Editor Login Back to top"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:58:55.977790",
    "url": "https://www.asc.upenn.edu/graduate/apply-phd-program",
    "university_name": "University of Pensylvania",
    "title": "Apply to the Ph.D. Program",
    "content": "Skip to main site navigation Skip to main content Return to Anneberg School for Communication Homepage Open the main menu People Faculty, Lecturers & Researchers Graduate Students Staff Graduate Ph.D. Program How to Apply Financial Support Curriculum and Milestones Courses Graduate Faculty Joint Degrees & Certificates Student Life Careers & Outcomes Undergraduate Major in Communication Declaring the Major Major Requirements Courses Academic Opportunities Advising Appointments Careers & Outcomes Research Research Areas Topics Centers & Groups Annenberg School Library Executive Education Multimedia Lab News & Events News Events In the Media About Message from the Dean Mission & History Leadership & Governance Location & Facilities Careers at Annenberg Contact Us Open the search panel Search Site Graduation Alumni Policies & Resources Doctorate in Communication Apply to the Ph.D. Program Apply to the Ph.D. Program Thank you for your interest in the Annenberg School's doctoral program! Read on for all the details on how to apply. Applications to the Ph.D. program are now open. Request More Information Getting Started Applications for the following calendar year open October 2 . The Annenberg School for Communication does not accept paper applications. Elements of the application include: Three Letters of Recommendation Statement of Purpose CV or Resume Transcripts $90 Application Fee GRE Scores (optional) TOEFL/IELTS Scores (for non-native speakers of English) Writing Sample (optional) Read on for more details about each of these application elements. An application is considered complete and ready for review when we have received all of the above required items. Incomplete applications will not be reviewed. Please note that all application materials become property of the University of Pennsylvania and will not be returned. Remember to retain a personal copy of your application. Key Dates October 2 The Annenberg School begins accepting applications for the fall term that begins the following calendar year. November 1 TOEFL exams (if needed) should be complete to ensure they are received by December 1. December 1 Statement of Purpose, CV, test scores, transcripts, and online application must be submitted and application fee paid (unless the applicant qualifies for a fee waiver ). December 15 All letters of recommendation must be received. April 1 Annenberg will complete notifying applicants about all admission decisions. Application Details Three Letters of Recommendation Please submit no more than three letters from individuals who are familiar with your academic abilities and scholarly work. Annenberg’s online application system will generate a request for a recommendation letter. It will be sent from your email address to your recommender. Please have each recommender's contact information (including email address and phone number) ready when you log on to begin your application. Interfolio users should email the dossier to joanne.murray@asc.upenn.edu . Please ask each recommender to submit your letter as a Microsoft Word or Adobe PDF document. However, if any of your recommenders prefers to provide a hard copy letter instead of using email, please request that the document be mailed to our admissions office before the December 15 deadline. Our mailing address is: The Annenberg School for Communication Admissions Office University of Pennsylvania 3620 Walnut Street Philadelphia, PA, 19104-6220 Statement of Purpose and Research Advisor Selection Your statement of purpose should discuss your potential research area or topic and its relationship to an Annenberg School for Communication graduate faculty member , research center, or lab . Please describe in detail how your academic and professional background, interests, and preparation in the social sciences, the humanities, and other studies support your research topic. The statement should also address the question of what career objectives an Annenberg degree would help you realize. The statement should be double spaced and must not exceed 1,000 words. On the application you will be asked to identify potential Research Advisors.  Please select (in order) the three Annenberg faculty you are most interested in working with.  Note: only faculty who are accepting new students are on this application drop down.  The indicated faculty will be asked to review your application.  However, you do not need their permission to apply. CV or Resume A CV or resume should include references to major research projects, a thesis, and other scholarly papers and accomplishments. The file should be attached to the online application as a Word or Adobe PDF file. Graduate Record Examination (GRE) — Optional The GRE will be optional for the coming application cycle. Your file will be reviewed with or without GRE scores. GRE scores are valid and reportable only for five years from the test date. The test may be taken internationally. Please see the GRE website for testing locations in your area. The ETS code for the Annenberg School at the University of Pennsylvania is (2926) on the request form. W e do not use department codes, but anything you choose will get to us . Applicants should allow at least six weeks for GRE scores to be processed and received. Information about the GRE may be obtained from the Educational Testing Service, P.O. Box 6000, Princeton, NJ 08541-6000. If you are submitting scores, please arrange for us to receive an official report of your general GRE test scores before the application deadline of December 1. Test for Non-Native Speakers of English (TOEFL/IELTS) Applicants from non-English speaking countries must submit the results of their TOEFL/IELTS exam unless they have obtained a degree from a university or college in an English speaking nation or was taught entirely in English. TOEFL/IELTS exam results can be sent electronically to the University of Pennsylvania Annenberg School OR mailed to: The Annenberg School for Communication Admissions Office University of Pennsylvania 3620 Walnut Street Philadelphia, PA, 19104-6220 Transcripts Applicants may scan and attach student copies of academic transcripts to the application. If you are currently taking classes you will not need to send us an updated transcript once your grades are submitted. One official transcript of all undergraduate and graduate work will be required if you are offered admission to the program. An offer of admission will be contingent upon verification of student records with official transcripts from your institutions. Only graduates of a college or university will be admitted to the Annenberg School graduate program. $90 Application Fee Payment may be made by credit card online or by mailing a check or money order payable to the Trustees of the University of Pennsylvania. International applicants applying from abroad who are not using credit cards should provide a $90 check drawn on a U.S. bank or international postal money order. Fee waivers are available for McNair Fellows, participants in the National Name Exchange, or those with demonstrated financial need. Please be advised that applicants must demonstrate a clear and compelling case of financial hardship and fee waivers may be considered for U.S. citizens or permanent residents only. Email Joanne Murray a brief letter stating the reason for your request. Writing Sample — Optional You may submit whatever you feel best displays your scholarly writing ability. The sample must not exceed 10 pages, double-spaced, and may be an excerpt from a larger work (not including references). Please upload the writing sample using the online application. Frequently Asked Questions Our Graduate Studies team answers applicants' mostly commonly asked questions. Read the FAQ Apply Applications to the Ph.D. program will open in October. Contact Us John B. Jemmott III, Ph.D. Associate Dean for Graduate Studies Kenneth B. Clark Professor of Communication and Psychiatry john.jemmott@asc.upenn.edu Joanne Murray, M.S.Ed. Assistant Dean for Graduate Studies (215) 573-6349 joanne.murray@asc.upenn.edu University of Pennsylvania Homepage Annenberg School for Communication 3620 Walnut Street Philadelphia, PA 19104 Contact Us Building Hours: Monday to Friday - 8:00AM to 11:00PM Saturday to Sunday - 10:00AM to 5:00PM No Pets - Service Animals Only Library Hours: Monday to Friday - 9:00AM to 5:00PM Saturday & Sunday - Closed Engage With Us on social media Facebook Twitter YouTube Instagram Support Annenberg Privacy Copyright Information Disclaimer Report Accessibility Issues & Get Help Contact Us Copyright © 2024 Annenberg School for Communication at the University of\n        Pennsylvania"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:06.733064",
    "url": "https://admissions.upenn.edu/visit-connect/contact-us",
    "university_name": "University of Pensylvania",
    "title": "Site Navigation",
    "content": "Skip to main content Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Search Close Menu Close Search keywords Search Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Contact Us Thank you for your interest in the University of Pennsylvania. We are eager to connect applicants, parents, and counselors with the information they need to navigate the admissions process. We are here to help. Navigate Section Contact Us Visit Penn Penn Perspectives Ask Have a question for Penn Admissions? Find answers to your questions about visiting campus, application materials, specialized programs, financial aid and more! Frequently Asked Questions Submit your question(s) directly online, so we can get you the information you need. Submit A Question Join our mailing list to get updates about virtual events, news from our office and insight into the college admissions process. Join Our Mailing List Phone and Fax Numbers Our staff is available to speak with you Mondays through Fridays, from 9:30 am - 12:30 pm and 2:00 pm - 5:00 pm Eastern Time. Phone: (215) 898-7507 Fax: (215) 898-9670 Mailing Address University of Pennsylvania Office of Admissions 3535 Market Street, Suite 850 Philadelphia, PA 19104 When possible, please submit applicant materials electronically. Admissions Visitor Center Claudia Cohen Hall, Ground Floor 249 S. 36th Street Philadelphia, PA 19104 Contact Us By Region Please see below for admissions contact information by region. NORTHEAST REGION Email the Northeast Region Team: northeastteam@admissions.upenn.edu State Admissions Contact Connecticut Barkley Barton Maine Andrew Campbell Massachusetts Andrew Campbell New Hampshire Andrew Campbell New York (Rockland and Westchester Counties) Suzannah Bretz New York (Manhattan, Bronx) Jessica Ward Regosch New York (Upstate New York and Brooklyn, Queens, Staten Island) Micaela Beigel New York (Long Island) Suzannah Bretz Rhode Island Andrew Campbell Vermont Andrew Campbell MID-ATLANTIC REGION Email the Mid-Atlantic Region Team: midatlanticteam@admissions.upenn.edu State Admissions Contact Delaware Courtney Bradshaw Maryland Zoe Osborne New Jersey (Southern Jersey, Camden, Burlington, Jersey Shore, Pinelands, & Monmouth Counties) Andria Board New Jersey (Essex, Southern Passaic, Hudson, Bergen, Morris, Northern Passaic, Sussex, Warren, & Hunterdon Counties) Samantha Cardenas New Jersey (Middlesex , Somerset, Mercer, & Union Counties) Tina Pierce Fragoso Pennsylvania (All counties except Philadelphia) Ana Del Puerto and F. Wykle Pennsylvania (Philadelphia County) Courtney Bradshaw Washington, D.C. Andria Board SOUTH REGION Email the South Region Team: southteam@admissions.upenn.edu State Admissions Contact Alabama Mwanasha Warrakah-VanWright Arkansas Mwanasha Warrakah-VanWright Florida Crissy Iglesias Georgia Sara Cohen Louisiana Mwanasha Warrakah-VanWright Kentucky Reshan Selvavelautham Mississippi Mwanasha Warrakah-VanWright North Carolina Sara Cohen Oklahoma Reshan Selvavelautham Puerto Rico Crissy Iglesias South Carolina Sara Cohen Tennessee Reshan Selvavelautham Texas Kevin Strong U.S. Virgin Islands Crissy Iglesias Virginia Molly Scherner West Virginia Molly Scherner WEST and MIDWEST REGION Email the West/Midwest Region Team: westmidwestteam@admissions.upenn.edu State Admissions Contact Alaska Billy Gannon Arizona Katerina Davidson California Natalie Zamora Colorado Hosea Wah Guam Jordan Pascucci Hawaii Barkley Barton Idaho Billy Gannon Illinois Caroline Bormann Indiana Caroline Bormann Iowa Xena Wang Kansas Xena Wang Michigan Xena Wang Minnesota Xena Wang Missouri Xena Wang Montana Hosea Wah Nebraska Xena Wang Nevada Katerina Davidson New Mexico Katerina Davidson North Dakota Xena Wang Ohio Xena Wang Oregon Billy Gannon South Dakota Xena Wang Utah Hosea Wah Washington Billy Gannon Wisconsin Xena Wang Wyoming Hosea Wah INTERNATIONAL REGION Email the International Region Team: internationalteam@admissions.upenn.edu Region Admissions Contact Africa (Sub-Saharan Africa) Elisabeth O’Connell Africa (North Africa) Justin Mazur Asia (Central Asia) Akosua Ako-Addo Asia (China) Barbara Stoddard Asia (East and Southeast Asia) Elisabeth O’Connell Asia (South Asia) Kristen Pantazes Caribbean and Bermuda Crissy Iglesias Central and South America William Canon Europe and Eurasia (Continental Europe and Ireland) Jessica Ward Regosch, Barbara Stoddard, and Akosua Ako-Addo Europe and Eurasia (United Kingdom) Jordan Pascucci Europe and Eurasia (Turkey) Justin Mazur Middle East Justin Mazur North America (Canada) Madeleine Jacobs North America (Mexico) Ana del Puerto Oceania Elisabeth O’Connell 1 College Hall, Room 1, Philadelphia, PA 19104-6376 Footer Menu Join the mailing list Contact Us Accessibility Privacy Policy NACAC Partnership Agreement"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:09.669793",
    "url": "https://srfs.upenn.edu/financial-aid/undergraduate-aid-program",
    "university_name": "University of Pensylvania",
    "title": "SRFS Utility Links",
    "content": "Skip to main content SRFS Utility Links Path@Penn University Catalog Financial Wellness @ Penn University of Pennsylvania search full menu SRFS Drawer Menu Costs & Budgeting Explore Back to main menu Undergraduate Cost of Attendance Explore Back to main menu Undergraduate Tuition and Fees College of Liberal and Professional Studies Undergraduate Summer Session Graduate Cost of Attendance Explore Back to main menu Graduate School of Education Penn Carey Law Perelman School of Medicine Explore Back to main menu MD Program PSOM Master's & Certificate Programs School of Arts and Sciences School of Dental Medicine Explore Back to main menu DMD-PASS Graduate Dental Education School of Engineering and Applied Science School of Nursing School of Social Policy and Practice School of Veterinary Medicine Weitzman School of Design Wharton School PhD Programs Graduate Summer Session Liberal and Professional Studies Graduate Program Costs Estimate Your Costs Billing & Payment Explore Back to main menu Understanding Your Bill Paying Your Bill Explore Back to main menu Penn.Pay Explore Back to main menu Penn.Pay FAQ Third Party Payment Contracts Payment Status Wire Transfer Instructions Tuition Refund Plan Billing Schedule Financing and Payment Plans Explore Back to main menu Penn Payment Plan Tuition Prepayment Plan Student and Parent Loans Explore Back to main menu Types of Loans Loan Repayment Explore Back to main menu Federal Student Loan Repayment Public Service Loan Forgiveness Federal Loan Consolidation Student Loan Exit Counseling E-sign Line of Credit Student Account Refunds Local Banks Billing Contacts Student Fund Recovery Financial Aid Explore Back to main menu Undergraduate Aid Program Explore Back to main menu Financial Aid 101 How We Determine Need Facts and Figures Applying for Financial Aid Financial Aid Funds Explore Back to main menu Grants and Scholarships Explore Back to main menu Mayor's Scholarship Program Explore Back to main menu Mayor's Scholarship FAQ Outside Scholarships Student and Parent Loans Explore Back to main menu Types of Loans Explore Back to main menu Federal Direct Loan (Undergraduate) Federal Direct PLUS Loan (Undergraduate) Federal Direct Loan (Graduate) Federal Direct Grad PLUS Loan Health Professions Student Loan Nursing Student Loan Private Alternative Loans Comparing Graduate Loan Options Loan Repayment Explore Back to main menu Federal Student Loan Repayment Explore Back to main menu Return to Federal Repayment FAQ Public Service Loan Forgiveness Federal Loan Consolidation Student Loan Exit Counseling E-sign Graduate Student Loans FAQ Work-Study Explore Back to main menu International Student Work-Study Summer Funding Emergency Funding FAFSA Comment Code Guide Federal Verification Financial Aid Counseling Explore Back to main menu Undergraduate Counseling Highly Aided Undergraduate Counseling Graduate Counseling International Student Financial Aid Explore Back to main menu International Students and U.S. Taxes Financial Aid for Undocumented Residents International Student FAQ Veterans and Military-Affiliated Students Explore Back to main menu VA Chapter Benefits - Current and Prospective Students Veteran Status for Federal Aid Yellow Ribbon Program Using Your Benefits Federal Tuition Assistance (FTA) VA Benefits FAQ VA Disclosures and Resources Highly Aided Students Explore Back to main menu Highly Aided Summer Funding Highly Aided Break Meal Program Financial Aid Forms Student Employment Explore Back to main menu Search for a Job Student Employment Options Explore Back to main menu Federal Work-Study Non-Work Study International Student Work-Study Pay Schedule Receiving Your Pay Information for Hiring Managers Explore Back to main menu Federal Work-Study Community Service Information for Off-Campus Employers Student Employment Forms Student Employment FAQ Contact Student Employment Registration, Catalog & Calendar Explore Back to main menu Course Registration Holds University Catalog Penn Academic Calendar Course Rosters and Timetables Explore Back to main menu Archives Final Exam Information Student Records Explore Back to main menu Request a Transcript Explore Back to main menu Transcript Key Student Grades Explore Back to main menu Grade Mode Change Course Action Notices Notary Services Degrees, Graduation, and Diplomas Explore Back to main menu Graduation Application Enrollment and Degree Verification Update Your Student Data Explore Back to main menu Update Required Contact Information Quaker Consortium External Credit Explore Back to main menu External Credit FAQs Withdrawals and Leaves of Absence Student Privacy Policies & Publications Explore Back to main menu Policies Publications Student Financial Responsibility Statement Faculty & Staff Resources Explore Back to main menu Pennant Explore Back to main menu Pennant Access Requests Pennant Aid Explore Back to main menu Pennant Aid Resources Pennant Aid Support Pennant Records Explore Back to main menu Pennant Records Resources & Support Curriculum Manager (CM) Explore Back to main menu Curriculum Manager (CM) Contacts CourseLeaf Section Scheduler (CLSS) Pennant Records Resources & Support Explore Back to main menu Pennant Records Resources & Support - Advisors Explore Back to main menu Advisors - Advising Advisors - CAN Advisors - Degree Works Advisors - Pennant Workflow Advisors - Personal Information Advisors - Student Records Advisors - Videos Pennant Records Resources & Support - Faculty and Instructors Explore Back to main menu Faculty and Instructors - Class Lists Faculty and Instructors - Course Action Notices Faculty and Instructors - Courses-at-Penn Faculty and Instructors - Grading Faculty and Instructors - Pennant Workflow Faculty and Instructors - Personal Information Faculty and Instructors - Videos Faculty and Instructors - XCAT Pennant Records Resources & Support - School Registrars and Administrators Explore Back to main menu School Registrars and Administrators - Advisors School Registrars and Administrators - Grades School Registrars and Administrators - Graduation School Registrars and Administrators - Graduate Forms School Registrars and Administrators -  Legacy Records School Registrars and Administrators - Matriculated Students School Registrars and Administrators - Pennant Workflow School Registrars and Administrators - Personal Information School Registrars and Administrators - Registration School Registrars and Administrators - Student Records School Registrars and Administrators - Videos School Registrars and Administrators - XCAT Pennant Records Resources & Support - Students Explore Back to main menu Students -  CAN Students -  Degree Audit Students -  Exceptions to Policy Students -  Grades Students -  Graduation Students -  Personal Information Students - Major-Minor Updates Students - Registration Students - XCAT Pennant Accounts Explore Back to main menu Pennant Accounts Feeder App Explore Back to main menu Pennant Accounts Feeder App FAQ Pennant Graduate Funding Pennant Plus Pennant Accounts Forms Pennant Cost of Attendance Workflow Pennant Accounts Support User Documentation Explore Back to main menu Banner Navigation Quick Reference Guides Data Warehouse Collection Pennant Glossary Advising@Penn Courses@Penn Grading Guidelines Tuition Distribution Process University Classroom and Facility Scheduling Financial Wellness @ Penn SRFS Below Traversable SRFS Offices Contact Us Events & Deadlines Path@Penn Search Undergraduate Aid Program SRFS Sidebar Menu Costs & Budgeting Explore Back to main menu Undergraduate Cost of Attendance Explore Back to main menu Undergraduate Tuition and Fees College of Liberal and Professional Studies Undergraduate Summer Session Graduate Cost of Attendance Explore Back to main menu Graduate School of Education Penn Carey Law Perelman School of Medicine Explore Back to main menu MD Program PSOM Master's & Certificate Programs School of Arts and Sciences School of Dental Medicine Explore Back to main menu DMD-PASS Graduate Dental Education School of Engineering and Applied Science School of Nursing School of Social Policy and Practice School of Veterinary Medicine Weitzman School of Design Wharton School PhD Programs Graduate Summer Session Liberal and Professional Studies Graduate Program Costs Estimate Your Costs Billing & Payment Explore Back to main menu Understanding Your Bill Paying Your Bill Explore Back to main menu Penn.Pay Explore Back to main menu Penn.Pay FAQ Third Party Payment Contracts Payment Status Wire Transfer Instructions Tuition Refund Plan Billing Schedule Financing and Payment Plans Explore Back to main menu Penn Payment Plan Tuition Prepayment Plan Student and Parent Loans Explore Back to main menu Types of Loans Loan Repayment Explore Back to main menu Federal Student Loan Repayment Public Service Loan Forgiveness Federal Loan Consolidation Student Loan Exit Counseling E-sign Line of Credit Student Account Refunds Local Banks Billing Contacts Student Fund Recovery Financial Aid Explore Back to main menu Undergraduate Aid Program Explore Back to main menu Financial Aid 101 How We Determine Need Facts and Figures Applying for Financial Aid Financial Aid Funds Explore Back to main menu Grants and Scholarships Explore Back to main menu Mayor's Scholarship Program Explore Back to main menu Mayor's Scholarship FAQ Outside Scholarships Student and Parent Loans Explore Back to main menu Types of Loans Explore Back to main menu Federal Direct Loan (Undergraduate) Federal Direct PLUS Loan (Undergraduate) Federal Direct Loan (Graduate) Federal Direct Grad PLUS Loan Health Professions Student Loan Nursing Student Loan Private Alternative Loans Comparing Graduate Loan Options Loan Repayment Explore Back to main menu Federal Student Loan Repayment Explore Back to main menu Return to Federal Repayment FAQ Public Service Loan Forgiveness Federal Loan Consolidation Student Loan Exit Counseling E-sign Graduate Student Loans FAQ Work-Study Explore Back to main menu International Student Work-Study Summer Funding Emergency Funding FAFSA Comment Code Guide Federal Verification Financial Aid Counseling Explore Back to main menu Undergraduate Counseling Highly Aided Undergraduate Counseling Graduate Counseling International Student Financial Aid Explore Back to main menu International Students and U.S. Taxes Financial Aid for Undocumented Residents International Student FAQ Veterans and Military-Affiliated Students Explore Back to main menu VA Chapter Benefits - Current and Prospective Students Veteran Status for Federal Aid Yellow Ribbon Program Using Your Benefits Federal Tuition Assistance (FTA) VA Benefits FAQ VA Disclosures and Resources Highly Aided Students Explore Back to main menu Highly Aided Summer Funding Highly Aided Break Meal Program Financial Aid Forms Student Employment Explore Back to main menu Search for a Job Student Employment Options Explore Back to main menu Federal Work-Study Non-Work Study International Student Work-Study Pay Schedule Receiving Your Pay Information for Hiring Managers Explore Back to main menu Federal Work-Study Community Service Information for Off-Campus Employers Student Employment Forms Student Employment FAQ Contact Student Employment Registration, Catalog & Calendar Explore Back to main menu Course Registration Holds University Catalog Penn Academic Calendar Course Rosters and Timetables Explore Back to main menu Archives Final Exam Information Student Records Explore Back to main menu Request a Transcript Explore Back to main menu Transcript Key Student Grades Explore Back to main menu Grade Mode Change Course Action Notices Notary Services Degrees, Graduation, and Diplomas Explore Back to main menu Graduation Application Enrollment and Degree Verification Update Your Student Data Explore Back to main menu Update Required Contact Information Quaker Consortium External Credit Explore Back to main menu External Credit FAQs Withdrawals and Leaves of Absence Student Privacy Policies & Publications Explore Back to main menu Policies Publications Student Financial Responsibility Statement Faculty & Staff Resources Explore Back to main menu Pennant Explore Back to main menu Pennant Access Requests Pennant Aid Explore Back to main menu Pennant Aid Resources Pennant Aid Support Pennant Records Explore Back to main menu Pennant Records Resources & Support Curriculum Manager (CM) Explore Back to main menu Curriculum Manager (CM) Contacts CourseLeaf Section Scheduler (CLSS) Pennant Records Resources & Support Explore Back to main menu Pennant Records Resources & Support - Advisors Explore Back to main menu Advisors - Advising Advisors - CAN Advisors - Degree Works Advisors - Pennant Workflow Advisors - Personal Information Advisors - Student Records Advisors - Videos Pennant Records Resources & Support - Faculty and Instructors Explore Back to main menu Faculty and Instructors - Class Lists Faculty and Instructors - Course Action Notices Faculty and Instructors - Courses-at-Penn Faculty and Instructors - Grading Faculty and Instructors - Pennant Workflow Faculty and Instructors - Personal Information Faculty and Instructors - Videos Faculty and Instructors - XCAT Pennant Records Resources & Support - School Registrars and Administrators Explore Back to main menu School Registrars and Administrators - Advisors School Registrars and Administrators - Grades School Registrars and Administrators - Graduation School Registrars and Administrators - Graduate Forms School Registrars and Administrators -  Legacy Records School Registrars and Administrators - Matriculated Students School Registrars and Administrators - Pennant Workflow School Registrars and Administrators - Personal Information School Registrars and Administrators - Registration School Registrars and Administrators - Student Records School Registrars and Administrators - Videos School Registrars and Administrators - XCAT Pennant Records Resources & Support - Students Explore Back to main menu Students -  CAN Students -  Degree Audit Students -  Exceptions to Policy Students -  Grades Students -  Graduation Students -  Personal Information Students - Major-Minor Updates Students - Registration Students - XCAT Pennant Accounts Explore Back to main menu Pennant Accounts Feeder App Explore Back to main menu Pennant Accounts Feeder App FAQ Pennant Graduate Funding Pennant Plus Pennant Accounts Forms Pennant Cost of Attendance Workflow Pennant Accounts Support User Documentation Explore Back to main menu Banner Navigation Quick Reference Guides Data Warehouse Collection Pennant Glossary Advising@Penn Courses@Penn Grading Guidelines Tuition Distribution Process University Classroom and Facility Scheduling Financial Wellness @ Penn SRFS Below Traversable SRFS Offices Contact Us Events & Deadlines Path@Penn Breadcrumb Penn Student Registration & Financial Services Financial Aid Undergraduate Aid Program Penn’s undergraduate grant-based financial aid program meets 100% of demonstrated financial need with grants and work-study funds. Penn is the largest university with a program that enables eligible undergraduates to receive grant-based financial aid packages for eight semesters. The program applies to traditional, dependent undergraduate students in the College of Arts and Sciences, the School of Nursing, the School of Engineering and Applied Sciences, and the Wharton School, who are pursuing their first baccalaureate degree. This section includes general information about our undergraduate financial aid philosophy and how we build your financial aid package. We also feature data about undergraduate financial aid at Penn. Keep Exploring This Section Financial Aid 101 How We Determine Need Facts and Figures Questions About Terminology? Go To Glossary Need Help? Type a word or phrase into the search box to find the answers you need. Search 3451 Walnut Street University of Pennsylvania Philadelphia, PA 19104 Mon, Wed., Thu., Fri.: 9am-5pm Tue: 10am-5pm Sat, Sun: Closed Footer Menu Contact Us University of Pennsylvania Privacy Policy Report Accessibility Issues and Get Help ©2024 University of Pennsylvania, Philadelphia, PA 19104"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:10.638118",
    "url": "https://mba.wharton.upenn.edu/admissions-faqs/",
    "university_name": "University of Pensylvania",
    "title": "Wharton MBA Admissions FAQs",
    "content": "Skip to content Skip to main menu Faculty Youth Program Undergrad MBA EMBA PhD Exec Ed Wharton Online Alumni Search Wharton Mobile menu toggle MBA Program Menu Facts & Figures Class Profile The Value of a Wharton MBA MBA or EMBA? Academics Program Details Curriculum Majors Interdisciplinary Programs MBA/MA Lauder Joint Degree in International Studies Program Francis J. & Wm. Polk Carey JD/MBA Program MBA in Healthcare Management Major Wharton/Engineering Dual Degree Program International Study Opportunities Leadership Ventures & Experiential Learning Faculty Student Life Extracurricular Activities Diversity at Wharton Nontraditional Students Living in Philly Careers & Network Career Services Alumni and Network MBA Stories Applying Start or Continue an Application Application Timeline and Deadlines Application Requirements Interview Process Deferred Admission Moelis Advance Access Program Visiting Wharton Attend an Event Recorded Webinars Connect with an Admissions Fellow Admissions FAQs Admissions Blog Financing Events All Events Alumni-led Events Application Tips Events Campus Visits Diversity Events Information Sessions JD/MBA Events Lauder MBA/MA Events Moelis Advance Access Events Contact Us Applying » Admissions FAQs Frequently Asked Questions Wharton MBA Admissions FAQs The following are the most Frequently Asked Questions (FAQs) we receive from prospective students interested in the Wharton MBA Program. In addition, the MBA Admissions Blog has the latest news from Admissions and Financial Aid. If you’re unable to find an answer to your MBA program questions, please contact us to ask your question directly to an MBA admissions team member. Visiting & Getting in Touch with the Wharton MBA Program What can I do when I visit campus? You can take a campus tour, sit in on a live class, and attend a student panel. These activities are not available May through September when classes are not in session. For more information, explore the Visit Campus page. How can I contact Wharton alumni in my area? Alumni often attend our admissions information sessions and receptions all over the world. To find an event close to you, please check the Admissions Events page . As an international prospective student, I need a visa to come to the U.S. for a campus visit. Will Wharton or the University of Pennsylvania sponsor me or provide a letter of support that I may use when I apply for a visa? The university is unable to sponsor individual visits to the campus. The Office of International Programs , which handles visa and immigration issues at the university, may only support students who have been admitted to and intend to enroll at the school. For more information & resources for international applicants, please refer to our International MBA Students page . MBA Admissions Process and Requirements Do I need to hire an admissions consultant to get into Wharton? Hiring a paid admissions consultant isn’t necessary to gain admission to the Wharton MBA program. Our goal is to have a transparent evaluation process, as we believe in providing each applicant with an equal opportunity for success. While we certainly encourage you to have a trusted family member or peer review the written portion of your application for clarity and accuracy, we do not believe that professional services are needed.  If you have questions during the application process, we recommend seeking guidance through our website and visit opportunities . When should I apply, and when is the application deadline? Wharton offers three rounds of admissions. To determine which is the best round for you, please visit the Application Deadlines page. We encourage all applicants to apply in the year preceding their start at Wharton. Our general policy is not to grant deferrals. All requests will be handled on a case-by-case basis. What are the minimum requirements to apply to the Wharton MBA program? The minimum requirements to apply to the MBA program include: Completion of an undergraduate program in an accredited U.S. college or its equivalent in another country. Results of the Graduate Management Admissions Test (GMAT) or the Graduate Record Examination (GRE). Submission of the Wharton application. Results of an English Language Test (TOEFL, PTE, or IELTS) unless you have earned an undergraduate or Master’s degree in an English-speaking country or from an institution in which English is the language of instruction. To waive an English language test, you must include a letter requesting the waiver in your application AND documentation that your education was in English. For more information on the application process, go to the Admissions Requirements page. I already have an MBA. Can I apply to the Wharton program? Yes. We do not exclude candidates who have an MBA or any other graduate degree. You should, however, fully explain your reasons for pursuing a second MBA in your application. I earned an undergraduate degree that only took three years. Am I eligible to apply to the Wharton MBA Program? Several universities around the world offer three year undergraduate programs. If you have received a Bachelor’s degree upon completion of such a program, you are eligible to apply to the Wharton MBA program. How many applications do you receive each year for the MBA program? We typically receive 6,000 to 7,000 applications in a given year. Approximately 75% to 80% of all applicants are qualified for admission. Of these, we generally admit about 1,000 candidates for a class of about 840 students. Check out more facts & figures from our most recently admitted class on the Class Profile page . Do I need an interview, and if so, how can I arrange one? We interview by invitation only. After we review the completed application, we select candidates for interviews. No candidate is admitted without an interview. Read more about the details and how to prepare for our Team-Based Discussion interview format . Can I get my decision over the Web or by e-mail, telephone, or fax? All applicants receive their decision letter over the Web via their online account. We do not release decisions over the telephone or via e-mail or fax. If admitted, you will receive additional information, along with a hard copy of your admissions letter, via regular mail. Start and manage your application status on the Wharton MBA Application Portal . How long does it typically take for an applicant to receive a decision after he/she has submitted his/her application? After your application is submitted to the Wharton MBA program you can expect the following timeline for updates from the admissions team. Applicants who are invited to interview will be notified via email on the interview invitation dates listed below. The interview invitation email will include a link to schedule an interview, and resources to prepare for an interview. Integrated Joint Degree Program Application and Decision Timelines Please note, the following integrated joint degree programs accept applications only in Round 1 and Round 2, and follow the above-listed application timelines for Rounds 1 and 2. To learn more about each program, click the links below: Francis J. & Wm. Polk Carey JD/MBA Program MBA/MA Lauder Joint-Degree in International Studies Program How does Wharton notify applicants of their status? Applicants who are not moving forward in the application process will be notified via email on the same dates listed above. For example, if you are not invited to interview, you will be notified on the same timeline as those applicants who are invited. After the interview process, you will be notified whether you’re admitted or not on the above-listed decision release dates for the round in which you applied. Applicants who do not move forward in the application process are encouraged to revisit their application and consider reapplying during Round 1 or 2. For advice and guidelines around reapplication, see the Reapplication section in our Application Requirements page. What should I know about the GMAT and GRE tests? All applicants must submit results of either the Graduate Management Admission Test (older version or Focus Edition, both now referred to as GMAT) or the Graduate Record Examination (GRE). We accept scores from tests taken at a test center or at home/online. All at-home tests are monitored by a human proctor online. Scores may be self-reported; when self-reporting your score(s) in the application please list your highest score first. Should you receive an offer of admission, official scores will then be requested for verification. You should register for a test at least one month before you plan to take it. You must complete the GMAT or GRE before we can process your application. We recommend that you take your test no later than 2 weeks prior to the application deadline. This will ensure that you are able to submit your application with all scores. Scores are valid for five years after the test date. Test codes for the Wharton MBA Program are: GMAT: G56-97-73 GRE: 6802 What is the average TOEFL? Do you keep scores submitted in prior years? The average TOEFL score for those students in the Class of 2022 who were required to take it was 115 . We keep TOEFL scores submitted within the previous two years or as long as they are valid (two years from the test date). If you studied at an English speaking institution please request a TOEFL waiver in our application as your TOEFL score is waived. If we cannot locate your official report, we will verify it with ETS. For more information, go to Admissions Process . Can I submit the English for International Opportunity (IELTS) exam results instead of the TOEFL or PTE? As of the 2023-2024 application cycle, we will accept the IELTS, TOEFL and PTE exam score. We also pay careful attention to a student’s GMAT (verbal percentile and AWA score), written and spoken English, recommender observations, and exposure to language, in addition to the GRE. Applicants who earned a baccalaureate or advanced degree at an institution in which the medium of instruction was English, or who have had considerable exposure to the language, may waive the test. A waiver request may be submitted as part of your application. Learn about other important information and resources for international applicants on our International MBA students page. Are application fee waivers available? Application fee waivers are only granted to students for whom the application fee would create an extreme financial hardship or for U.S. military active duty or veteran applicants. Applicants who wish to request a fee waiver must start their application and e-mail feewaiver@wharton.upenn.edu with information detailing their financial need. We will then follow up for supporting documentation. Requests must be submitted no later than 15 days prior to application submission, and no requests will be granted after the application deadline for the round in which you applied. For veterans or active duty applicants, reach out to our admissions office when you are ready to submit your application. Work Experience Before Applying to the MBA Program Work experience isn’t mandatory for applying to the MBA program but the admissions committee does seek individuals who will come to the program with diverse experiences and professional maturity. Check out our Class Profile page for an idea of the work experience and background of our most recently admitted class. How much work experience do most accepted students have? Is there a particular type of work experience Wharton seeks? The average student has worked for five or six years between graduating from college and entering the MBA program. The program does accept early career candidates with limited or no experience who exhibit strong managerial and professional potential. The Admissions Committee looks for individuals who exhibit professional maturity. In other words, we evaluate work experience not in terms of years, but the depth and breadth of an individual’s position, his or her contributions to the work environment, and level of responsibility and progression. Wharton looks for diversity in the professional backgrounds of its admitted students just as it does in all other parts of our applicants’ profiles. No one industry is favored over another, and experience in a Fortune 500 company does not have higher value than experience in a small business or public institution. Does graduate education count as work experience? While we recognize the value of graduate academic work, we do not count academic work as professional work experience. Does time spent in the military count as work experience? Absolutely. The service provides many rich and varied opportunities for professional growth and development. Military candidates are evaluated based on the same criteria as other candidates, including the nature and scope of the work, the skill sets required, work progression, and general leadership and management skills developed. Does time spent in the Peace Corps, on a Latter Day Saints’ mission, or other voluntary assignment or internship count as work experience? Certainly. As with all work experiences, we are interested in the skills acquired on the job and level of progression (measured by scope of responsibilities, job title, salary). I am still an undergraduate student. How can I increase my chances for admission? We welcome applicants directly from undergraduate programs who are motivated and exhibit strong leadership and managerial potential. When preparing for the Wharton MBA program, consider that the stronger your quantitative background, the better prepared you will be to take finance, statistics, accounting, economics, and other quantitative courses offered in our curriculum. For example, calculus and/or statistics are good foundation courses. We do accept students without this type of background, but we like to see evidence of a capacity to handle these types of topics (e.g., strong quantitative GMAT scores, strong academic performance in quantitative subjects). We are also interested in your history of involvement in extra-curricular activities, community service, and hobbies. We advise undergraduates to apply in the Fall prior to the academic year in which they want to enroll in the program. Admission to the program is contingent upon successful completion of the undergraduate degree. For current undergraduates , the Moelis Advance Access Program provides a guaranteed deferred admission pathway for undergraduate seniors accepted into the program. I have less than your average four years of work experience. Is this a disadvantage in the admissions process? Each year, we welcome several early career candidates (individuals with 0 to 3 years of professional work experience) into our program. We are more interested in the skills you have acquired to date, including leadership and management opportunities, than the number of years you have been in the work force. We consider both the skills you have demonstrated to date and your future potential. Check out our most recent Class Profile for additional context on the background and work experience of this year’s accepted class. Is an applicant at a disadvantage without previous course work in business? No. Many students at Wharton have not had business courses prior to entering the program. Generally, 40% of our class consists of people with liberal arts backgrounds. Pre-term offers incoming students an opportunity to “brush up” on their quantitative skills before classes begin. Candidates are also encouraged to complete introductory courses in calculus and statistics prior to entrance, since much of the course work requires quantitative skills. Please go to Non-traditional Backgrounds for more information. Online Application Questions When you submit your Wharton MBA application via the Wharton Application Portal you may have a few questions as you make updates & submissions. This section highlights some of the most common questions we receive on this process, but please reach out to our admissions office for any specific issues not reflected here. How does the system work? You may already have an account on the Wharton Web Application System if you have completed your profile through the “Let’s Get Acquainted” Form, or if you started or completed your MBA application through the Wharton Web Application System . If you encounter problems logging on, please email mbaoperations@wharton.upenn.edu . I created an account and began and/or submitted my application. But, when I log into my account, information I entered is missing and/or my application does not appear to have been submitted. What happened to my information? The problem you encountered typically happens when two accounts are inadvertently created. To determine if you have more than one account on our system, please follow the instructions below: Return to the login page. Click on the “Search” button in the user login box at the top right-hand corner of the page. A PIN lookup box will appear. Complete the required fields for first name, last name, birth date, and e-mail address. Then click “Search.” An e-mail(s) will be sent to you with your login and password information for each of your accounts. Please check both to see which one is active and make a note of it. If you continue to encounter problems, please contact mbaoperations@wharton.upenn.edu . When should I check the system after submitting the application? You should allow three weeks for us to process your online account and update your online status to reflect receipt of your online application and any supporting materials. Will I receive an e-mail when decisions are made? How do we know when to check the system? You will receive an e-mail each time your status changes, including when we release a decision. Once you receive an e-mail, you need to check your status online (the e-mail only indicates there is a change, but it does not indicate what the change is). How do I calculate my GPA if my university or college does not provide one? Students reporting grades from institutions that do not evaluate academic performance on a 4.0 GPA scale should NOT convert their scores to a GPA. Report your scores or grades as your university lists them in your official transcripts, including an explanation of the grading scheme if needed. Keep in mind that we have students from more than 70 countries in our program and have broad expertise in grading methods around the world. Interdisciplinary Programs Questions Customize your MBA experience with our interdisciplinary programs. The Wharton MBA FAQ covers each response in as much detail as necessary, but if your interdisciplinary MBA questions remain unanswered, visit the interdisciplinary page for more details. Am I able to apply to the Lauder Program after I have started the Wharton MBA Program? The academic calendar for first-year students in the Lauder Program begins in May. Students that have been accepted to the Wharton MBA Program in Round 1 or Round 2 can apply separately to the Lauder Program and still will be expected to start the program in May. Students cannot apply to the Lauder Program after they have started their first or second years at Wharton. For more information about applying to the Lauder Program, please visit the Lauder website or contact lauderinfo@wharton.upenn.edu . Can I combine the Lauder Program with a degree program other than the Wharton MBA? The Lauder Institute also offers a joint JD/MA program in partnership with Penn Law. For more information about the Lauder JD/MA, please visit this website . Is Health Care Management a major or a separate program? Health Care Management (HCM) is one of the 18 majors offered through the Wharton MBA Program. The Health Care Management major differs from other majors in that students must select this major at the time of application to Wharton. HCM integrates academic and professional development, helping students to obtain summer and permanent positions in all parts of the health care sector, including consulting firms, health care venture capital and private equity, digital health, health care analytics firms, biotechnology, pharmaceutical firms, hospitals, insurers, and government agencies. If prospective students wish to explore the Health Care Management major, the HCM department is happy to arrange either a telephone conversation or a meeting with June Kinney, the Associate Director of HCM. Please find more information on the application process here . If I am not accepted into the Health Care Management major, can I still be admitted to Wharton? Your application will be evaluated specifically for the Health Care Management major. If the Admissions Committee feels you are not best suited for HCM but could be a good fit for the MBA program more broadly, you will be considered for Wharton. If I am admitted to a dual degree program with the Harvard Kennedy School (HKS) or the School of Advanced Studies (SAIS), can I start my degree at HKS or SAIS instead of Wharton? Applicants should apply to Wharton during the application cycle directly preceding their desired Wharton start date. If you are admitted to both programs and do not want to begin at Wharton, you will need to request a deferral and will be subject to our deferral policy. Deferrals typically are only granted for extenuating circumstances. Are there any dual degree programs that will not allow me to start at Wharton? The School of Design requires all dual degree students to start at Penn Design. The Harvard Kennedy School encourages students interested in the MPA/ID dual degree to start at HKS. If I want to apply to a dual degree program, do I have to apply to the Wharton MBA Program and the other program separately? Unless otherwise noted on the Interdisciplinary Programs website, you must submit separate applications and materials to both programs. Some schools will have strict application requirements around testing, recommendations, and essays. Please follow the admissions requirements for each individual school. Are admissions decisions for integrated dual degree programs made by one committee? Applicants to the MBA/MA Lauder Joint Degree in International Studies, the Francis J. & Wm. Polk Carey JD/MBA Program, and the MBA in Health Care Management will receive one joint decision. Can I create my own dual degree with a school not listed on the website? We cannot accept any credits from other programs. You can pursue another program in your own time, but you would still be required to complete all Wharton credit units as prescribed by the full-time MBA program. As a full-time MBA student, you are expected to be at Wharton and pay tuition for four full semesters. How do I learn more about a graduate program not listed on the Wharton Interdisciplinary Programs website? If you are interested in other programs not listed on the website, please contact the program office of that respective program. How many credit units can I take at other Penn graduate schools while a Wharton MBA student? All Wharton MBA students can take four to six credit units at other Penn graduate schools . Can I apply to a dual degree program after starting at Wharton? For most dual degree programs, you can apply to the other program during your first year at Wharton. However, this may extend your time at Penn. Can I connect with a current student that is a part of a specific dual degree program? Due to the volume of such requests, we are unable to connect prospective students with current students in every dual degree program. Please review the profiles of our Admissions Fellows and request to be connected with a current MBA student who most closely aligns with your interests. What if I want to pursue a degree beyond the master’s level at Penn? Please speak with the PhD department of your interest if you intend to continue your studies beyond the master’s level. Deferred Admissions with the Wharton MBA Advance Access Programs The Wharton MBA Advance Access Programs are deferred admission programs that offer undergraduates seniors a guaranteed pathway to the Wharton MBA program after pursuing 2-4 years of work experience after graduation. Please visit the Deferred Admission Programs section to learn about each program, view frequently asked questions, and learn about upcoming events. Miscellaneous Frequently Asked Questions I heard that Wharton is offering some of its core courses online through Coursera. Where can I find out more information about this? Yes, as part of a greater Penn initiative, Wharton has recently launched nine non-credit, massive open online courses (MOOCs) available at no cost through Coursera . More information about these offerings is available on the Wharton.Online site , Penn’s Open Learning Initiative site, our Coursera FAQS page, and the University’s Coursera homepage . Registration for these courses is available directly through Coursera.org . How will changes to the curriculum affect current applicants? Wharton fully implemented the new curriculum in 2012 and has received much positive student feedback regarding the new course structure and resources. The new curriculum offers increased flexibility based on your background and experience with strengthened emphasis in microeconomics, statistics, ethics and legal responsibility, leadership and communications. New MBA graduates will have access to tuition-free executive education every seven years throughout their careers. See curriculum . Are transfer credits accepted? Wharton does not accept transfer credits, but does encourage students to waive required core courses, either by furnishing the required academic or professional credentials or passing Wharton’s waiver examinations. Waiving courses gives you the opportunity to take more electives. Can I reapply to the MBA Program? You can reapply to the MBA program, but not during the same academic year. For more information, visit the Reapplicants section in Admissions Requirements . What is the median compensation package for graduating MBA students? The median Annual Base Salary for graduates of the Class of 2020 was $150,000. Other compensation included tuition reimbursement, relocation expenses, mortgage assistance, automobiles, stock options, etc. For more detailed information, please see the MBA Career Management’s Annual Career Statistics . Does Wharton offer a one-year, a part-time, an evening, or a distance-learning MBA? Wharton offers the Wharton MBA for Executives program, a two-year program that offers the same MBA degree in an executive format, delivered in Philadelphia and San Francisco. Other (non-MBA) programs that may interest you are executive programs offered by Wharton Executive Education . I’m fluent in another language. How can that help me with my MBA? Consider the joint MBA/MA – Lauder program if you are interested in acquiring an expertise in a specific region and speak one of these nine languages relatively well: Arabic, French, German, Hindi, Japanese, Mandarin Chinese, Portuguese, Russian or Spanish. In addition, Wharton offers many opportunities to participate in career treks or global consulting in which you can immerse yourself in the culture and language. See Global Learning . We hope that the information on this page has been useful in your educational journey. If you have any further questions you would like to ask MBA admissions , please contact us directly. Start or Continue an Application Application Timeline and Deadlines Application Requirements Interview Process Deferred Admission Moelis Advance Access Program Visiting Wharton Attend an Event Recorded Webinars Connect with an Admissions Fellow Admissions FAQs Admissions Blog Back To Top Additional Links MBA Program Facts & Figures Academics Student Life Careers & Network MBA Stories Applying Financing Events Contact Us Featured Links MBA Events Read our Blog Programs Undergraduate MBA EMBA Doctorate Executive Education Wharton Online Locations Philadelphia San Francisco Beijing The Power of Wharton Global Influence Analytics Entrepreneurship & Innovation Featured Give to Wharton Alumni Knowledge@Wharton Recruiters & Corporations Wharton Faculty About Us Research Centers Departments Resources Contact Us News Faculty & Staff Twitter Facebook YouTube Instagram Support Wharton © 2024 The Wharton School, The University of Pennsylvania | MBA Program | Privacy Policy | Report Accessibility Issues and Get Help"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:16.627430",
    "url": "https://www.design.upenn.edu/graduate-admissions/how-apply",
    "university_name": "University of Pensylvania",
    "title": "Header Mini Menu",
    "content": "Skip to main content Weitzman School of Design Logo Header Mini Menu Apply Request Info Give Open Search Panel Close Search Search Search Menu 1 Primary Dept Mega Menu Architecture City & Regional Planning Fine Arts Historic Preservation Landscape Architecture Urban Spatial Analytics PhD Programs Center for Professional Learning All Degrees & Certificates Mega Menu About People The Weitzman School Justice & Belonging Weitzman School Awards Contact Admissions Overview Admissions Events How to Apply Tuition & Aid Undergraduate Applicants Resources Career Resources IT Services Fabrication Lab All Resources Research Centers & Labs PennPraxis Partners Applying for Research Funds Updates Latest Weitzman News Events & Exhibitions Popular Links For Students For Faculty & Staff For Alumni Academic Calendar Student Handbook Now on View Weitzman Year End Show 2024 Connect Facebook Twitter Linked In Instagram Vimeo Youtube Flickr Stuart Weitzman School of Design 102 Meyerson Hall 210 South 34th Street Philadelphia, PA 19104 215.898.3425 Get Directions Get the latest Weitzman news in your Inbox: Email Address Back to Top Breadcrumb Home Admissions How to Apply How to Apply Section Menu 1 Main navigation Overview Visit Admissions Events How to Apply Tuition & Aid Admitted Students FAQs Contact Application Requirements Fall 2024 Application Requirements MArch MS Arch MSD-AAD MSD-RAS MSD-EBD & MEBD MSD-HP MCP MFA MSHP MLA MUSA PhD Arch PhD CPLN Online Application ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Portfolio ✓ ✓ ✓ ✓ ✓ ✓ † ✓ O ✓ O ✓ Recommendation Letters (3) ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Personal Statement and Community Essay ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Uploaded evaluations* / Transcripts ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Writing Sample ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Research Statement ✓ ✓ Resume ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ GRE O O ✓ English Proficiency Test* ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ Prerequisites ✓ ✓ Dual Degree Option ✓ ✓ ✓ ✓ ✓ ✓ Deadline JAN 4 DEC 14 JAN 4 JAN 4 JAN 4 JAN 11 JAN 11 JAN 11 JAN 11 JAN 11 JAN 11 DEC 14 DEC 14 * - applies to international students    O - optional     † - required for Urban Design Concentration Our online application allows you to fill out portions of the application, save your information, and go back in at a later date. A non-refundable application fee of $80 must be submitted by credit card immediately after submitting your application. Directions for uploading supporting material are included in the application, as well as in our FAQ section . Admissions decisions are released on March 11, 2024 at 12 noon eastern time. Supporting Materials Prerequisites International Students Related Information Certificates & Dual Degrees FAQs Policies Financial Aid Get the latest Weitzman news in your Inbox: Email Address logo-penn-footer © 2024 Trustees of the University of Pennsylvania Connect Facebook Twitter Linked In Instagram Vimeo Youtube Flickr 1 Primary Dept Mega Menu Architecture City & Regional Planning Fine Arts Historic Preservation Landscape Architecture Urban Spatial Analytics PhD Programs Center for Professional Learning Contact Us Support Weitzman Report Accessibility Issues and Get Help Privacy Policy Disclaimer Emergency Services Report Copyright Infringement Close Close"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:22.287691",
    "url": "https://admissions.upenn.edu/",
    "university_name": "University of Pensylvania",
    "title": "Site Navigation",
    "content": "Skip to main content Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Search Close Menu Close Search keywords Search Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Four Schools, One University There’s no one path to success here. Penn has four undergraduate schools that each offer unique opportunities, all on one campus. And our students have access to all of them. You’ll choose a school or program to serve as your home base, but you’ll never be limited to just one thing. Take classes that interest you, regardless of the school they're in. Pursue an Interschool Minor. Or even a second degree. And if you don’t see the path you want to take? We’ll help you make one. About Penn First things first: We’re the University of Pennsylvania (aka Penn), an Ivy League research university founded by Ben Franklin in the heart of Philadelphia. Did that sound stuffy? It felt stuffy. Here’s what we’re really about: Penn is a place for people who want to do something big. But it’s also for people for who want to try a bunch of little things first. It’s a place for sparking revolutionary ideas. For pioneering thinkers. And it’s a place that will help you figure out what inspires and excites you. Where you won’t just gain knowledge, you’ll make it. You’ll research solutions, invent ideas, engineer art – all in a culture that’s not about perfection, but about perfecting the pursuit. The people who love it here? People who are drawn to other people and who are curious about everything. This is the time to figure things out. Try everything that seems worthwhile. You’ll find what truly is. Sound like the place for you? Then we can’t wait to meet you. This is Penn STATS AND FACTS 8:1 Student-Faculty Ratio 9,960 Undergraduate Students 4,200+ Course Offerings 96% 6-year graduation rate for undergraduates I want information for First-Year Applicants International Applicants Counselors Supporting my Student Transfer Applicants Not sure where to start? Learn About Our Four Schools How to Apply Living in Philly Penn Meets 100% of Demonstrated Need with Grants! Affordability & Aid Here at Penn, we believe the hard part about college shouldn’t be paying for it. That’s why all undergraduate financial aid is awarded on the basis of financial need (aka, need-based aid). We are committed to making a Penn education accessible and affordable by meeting 100% of demonstrated need with grants and work-study funding. Those are funds you don’t have to pay back, meaning its possible to graduate debt-free! Ready to Learn More? Frequently Asked Questions What does Penn look for in its first-year applicants? We look for students who aspire to develop and refine their talents and abilities within Penn’s liberal arts-based, practical, and interdisciplinary learning environment. Our ideal candidates are inspired to emulate our founder Benjamin Franklin by applying their knowledge in “service to society” to our community, the city of Philadelphia, and the wider world. To best understand prospective students’ paths through Penn, we approach applications holistically and with great care. Do domestic and international students fill out the same application? Yes, Penn accepts the Common App, the Coalition Application, and the QuestBridge Application. All applicants, regardless of citizenship, must submit one of these applications. How do I apply for financial aid? Student Registration and Financial Services posts financial aid application checklists for prospective students. Most students will need to submit the Free Application for Federal Student Aid (FAFSA), CSS Profile, and Penn Financial Aid Supplement. Make sure to follow the instructions on your relevant checklist and turn in forms by their listed deadlines. What are the different ways that I can make Penn and Philadelphia feel like home? There are a wide range of clubs, organizations, and activities on campus . Take our word for it that there are enough academic, cultural, environmental, performing arts, religious, media, and social opportunities for you to get involved in and to find community with! You will also live and learn in the vibrant city of Philadelphia where diverse people and a saturation of experiences come together. Rich in history, culture, art, recreation, and famous (and delicious) food, Philly offers countless things to do and something for everyone. See all Frequently Asked Questions 1 College Hall, Room 1, Philadelphia, PA 19104-6376 Footer Menu Join the mailing list Contact Us Accessibility Privacy Policy NACAC Partnership Agreement"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:22.718052",
    "url": "https://admissions.upenn.edu/how-to-apply/apply-for-admissions/first-year-admission",
    "university_name": "University of Pensylvania",
    "title": "Site Navigation",
    "content": "Skip to main content Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Search Close Menu Close Search keywords Search Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask First-Year Admission We’re interested in learning all about you: what you love, your strengths, your challenges, your interests, and how these pieces come together to make you a distinct individual who will actively grow and contribute to the Penn community. Navigate Section Apply for Admission Apply for Admission sub-navigation First-Year Admission: Checklist First-Year Admission Homeschool Applicants QuestBridge QuestBridge Finalists Ranking Penn Undocumented Students Student Athletes International Applicants Transfer Admission What Penn Looks For Penn accepts Common App and the Coalition Application . We have no preference for either format and treat both applications equally in our process. We encourage you to review the features of each application format and use the platform that suits you best. You should submit only one application per admissions cycle and not mix-and-match across platforms. Apply Via Common App Apply Via The Coalition Application QuestBridge Applicants Penn is a proud QuestBridge partner institution and participates in the National College Match program for high-achieving students with significant financial need. We will accept the QuestBridge Application from QuestBridge National College Match Finalists in lieu of Common App or the Coalition Application. For more details on QuestBridge and the National College Match program, please visit their website . Apply via the QuestBridge Application Application Dates & Deadlines Early Decision: November 1, 2023 Regular Decision: January 5, 2024 Application Fee: $75 or fee waiver for those who qualify. First-Year Checklist & Deadlines Admissions Plans (Early vs. Regular) Early Decision Penn’s Early Decision program is binding, meaning that if you are admitted, you are obligated to accept our offer of admission. By mid-December, you will receive one of three possible outcomes from your Early Decision application: You are admitted into the University of Pennsylvania . As part of our Early Decision program, you are committed to accepting our offer of admission. You must withdraw any active applications you have to other colleges/universities. The only instance in which you could request to be released from our Early Decision binding agreement is if your financial need can’t be met, which would be determined only after consulting with Penn’s Student Financial Services office. You are deferred for consideration during Regular Decision . Your application will be considered among our Regular Decision candidates and you will no longer be bound by the Early Decision binding agreement. You will receive final notification of our decision in late March/early April. Instructions on how to provide updates to your application will be found on your applicant portal. You are denied under the Early Decision program . Your application process for this cycle year is complete. If you are still interested in Penn, you are welcome to re-apply during the next application cycle. * We will notify all Early Decision applicants of the exact time and date of our decision release at least one week ahead of time so that they can be aware of when to expect their admissions decision. We appreciate that attending Penn is a tradition for many families. The Admissions Office identifies legacy applicants based on the information provided in a student’s application and defines “legacy” as being either a child or grandchild of alumni. Legacies who apply to Penn—like all applicants—receive thorough consideration in the application process. Although applicants considering applying through Early Decision must submit their applications earlier (November 1st) than Regular Decision applicants (January 5th), the process of applying is no different. Please refer to our Checklists & Deadlines page for more information. Regular Decision If you’re a Regular Decision applicant to the University of Pennsylvania and are accepted by another school under a binding Early Decision program, you must inform the Office of Admissions and withdraw your Penn application. You are admitted into the University of Pennsylvania . You have been accepted and are now invited to join the incoming first-year class. You will have until the admitted student reply date to accept or decline our offer of admission. You are waitlisted . You have been placed on the waitlist and do not currently have a seat in the incoming class. If you choose to remain on the waitlist -- and if space allows -- you will be considered for admission later in the spring or summer. You are denied admission under the Regular Decision program . Your application process for this cycle year is complete. If you are still interested in Penn, you are welcome to re-apply during the next application cycle. Decision Notification Timeline Notification of Decision Early Decision: Mid-December 2023 Regular Decision: By April 2024 Admitted Student Reply/Enrollment Confirmation Early Decision: January 5, 2024 Regular Decision: May 1, 2024 Pre-college Credit Please note: These polices are in effect for students entering in the Fall of 2018 and beyond. They remain under ongoing review by the faculty of the University and are subject to change without notice. Current students should consult their home school offices for policies in effect at the time of their matriculation. COVID-19 Update: Penn will continue to grant credit and placement for these exams. We understand some scores will now be based on online tests, while other scores will be based on year-long academic coursework. Testing agencies are making prudent decisions to prevent large gatherings of people. We are in communication with testing agencies around the world and we support them in the decisions they feel they need to make. The University of Pennsylvania may award credit or advanced course standing to students who have taken Advanced Placement, International Baccalaureate, or other internationally-recognized examinations. Scores warranting University credit vary by department. Matriculating students seeking credit for Advanced Placement (AP) exams must have official score reports sent directly to the Office of the University Registrar by the Educational Testing Service. See Advanced Placement chart below. Matriculating students seeking credit for International Baccalaureate (IB) exams must have official score reports sent directly to the Office of Admissions by the International Baccalaureate Organization. See International Baccalaureate chart below. Matriculating students seeking credit for A-Level exams must email their original A-Level certificates to the Office of Admissions (Attention: Eddrena Owens, eddrenao@upenn.edu) in order to have their scores evaluated for credit. See GCE Advanced (A) Level Exam Policy chart below. Pre-College and Dual Enrollment Course Work Credit is not awarded for college-level coursework undertaken at other institutions while a student is enrolled in high school or in the summer after high school. Such coursework is considered a part of a student’s preparation for a Penn education. It is used in consultation with the student’s academic advisor to inform decisions about placement into appropriate courses at Penn. Students who enroll in regular undergraduate courses at Penn prior to their matriculation into an undergraduate degree program at the University, during the academic year or in the summer sessions, may elect to have that coursework merged with their undergraduate transcript, in which case it will count toward their undergraduate degree requirements, and the grades will be included in their grade point average. Advanced Placement Examination Score Penn Credit Awarded Art History 5 Waiver for ARTH 1010 or ARTH 1020, consult with undergraduate chair Art (Studio) 5 No credit (possible exemptions for majors, portfolio considered) Biology No credit Chemistry♦ 5 EAS 091 (1 c.u.), for Engineering students only 5 NURS 0061 (0.5 c.u.), for Nursing students only Computer Science A 5 CIS 1100 (1 c.u.) Computer Science Principals No credit Economics Micro 5 Economics 0100 waiver Macro 5 Economics 0200 waiver English Language/Composition No credit Literature/Composition No credit Environmental Science No credit European History No credit French Language 5 French 1000 (1.cu.) (fulfills language requirement) 4 No credit (fulfills language requirement) German Language 5 German 0400 (1 c.u.) (fulfills language requirement) 4 No credit, (must pass the department exam to fulfill language requirement) Government and Politics No credit Human Geography No credit Italian Language and Culture 5 ITAL 1000 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Japanese 5 JPAN 0400 (1 c.u.) (fulfills language requirement) 4 No credit (must pass the departmental exam to fulfill language requirement) Latin 5 Latin 0400 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Latin - Literature 5 Latin 0400 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Latin - Vergil 5 Latin 0400 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Mathematics AB No credit Mathematics BC♦ 5 Math 1400 (1 c.u.) (2023 and earlier) Math 1300 (1 c.u.) (Students entering Penn in 2024 onward) Music Theory No credit Physics 1 5 Physics 0101 (1.5 c.u.) Physics 2 5 Physics 0102 (1.5 c.u.) Physics-C (Mechanics) 5 Physics 0150 (1.5 c.u.) Physics-C (Electricity and Magnetism) 5 Physics 0151 (1.5 c.u.) Psychology 5 Psychology 0001 Waiver Spanish Language 5 Spanish 1000 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Spanish Literature 5 Spanish 1200 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Statistics 5 STAT 1010 waiver or STAT 1110 waiver 5 NURS 2300 (1 c.u.), for Nursing students only United States History No credit World History No credit International Baccalaureate Higher Level Examination Score Penn Credit Awarded Anthropology No credit Biology No credit Chemistry♦ 7, 6 EAS 091 (1 c.u.), for Engineering students only Economics 7, 6 Economics 0100 and 0200 Waiver English A/B No credit French A 7, 6 French 1212 (1 c.u.) 5 French 1000 (1 c.u.) French B 7, 6 French 1000 (1 c.u.) Geography No credit German A 7, 6 German 2100 (1 c.u.) (fulfills language requirement) 5 German 0400 (1 c.u.) (fulfills language requirement) German B 7, 6 German 0400 (1 c.u.) (fulfills language requirement) History of the Americas No credit History of Europe No credit Latin 7 Latin 0400 (1 c.u.) (fulfills language requirement) 6 No credit (fulfills language requirement) Mathematics♦ No credit Music No credit Philosophy 7, 6 Phil 1000 (1 c.u.) Physics 7, 6 Phys 0150 (1.5 c.u.) and Physics 0102 (1.5 c.u.) Psychology 7, 6 Waiver for Psychology 0001 Spanish A 7, 6 Spanish 1200 (1 c.u.) (fulfills language requirement) 5 Spanish 1000 (1 c.u.) (fulfills language requirement) Spanish B 7, 6 Spanish 1000 (1 c.u.) (fulfills language requirement) Theater Arts 7, 6, 5 Departmental review on case-by-case basis ♦ An internal departmental examination is also available for credit once enrolled at Penn. GCE Advanced (A) Level Exam Policy Examination Grade of A* or A or B Grade of C Accounting No credit No credit Biology No credit No credit Chemistry A* or A = EAS 091 (1 c.u.), for Engineering students only No credit Economics A* or A = Waiver Econ 0100 & 0200 B = no waiver No credit English No credit No credit French A* or A = Fren 1212 (1 c.u.) (fulfills language requirement) A- = no credit (fulfills language requirement) B = no credit No credit Greek A* or A = Greek 0400 (1 c.u.) (fulfills language requirement) B = no credit (fulfills language requirement) No credit History No credit No credit Latin A* or A = Latin 0400 (1 c.u.) (fulfills language requirement) B = no credit (fulfills language requirement) No credit Math w/Special paper w/merit (Cambridge) No credit No credit Physics A* or A = Physics 0150 (1.5 c.u.) and Physics 0151 (1.5 c.u.) B = Physics 0101 (1.5 c.u.) and Physics 0102 (1.5 c.u.) No credit Spanish A* or A = Spanish 1200 (1.cu) (fulfills language requirement) A- = no credit (fulfills language requirement) B = no credit No credit 1 College Hall, Room 1, Philadelphia, PA 19104-6376 Footer Menu Join the mailing list Contact Us Accessibility Privacy Policy NACAC Partnership Agreement"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:23.692999",
    "url": "https://provost.upenn.edu/for-students/graduate-and-professional-education/graduate-admissions/",
    "university_name": "University of Pensylvania",
    "title": "Graduate Admissions",
    "content": "Skip to main content Admissions Athletics Libraries Penn President Penn Deans Penn Website Who We Are Who We Are About the Provost Deputy Provost Vice Provosts Staff Directory Accreditation Provost’s Councils More Resources Centers and Institutes News and Announcements Campaign for Community For Students For Students Graduate and Professional Students Undergraduate Students University Life at Penn Wellbeing Initiatives Student Health and Counseling International Student and Scholar Services Center for Community Standards and Accountability More Resources Pennbook Graduate Catalog Undergraduate Catalog Graduate Student Center Family Resource Center For Staff For Staff Provost Administrative Affairs Penn Human Resources Resources for Academic Program Administrators More Resources Staff Directory Central Pool Classrooms Campaign for Community For Faculty For Faculty Faculty Website Faculty Senate Faculty Handbook Teaching at Penn CETLI More Resources PASEF Central Pool Classrooms For Postdocs Contact Search Admissions Athletics Libraries Penn President Penn Deans Penn Website Who We Are About the Provost Deputy Provost Vice Provosts Staff Directory Accreditation Provost’s Councils More Resources Centers and Institutes News and Announcements Campaign for Community For Students Graduate and Professional Students Undergraduate Students University Life at Penn Wellbeing Initiatives Student Health and Counseling International Student and Scholar Services Center for Community Standards and Accountability More Resources Pennbook Graduate Catalog Undergraduate Catalog Graduate Student Center Family Resource Center For Staff Provost Administrative Affairs Penn Human Resources Resources for Academic Program Administrators More Resources Staff Directory Central Pool Classrooms Campaign for Community For Faculty Faculty Website Faculty Senate Faculty Handbook Teaching at Penn CETLI More Resources PASEF Central Pool Classrooms For Postdocs Contact Home For Students Graduate and Professional Education Graduate Admissions Graduate Admissions Graduate Admissions Guide to Applying for Graduate School Graduate Degrees Graduate Degrees-Contact Us Graduation Information Dissertation and Thesis Deposit Resources for PhD Students Graduate and professional programs at Penn emphasize the integration of knowledge across boundaries and disciplines. More than 16,000 graduate and professional students study at Penn, pursuing more than 300 degree and certificate offerings, from Accounting to Women’s Health. Explore our graduate programs and click on the programs that interest you to learn more about admissions and academic requirements. Spotlight on Research Penn is a nationally-ranked research university, one of the top recipients of competitive research grants in the U.S. More than 170 research centers and institutes play a major role in advancing the university’s intellectual agenda. Learn more about research activity in Penn’s graduate and professional schools through Research at Penn . Explore Graduate Admissions Contacts Below How to Apply Penn’s graduate and professional programs are housed in 12 schools on one campus. Each graduate program has a separate admissions process. Applicants apply directly to the program of interest . All questions about the admissions process should be directed to the program of interest . Spring 2020 Recognizing the challenges of teaching, learning, and assessing academic performance during the global COVID-19 pandemic, Penn’s admissions committees for graduate and professional programs will take the significant disruptions of the COVID-19 outbreak in 2020 into account when reviewing students’ transcripts and other admissions materials as part of their regular practice of performing individualized, holistic reviews of each applicant. In particular, as we review applications now and in the future, we will respect decisions regarding the adoption of Pass/Fail and other grading options during the period of COVID-19 disruptions. An applicant will not be adversely affected in the admissions process if their academic institution implemented a mandatory pass/fail (or similar) system for the term or if the applicant chose to participate in an optional pass/fail (or similar) system for the term. Penn’s longstanding commitment remains to admit graduate and professional student cohorts composed of outstanding individuals who demonstrate the resilience and aptitude to succeed in their academic pursuits. Required Tests For PhD applicants: Most, but not all, PhD programs at Penn require the Graduate Record Examination (GRE). The University’s institution code is 2926, you only need to send your scores to one Penn code and it will be matched to your application. Each graduate program has a different GRE requirement; please refer to your program of interest for more information. For information about the administration of the GRE, see the Educational Testing Service website . For professional program applicants: Some, but not all, professional programs at Penn require standardized test scores, such as the GRE, LSAT, MCAT, GMAT, etc. Each program has a different requirement and a different institution code. Please refer to your program of interest for more information. International Applicants Applicants who are non-native English speakers may also be required to report scores from the Test of English as a Foreign Language (TOEFL), Pearson’s PTE Academic , or International English Language Testing System (IELTS). Please refer to your program of interest for detailed requirements. Penn is a leader among its peers in welcoming students from every part of the world. The division of International Student and Scholar Services offers help, advice, and information on all matters connected to immigration, employment, adjustment to a new culture, and living in Philadelphia. Application Materials Please note that all application materials become property of the University of Pennsylvania and will not be returned. Remember to retain a personal copy of your application. Offline Recommendation Penn strongly prefers that recommenders submit letters of recommendation online through the admissions system. If, however, your recommender is unable to submit an online recommendation, please follow these instructions: 1) Select the “Recommendation Form PDF Download” and download the form . 2) Complete the first section. Be sure to include the address of the appropriate admissions office — refer to the “Contact Graduate Admissions” list below. 3) Print out the form and provide it to your recommender. Please note: If you are applying to a program in Nursing, print out and provide your recommender with these special instructions for completing your letter of recommendation. If you are applying to a program in the School of Social Policy & Practice, print out and provide your recommender with these special instructions for completing your letter of recommendation. 4) Your recommender should send the form directly to the admissions office you designate, along with the letter of recommendation. Visiting Penn You are welcome to visit the campus. Interviews are generally by invitation only. Applicants may contact their prospective program to inquire about the availability of tours, open houses, and information sessions. If you plan to visit campus, make sure to visit other attractions in Philadelphia too. Privacy Policy Prospective students and applicants should review Penn’s Privacy Policy. Cost & Financial Aid Penn’s graduate tuition and other fees vary by school. Consult the individual schools and programs for details. Penn awards some loans based on financial need. These awarded loans are only made by Penn as part of a student’s financial aid package. The loans are repayable by the student after completion of his/her education or withdrawal from school and are not subsidized. Students in Ph.D. programs generally receive multi-year financial packages to cover tuition, fees, health insurance and a living allowance or stipend. The terms of the award may vary according to field of study. Contact individual programs for details. Most programs require that PhD students teach or conduct research for two or more years during their course of study, as part of their academic preparation. Penn’s professional schools provide limited assistance in the form of grants based on financial need. Some schools award merit-based scholarships or provide support in return for service. Contact your school for information on its policies and application procedures for grants and scholarship funding. Penn’s Student Financial Services provides up-to-date information the cost of attendance , as well as loans and other resources for support . U.S. citizens and permanent residents may be eligible for federal loans (i.e., Direct Loan, Grad PLUS). In addition, private alternative loan programs are available for credit-worthy borrowers. Generally, international students must have a qualified co-signer who is a U.S. citizen or permanent resident. Grad Student Life A stimulating intellectual and social community of students and scholars from across Penn’s 12 schools form a vibrant graduate network. The campus offers extensive resources for academic support and personal enrichment. Penn is a leader among its peers in welcoming students from every part of the world. The division of International Student and Scholar Services offers help, advice, and information on all matters connected to immigration, employment, adjustment to a new culture, and living in Philadelphia. Graduate Student Center Penn’s Graduate Student Center provides a home base for graduate and professional students.  Located in the heart of campus on Locust Walk, the Center hosts a variety of activities including recreational outings, dissertation support workshops, game nights, and more. Graduate Student Organizations As the University-wide graduate student government, GAPSA — the Graduate and Professional Student Assembly – advocates for students, funds initiatives, and plans events. A wide variety of other graduate and professional student organizations flourish at Penn, including school governments, as well as professional, social, athletic, and cultural groups. Campus Resources The Grad Student’s Guide to Thriving at Penn , published by the Grad Center, comprehensively outlines all of the many resources serving graduate and professional students at Penn. Of special importance to many students are these resources: Family Resource Center for students with children Campus Cultural Resource Centers LGBT Center Student Disabilities Services Health & Wellness Resources Recreation & Gyms Career Services Diversity Across 12 Schools, more than 16,000 graduate and professional students, and more than 5,000 faculty members, we become one university: a wide-ranging, ever-changing community that draws its strength from a multitude of races, ethnicities, nationalities, genders, sexual orientations, historical traditions, ages, religions, disabilities, veteran status, interests, perspectives, and socioeconomic backgrounds. Penn has a number of policies and initiatives that support its efforts to foster inclusive excellence. Diversity and inclusion related data, progress reports on initiatives, a timeline of selected milestones, and stories about members of the Penn community are available here . Additional Resources Request Program Information New Grad Student Orientation Graduate Student Center Off Campus Services to help you find housing About Philadelphia Campus Safety- Clery Act and Crime Reporting Living in Philadelphia Famous as the birthplace of life, liberty and the pursuit of happiness, Philadelphia is a vibrant city offering countless things to do: fascinating museums, vibrant parks, national historic sites and famous (and delicious) food. Learn more about the great City of Philadelphia. Philadelphia neighborhoods each have a distinctive personality. The University of Pennsylvania is located in the University City section of Philadelphia. While most students live in University City and the adjacent Center City neighborhoods, there are many other areas to explore . Penn’s Office of Off Campus Services assists students with finding housing in Philadelphia, as well as assistance with leases, landlords, utilities and more. New graduate and professional students are encouraged to start looking for housing 3-4 months before arriving at Penn. Each spring, the University offers online sessions about housing so that incoming graduate students can get this critical information before arriving on campus. The Graduate Student Center’s Resources for New Grad Students includes a section on Moving to Philadelphia, which includes more information on transportation, parking, dining, and more. Contact Graduate Admissions There is no one central Office of Graduate Admissions. All questions about the admissions process should be directed to the academic program of interest. Carefully research the admissions information available online through the Penn Catalog for your prospective program. If you are unable to find the information you require, contact the appropriate School Admissions Office: Annenberg School for Communication 3620 Walnut Street Philadelphia, PA 19104-6220 215-573-6349 Contact Arts & Sciences PhD Programs Graduate Division 3401 Walnut Street, Suite 322A Philadelphia, PA 19104-6228 215-898-8101 Contact Arts and Sciences The College of Liberal & Professional Studies 3440 Market Street, Suite 100 Philadelphia, PA 19104-3335 215-898-7326 Contact Dental Medicine Robert Schattner Center 240 South 40th Street Philadelphia, PA 19104-6030 215-898-8943 Contact Education GSE Admissions Office 3700 Walnut Street Philadelphia, PA 19104-6216, 215-898-6415 Contact Engineering Engineering Admissions 109 Towne Building 220 South 33rd Street, Philadelphia, PA 19104-6391 215-898-4542 Contact Law Law Admissions 3501 Sansom Street, Philadelphia, PA 19104-6204, Contact Perelman School of Medicine Admissions Contact Nursing Claire M. Fagin Hall 418 Curie Blvd., Suite M-5 Philadelphia, PA 19104 215-898-4271 Contact Social Policy and Practice 3701 Locust Walk Philadelphia, PA 19104-6214 215-898-5539 Contact Veterinary Medicine 3800 Spruce Street, Suite 106 Philadelphia, PA 19104-6008 215-898-5434 Contact Weitzman School of Design 110 Meyerson Hall, 210 South 34th Street Philadelphia, PA 19104-6311 215-898-6520 Contact Wharton Graduate Admissions Contact 122 College Hall University of Pennsylvania Philadelphia, PA 19104 215.898.5000 provost@upenn.edu Contact Us © 2024 University of Pennsylvania, Philadelphia, PA 19104 University of Pennsylvania Penn Directory Accessibility"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:24.303125",
    "url": "https://www.dental.upenn.edu/admissions-academics/",
    "university_name": "University of Pensylvania",
    "title": "",
    "content": "News & Events Contact Alumni Continuing Education Give About Us HR & Faculty Affairs Inside PDM Search: Submit Search Menu Admissions & Academics DMD Program Admissions DMD Curriculum Clinical Education Community Outreach / Service Learning Honors Program Dual-Degree Options Leonard Davis Institute Summer Research Fellowship Tuition & Fees Prospective Student Learning Opportunities National & International Externships Close Graduate Dental Education Programs Admissions Advanced Education in General Dentistry Program Endodontic Program Oral Medicine Residency Program Oral Maxillofacial Surgery Residency/M.D. Orthodontic Program Pediatric Dentistry Program Periodontic Program Periodontic/Orthodontic Program Dual Periodontics Prosthodontics Program Prosthodontic Program Close Advanced Graduate Degree Programs Doctor of Science in Dentistry Master of Advanced Dental Studies (MADS) Master of Oral Health Sciences (MOHS) for Non-U.S.-Trained Dentists Master of Oral Health Sciences (MOHS) for Predental Track Students Master of Science in Oral and Population Health (MOPH) Master of Science in Oral Biology Close Program for Advanced Standing Students Admissions Requirements Tuition and Fees Close Bio-Dental Consortial Programs for High School Students Bio-Dental Consortial Programs for High School Students Close Financial Aid DMD Financial Aid and the Dean’s Scholarship Federal Loan Options General Student Scholarship and Loan Repayment Programs Minority Student Scholarships International Student Scholarships Close Technical & Health Standards Technical & Health Standards Close Office of Faculty Diversity & Mentorship Office of Faculty Diversity & Mentorship Close Faculty Search Faculty Search Close Academic Calendar Academic Calendar Close Close Student Life Career Services Office Student Housing Student Health and Wellness Student Organizations University Life Living in Philadelphia International Dental Student Exchange Program Close Departments Basic & Translational Sciences Endodontics Oral Medicine Oral and Maxillofacial Surgery / Pharmacology Orthodontics Periodontics Preventive & Restorative Sciences Division of Community Oral Health Division of Pediatric Dentistry Division of Restorative Dentistry Close Multicultural Affairs Office of Multicultural Affairs & Inclusion Office of Faculty Diversity & Mentorship Statement on Inclusion Policy on Diversity Resources Close Global Center for Integrative Global Oral Health International Dental Student Exchange Program Close Research Research Overview Research Programs Talking Research Research Day ACCE Day Close Center for Innovation & Precision Dentistry About Our Team & Partners Research & Technologies Training & Education CiPD Symposium Funding Resources Support News & Events Close Center for Clinical and Translational Research About Us Research Projects Close Center for Integrative Global Oral Health Cochrane Oral Health Collaborating Center at Penn Dental Medicine About Us Leadership/Faculty Lecture Series Education Publications Oral & Planetary Health Policies at Penn Dental Medicine A Stakeholder Dialogue – Accelerating Oral Health Research and Evidence-informed Policies in the WHO African Region Close Care Center for Persons with Disabilities Personalized Care Suite Care Center for Persons with Disabilities Personalized Care Suite Close Student Research Summer Research Basic & Translational Research Honors Program Research Advisors Student Research Group Summer 2023 Student Researchers Close Core Facilities Live Cell Imaging Core Tissue Processing Laboratory Transmission Electron Microscope Close OMS Research Collaborative OMS Research Collaborative Close Research Support and Services Research Support and Services Close Close Patient Care News & Events Contacts / Visitor Info Alumni Continuing Education Giving Opportunities About Us Human Resources Inside PDM Home // Admissions & Academics Admissions & Academics Along with its DMD program, including dual-degree opportunities through other Penn graduate program, Penn Dental Medicine offers postgraduate training in all the dental specialty areas as well as Master of Science in Oral Biology and Doctor of Science in Dentistry degrees. In addition, the School’s advanced graduate degree programs include a Master of Oral Health Sciences for both DMD track students and non-U.S.-trained dentists . Its academic programs also include a Program for Advanced Standing Students for internationally-trained dentists. DMD Degree Program DMD students gain a thorough grounding in the latest clinical techniques and emerging technologies in diverse clinical settings. Graduate Dental Education Programs Residents pursue postgraduate training in all the dental specialties with the opportunity to combine their specialty training with a Master of Science in Oral Biology or a Doctor of Science in Dentistry (DScD). Students Program for Advanced Standing Students Internationally-trained dentists earn a DMD in two years, preparing to practice in the United States. Advanced Graduate Degree Programs Master of Oral Health Science programs for both DMD-track students and non-U.S.-trained dentists. Bio-Dental Consortial Programs for High School Students Qualified students earn both their BS and DMD degrees in seven years. Financial Aid and Scholarships Academic Calendar Accreditation Status A statement on the Penn Dental Medicine programs accredited by the Commission on Dental Accreditation. Careers Calendar Library Inside PDM Maps Support Penn Dental The Robert Schattner Center, University of Pennsylvania, School of Dental Medicine 240 South 40th Street, Philadelphia, PA 19104-6030 © Copyright 2024 Penn Home Disclaimer Privacy Policy Report Accessibility Issues Emergency Services Report Copyright Infringement Facebook Twitter Instagram Youtube LinkedIn"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:24.584155",
    "url": "https://admissions.upenn.edu/how-to-apply/transfer-admission",
    "university_name": "University of Pensylvania",
    "title": "Site Navigation",
    "content": "Skip to main content Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Search Close Menu Close Search keywords Search Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Transfer Admission This is a community of people from all around the world, each with their own background and their own story. We're really interested in seeing all you love, everything that challenges you, and what you have learned, which together make you a distinct, singular person. Navigate Section Apply for Admission International Applicants Transfer Admission Transfer Admission sub-navigation Curricular Requirements Eligibility Guidelines Transfer Admission: Checklist and Deadlines Transfer Credit Transferring to the College of Arts and Sciences Transferring to the School of Engineering Transferring to the School of Nursing Transferring to the Wharton School Transferring to the College of Liberal and Professional Studies What Penn Looks For As a transfer student, you bring a unique perspective to our application process and our community. As you begin your transfer application process, please refer to the resources below. Penn accepts Common App and the Coalition Application . We have no preference for either format and treat both applications equally in our process. We encourage you to review the features of each application format and use the platform that suits you best. You should submit only one application per admissions cycle and not mix-and-match across platforms. Apply Via Common App Apply Via The Coalition Application Penn Admissions welcomes applications from members of the United States Armed Forces. For more information, please refer to the resources below and our frequently asked questions . Transfer Admission: Checklist and Deadlines Learn More Curricular Requirements Learn More Eligibility Guidelines Learn More Transfer Credit Learn More 1 College Hall, Room 1, Philadelphia, PA 19104-6376 Footer Menu Join the mailing list Contact Us Accessibility Privacy Policy NACAC Partnership Agreement"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:26.996344",
    "url": "https://gradadm.seas.upenn.edu/how-to-apply/",
    "university_name": "University of Pensylvania",
    "title": "How to Apply",
    "content": "Graduate Admissions Contact Us Doctoral Master’s Research News & Events About Us Online Programs Apply Now How to Apply Penn students and alumni are shaping the future of engineering and transforming the world. Are you ready to join them? The application process is straightforward, and we’re here to help. We evaluate your application holistically based on the following components: The Application When you’re ready, start your online application here . Your Professional Resume We look at your resume to learn about your job skills, the depth of your professional experience, your leadership experience and more. A Personal Statement In two pages or less, write an essay that answers the questions below. (But if you’re applying to the Integrated Product Design program, see the IPD-specific questions here .) Use specific examples where possible. Why are you interested in this program? What have you done that makes you a great candidate? How will you benefit from the program? How do you plan to contribute to the student community in Penn Engineering while you’re here? Why will you succeed in the program? What will you do/accomplish once you have completed the program? Letters of Recommendation Please provide two letters of recommendation (three for the CIS Ph.D. and BE Ph.D. “Medical Physics” concentration only), including one from a faculty member who is familiar with your scholarly abilities. Your letter writers will receive an email when you enter their contact information in the application for admission. The email provides a link to fill out a form and upload their letter. We don’t have any formal requirements or guidelines for how the letters should be written. Transcripts When you apply, please submit an unofficial transcript from each university or college where you earned course credit. Your transcripts must be in English. If your original transcript is not in English, we encourage you to use a transcript evaluation and translation service such as Educational Perspectives . If you are from a Chinese institution, we encourage you to use the Center for Student Services and Development . For applicants using WES transcript evaluation, please arrange to have your report sent to: University of Pennsylvania Dept: SEAS Graduate Admissions (Engineering) Official transcripts are only required if you have been admitted and choose to enroll. The Application Fee Please pay the $90 nonrefundable application fee along with your online application. You may qualify for a fee waiver if you are in one of the following categories: US citizens or permanent residents with proven low-income background Applicants with Penn or military affiliation Eligible students from a US partner institution applying to an Accelerated Master’s program If you meet one of these criteria, your fee will be automatically waived. GRE (Optional) The GRE is optional during the 2024-2025 application cycle, and it won’t hurt your application if you choose not to take it. But if you have taken the exam and received valid scores, we encourage you to submit them. Here’s what you need to know if you decide to submit your scores: The institution code to use for the GRE exam is 2888. Test results must be valid at the time you submit your application. You must take the exam by the application deadline. English Language Proficiency (for international students) If you are an international applicant or a non-US citizen or permanent resident and English is not your native language, you must submit official scores for (1) the Test Of English as a Foreign Language (TOEFL), (2) the International English Language Testing System (IELTS), or (3) Duolingo English Test (DET). The institution code for the TOEFL exam is 2888. Test results must be valid when you submit your application. You must take the exam by the application deadline. Test scores from at-home administration of the GRE and TOEFL exams are accepted. Please send your IELTS score report electronically to “University of Pennsylvania School of Engineering and Applied Science.” Please send your DET score report electronically to “ University of Pennsylvania – School of Engineering and Applied Science – Graduate.” Test Waivers To have the English-language requirement waived, you must meet one of the following criteria by the time of matriculation: Graduate from a program in the United States; Attend school in a country in which English is recognized as the official language; or, Graduate from an institution where the medium of instruction is English, and this is indicated on the unofficial transcript If you meet one of these criteria, this requirement will be automatically waived. Recommended Scores You don’t have to achieve a particular score to be admitted, but we recommend that you aim for at least the following scores: TOEFL: 100 IELTS: 7.5 DET: 135 Ph.D. Admissions Timeline 15 Sep Application opens 15 Dec Application deadline 15 Apr Admissions decisions released **Release Update: Decisions are released on a rolling basis. Applicants can expect a decision by April 15. Master’s Degree Admissions Timeline 15 Sep Application opens 1 Nov Early admissions deadline (for CIS, Data Science, and MCIT on-campus programs with two deadlines) 14 Jan Early admissions decisions released 1 Feb Regular admissions deadline 1 Apr Regular admissions decisions released Funding Your Education A degree from Penn Engineering is an excellent investment in your future. Find out more about costs, scholarships and other funding opportunities. Learn About Funding Request Information Fill out our form to learn more about graduate programs at Penn Engineering. Request Information Facebook Twitter YouTube LinkedIn Instagram University of Pennsylvania ©2024 | Privacy Policy Report Accessibility Issues and Get Help | Report Website Issues"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:34.251033",
    "url": "https://in-principle-and-practice.upenn.edu/",
    "university_name": "University of Pensylvania",
    "title": "Penn’s Focus on Tomorrow",
    "content": "Link to UPenn Homepage Penn’s Focus on Tomorrow Introducing a New Strategic Framework for the University of Pennsylvania. Read Our Principles We asked: “What does the world need from Penn?” The resulting principles are the essence of who we are. They are Penn’s enduring values and distinctive strengths. They are where we as a campus community stand. Scroll to section 1 Scroll to section 2 Scroll to section 3 Scroll to section 4 The Anchored University Our exceptional and diverse people, communities, and campus are our anchor, the foundation of all we do, and they guide and propel Penn. Being an excellent Philadelphia neighbor and global citizen is essential to Penn’s mission. The Interwoven University The more ideas and people from all backgrounds we bring to the table—and the more interconnected and less siloed our community—the more rigorous, more resourceful, and more effective Penn is. Leadership in interdisciplinary excellence distinguishes Penn. The Inventive University Penn is a powerhouse for breakthroughs in all fields. Penn addresses great challenges and opportunities. The Engaged University Penn cultivates leaders who serve. Penn seeks dialogue and collaboration across differences and divides. Our Practices Our areas of practice directly support and strengthen Penn’s core educational mission. They will help us channel Penn’s excellence and its boundless creative energy to meet the needs of our time. These practices are meant to guide, not decide, our future course. Accelerate interdisciplinary pursuits A cross-cutting University approach that spans boundaries to forge novel connections in teaching, research, and clinical practice to advance knowledge and improve lives. Expand our commitment to the power of curiosity-driven exploration across all fields of knowledge, from the arts and humanities to the sciences to the professions. Seek exponential growth in Penn’s interdisciplinary faculty support; even more inter-School teaching, projects, and programs; and rich opportunities for students and staff to pursue novel collaborations across a wide range of domains. Champion the essential role of the arts and humanities at the core of the human endeavor.  They bring people together through deeper understanding of history, culture, social conditions, and empathy for others, and they foster problem-solving. We will seek new ways to strengthen and integrate them in all fields and amplify opportunities to explore Penn’s extraordinary repositories of culture and beauty on campus and beyond. Continue to fuel Penn as a premier inventive powerhouse. From entrepreneurship to commercialization and tech transfer, Penn has established significant infrastructure to make this campus and city a destination for innovators. We will accelerate Penn as a premier powerhouse for translating knowledge into action and solutions. Lead on great challenges of our time Climate: Every person at Penn and all that we do has some nexus to the existential challenge of climate change. We must, in an all-in University effort, do more. From leading energy science and policy across disciplines to designing and caring for the built environment, Penn will seek additional ways to support and recruit the best minds; fuel initiatives that advance understanding and promise solutions; and adopt institutional best practices for the sake of our future and our planet. Health: The pandemic cast in sharp relief the urgency of Penn’s groundbreaking work in life sciences and health across schools and disciplines. To help ensure a healthier, safer global future, Penn will do even more to advance our health efforts. We will further cement both Penn and the region as an epicenter for groundbreaking research and teaching, translational discovery, and policy expertise in life sciences and public health. Data: From big data to large language model-powered AI, technological advances offer the chance to unlock new understanding across a dizzying number of domains and at the same time may dramatically outpace society’s ability to assess and plan for the promises and consequences. Penn is poised to lead in data-driven research, teaching, and applications. We will also cultivate leading expertise on how society can develop and deploy powerful technologies beneficially and justly. Democracy, trust, and truth: Position Penn as a global leader in driving conversations about and promoting democratic values and institutions. Build on signature homegrown strengths and exceptionally broad-ranging expertise to seek and defend truth. Grow opportunity and strengthen affinity Recruit and support diverse and exceptional students, faculty, and staff with the widest range of backgrounds, experiences, and perspectives. Undertake our campus planning to ensure design and function that serves its community for generations to come. Our physical plant should be state-of-the-art, sustainable, and thoughtfully improved to foster the interactions, experiences, and relationships that knit communities together. Deepen connection with neighbors and the world Excellent neighbor to West Philadelphia, our city, and region. Penn will pursue all that a collaborative urban institution and caring neighbor can do in this new era for cities everywhere. As one University, we will more centrally convene and coordinate all the work we do in meaningful partnership with our West Philadelphia neighbors, the city, and the region. We will leverage our academic expertise to shed light on, and seek solutions to, pressing urban challenges. Model global citizen. At a time when the tectonic plates of the international community are shifting rapidly, what is a leading American university’s role in the world? By building on existing partnerships around the world and further investing in global research, teaching, and learning on campus, Penn will help define what the next decade requires of a leading global university. Foster leadership and service Cultivate leaders who serve. The world needs leaders now more than ever—discerning leaders who have knowledge, vision, creativity, and, above all, a commitment to making a difference for others and for the planet. Penn has long prepared students to be leaders. For the future, we will build on existing resources and initiate new ways of cultivating service-minded leadership among our students, and also our faculty and staff. Best-in-class instruction. Producing knowledge and transmitting that knowledge to the next generation is the very core of the Penn experience. We will continually seek to advance state-of-the-art and innovative instruction to best deliver on our mission of preparing future generations to think critically and lead effectively. Convene, communicate, and collaborate across divisions and divides. Link to UPenn Homepage © 2024, University of Pennsylvania"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:39.590070",
    "url": "https://president.upenn.edu/",
    "university_name": "University of Pensylvania",
    "title": "",
    "content": "Skip to main content Go to site search Go to primary navigation Go to resources navigation Penn Home Toggle Site Navigation Toggle Site Search About Interim President Jameson More About Interim President Jameson News Highlights Event Galleries Messages & Statements Initiatives More Initiatives Penn’s Action Plan to Combat Antisemitism Presidential Commission More Presidential Commission Membership Progress Update In Principle and Practice University Leadership More University Leadership President's Center Provost & Deans Senior Administrators History of the Presidency Toggle Site Search Resources Current Students Faculty & Staff Parents Alumni Visitors A-Z Directory Webmail Services Penn Home Search Search Close Office of the Interim President To Penn’s Class of 2024: ‘The world needs you’ The University celebrated graduating students during the 268th Commencement. Learn MORE Class of 2024 President’s Engagement, Innovation Prize winners announced Three prize-winning teams will design and undertake post-graduation projects that make a positive, lasting difference in the world. Learn more Office of the President Contact 1 College Hall, Rm 100 Philadelphia, PA 19104-6380 215-898-7221 president@upenn.edu Disclaimer Emergency Services Privacy Policy Report Accessibility Issues and Get Help Report Copyright Infringement Philadelphia, PA 19104 Telephone: (215) 898-5000"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:41.626378",
    "url": "https://www.med.upenn.edu/admissions/",
    "university_name": "University of Pensylvania",
    "title": "MD Admissions",
    "content": "Navigate MD Admissions Home Innovations Dynamic Learning Environment Dual Degrees & Areas of Concentration Special Study & Research Curriculum Core 1 Core 2 Core 3 Evaluation and Degree Requirements The Penn Med Experience Teaching Facilities 2023-24 Total Enrollment and Entering Class Profile Post-Graduate Outcomes Admissions General Academic Competencies Application Procedure Application Timeline Inclusion, Diversity, and Equity Technical Standards for Admission Prospective Student Resources Special Programs FAQs COVID-19 Policies Financial Aid Overview Tuition & Fees AAMC/FIRST How To Apply For Aid Student Resources Innovations Dynamic Learning Environment Dual Degrees & Areas of Concentration Special Study & Research Curriculum Core 1 Core 2 Core 3 Evaluation and Degree Requirements The Penn Med Experience Teaching Facilities 2023-24 Total Enrollment and Entering Class Profile Post-Graduate Outcomes Admissions General Academic Competencies Application Procedure Application Timeline Inclusion, Diversity, and Equity Technical Standards for Admission Prospective Student Resources Special Programs FAQs COVID-19 Policies Financial Aid Overview Tuition & Fees AAMC/FIRST How To Apply For Aid Student Resources MD Admissions Dear Prospective Applicants, Thank you for your interest in the Perelman School of Medicine! Your decision to pursue a career in healthcare is an incredibly important one, and we welcome the opportunity to be part of your medical training. Caring for patients is a privilege, and aspiring physicians like you provide us with tremendous hope and inspiration for the future. There has never been a more exciting time to practice medicine, with a steady stream of game-changing discoveries and technological breakthroughs improving patient outcomes and clinical care delivery. Innovation in medicine is a defining characteristic of PSOM, as is our commitment to prepare our students to become tomorrow's leaders in whatever career path they choose. Dr. Neha Vapiwala, Associate Dean of Admissions, Perelman School of Medicine Important Dates 2024 Applicants Admissions decisions have been releases via the applicant portal. Accepted applicants have until April 30 to make their PTE decision. 2025 Applicants and Beyond Are you interested in applying to Perelman and want to learn more? Check out our May 2024 Summer Information Session . We will host another virtual session in July, registration will open June 15. Campus Information Campus Map Life at Penn Follow us on social media! Perelman School of Medicine (Facebook) Penn Medicine (Facebook) Penn Medicine (IG) Quick Links AAMC AAMC Medical School Admissions Requirements Guide IDEAL MEd Inclusion, Diversity, Equity, and Learner Experience Program in Medical Education Liberal and Professional Studies — Post Bac Program Global Health Penn Medicine Penn Medicine Facts & Figures Blue Ridge Institute for Medical Research FIRST (Financial Information, Resources, Services, and Tools) IMP a CT Integrating Medicine Patient Care Transitions IMPaCT The Perelman School of Medicine enjoys an international reputation for innovation in areas ranging from leadership training to global health. Our groundbreaking curriculum sets a new standard for medical education nationwide. The three core blocks of the MD curriculum integrate basic sciences and clinical experience from day one. It teaches students self-directed lifelong learning skills, interdisciplinary teamwork and technological proficiency in the practice of evidence-based medicine and patient-centered care. Integrated Integration of basic, translational, social, clinical, and health systems sciences throughout the continuum of medical education, led by outstanding faculty committed to the privilege of teaching tomorrow's healthcare leaders. Innovative Our training is designed to enable students to learn and work in teams throughout medical school. Our university campus provides unparalleled proximity and access to opportunities for educational enrichment at any of our leading graduate schools, innovative research centers, and renowned clinical facilities. Individualized Numerous and diverse opportunities allow for customization of the medical education journey and pursuit of unique professional experiences so that all specific interests and career goals can be attained. A Unique Opportunity in Medical Education Medical students can customize their education to suit their interests. More than 50 percent of each class remains at Penn beyond four years to take advantage of resources for dual degrees, certificates, global health experiences, and research. Admissions Vision Statement Perelman School of Medicine at the University of Pennsylvania will select students who will become future physician leaders in health care, advancing science and discovery and furthering the clinical, educational, research, health policy and medical entrepreneurial missions for our society. Graduates of the Perelman School of Medicine will be leading advocates for these endeavors within their local environment as well as for the health of national and international communities. We strive to recruit a diverse and inclusive class that reflects these goals. Principles of Selection at PSOM: Student selection is a multifactorial process that emphasizes holistic review. Aspects considered include academic performance, breadth and depth of life experiences and personal attributes. Diversity, equity and inclusion are core missions of our institution. We strive for representation in our class from a variety of demographic, educational and socioeconomic backgrounds. Successful candidates demonstrate academic excellence, commitment to community service, scholarly achievement and leadership ability. MD Admissions News Julia Puchtler Named UPHS Chief Financial Officer Tuesday, May 21, 2024 Julia Puchtler has been named senior vice president and chief financial officer of the University of… Colonoscopy and At-Home Tests Doubled Colorectal Cancer Screening Thursday, May 16, 2024 In a trial analyzing how messages were framed in an underserved population, offering colorectal cancer… Axons in female mammal brains may be more prone to concussions Monday, May 13, 2024 The structural differences in male and female brains might explain why females are more prone to concussions… Subscribe Our Mission Our mission is to advance knowledge and improve health through research, patient care, and the education of trainees in an inclusive culture that embraces diversity, fosters innovation, stimulates critical thinking, supports lifelong learning, and sustains our legacy of excellence. Perelman School of Medicine University of Pennsylvania Diversity & Community Search this Site Connect With Us on Facebook Penn Medicine MD Admissions Perelman School of Medicine at the University of Pennsylvania Jordan Medical Education Center, 6th Floor 3400 Civic Center Blvd. Building 421 Philadelphia, PA 19104-5162 215-898-8001 admiss@pennmedicine.upenn.edu Campus Map © The Trustees of the University of Pennsylvania | Site best viewed in a supported browser . | Report Accessibility Issues and Get Help | Privacy Policy | \nSite Design: PMACS Web Team."
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:43.984831",
    "url": "https://www.sas.upenn.edu/graduate-division",
    "university_name": "University of Pensylvania",
    "title": "Graduate Division",
    "content": "Skip to main content School of Arts and Sciences - University of Pennsylvania University of Pennsylvania School of Arts & Sciences College of Arts & Sciences Graduate Division College of Liberal & Professional Studies Search Search Menu School of Arts and Sciences - University of Pennsylvania SAS_logo_white-sticky Graduate Division About Dean's Welcome History Contact Programs Graduate Groups Certificate Programs Summer Research-Early Identification Program Ivy+ Exchange Scholar Program News & Announcements Current Students Principles for Graduate Teaching and Mentorship Dissertation and Theses Deposit Policies Funding Resources & Support Reporting Concerns 2024 Commencement Ceremony The Graduate Division of the School of Arts & Sciences Presents: Graduate School in 3, 2, 1 Prospective Students Application Information Admissions FAQ Explore Philadelphia Diversity & Inclusion Search Graduate Division We’re the Graduate Division Home to more than 30 graduate groups spanning the humanities and social and natural sciences, the Graduate Division at Penn Arts & Sciences is here to support your research. Create New Knowledge Home to expert faculty, archives, and state-of-the art equipment, Penn Arts & Sciences will help you grow into a leader in your field. At the Frontiers Our graduate groups offer a rigorous education, guiding students as they pursue advanced research and begin to make their own original contributions at the frontiers of knowledge. Previous Next 1 / 3 News & Announcements Previous Next 1 / 2 SAS Graduate Division Ceremony: Featured Graduation Speakers The Graduate Division is pleased to announce that our keynote speaker for graduation 2024 will be Professor Dorothy Roberts. View Article 2024 Penn Grad Talks Winners Congratulations to this year's winners of Penn Grad Talks! View Article At Ben Talks NYC, A Journey from Ocean Depths to Outer Space In a room overlooking New York's Bryant Park, more than 200 alums heard from scientists studying coral reefs, fractures on the Earth's surface, and the expansion of the universe. View Article A Conversation About Free Speech In the first Living the Hard Promise event from Penn Arts & Sciences, Sophia Rosenfeld, Walter H. Annenberg Professor, spoke with Associate Dean for Graduate Studies Beth S. Wenger about the purpose, history, and challenges of open expression on campus. View Article Graduate Division 2024 Commencement Ceremony Mark your calendars! View Article 2023 SAS Dean's Scholars Penn Arts & Sciences has named 9 students from the Graduate Division as 2023 Dean's Scholars. This honor is presented annually to students who exhibit exceptional academic performance and intellectual promise. View Article 2024 Commencement The 2024 Commencement Ceremony for Master's and PhD recipients took place on Friday, May 17, 2024, in Irvine Auditorium. Congratulations to the class of 2024! View photos and video Grad Students in the News Previous Next 1 / 2 Uniting passions for architecture, preservation, and the Near East Marc Marín Webb, who studied architecture in Berlin and Barcelona, is studying the impact of genocide on the built heritage of the Yezidi community in Iraq. View Article Penn’s ‘philosophers in residence’ engage Philadelphia youth with the hard questions Ph.D. students Jacqueline Wallis and Afton Greco are embedded at the Academy at Palumbo in South Philadelphia, where they give philosophy lessons on curriculum-relevant topics and run an after-school Philosophy Club. View Article In Japan, teaching a multitude of creative anthropology practices Penn anthropologists in the Center for Experimental Ethnography led workshops at Ritsumeikan University on performance, film, mapping, sound, and collaging. View Article Finding new ways to evaluate voters’ beliefs In his dissertation research, joint communication and political science doctoral student Nicholas Dias searches for new ways to gauge voter competency. View Article Race and Romance Sociology Ph.D. candidate Olivia Hu is studying how people choose romantic partners across race lines, and how those relationships affect their understandings of social difference. View Article Lessons From 17th Century \"New Netherland\" Through study of the fur and wampum trade between the Lenape and Dutch in the 1600s, fourth-year history Ph.D. candidate Molly Leech is aiming to recenter Indigenous contributions to global trade. View Article Graduate Groups Learn about our 33 graduate groups in the humanities and social and natural sciences. Learn more Penn Grad Talks Penn Grad Talks is an annual TED Talk-style event where Penn Arts & Science grad students showcase their knowledge and research while competing for prizes. Watch the 2024 presentations College of Arts & Sciences Graduate Division College of Liberal & Professional Studies Quick School Links Penn Arts & Sciences A-Z Academic Departments Faculty Index Computing Resources for Faculty Penn Resources Libraries Directory Calendar News Donate Contact Us Copyright © 2024  The Trustees of the University of Pennsylvania Report Accessibility Issues and Get Help Penn Weblogin"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:44.706233",
    "url": "https://www.library.upenn.edu/",
    "university_name": "University of Pensylvania",
    "title": "Get Started",
    "content": "Get Started Get Started Close My Account Make an Appointment Reserve a Space Guides by Subject Off-Campus Access Resource Sharing Alumni and Guest Accounts Alumni Access Menu Homepage Ask Ask a Librarian Close Send Us a Question Skip to main content Skip to site search Skip to primary navigation Skip to About Penn libraries menu Skip to Get Started menu Skip to Live Chat Phone 215-898-7555 Report Accessibility Issues and Get Help Access to the College Green area of campus will be restricted until further notice . PennCard holders and some Penn affiliates may enter and exit Van Pelt-Dietrich Library Center through the Rosengarten Undergraduate Study Center on the ground floor, and may enter and exit the Fisher Fine Arts Library through the 34th Street entrance to Meyerson Hall. See our Service Alerts for details. Close Penn Libraries logo Toggle Site Navigation Toggle Site Search Help With More Help With Borrowing Research and Scholarship Instruction and Course Support Guides by Subject Equipment Software and Tools Digital Scholarship and Data Services Digitization (SCETI) Featured Services Off-Campus Access Alumni Access Quick Start Guide Collections More Collections About Our Collections Collections by Subject Collection Development Policies Search Our Catalog Notable Collections University Archives Contact a Subject Librarian Suggest a Purchase Philadelphia Area Archives Strategies for Special and Global Collections Libraries & Spaces More Libraries & Spaces Libraries and Locations Access and Visitor Information Find and Reserve Spaces Albrecht Music Library Annenberg Library Biddle Law Library Center for Global Collections Chemistry Library Education Commons Fisher Fine Arts Library Holman Biotech Commons Kislak Center for Special Collections, Rare Books and Manuscripts Levy Dental Medicine Library LIBRA--Penn Libraries Research Annex Library at the Katz CAJS Lippincott Library of the Wharton School Math/Physics/Astronomy Library Penn Museum Library University Archives University Records Center Van Pelt-Dietrich Library Center Veterinary Medicine Libraries Weigle Information Commons News & Events More News & Events News Events Exhibits Social Media About Penn Libraries About Us Staff Directory Hours Policies and Guidelines for Users Accessibility Diversity, Equity and Inclusion Community Engagement Strategic Plan Service Alerts Support Us Toggle Site Search Search Library Website Search Close Penn Libraries Search Franklin Homepage Hours My Account Ask Just graduated? Alumni Services Graduation doesn’t mean the end of your journey with the Penn Libraries! As a University of Pennsylvania alum, you can continue to experience a variety of events and exhibits, access select print and e-resources, and more. Find out how Using the Library Quick Start Guide Borrow Books and More Get Expert Help Find a study space Teaching Borrow Books and More Search the Franklin Catalog Use Franklin to find books, journal articles, databases, CDs and DVDs, and anything else in the Penn Libraries collections. Get Off-Campus Access Need to access subscription materials like journals, databases, and ebooks when you’re not on campus? Check out our cheat sheet. Request Scans Our library staff can scan book chapters and articles for quick delivery directly to your inbox. Receive Books by Mail When you register for Books By Mail, you can request to have books sent to your off-campus address anywhere in the United States. Get Expert Help Ask a Question Anytime Explore our archive of Frequently Asked Questions. Can’t find the answer you’re looking for? Submit your question anytime, and we’ll respond within 24 hours. Book a Consultation Book an in-person or virtual consultation with a librarian or technology consultant with expertise in your field of study, copyright, digital fabrication, or statistical and design software. Find Your Personal Librarian From Accounting to Veterinary Medicine, one of our subject specialists can tailor help to your particular focus. Find a study space Browse our spaces Explore our array of flexible and innovative spaces, from collaborative or quiet study spots to classrooms designed for active learning and equipped with the latest technology. Reserve a room Already know exactly which room you need? Head directly to our room reservation system. Explore our library locations Like to study in the middle of the night? Need specialized databases at your fingertips? Looking for a location close to your classes? Find out how to visit all our library locations across campus—and beyond—and discover which one suits your needs best. Teaching Explore Canvas and Related Resources Find support, training, and instructional design services for Canvas—Penn’s learning management system—and related educational technologies. Book a Classroom Space Use our spaces finder to book a classroom with the setup and technology that suits your needs. Course Reserves Set aside books, films, and sound recordings for classroom use. Featured Collections The Penn Libraries' global collections encompass hundreds of languages and scripts across a broad range of subject areas, preserving the rich cultural and scholarly record from Africa, East Asia, Latin America, the Middle East, Eastern Europe, and South Asia. Read about some of our unique recent acquisitions. show-hide control Khajistan and the Shaping of Pakistani Cultural Histories The Penn Libraries is collaborating with preservation organization Khajistan to acquire ephemera, magazines, pulp fiction, and rare books that document the cultural history of Pakistan, Afghanistan, and Iran. Nova khata: A Ukrainian Folk Art Journal in Interwar Galicia The Penn Libraries has recently acquired several issues of the women’s journal Nova khata (New Home), which offer a unique window into Ukrainian culture as it existed a century ago in Galicia. Exploring Chinese Internet Literature To more accurately reflect the diversity of literature in China, the Penn Libraries has made a special effort to add recent internet novels that have been published in print form to our collection. Upcoming Events View all List Workshop May 23, 2024 Coffee with a Codex: Book of Hours On May 23, curator Dot Porter will bring out Ms. Codex 1566, an illuminated Book of hours, use of Metz , with a calendar, the Hours of the Virgin, the Penitential Psalms and Litany, and the Office of the Dead. Written in Metz, France, between 1375 and 1399. 12:00pm - \n            12:30pm Online Open to the Public Workshop May 27, 2024 Canvas 101 for Faculty and Staff This workshop will introduce basic Canvas functions that will allow participants to do the following: set profile and notifications; navigate the Canvas interface; create content for a Canvas site; and post files, images, and videos. 12:00pm - \n            12:45pm Virtual Open to Penn Students, Faculty, and Staff May 28, 2024 Artist Book Show and Tell at the Common Press Bring your favorite artist book or special edition to show and tell in this re-occurring event happening during lunchtime on the last Tuesday of every month. If you are feeling shy about sharing, just come and see what staff from the Common Press brings! 12:30pm - \n            1:30pm Common Press, Fisher Fine Arts Library (Lower Level) Open to Penn Students, Faculty, and Staff Subscribe to our newsletter 3420 Walnut Street, Philadelphia, PA 19104-6206 (215) 898-7555 Privacy Policy Campus libraries map Committees Resources for Staff Welcome to your library. Report Accessibility Issues and Get Help instagram facebook twitter linkedin"
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:46.009531",
    "url": "https://portal.apps.upenn.edu/penn_portal/student.php",
    "university_name": "University of Pensylvania",
    "title": "",
    "content": "Penn My tab Path@Penn Libraries Log in to PennPortal Log in Announcements There are no announcements. Portal power tip Action items for all students Emergency contact information Share academic/financial info Sign up for direct deposit Setup Penn.Pay Penn Privacy Registration & academic info Course search & schedule planning University Catalog My course schedule Canvas Timetable, course & room roster more Register for courses Advising Ordering transcripts View transcripts Penn Course Evaluations Resources to support student learning Books & materials Student Affairs Policies Academic programs Library Research Computing Penn course review less Financial information Update your must-do list Billing, financial aid, loans, and more... View and pay your student bill Financial literacy Hubs & communities Center for Undergraduate Research and Fellowships (CURF) Civic House CWiC Speaking Center Family Resource Center more Graduate Student Center Greenfield Intercultural Center Kelly Writers House La Casa Latina Lesbian Gay Bisexual Transgender Center Makuu  Black Student Cultural Center Navy ROTC Office of International Programs Office of Student Life Pan-Asian American Community House Penn Humanities Forum Penn Women's Center Platt Student Performing Arts House Religious communities SNF Paideia Program Weiss Tech House less Student groups Groups Online at Penn Student organizations by category Fraternities and sororities Graduate and professional student organizations more Student government Performing Arts Council Find out more about student organizations Reserving spaces How student groups can use PennPortal less Portal spotlight Don't forget . . . Campus life resources Access PennCard PennKey Privacy must do list Share academic/financial info Online directory QuakerNet Alumni Directory Update PennCard Access Code The Daily Pennsylvanian Penn's independent, student-run newspaper Living green at Penn Green campus partnership eCard greetings from Penn Residential information more less On campus housing information College Houses Graduate housing AiM maintenance request Off-campus services more residential information Dining & shopping Dining options Penn Bookstore Penn Computer Connection more about dining and shopping Global more less Penn Global Penn Abroad Global Activities  Registry International Student and Scholar Services Office of Student Affairs Provosts Global Engagement Careers & employment Career Services Student employment Health & welfare Public Safety Emergency phone numbers Student Health Service (215-746-3535), appointments, immunizations, insurance, fees & more... Counseling and Psychological Services more about health & welfare Getting around more less Penn Shuttle and PennBus (898-RIDE) Walking Escort (898-WALK) Discounts on SEPTA and NJ Transit SEPTA: regional transit Campus maps Philadelphia more about getting around Athletics & recreation Penn Athletics Gyms, IM sports, classes and clubs Community service Civic House Netter Center for Community Partnerships Arts & entertainment Social Planning and Events (SPEC) Performing Arts Council more arts and entertainment Penn home page | Contact Us Copyright © 2024, University of Pennsylvania. All rights reserved."
  },
  {
    "id": 10,
    "date": "2024-05-22T19:59:54.059236",
    "url": "https://provider.www.upenn.edu/computing/webmail/index.php",
    "university_name": "University of Pensylvania",
    "title": "",
    "content": "Webmail Server Selection Welcome to the webmail jump-off page. Here ISC provides links to webmail access for Exchange, Zimbra and our new Microsoft O365 cloud-based services, Penn O365.  You will also find selections for accessing email over the web for other schools on campus. Select your server and click \"Go\" to proceed to the appropriate webmail server. Please select your mail server: Penn O365 ben.dev.upenn.edu ehrs.upenn.edu gse.upenn.edu mail.design.upenn.edu mail.isc.upenn.edu mail.sp2.upenn.edu webmail.nursing.upenn.edu sas.upenn.edu mail.med.upenn.edu pennmedicine.upenn.edu vet.upenn.edu gmail.seas.upenn.edu wharton.upenn.edu Information Systems and Computing University of Pennsylvania Comments & Questions Information Systems and Computing, University of Pennsylvania"
  }
]