[
  {
    "id": 2,
    "data": "2024-05-17T19:19:37.952189",
    "url": "https://gradschool.princeton.edu/academics/degrees-requirements/fields-study/computer-science",
    "university_name": "Princeton University",
    "title": "Graduate School",
    "content": "Graduate School Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Admission & Onboarding Submenu Admission & Onboarding Explore Prepare Submenu Deadlines and Fees Statement of Academic Purpose Resume / Curriculum Vitae Letters of Recommendation Transcripts Personal Essay Fall Semester Grades Required Tests Writing Sample Statement of Financial Resources Apply Review Admission Decision Onboard & Arrive Submenu Final Transcripts Immunizations & University Health Services Forms I-9: Employment Eligibility Verification Nondegree Programs Submenu Research Collaborators Submenu Visiting Student Research Collaborators (VSRC) Ecole Normale Superieure Paris (ENS) Exchange Freie Universität Berlin Trailing Nondegree Students Exchange Students Submenu BGSAS Berlin DAAD-German Sciences Po HUJI Jerusalem Princeton-Humboldt SNS Pisa U. Tokyo Visiting Students Submenu Daniel M. Sachs Scholarship Procter Visiting Fellowships Fleet Fellowship Graduate Visiting Student Qualifying Nondegree Students Review Admission Decision & Onboard Academics Submenu Academics Degrees & Requirements Submenu Fields of Study Submenu Program Offerings Standard Requirements Advising Requirements General Exam Submenu Incidental Master’s Degree Dissertation & FPO Advanced Degree Application Process Submenu Degree Deadlines Final Master's Degree Requirements Enrollment, Status & Progress Submenu Semester Sign-In Enrollment Statuses Submenu Degree-Seeking Statuses Former Degree-Seeking Statuses Status Changes and End of Student Benefits Reenrollment Courses, Research & Teaching Submenu Course Information Submenu Curriculum Management Teaching Submenu Collaborative Teaching Initiative in the Humanities and Social Sciences Academic & Research Integrity Opportunities, Resources & Support Submenu Partnerships, Exchanges & Cross-Registration Submenu IUDC Princeton-Rutgers IvyPlus Exchange ENS Paris Freie Univ. Berlin BGSAS Berlin DAAD Sciences Po HUJI Jerusalem Humboldt Exchange SNS Pisa U. Tokyo External Opportunities Learning, Teaching & Research Support Submenu Learning Support Teaching Support Research Support Time Off Advising & Mentoring Submenu Resources for Students Resources for Faculty Graduate Student Mentoring Report Academic Grievance Process Financial Support Submenu Financial Support Financial Support Model Submenu Funding Calendar, University Rates & Costs Ph.D. Funding: Humanities & Social Sciences Ph.D. Funding: Natural Sciences & Engineering Dissertation Completion Funding Submenu Dean's Completion Fellowship / PGRA Master’s Degree Funding Nondegree Students Fellowships Submenu Princeton Fellowships External Fellowships Fellowship Coordination NSF Fellowships Assistantships Graduate Student Employment Submenu Policies & Guidelines Additional Funding & Support Submenu Student Activity Funding Loans & Work-Study Submenu Federal Student Loans Federal Work Study Private Student Loans Code of Conduct Assistance Programs Military-Connected Students Submenu Financial Shopping Sheet AmeriCorps Understand Your Finances Submenu My Financials Student Taxes Financial Literacy Financial Wellness Fellows Program Tiger Cents Chronicles Professional Development Submenu Professional Development About GradFUTURES Submenu Meet the Team Professional Competencies For Current Students Submenu Sharpen Skills Forge Connections Gain Experience Explore Pathways Partner with Us Professional Development Events GradFUTURES Forum GradFUTURES Podcast Diversity Student Experience Submenu Student Experience Residential Life Submenu The Graduate College Submenu Facilities Porter's Lodge Lawrence Apartments Lakeside Apartments Dining Student Life Submenu Orientation Hooding and Recognition Ceremony Submenu Faculty Info Regalia Frequently Asked Questions Special Events High Tables Get Involved Submenu Student Organizations Plan an Event Student Govt & Advocacy Affinity Groups Other Ways to Engage Meet the Team Support & Resources Submenu Family-Focused Submenu Childbirth & Adoption Child Assistance Program Health/Wellness Submenu Graduate Advance Medical Expense Assistance Safety Resources Crisis Support Transportation/Travel Books/Technology Conduct & Standards Alumni About SubMenu Dean's Welcome Our Mission Program Metrics SubMenu Admission Statistics Enrollment Statistics Degree Counts and Time to Degree Analysis Ph.D. Completion and Cohort Analysis Ph.D. Long-term Career Outcomes Governance SubMenu Faculty Roles & Graduate Committee Requirements Our History SubMenu Architectural Tour Carillon Honorific Recipients Teaching Awards Information about Graduate Student Unionization SubMenu Communications from the Graduate School Student Support and Benefit Highlights Peer Institution Collective Bargaining Agreements FAQs about Graduate Student Unionization News Events Policies Admin Portal Apply Log in Search Search Home Academics Graduate Degrees & Requirements Fields of Study Computer Science Academic Year 2023 – 2024 Jump To: Jump To: General Information Address Computer Science Building, 35 Olden Street Phone 609-258-5387 Website Department of Computer Science Program Offerings: Ph.D. M.S.E. Graduate Program Administrator: Nicki Mahler Louis Riehl Director of Graduate Studies: Michael Freedman Elad Hazan Andrés Monroy-Hernández Overview The Department of Computer Science accepts both beginning and advanced graduate students for study and research leading to the degree of Master of Science in Engineering (M.S.E.) and Doctor of Philosophy (Ph.D.). These degree programs are sufficiently flexible to adapt to individual plans of study and research. Apply Application deadline December 15, 11:59 p.m. Eastern Standard Time\n      (This deadline is for applications for enrollment beginning in fall 2024) Program length Ph.D. 5 years, M.S.E. 2 years Fee $75 GRE General Test - not accepted Additional departmental requirements Applicants are required to select up to two areas of research interest when applying. M.S.E.: Two supplemental essays are required. Please describe any teaching experience you have had, in any subject, at any grade level. This can include but is not limited to experience as a teaching assistant, lab assistant, grader, tutor, or any other role in which you interacted with students or mentored your peers. 250 words max. For those with teaching experience, describe a specific instance when you helped your student/students overcome a misunderstanding or understand a difficult concept. If you do not have any teaching experience, please describe an oral presentation or talk you gave that explains a particularly difficult concept. 250 words max. M.S.E.: If TOEFL is required, a minimum of 28 on the speaking subsection is required. Program Offerings Ph.D. M.S.E. Program Offering: Ph.D. Program description The doctoral program in computer science combines coursework and participation in original research. Most students enter the program with an undergraduate degree in computer science, mathematics, or a related discipline. Some entering students may have a master’s degree, but that is not necessary for success in the program. Every admitted Ph.D. student is given financial support in the form of a first-year fellowship. In addition, all admitted Ph.D. students are automatically considered for the prestigious Wu and Upton Fellowships. Courses In preparation for the general examination, the doctoral candidate, in consultation with a faculty adviser, develops an integrated program of study in one of the departmental areas of research. Such preparation usually requires two academic years for students entering with a bachelor’s degree, and one year for students entering with a master’s. Students are required to stand for the general examination at the end of the second year. A total of 6 courses are required. Three courses must be taken to satisfy the core breadth requirement, with one course from each of three main areas of computer science: Systems, Artificial Intelligence (AI), and Theory.  All students must fulfill the core breadth requirements plus one additional course by the end of the second year, demonstrating minimum competence in three main areas. The remaining three courses can be any 400- or 500-level course from any department in the University. Courses taken outside the Department of Computer Science require approval from the student’s academic adviser and the Director of Graduate Studies. All courses must be taken for a grade. A grade of B+ or higher is required to get credit towards course requirements, although at most one B will be accepted for a course that does not satisfy the core breadth requirements. Individual research areas may request additional courses in excess of departmental requirements or may require students in that subfield to complete specific required courses in fulfillment of course requirements. Breadth requirement core course list: Systems 475 Computer Architecture (See ELE 475) 518 Advanced Computer Systems 561 Advanced Computer Networks 563 Wireless Networks Artificial Intelligence 511 Theoretical Machine Learning 513 Foundations of Probabilistic Modeling 524 Fundamentals of Machine Learning 529 Advanced Computer Vision 584 Advanced Natural Language Processing Theory 510 Program Languages 516 Automated Reasoning About Software 521 Advanced Algorithm Design 522 Computational Complexity 585 Information Theory and Applications General exam The general examination consists of a research seminar prepared under the supervision of a faculty member, followed by an in-depth oral examination on the contents of the seminar and the associated general area of research. The oral examination tests the student's knowledge in a number of topics relevant to the student's research area. These topics are specified beforehand by an examining committee in consultation with the student. The seminar is open to the public, and at least three computer science faculty members must attend. Two are invited by the student; the adviser chooses a  third faculty member who could be in any area of Computer Science or related fields.  The examining committee and the student agree upon a reading list for the exam. This document is to be made available to anyone present in the oral examination, and only questions pertaining to either the material described in the document or presented during the research seminar can be asked during the oral examination. Original research results do not have to be presented, but problems whose solution may lead to a thesis should be discussed. In many cases, the student’s thesis is in the same area as the research seminar, but this is not required. Qualifying for the M.A. The Master of Arts (M.A.) degree is normally an incidental degree on the way to full Ph.D. candidacy once a student has successfully completed the general examination. The M.A. may also be awarded to students who, for various reasons, leave the Ph.D. program, provided the student has successfully completed the six required courses from the Breadth Requirement. Please note, students admitted to the Ph.D. program who do not wish to complete the program may be considered for an M.S.E. degree with approval from the department and the Graduate School. Ph.D. students who have already been awarded the incidental M.A. are not eligible to earn an M.S.E. For students who entered the Ph.D. Program before Fall 2018: The Master of Arts degree can be awarded after successfully completing all the year 2 requirements -- 3 core courses, one additional course, and passing the general exam. For students who entered the Ph.D. Program Fall 2018 and after: The Master of Arts degree can be awarded after successfully completing the 6 required courses from the Breadth Requirements. Teaching Teaching experience is considered to be a significant part of graduate education. All Ph.D. candidates are therefore required to assist with course instruction for the equivalent of two terms. Post-Generals requirements Pre-FPO The preliminary FPO is a research talk given to the anticipated FPO committee approximately six months before the FPO date. The pre-FPO covers results to date and planned research, and serves as a preliminary critique of the proposed dissertation. Graduate students will present a public talk followed by a private meeting with the committee.  The outcome of the pre-FPO is not graded. Graduate students are provided with valuable feedback to the committee expects will guide any final work and will be incorporated into the dissertation. FPO Committee must be identical to the Pre-FPO committee; any subsequent changes to the committee require approval from the DGS. Dissertation and FPO The Ph.D. is awarded after the acceptance of the dissertation and completion of the final public oral. Program Offering: M.S.E. Program description The Master's degree at Princeton is a two year, full-time program. All admitted students will initially be enrolled in the Master of Science in Engineering (M.S.E.), thesis-required track. In the spring of year 1, as part of readmission, all students will be given the option to switch to the Master of Engineering (M.Eng.), non-thesis track. Students opting to remain on the M.S.E. track must have a confirmed research adviser and should also have a preliminary thesis proposal. Switching from the M.S.E. track to the M.Eng track will be permitted through January of Year 2. All coursework must be taken for a grade. A minimum of 4 courses must be taken in year 1. If, due to scheduling conflicts,this is not possible, approval by the Director of Graduate Studies is required. In no event will time to degree be extended beyond two years. Funding is normally in the form of teaching assistantships covering the four semesters of the program. Summer funding for M.S.E. candidates in the form of a research assistantship may be offered at the adviser's discretion. Students wishing to continue on for a Ph.D. should apply through the normal application process during the fall of their second year of study. Undergraduate senior thesis and undergraduate independent work courses are not included in this policy. The M.S.E. program is a two year, full-time program of coursework plus submission of an original thesis. Candidates choose a subarea of computer science on which to focus by taking appropriate courses, and writing a thesis under the direction of an adviser. Course requirements are fulfilled by taking six courses for a grade, at least three of which must be 500-level courses. The other eligible courses are 318, 320, 324, 326, 343, 352, 375, or any 400-level course, or 500-level COS course, including COS 597 and 598. You may view a list of approved courses outside of the department here. Relevant courses from outside the department may be taken with Director of Graduate Studies consent. Candidates must maintain a B average, with no more than one C allowed. In order to be readmitted for a second year, candidates must have a confirmed thesis adviser and preliminary thesis proposal by the end of the first year. In addition to satisfactory completion of coursework, candidates must prepare and submit an original thesis as well as present a public seminar on the research. The thesis will be reviewed and graded by your adviser plus one additional reader from the Princeton faculty. If the reader is from outside the Computer Science Department, approval by the Director of Graduate Studies is required. The public seminar is an ungraded 20-minute talk, followed by a 10-minute question session, given in the spring of year 2. This will allow your adviser and reader to give preliminary feedback prior to submission of the final thesis. The written thesis should be a research paper of \"scholarly quality\" -- making a novel contribution to scholarship in the field. The thesis should motivate the chosen research problem, evaluate the proposed solution (e.g., via analysis, measurement, simulation, or prototype implementation), and compare the approach to the related work in the field. While there is no specific length requirement, a reasonable target is a typical conference paper (e.g., 10-15 pages in two-column format or 20-40 pages in single-column, double spaced format). Thesis Requirement Candidates choose a subarea of computer science on which to focus by taking appropriate courses, and writing a thesis under the direction of an advisor. In order to be readmitted for a second year, candidates must have a confirmed thesis advisor and preliminary thesis proposal by the end of the first year. Students remaining in the MSE program should identify a thesis advisor and submit a 350-500 word thesis proposal abstract (approved by the thesis advisor) by the re-enrollment deadline. Candidates must prepare and submit an original thesis as well as present a public seminar on the research. The thesis will be reviewed and graded by your adviser plus one additional reader from the Princeton faculty. If the reader is from outside the Computer Science Department, approval by the Director of Graduate Studies is required. The public seminar is an ungraded 20 minute talk, followed by a 10 minute question session, given in the spring of Year 2. This will allow your adviser and reader to give preliminary feedback prior to submission of the final thesis. The written thesis should be a research paper of \"scholarly quality\" -- making a novel contribution to scholarship in the field. The thesis should motivate the chosen research problem, evaluate the proposed solution (e.g., via analysis, measurement, simulation, or prototype implementation), and compare the approach to the related work in the field. While there is no specific length requirement, a reasonable target is a typical conference paper (e.g., 10-15 pages in two-column format or 20-40 pages in single-column, double spaced format). Students may resubmit their thesis with revisions for final archiving by Dean's Date.  After being graded, one bound copy of the final version must be submitted to Mudd Library and a PDF file is due to the Graduate Coordinator.  Click here to review Mudd Library Thesis formatting guidelines . Course Requirements MSE course requirements are fulfilled by completion of six courses: three Core courses and three Elective courses . Candidates must maintain a B average, with no more than one C allowed. All courses must be taken for a letter grade. Core Courses Three COS courses from the following list: COS 475 (ELE 475), 510, 511, 513, 514, 516, 518, 521, 522, 524, 525, 526, 527, 528, 529, 533, 534, 551 (MOL 551), 557 (MOL 557), 561, 563, 583, 584, 597*, 598* *For students who have entered the program prior to Fall 2023 Elective Courses Three courses, each of which must satisfy one of the following criteria: COS 318, 320, 324, 326, 343, 352, 375, 597**, 598** **For students entering the program in Fall 2023 and later Any 400-level COS course An additional course that satisfies the Core Course criteria. A non-COS elective from the list here . Relevant non-COS courses not on this list may be added with the Director of Graduate Studies’ consent. Candidates electing to switch to the M.Eng. degree track are not required to submit a thesis: the following Course Requirements suffice for the degree. Course Requirements MEng course requirements are fulfilled by completion of eight courses over two years: three Core courses and five Elective courses. Candidates must maintain a B average, with no more than one C allowed.  All courses must be taken for a letter grade. Core Courses Three COS courses from the following list: COS 475 (ELE 475), 510, 511, 513, 514, 516, 518, 521, 522, 524, 525, 526, 527, 528, 529, 533, 534, 551 (MOL 551), 557 (MOL 557), 561, 563, 583, 584, 597*, 598* *For students who have entered the program prior to Fall 2023 Elective Courses Five courses, each of which must satisfy one of the following criteria: COS 318, 320, 324, 326, 343, 352, 375, 597**, 598** **For students entering the program in Fall 2023 and later Any 400-level COS course An additional course that satisfies the Core Course criteria. A non-COS elective from the list here . Relevant non-COS courses not on this list may be added with the Director of Graduate Studies’ consent. Acceleration of the M.Eng. (non-thesis track). Students in excellent academic standing who intend to transition to the M.Eng. track may request the department accelerate their two-year program by either one semester or one year, provided all the applicable following conditions are met: 1. Satisfactory performance in all past, current, and future Teaching Assistantship assignments at the University, as evaluated by the Instructor of Record of the course the student is assigned to; 2. The request must be made in writing to the department before the Faculty Deadline for Submission of Graduate Course Grades at the end of the first semester of study; 3. For one-semester acceleration requests : Three courses completed in the first semester, with all A grades (one A- permitted). 4. For one-year acceleration requests: Four courses completed in the first semester, with all A grades (one A- permitted). The department will cancel the request if the student later chooses to remain on the M.S.E. track during their Year 1 reenrollment. Students who accelerate may choose to revert their program of study to its original length by communicating this request in writing to the department. For Princeton undergraduates interested in continuing at Princeton for a Master's Degree : There is now a special policy that allows current Princeton students to count up to two courses taken as an undergraduate towards a Master's degree in Computer Science at Princeton. Those two courses must be upper-level COS courses that fulfill requirements of the Master's degree and have been taken in excess of the COS requirements for the undergraduate degree. For example, if you take ten COS departmentals as an undergraduate at Princeton, and two of them are advanced classes that satisfy requirements of the Master's program, then you can count both towards a Master's degree if you are accepted into the program.  This is a way to reduce your expected time to completion by approximately one semester. Teaching The master’s program is fully funded by teaching assistantships. Master's students are required to hold a full teaching assistantship each semester that they are enrolled. Thesis Candidates for the M.S.E. must prepare and submit an original thesis as well as present a public seminar on the research. The thesis will be reviewed and graded by the student’s adviser plus one additional reader from the Princeton faculty. If the reader is from outside the Department of Computer Science, approval by the director of graduate studies is required. The public seminar is an ungraded 20-minute talk, followed by a 10-minute question session, given in the spring of year 2. This will allow the student’s adviser and reader to give preliminary feedback prior to submission of the final thesis. The written thesis should be a research paper of scholarly quality, making a novel contribution to scholarship in the field. The thesis should motivate the chosen research problem, evaluate the proposed solution (e.g., via analysis, measurement, simulation, or prototype implementation), and compare the approach to the related work in the field. While there is no specific length requirement, a reasonable target is a typical conference paper (e.g., 10-15 pages in two-column format or 20-40 pages in single-column, double-spaced format).  Thesis is due to the adviser, reader, and department prior to Deans Date. Students may resubmit their thesis with revisions for final archiving by Dean's Date.  After being graded, a .pdf file is due to the Graduate Coordinator and should be uploaded to ProQuest.  Click here to review Mudd Library Thesis formatting guidelines . Faculty Chair Szymon M. Rusinkiewicz Associate Chair Ryan P. Adams Wyatt A. Lloyd Director of Graduate Studies Michael J. Freedman (co-director) Elad Hazan (co-director) Director of Undergraduate Studies Andrew W. Appel (co-director) (spring) Brian W. Kernighan (co-director) David P. Walker (co-director) (fall) Kevin Wayne (co-director) Professor Ryan P. Adams Andrew W. Appel Sanjeev Arora David I. August Mark Braverman Bernard Chazelle Zeev Dvir Adam Finkelstein Michael J. Freedman Tom Griffiths Aarti Gupta Elad Hazan Kyle A. Jamieson Brian W. Kernighan Kai Li Margaret R. Martonosi Radhika Nagpal Arvind Narayanan Ben Raphael Ran Raz Szymon M. Rusinkiewicz H. Sebastian Seung Jaswinder P. Singh Mona Singh Robert E. Tarjan Olga G. Troyanskaya David P. Walker Associate Professor Jia Deng Zachary Kincaid Gillat Kol Wyatt A. Lloyd Olga Russakovsky Matt Weinberg Assistant Professor Parastoo Abtahi Danqi Chen Adji Bousso Dieng Benjamin Eysenbach Felix Heide Aleksandra Korolova Amit A. Levy Alex Lombardi Jonathan Mayer Andrés Monroy-Hernández Karthik Narasimhan Ravi A. Netravali Yuri Pritykin Huacheng Yu Ellen Zhong Associated Faculty Amir Ali Ahmadi, Oper Res and Financial Eng Christine Allen-Blanchette, Mechanical & Aerospace Eng Maria Apostolaki, Electrical & Comp Engineering Jianqing Fan, Oper Res and Financial Eng Jaime Fernandez Fisac, Electrical & Comp Engineering Yasaman Ghasempour, Electrical & Comp Engineering Chi Jin, Electrical & Comp Engineering Jason D. Lee, Electrical & Comp Engineering Anirudha Majumdar, Mechanical & Aerospace Eng Prateek Mittal, Electrical & Comp Engineering Paul Seymour, Mathematics John D. Storey, Integrative Genomics Daniel L. Trueman, Music Robert J. Vanderbei, Oper Res and Financial Eng Janet A. Vertesi, Sociology Pramod Viswanath, Electrical & Comp Engineering Mengdi Wang, Electrical & Comp Engineering David Wentzlaff, Electrical & Comp Engineering University Lecturer Kevin Wayne Senior Lecturer Robert M. Dondero Alan Kaplan Xiaoyan Li Christopher M. Moretti Lecturer Sebastian Caldas Marcel Dall'Agnol Robert S. Fish Ruth C. Fong Donna S. Gabai Mihir E. Kshirsagar Dan Leyzberg Pedro Paredes Iasonas Petras Vikram V. Ramaswamy Visiting Associate Professor Rotem Oshman Visiting Lecturer Edo Liberty For a full list of faculty members and fellows please visit the department or program website. Permanent Courses Courses listed below are graduate-level courses that have been approved by the program’s faculty as well as the Curriculum Subcommittee of the Faculty Committee on the Graduate School as permanent course offerings. Permanent courses may be offered by the department or program on an ongoing basis, depending on curricular needs, scheduling requirements, and student interest. Not listed below are undergraduate courses and one-time-only graduate courses, which may be found for a specific term through the Registrar’s website. Also not listed are graduate-level independent reading and research courses, which may be approved by the Graduate School for individual students. COS 510 - Programming Languages Fundamental concepts underlying all programming languages; semantic aspects, including binding times, visibility, retention, storage management, abstraction mechanisms and extensibility; operational and denotational semantic specifications; and design and implementation issues, particularly for very high-level languages, including data representations, control regimes, code representations, and portability. Prerequisites: 226 and 320. COS 511 - Theoretical Machine Learning Course introduces the mathematical foundations of machine learning, including theoretical models of machine learning, and the design and analysis of learning algorithms.  Topics include: bounds on the number of random examples needed to learn; learning from non-random examples in the on-line learning model (i.e., for investment portfolio selection); how to boost the accuracy of a weak learning algorithm; learning with queries; Fourier-based algorithms and support-vector machines. COS 513 - Foundations of Probabilistic Modeling\n                                  (also SML 513) A study of the essential tools for analyzing the vast amount of data that have become available in modern scientific research. Mathematical foundations of the field will be studied, along with the methods underlying the current state of the art.  Probabilisitc graphical models and a unifying formalism for descrtibing and extending previous methods from statistics and engineering will be considered. Prerequisites COS402 or COS424.  Undergraduates by permission only. COS 514 - Fundamentals of Deep Learning This course is a mathematical and conceptual introduction to Deep Learning: basic concepts, model classes, paradigms, and attempts at analysis. It covers some ML theory (learning rate, SGD, generalization, etc.) and some advanced topics: Normalization, Implicit Bias, Generative Models, Recurrent Nets, Contrastive Learning, Self-Supervised Learning, Transformers, Diffusion Models, Private Learning, Interpretability, Fine-tuning of Large Pretrained Models, etc. (Varies year to year.) COS 516 - Automated Reasoning about Software\n                                  (also ECE 516) An introduction to algorithmic techniques for reasoning about software. Basic concepts in logic-based techniques including model checking, invariant generation, symbolic execution, and syntax-guided synthesis; automatic decision procedures in modern solvers for Boolean Satisfiability (SAT) and Satisfiability Modulo Theory (SMT); and their applications in automated verification, analysis, and synthesis of software. Emphasis on algorithms and automatic tools. COS 518 - Advanced Computer Systems Survey of operating systems covering: early systems, virtual memory, protection, synchronization, process management, scheduling, input/output, file systems, virtual machines, performance analysis, software engineering, user interfaces, distributed systems, networks, current operating systems, case studies. Survey of research papers from classic literature through contemporary research. Prerequisite: COS 318 or equivalent. COS 521 - Advanced Algorithm Design Advanced methods of algorithmic design and analysis: data structures, network flows, and linear programming. Solution of linear programs: Karmarkar and Ellipsoid algorithms. Probabilistic techniques. A selection of topics from on-line computation, approximation algorithms for NP-hard problems, number theoretic algorithms, geometric algorithms, and parallel computation. COS 522 - Computational Complexity\n                                  (also MAT 578) Introduction to research in computational complexity theory. Computational models: nondeterministic, alternating, and probabilistic machines. Boolean circuits. Complexity classes associated with these models: NP, Polynomial hierarchy, BPP, P/poly, etc. Complete problems. Interactive proof systems and probabilistically checkable proofs: IP=PSPACE and NP=PCP (log n, 1). Definitions of randomness. Pseudorandomness and derandomizations. Lower bounds for concrete models such as algebraic decision trees, bounded-depth circuits, and monotone circuits. COS 524 - Fundamentals of Machine Learning Computers have made it possible to collect vast amounts of data from a variety of sources. It is not always clear, however, how to use those data, and how to extract useful information from them. This course focuses on some of the most useful approaches to the problem of analyzing large complex data sets, exploring both theoretical foundations and practical applications of machine learning. Course covers classification, regression, clustering, dimension reduction, and time series models. Students gain experience analyzing a variety of data. Prerequisites are introductory linear algebra and statistics. COS 526 - Neural Rendering\n                                  (also ECE 576) Advanced topics in computer graphics, with focus on learning recent methods in rendering, modeling, and animation.  Appropriate for students who have taken COS426 (or equivalent) and who would like further exposure to computer graphics. COS 528 - Data Structures and Graph Algorithms Data structures and algorithms for graph and network problems, including disjoint set union, heaps, search trees, search on graphs, minimum spanning trees, shortest paths, network flows, and matchings. The intent of the course is to examine the most efficient algorithms known for a variety of combinatorial problems and to discover the principles underlying the design and analysis of these algorithms. The emphasis is on asymptotic worst-case and amortized analysis. Prerequisite: 423 or the equivalent. COS 529 - Advanced Computer Vision Advanced topics in computer vision, with a focus ~n recent methods and current research. Topics include 3D vision, recognition, and the intersection of computer vision and other fields. Appropriate for students who have taken COS 429 or equivalent and would like further exposure to computer vision. COS 532 - Computer Graphics:  Modeling Advanced topics in geometric modeling.  Topics to be covered include methods for describing geometric primitives such as implicit surfaces and parametric patches, solid modeling and constructive solid geometry, boundary representations and topological representations, procedural models, and models appropriate for natural and biological shapes.  Prerequisite:  426 or the equivalent. COS 533 - Cryptography This course covers a selection of advanced topics in cryptography, including some or all of the following: fully homomorphic encryption, zero knowledge proofs, traitor tracing, identity-based encryption, private information retrieval, garbled circuits, secret sharing, multiparty computation, lattice-based cryptography, and elliptic curve-based cryptography. COS 534 - Fairness in Machine Learning The course covers: sources of bias in machine learning; methods for detecting, measuring, and mitigating bias; individual fairness, group fairness, and the tension between them; data modeling versus algorithmic modeling;connections between fairness and privacy; bias in algorithmic decision making; bias in unsupervised machine learning; interpretability in ML and its connection to fairness. The syllabus is predominantly technical, supplemented by a few readings from social science, law, and public policy. Students take on hands-on empirical\nprojects of their choosing. COS 551 - Introduction to Genomics and Computational Molecular Biology\n                                  (also MOL 551/QCB 551) Introduction to basic computational and genomic methods for analysis of biological systems.  Topics include: sequence similarity and alignment, phylogenic inference, gene recognition, gene expression analysis, transcriptional networks, structure prediction, functional genomics and proteomics.  This is primarily a graduate-level course; interested undergraduates will require permission from instructors. COS 557 - Artificial Intelligence for Precision Health\n                                  (also QCB 557) Introduces students to the promise and challenges of AI and machine learning methods, including large language models, in precision health. Topics covered will include analysis of genomes, omics, and clinical data, as well as learning from multiple data sources. No prior knowledge of biology or medicine is required; an introduction to these topics and the nature of biological data will be provided. In depth knowledge of AI is not required, but students should have basic familiarity with coding and computer science. COS 561 - Advanced Computer Networks Survey of computer networks covering end-to-end principle, multiplexing, virtualization, packet switching vs. circuit switching, router design, network protocols, congestion control, internet routing architecture, network measurement, network management, and overlay networks.  Survey of research papers from classic literature through contemporary research. COS 563 - Wireless Networks This course is a graduate-level class that explores recent developments in wireless networks and wireless sensing systems. The class aims to develop students' taste in research: what constitutes a good research problem, and what constitutes convincing scientific evidence that a design solves a problem. Students conduct a semester-long project that reproduces research or creates new research, and read/discuss papers in small groups. Topics include abstracting underlying and overlying hardware/layers in the networking stack, integration with overlying applications, and concurrency, performance, and resource allocation in wireless networks. COS 583 - Great Moments in Computing\n                                  (also ECE 583) Course covers pivotal developments in computing, including hardware, software, and theory.  Material will be covered by reading seminal papers, patents, and descriptions of highly-influential architectures.  Course emphasizes a deep understanding of the discoveries and inventions that brought computer systems to where they are today, and class is discussion-oriented.  Final project or paper required.  Graduate  students and advanced undergraduates from ELE, COS, and related fields welcome. COS 584 - Advanced Natural Language Processing Natural Language Processing (NLP) is witnessing exciting developments in core technologies and applications to a wide variety of domains. This graduate-level course focuses on an advanced study of frameworks, algorithms and methods in NLP -- including state-of-the-art techniques for problems such as language modeling, text classification, machine translation, and question answering. The course contains multiple programming assignments, paper readings, a mid-term and a final project. Students are expected to have taken at least one introductory course in machine learning prior to this class, and be comfortable with programming in Python. COS 585 - Information Theory and Applications The notions of entropy and information, originated in statistical physics and electrical engineering, have become central in almost all branches of modern science. The course gives an introduction to information theory and its applications, from the perspective of math, computer science and theoretical computer science.The course is intended for students from all areas of computer science, as well as math, physics, bio-informatics and electrical engineering. A basic knowledge in probability theory and linear algebra is required. COS 589 - Extramural Summer Research Project Summer research project designed in conjunction with the student's advisor and an industrial, NGO, or government sponsor that will provide practical experience relevant to the student's research area.  Start date no earlier than June 1.  A final paper is required. COS 590 - Extramural Research Internship One-term full time research internship at a host institution to perform scholarly research directly relevant to a student's dissertation work.  Research objectives will be determined by the student's advisor in consultation with the outside host.  Monthly progress reports and a final paper are required.  Enrollment is limited to post-generals students.  Students will be permitted to enroll in this one-semester course at most twice. Participation will be considered exceptional. COS 597A - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597B - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597C - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597D - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597E - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597F - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597G - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597I - Advanced Topics in Computer Science An in-depth study of compiler backend techniques for modern computer architectures.   The course includes coverage of the fundamentals and a survey of current research.  Students work together on a research project.  Familiarity with both computer architecture and compilers is recommended. COS 597J - Advanced Topics in Computer Science This seminar prepares computer science graduate students and advanced undergraduate students to effectively engage on matters of public policy and law. The core of the course is a survey of computer science research that has successfully influenced government decision making or commercial practices. Topics include consumer privacy, data security, net neutrality, government surveillance, artificial intelligence fairness, election integrity, and cryptocurrencies. Assignments challenge participants to develop their own research interests into deliverables for public policy and law audiences. COS 597M - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597N - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597O - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 597Q - Advanced Topics in Computer Science What existential and social risks do modern AI systems and methods pose? How can we mitigate these risks and ensure that AI systems are safe and aligned with the intention of their builder? What is currently being done to ensure that AI systems are safe? Are current safeguards sufficient and if not how can we improve upon them? These are the questions we consider in this advanced seminar. Topics include algorithms and optimization-based methods for alignment, reinforcement learning from human feedback, the mind-body problem as applied to AI, accountability and the free choice problem, and more. COS 597R - Advanced Topics in Computer Science Reinforcement learning (RL) is about using machine learning to not just mimic past predictions, but instead to determine which decisions will lead to good, long-term outcomes. While RL is typically viewed and taught from the perspectives of control theory and stochastic optimization, this course will study RL through the lens of probabilistic inference. This perspective will provide new ways of thinking about RL methods and suggest how to build new RL methods using techniques from other areas of machine learning (e.g., self-supervised learning). The course will be split between interactive lectures and discussions of recent papers. COS 597U - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 598 - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 598A - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 598B - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 598C - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 598D - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 598E - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 598F - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 598G - Advanced Topics in Computer Science Topics involving current research in computer science and applications in other fields. COS 598H - Advanced Topics in Computer Science This seminar reviews the latest developments in the theory of natural algorithms with a focus on biology. The course covers a number of topics from theoretical computer science, dynamical systems, statistical mechanics, machine learning, and evolutionary biology. No prerequisites are assumed except for a solid, general mathematical background. COS 598I - Advanced Topics in Computer Science What responsibilities, and for whom? This course addresses the theoretical and sociotechnical foundations of responsible AI. We survey current approaches, as well as the philosophical, ethical, and legal principles shaping AI in societal deployments. Methodological aspects include: data choice, problem formulation, prediction modeling limits, interventions/causal inference, measuring/mitigating algorithmic biases, algorithmic fairness limits, and impact evaluation via experimental design. We emphasize understanding broader impacts, relating to social justice, via case studies from education, healthcare, financial and social services. ECE 532 - Safety-Critical Robotic Systems\n                                  (also COS 572/MAE 572) The course covers the mathematical foundations of dynamical system safety analysis and modern algorithmic approaches for robotic decision making in safety-critical contexts. The focus is on safe robot learning, multiagent systems, and interaction with humans, paying special attention to uncertainty and the reality gap between mathematical models and the physical world. ECE 539 - Special Topics in Data and Information Science\n                                  (also COS 512) Advanced studies in selected areas in signal processing, communication and information theory, decision and control, and system theory. Emphasis on recent developments and current literature. Content varies from year to year according to the instructor's and students' interests. ECE 539B - Special Topics in Information Sciences and Systems\n                                  (also COS 597P) Advanced studies in selected areas in signal processing, communication and information theory, decision and control, and system theory. Emphasis on recent developments and current literature. Content varies from year to year according to the instructor's and students' interests. SOC 555 - Limits to Prediction\n                                  (also COS 598J) Is everything predictable given enough data and powerful algorithms? This seminar explores that question through social science and computer science research in many domains including life trajectories of individuals, geopolitical events, weather, disease outbreaks, social media and, somewhat speculatively, artificial general intelligence. We aim to identify fundamental limits, learn about common pitfalls, and explore policy implications. Coursework is a mix of reading and empirical work tailored to students' backgrounds. The course is designed to facilitate publishable student research in both social science and computer science. SPI 586F - Topics in STEP\n                                  (also COS 586) Currently unavailable Back to Top Footer Princeton University Graduate School Clio Hall, Princeton, NJ, 08544 Contact: [email protected] Twitter Instagram Facebook Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:20:23.719044",
    "url": "https://gradschool.princeton.edu/admission-onboarding/prepare/required-tests",
    "university_name": "Princeton University",
    "title": "Graduate School",
    "content": "Graduate School Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Admission & Onboarding Submenu Admission & Onboarding Explore Prepare Submenu Deadlines and Fees Statement of Academic Purpose Resume / Curriculum Vitae Letters of Recommendation Transcripts Personal Essay Fall Semester Grades Required Tests Writing Sample Statement of Financial Resources Apply Review Admission Decision Onboard & Arrive Submenu Final Transcripts Immunizations & University Health Services Forms I-9: Employment Eligibility Verification Nondegree Programs Submenu Research Collaborators Submenu Visiting Student Research Collaborators (VSRC) Ecole Normale Superieure Paris (ENS) Exchange Freie Universität Berlin Trailing Nondegree Students Exchange Students Submenu BGSAS Berlin DAAD-German Sciences Po HUJI Jerusalem Princeton-Humboldt SNS Pisa U. Tokyo Visiting Students Submenu Daniel M. Sachs Scholarship Procter Visiting Fellowships Fleet Fellowship Graduate Visiting Student Qualifying Nondegree Students Review Admission Decision & Onboard Academics Submenu Academics Degrees & Requirements Submenu Fields of Study Submenu Program Offerings Standard Requirements Advising Requirements General Exam Submenu Incidental Master’s Degree Dissertation & FPO Advanced Degree Application Process Submenu Degree Deadlines Final Master's Degree Requirements Enrollment, Status & Progress Submenu Semester Sign-In Enrollment Statuses Submenu Degree-Seeking Statuses Former Degree-Seeking Statuses Status Changes and End of Student Benefits Reenrollment Courses, Research & Teaching Submenu Course Information Submenu Curriculum Management Teaching Submenu Collaborative Teaching Initiative in the Humanities and Social Sciences Academic & Research Integrity Opportunities, Resources & Support Submenu Partnerships, Exchanges & Cross-Registration Submenu IUDC Princeton-Rutgers IvyPlus Exchange ENS Paris Freie Univ. Berlin BGSAS Berlin DAAD Sciences Po HUJI Jerusalem Humboldt Exchange SNS Pisa U. Tokyo External Opportunities Learning, Teaching & Research Support Submenu Learning Support Teaching Support Research Support Time Off Advising & Mentoring Submenu Resources for Students Resources for Faculty Graduate Student Mentoring Report Academic Grievance Process Financial Support Submenu Financial Support Financial Support Model Submenu Funding Calendar, University Rates & Costs Ph.D. Funding: Humanities & Social Sciences Ph.D. Funding: Natural Sciences & Engineering Dissertation Completion Funding Submenu Dean's Completion Fellowship / PGRA Master’s Degree Funding Nondegree Students Fellowships Submenu Princeton Fellowships External Fellowships Fellowship Coordination NSF Fellowships Assistantships Graduate Student Employment Submenu Policies & Guidelines Additional Funding & Support Submenu Student Activity Funding Loans & Work-Study Submenu Federal Student Loans Federal Work Study Private Student Loans Code of Conduct Assistance Programs Military-Connected Students Submenu Financial Shopping Sheet AmeriCorps Understand Your Finances Submenu My Financials Student Taxes Financial Literacy Financial Wellness Fellows Program Tiger Cents Chronicles Professional Development Submenu Professional Development About GradFUTURES Submenu Meet the Team Professional Competencies For Current Students Submenu Sharpen Skills Forge Connections Gain Experience Explore Pathways Partner with Us Professional Development Events GradFUTURES Forum GradFUTURES Podcast Diversity Student Experience Submenu Student Experience Residential Life Submenu The Graduate College Submenu Facilities Porter's Lodge Lawrence Apartments Lakeside Apartments Dining Student Life Submenu Orientation Hooding and Recognition Ceremony Submenu Faculty Info Regalia Frequently Asked Questions Special Events High Tables Get Involved Submenu Student Organizations Plan an Event Student Govt & Advocacy Affinity Groups Other Ways to Engage Meet the Team Support & Resources Submenu Family-Focused Submenu Childbirth & Adoption Child Assistance Program Health/Wellness Submenu Graduate Advance Medical Expense Assistance Safety Resources Crisis Support Transportation/Travel Books/Technology Conduct & Standards Alumni About SubMenu Dean's Welcome Our Mission Program Metrics SubMenu Admission Statistics Enrollment Statistics Degree Counts and Time to Degree Analysis Ph.D. Completion and Cohort Analysis Ph.D. Long-term Career Outcomes Governance SubMenu Faculty Roles & Graduate Committee Requirements Our History SubMenu Architectural Tour Carillon Honorific Recipients Teaching Awards Information about Graduate Student Unionization SubMenu Communications from the Graduate School Student Support and Benefit Highlights Peer Institution Collective Bargaining Agreements FAQs about Graduate Student Unionization News Events Policies Admin Portal Apply Log in Search Search Home Admission and Onboarding Prepare Your Application Section Menu Explore Prepare Submenu Prepare Deadlines and Fees Statement of Academic Purpose Resume / Curriculum Vitae Letters of Recommendation Transcripts Personal Essay Fall Semester Grades Required Tests Writing Sample Statement of Financial Resources Apply Review Admission Decision Onboard & Arrive Nondegree Programs Required Tests Degree programs may require Graduate School applicants, including master’s students and those not applying directly out of college, to submit valid test scores to be considered for admission. If your native language is not English, you must meet English language proficiency requirements and may be required to submit TOEFL, IELTS, or DET test scores. The Graduate School does not have a minimum score requirement; each department or program may set its own. The Graduate School does not have average GRE scores, however, departments or programs may. Send test scores no later than three weeks before the degree program application deadline to ensure receipt of the official score report. Test scores received after the deadline will still be matched to your application; however, faculty may have already begun their review of your application without your test scores. No offers of admission will be made if required scores are not in the application. You do not need to wait on test scores to submit your application. If your application is on file when scores are received, we will match them to your application within seven business days. GRE Applicants may be required to submit valid General Test scores from Educational Testing Service (ETS). Other than the GMAT exception noted below, no other test scores (including the LSAT) may be submitted in their place. For more information about the GRE , contact ETS . GRE Requirements: General & Subject Tests Refer to the GRE table to determine if the GRE General Test is required. If the department or program to which you wish to apply requires GRE scores, they may not be waived. Required : Applicants need to submit GRE scores as part of the application requirements for the department or program to which they are applying.  Scores will be reviewed as part of the admission review process. Required GRE scores cannot be waived. Optional/Not Required : Applicants are not required to submit GRE scores as part of the application requirements for the department or program to which they are applying.  If scores are submitted by an applicant, they may be reviewed as part of the admission review process.  Applicants who do not submit scores will not be put at a disadvantage. Not Accepted : Applicants do not need to submit GRE scores as part of the application requirements for the department or program to which they are applying.  If scores are submitted by an applicant, they will not be reviewed as part of the admission review process. GRE Table: Requirements for Fall 2024 Admission Graduate School Department GRE General Test Required? Subject Test Required? Anthropology Not Accepted for fall 2024 admission Atmospheric and Oceanic Sciences Optional/Not required for fall 2024 admission Applied and Computational Math Optional/Not required for fall 2024 Subject test in Mathematics, Physics, or related field - Optional/Not required for fall 2024 admission School of Architecture - Ph.D. Optional/Not required for fall 2024 admission School of Architecture - Master's Optional/Not required for fall 2024 admission Art and Archaeology Optional/Not required for fall 2024 admission Astrophysical Sciences Optional/Not required for fall 2024 admission Subject test in Physics - Optional/Not required for fall 2024 admission Bioengineering Optional/Not required for fall 2024 admission Biophysics Optional/Not required for fall 2024 admission Subject test in Physics or Biology - Optional/Not required for fall 2024 admission Chemical & Biological Engineering Not Accepted for fall 2024 admission Civil and Environmental Engineering Optional/Not required for fall 2024 admission Chemistry Optional/Not required for fall 2024 admission Subject test in Chemistry or Physics - Optional/Not required for fall 2024 Classics Optional/Not required for fall 2024 admission Comparative Literature Optional/Not required for fall 2024 admission Computer Science Not Accepted for fall 2024 admission East Asian Studies Optional/Not required for fall 2024 admission Economics Required for fall 2024 admission Ecology and Evolutionary Biology Optional/Not required for fall 2024 admission Subject test in Biology - Optional/Not required for fall 2024 admission Electrical and Computer Engineering Optional/Not required for fall 2024 admission English Optional/Not required for fall 2024 admission Finance Optional/Not required for fall 2024 admission - (will also accept GMAT) French and Italian Not Accepted for fall 2024 admission Geosciences Not Accepted for fall 2024 admission German Optional/Not required for fall 2024 admission History Optional/Not required for fall 2024 admission History of Science Optional/Not required for fall 2024 admission Mechanical and Aerospace Engineering Not Accepted for fall 2024 admission Mathematics Not Accepted for fall 2024 admission Subject test in Mathematics - Not accepted for fall 2024 admission Molecular Biology Optional/Not required for fall 2024 admission Music Composition Not accepted for fall 2024 admission Musicology Not accepted for fall 2024 admission Near Eastern Studies Optional/not required for fall 2024 admission Neuroscience Optional/not required for fall 2024 admission Operations Research and Financial Engineering Optional/Not required for fall 2024 admission Subject test in Mathematics - Optional/Not required for fall 2024 admission Philosophy Optional/Not required for fall 2024 admission Physics Optional/Not required for fall 2024 admission Subject test in Physics - Optional/Not required for fall 2024 admission Politics Required for fall 2024 admission Population Studies Required for fall 2024 admission Princeton Plasma Physics Optional/Not required for fall 2024 admission Subject test in Physics - Optional/Not required for fall 2024 Princeton School of Public and International Affairs - Ph.D. Optional/Not required for fall 2024 admission Princeton School of Public and International Affairs -  MPP Not accepted for fall 2024 admission Princeton School of Public and International Affairs - MPA and MPA/JD Required for fall 2024 admission Psychology Optional/Not required for fall 2024 admission Quantitative & Computational Biology Not Accepted for fall 2024 admission Quantum Science and Engineering Optional/Not required for fall 2024 admission Subject test in Physics, Chemistry,  or Math - Optional/Not required for fall 2024 Religion Not Accepted for fall 2024 admission Slavic Languages and Literatures Optional/Not required for fall 2024 admission Sociology Optional/Not required for fall 2024 admission Spanish and Portuguese Optional/Not required for fall 2024 admission GRE Planning and Deadlines Visit the ETS website for upcoming test dates. Please have all scores sent by the deadline for fullest consideration. GRE Home Testing The Graduate School will accept the GRE General Test at Home version. Currently, ETS has no plans to change the GRE Subject tests, which are only offered in September, October, and April. Valid GRE Scores & Reporting We consider the highest score from each section, but the department or program has the ability to see all scores and components. GRE scores are valid for five years from the test date. For questions about the validity of GRE scores, please contact ETS. If ETS is able to send valid scores, we will accept them. Partial test scores are not accepted as a student who chooses to respond to only one section of the test per sitting is testing under different circumstances than those who took all three sections of the test on one test date. GMAT Applicants applying to the Department of Finance may submit valid GMAT scores in place of GRE scores. No other department or program accepts GMAT. GMAT is offered on a monthly basis. For more information, visit GMAT . GMAT Online The GMAT™ Online exam is an online remote proctored solution developed to support candidates during the disruption to test center-based delivery during the COVID-19 pandemic. Learn more . Valid GMAT Scores & Reporting GMAT scores are valid for five years. For questions about the validity of GMAT scores, please contact GMAT. If GMAT is able to send valid scores, we will accept them. When registering to take the GMAT, please request that scores are sent to Princeton University. Graduate Admission will update the submitted application checklist when the scores are received. It can take up to two weeks for us to receive the official score report from the administrator plus an additional seven days for scores to match them  to the submitted application. Please monitor the submitted application checklist to confirm scores have been received. English Language Tests Graduate students must demonstrate a level of oral proficiency in the English language sufficient to participate successfully in the various activities that comprise a graduate education, including classwork, research, research presentations, group meetings, project teamwork, and teaching undergraduates. Please view our English Language Proficiency Policy for more information. The three internationally recognized tests of English language proficiency which we accept are the Test of English as a Foreign Language (TOEFL), the International English Language Testing System (IELTS), and Duolingo English Test (DET). The following applicants are not required to submit English language test scores: Applicants whose primary language is English. Primary language is defined as the language that someone communicates in most frequently and in most situations when speaking, reading, and writing. Applicants whose undergraduate instruction is entirely in English as certified by the institution and for whom the degree will be awarded prior to anticipated enrollment at Princeton. Applicants whose graduate study was on a full-time basis for at least one year where instruction is entirely in English as certified by the institution. All other applicants must submit valid TOEFL, IELTS or DET scores. TOEFL Educational Testing Service administers the internet-based TOEFL. The Graduate School prefers scores from the iBT TOEFL. Applicants who take the test in a country which does not offer the iBT TOEFL should take the TOEFL Paper-delivered Test. For more information contact contact ETS . TOEFL iBT Home Edition We will accept the TOEFL iBT Home Edition. For more information, please visit the ETS website . TOEFL Scores & Reporting English language proficiency tests are a Graduate School requirement and although the Graduate School does not have a minimum score requirement to submit an application, please check with the department to which you wish to apply to see if they do. We are currently not accepting MyBest scores. If multiple score reports are sent to us, we consider the highest score from each section of score reports which we have received. TOEFL scores expire after two years from the original test date and will not be available from ETS. Please contact ETS if there are questions about the validity of the TOEFL scores. If ETS is able to send valid scores, we will accept them. TOEFL Scores and Princeton’s English Placement Test Admitted students may be assigned the English Language Program (ELP) code based on their TOEFL score, meaning they will be required to be tested here and may have to take courses with the ELP depending on how they do with that testing. IELTS IELTS Academic is administered jointly by the British Council, IDP Education Australia, and the University of Cambridge ESOL Examinations (Cambridge ESOL) . IELTS Online We will accept IELTS Online . IELTS Indicator is not accepted. IELTS Scores & Reporting English language proficiency tests are a Graduate School requirement and although the Graduate School does not have a minimum score requirement to submit an application, please check with the department to which you wish to apply to see if they do. We consider the highest score from each section, but the department or program has the ability to see all scores and components. IELTS scores expire two years after the original test date. For questions about the validity of the IELTS scores, please contact the test administrator. Please do not have tests mailed to us. Have IELTS Academic scores sent electronically through e-delivery. No institution code is required. The address, for identification purposes only, is: Princeton University, Graduate Admission, One Clio Hall, Princeton, NJ 08544. We do NOT verify Test Report Forms (TRF’s). IELTS Scores and Princeton’s English Placement Test Admitted students may be assigned the English Language Program (ELP) code based on their IELTS score, meaning they will be required to be tested here and may have to take courses with the ELP depending on how they do with that testing. DET Duolingo administers DET which is entirely computer-based and can be taken from any location with an internet connection. DET Scores & Reporting English language proficiency tests are a Graduate School requirement and although the Graduate School does not have a minimum score requirement to submit an application, please check with the department to which you wish to apply to see if they do. If multiple score reports are sent to us, we consider the highest score from each section of score reports which we have received. DET scores expire after two years from the original test date. Please contact Duolingo if there are questions about the validity of the DET scores. DET Scores and Princeton’s English Placement Test Admitted students may be assigned the English Language Program (ELP) code based on their DET score, meaning they will be required to be tested here and may have to take courses with the ELP depending on how they do with that testing. Tracking Your Scores What are Princeton’s institution and department codes? For GRE or TOEFL, the institution code for Princeton is 2672 and no department code is required. Graduate Admission will receive all score reports with this code regardless of whether a department code is selected or not. It can take up to two weeks for us to receive official score reports plus an additional seven days for scores to match to the submitted application. Please monitor your submitted application checklist to confirm scores have been received. Can I submit expired, partial, or self-reported scores? The University will not accept expired, self-reported, copies of, or partial test scores. There is no place in the application to self-report scores. We only accept the official score reports sent to us from the test administrator. Do I need to resubmit scores sent previously? If your test scores have not expired, you do not need to send them again. You will see the test dates on your submitted application checklist within seven business days. If you do not, please email [email protected] . How do I know if you received my test scores? If you have submitted your application, you will see the test dates on the submitted application checklist if the scores have matched. You will not see the test scores. If you see a date, it means the scores have been received. I see a test date on my checklist, but it is not the date I took the test. What should I do? Send an email to [email protected] . Include your name as it appears on your application, name as it appears on the test report if different, the test date, your date of birth, and the email you used for the exam. What do I do if there is a discrepancy in my name between my test and application? If the name entered on the test report is different than the name on the application, the test scores may not match. If the applicant has only one name, please enter it in the last name field and a period (.) in the first name field. If there is a name discrepancy, please email [email protected] . I had my scores sent and submitted my application but still do not see the test dates on my application checklist. What should I do? If it has been more than three weeks since you took your test or had your scores sent AND more than seven business days since you submitted your application, you can email [email protected] . Include your name as it appears on your application, name as it appears on the test report if different, the test date, your date of birth, and the email address you used for the exam. Back to Top Footer Princeton University Graduate School Clio Hall, Princeton, NJ, 08544 Contact: [email protected] Twitter Instagram Facebook Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:20:29.105974",
    "url": "https://accessibility.princeton.edu/help",
    "university_name": "Princeton University",
    "title": "Accessibility at Princeton",
    "content": "Accessibility at Princeton Off screen link: Skip to content Off screen link: Skip to search Accessibility at Princeton Main Menu Menu Campus Access Accommodations Instruction Digital Accessibility Affinity Groups Get help Search Search Accessibility Help Help with disability-related IT issues Report an IT barrier Help with logins and passwords Call 609-258-4357 Contact the Service Desk Questions about admission & financial aid Undergraduate admission Graduate admission Questions about parking, routes & transit Campus access Footer Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:20:32.470780",
    "url": "https://www.cs.princeton.edu",
    "university_name": "Princeton University",
    "title": "Home",
    "content": "Skip to main content Quick links CS Guide Directory Contact Department of Computer Science Menu Search Undergraduate Program Advisers & Contacts Becoming a CS Major Bachelor of Arts & Bachelor of Science in Engineering Prerequisites Declaring Computer Science for AB Students Declaring Computer Science for BSE Students Class of '25, '26 & '27 - Departmental Requirements Class of 2024 - Departmental Requirements COS126 Information Independent Work & Theses Important Steps and Deadlines Independent Work Seminars Guidelines and Useful Information Undergraduate Research Topics AB Junior Research Workshops Undergraduate Program FAQ Certificate Program Overview How to Enroll Requirements Policies Certificate Program FAQ Interdepartmental Committee Minor Program Funding for Student Group Activities Student Life Mailing Lists and Policies Study Abroad Jobs & Careers Graduate Program Admissions Requirements Doctoral Degree Breadth Requirements Pre-FPO Checklist FPO Checklist Master’s Degree M.S.E. Track M.Eng. Track Departmental Internship Policy (for Master's students) FAQ Funding General Examination Fellowship Opportunities Travel Reimbursement Policy Communication Skills Courses Course Schedule Course Catalog Research Research Areas Interdisciplinary Programs Technical Reports Computing Facilities People Faculty Researchers Technical Staff Administrative Staff Graduate Students Undergraduate Students Graduate Alumni Diversity & Outreach Climate and Inclusion Committee Resources for Undergraduate & Graduate Students Outreach Initiatives Resources for Faculty & Staff About Contact Us Visit Us News and Events News Events Spotlight Stories Directory Job Openings Home Spotlight Brian Kernighan recognized by Princeton Engineering for outstanding service Read More Huacheng Yu wins NSF CAREER award Read More Science has an AI problem. This group says they can fix it. Read More Parastoo Abtahi, expert in human-computer interaction, joins the faculty Read More Holographic displays offer a glimpse into an immersive future Read More Marcel Dall’Agnol joins the department as teaching faculty Read More Grad alum Avi Wigderson wins Turing Award for groundbreaking insights in computer science Read More Welcome Welcome to the Department of Computer Science at Princeton University. Princeton has been at the forefront of computing since Alan Turing, Alonzo Church and John von Neumann were among its residents. Our department is home to about 60 faculty members, with strong groups in theory, networks/systems, vision/graphics, architecture/compilers, programming languages, security/policy, machine learning, natural language processing, human-computer interaction, robotics, and computational biology. Research Computational Biology Computer Architecture Economics & Computation Human-Computer Interaction Machine Learning Natural Language Processing Programming Languages & Compilers Public Law & Policy Robotics Security & Privacy Systems & Networking Theory Vision & Graphics News May 16th, 2024 Brian Kernighan recognized by Princeton Engineering for outstanding service May 9th, 2024 Huacheng Yu wins CAREER award, supporting research on data structures and streaming algorithms May 1st, 2024 Science has an AI problem. This group says they can fix it. News archive Events 7 Aug Srikar Kasi FPO (CS 301 & Zoom) Full calendar and archive Follow us: Undergraduate Program Advisers & Contacts Becoming a CS Major Independent Work & Theses Undergraduate Program FAQ Certificate Program Minor Program Funding for Student Group Activities Student Life Jobs & Careers Graduate Program Admissions Requirements Doctoral Degree Master’s Degree FAQ Funding General Examination Fellowship Opportunities Travel Reimbursement Policy Communication Skills Courses Course Schedule Course Catalog Research Research Areas Interdisciplinary Programs Technical Reports Computing Facilities People Faculty Researchers Technical Staff Administrative Staff Graduate Students Undergraduate Students Graduate Alumni Diversity & Outreach Climate and Inclusion Committee Resources for Undergraduate & Graduate Students Outreach Initiatives Resources for Faculty & Staff About Contact Us Visit Us News and Events Directory Job Openings © 2024 The Trustees of Princeton University. Terms of Use | Privacy Policy | Site Map"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:20:32.758121",
    "url": "https://www.princeton.edu/",
    "university_name": "Princeton University",
    "title": "",
    "content": "Skip to main content Princeton University Menu Search Search Sites & People × Living Our Ethos of Service Matthew Desmond's 'Poverty, by America' ProCES course field-tests promising solutions, in collaboration with community partners. History and Sense of Place A new portrait of the pathbreaking actor and director José Ferrer '33 joins a series illuminating the University's broad diversity. Pursuing Excellence Genrietta Churbanova has been selected as Princeton Class of 2024 valedictorian. John Freeman is salutatorian. University News View All News Princeton graduate students honored for excellence in teaching Jamie Chiu, Katherine Sniezek, Laura Nelson, Ravin Raj, Casey Lewry, Pasquale Toscano, Jasante’ Howard, Filippo Palomba, Marie-Louise James, and Katie VanderKam have been recognized for their outstanding abilities as instructors. Four outstanding N.J. secondary school teachers to be honored at Princeton Commencement This year’s recipients of the Princeton Prize for Distinguished Secondary School Teaching are Ahmed Hassanein of Joseph H. Brensinger Elementary School, P.S. #17, in Jersey City, Sandra Keel-Huff of Orange High School, Bess Spero Li of Crossroads South Middle School in South Brunswick, and Theresa Riccardi of High Point Regional High School in Sussex. Eight seniors win 2024 Spirit of Princeton Award for service, contributions to campus life The award recognizes students who have demonstrated a strong commitment to the undergraduate experience through efforts in student organizations, athletics, community service, religious life, residential life and the arts. View All News The Quantum Future: Meeting the Moment Princeton’s quantum scientists and engineers are working to manipulate the strange behaviors of particles — mindbending realities like quantum entanglement and superposition — to advance knowledge and produce technologies in fields as far-ranging as computing, communications, medicine, energy, finance and cryptography. Our expanded Quantum Initiative and new Ph.D. program carry forward a spirit of discovery on our campus that reaches back to Einstein. Follow our latest breakthroughs and meet our Forward Thinkers Exceptional Faculty Princeton faculty members are all exceptional scholars in their disciplines who are expected to teach as well as engage in research. Faculty work closely with undergraduates in the supervision of junior year independent work and senior theses. Arvind Narayanan Computer Science and the Center for Information Technology Policy Narayanan studies the societal impact of artificial intelligence and machine learning. Sigrid Adriaenssens Civil and Environmental Engineering Adriaenssens is an engineering innovator, designing lightweight, elegant and resilient structures for sustainable buildings, bridges and other infrastructure. Leonard Wantchekon Politics 2023 Global Economy Prize winner Wantchekon came of age as a pro-democracy student activist in Benin. Marina Rustow Near Eastern Studies and History Rustow uses machine learning to decipher thousands of Arabic and Hebrew fragments preserved in a medieval Cairo synagogue that open a new window onto premodern history. Ruha Benjamin African American Studies Benjamin’s scholarship explores the relationship between technological innovation and social equity. She is the author of 2022’s “Viral Justice” and the new “Imagination: A Manifesto.” Janet Currie Princeton School of Public and International Affairs Currie applies economics expertise to children’s health, development and well-being. Princeton In the News PPPL breaks ground on $100M innovative fusion research hub (link is external) Featured: Steve Cowley NJ Biz May. 10, 2024 Scientists Reveal Cancer's Atomic Secrets—'Whole New Layer to Medicine' (link is external) Featured: Ashley Maloney Newsweek May. 07, 2024 Let’s All Take a Deep Breath About China (link is external) By Rory Truex The New York Times May. 06, 2024 #VentureForward Through the Venture Forward campaign, Princeton is making audacious bets on talent and potential that will have a transformative impact on the future of humanity. Dare to Venture Student Life at Princeton Princeton brings together undergraduate and graduate students from all backgrounds, and every corner of the earth, to share their experiences and perspectives with one another. Make your mark as part of our vibrant community. LEARN MORE Upcoming Events View All Flight/Air/Fire: An Installation of Paper Pulp Banners by Daniel Heyman May 18 CoLab, Lewis Arts complex, 122 Alexander Street 10:00 a.m. Chapel Worship Service by ORL May 19 Chapel 11:00 a.m. Flight/Air/Fire: An Installation of Paper Pulp Banners by Daniel Heyman May 20 CoLab, Lewis Arts complex, 122 Alexander Street 10:00 a.m. View all Events Study at Princeton Our approach to learning combines the best aspects of a great research university and an outstanding liberal arts college. Areas of Study Learning Abroad Undergraduate Admission Graduate Admission Work at Princeton Every employee has the opportunity to make an impact supporting our mission of teaching and research. Faculty and Academic Positions Staff Positions Princeton University Main navigation Meet Princeton Submenu for Meet Princeton In Service of Humanity Facts & Figures History Honors & Awards Contact Us Visit Us Our Faculty Our Students Our Alumni Our Staff Our Leadership Academic Freedom and Free Expression Strategic Planning Framework Academics Submenu for Academics Studying at Princeton Library Areas of Study Humanities Social Sciences Engineering Natural Sciences Advising Academic Calendar Course Tools Learning Abroad Career Development Continuing Education Innovative Learning Research Submenu for Research Engineering & Applied Science Humanities Natural Sciences Social Sciences Dean for Research Office Interdisciplinary Approach External Partnerships Facilities & Labs One Community Submenu for One Community Lifelong Connections Student Life Arts & Culture Athletics Living in Princeton, N.J. Housing & Dining Activities & Organizations Cultural & Affinity Groups Health & Wellness Religious Life Serving the Public Good Families Admission & Aid Submenu for Admission & Aid Affordable for All About Financial Aid Current Undergraduate Financial Aid Undergraduate Admission Graduate Admission For International Students Dare to Venture . From the Present to the Possible Athletics . Go Princeton Tigers Utility menu News Events Work at Princeton Student Links Alumni Giving Inside Princeton Contact links Contact Us Accessibility Help Directory Visiting links Plan a Visit Maps & Shuttles Varsity Athletics Giving to Princeton Academic links Library Academic Calendar Student Links Faculty & Staff Links Footer social media Facebook Twitter Instagram Snapchat LinkedIn YouTube Social Media Directory Equal Opportunity and Nondiscrimination at Princeton University: Princeton University believes that commitment to principles of fairness and respect for all is favorable to the free and open exchange of ideas, and the University seeks to reach out as widely as possible in order to attract the ablest individuals as students, faculty, and staff. In applying this policy, the University is committed to nondiscrimination on the basis of personal beliefs or characteristics such as political views, religion, national origin, ancestry, race, color, sex, sexual orientation, gender identity or expression, pregnancy/childbirth, age, marital or domestic partnership status, veteran status, disability, genetic information and/or other characteristics protected by applicable law in any phase of its education or employment programs or activities. In addition, pursuant to Title IX of the Education Amendments of 1972 and supporting regulations, Princeton does not discriminate on the basis of sex in the education programs or activities that it operates; this extends to admission and employment. Inquiries about the application of Title IX and its supporting regulations may be directed to the Assistant Secretary for Civil Rights, Office for Civil Rights, U.S. Department of Education or to the University’s Sexual Misconduct/Title IX Coordinator. See Princeton’s full Equal Opportunity Policy and Nondiscrimination Statement . Princeton University Princeton, NJ 08544 Operator: (609) 258-3000 © 2024 The Trustees of Princeton University Subfooter links Copyright Infringement Privacy Notice"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:20:37.260084",
    "url": "https://library.princeton.edu/special-collections/policies/masters-theses-and-phd-dissertations-submission-guidelines",
    "university_name": "Princeton University",
    "title": "Master's Theses and Ph.D. Dissertations: Submission Guidelines",
    "content": "Skip to main content Princeton University Library SPECIAL COLLECTIONS All Search Box * Search MENU Explore Exhibitions Digital Highlights New & Notable For Children Publications Digital Humanities Guide to Topics Collections Cotsen Children's Library Graphic Arts Collection Historic Maps Collection Manuscripts Division Numismatic Collection Public Policy Papers Rare Book Division Scheide Library University Archives Western Americana Collection Conducting Research Catalogs & Databases Library Services Ask Us! Research Account Access Visit Us Instruction Harvey S. Firestone Library Seeley G. Mudd Manuscript Library Ask Us! Special Collections Schedule - Summer 2024 The Special Collections reading rooms in Firestone and Mudd Libraries will be closed on the following upcoming holidays: Monday, May 27 (Memorial Day), Wednesday, June 19 (Juneteenth), Thursday, July 4 (Independence Day), and Monday, September 2 (Labor Day). We will be closing at 12:00pm on Friday, June 14. We will also begin our Summer Hours, 9am-4:15pm, on Monday, June 3. During this time we stop paging at 3:45pm. You are here Home Conducting Research Services & Policies Theses & Dissertations Master's Theses and Ph.D. Dissertations: Submission Guidelines Master's Theses and Ph.D. Dissertations: Submission Guidelines Master's Theses and Ph.D. Dissertations: Submission Guidelines Senior Thesis Submission Information for Students Senior Thesis Submission Information for Academic Departments The Princeton University Archives at the Mudd Manuscript Library is the repository for Ph.D. dissertations and Master’s theses. The Princeton University Archives partners with ProQuest to publish and distribute Princeton University dissertations beyond the campus community. Below you will find instructions on the submission process and the formatting requirements for your Ph.D. dissertation or Master's thesis. If you have questions about this process, please use our Ask Us form or visit the Mudd Manuscript Library during our open hours. Ph.D Dissertation Process Overview of the Ph.D. Dissertation Submission Process Publishing Options Embargoes Embargo Renewals Formatting your Dissertation Fees Deadlines A ccess to Dissertations and Theses The Master’s Thesis Submission Process Ph.D Dissertation Submission Process Overview of the Ph.D. Dissertation Submission Process Step 1) Near the time of the final public oral examination (FPO) (shortly before or immediately after) the student must complete the online submission of their dissertation via the ProQuest UMI ETD Administrator website ( www.etdadmin.com/princeton ). Students are required to upload a PDF of their dissertation, choose publishing options, enter subject categories and keywords, and make payment to ProQuest (if fees apply). This step will take roughly 20-25 minutes. Step 2) After the FPO the student should log on to TigerHub and complete the checkout process. When this step is complete, Mudd Library will be notified for processing. This step will occur M-F during business hours. The Mudd Library staff member will review, apply the embargo (when applicable), and approve the dissertation submission in ProQuest. You will receive an email notification of the approval from ProQuest when it has been approved or needs revisions. Step 3) The vast majority of students will not be required to submit a bound copy of their dissertation to the library. Only students who have removed content from the PDF to avoid copyright infringement are required to submit a bound copy to the library. This unredacted, bound version of the dissertation must be formatted according to the Dissertation Formatting Guidelines , and delivered by hand, mail, or delivery service to the Mudd Manuscript Library by the degree date deadline in order to be placed on the degree list. Address the bound copy to: Attn: Dissertations, Mudd Manuscript Library, 65 Olden Street, Princeton, NJ 08540. Publishing Options ProQuest Publishing Options When you submit your dissertation to the ProQuest ETD Administrator site, you will be given two options: Traditional Publishing or Open Access Publishing Plus. ProQuest compares the two options in their Open Access Overview document . Full details will be presented in the ProQuest ETD Administrator site. Traditional Publishing No fee is paid to ProQuest; your dissertation will be available in full text to subscribing institutions only through the ProQuest Dissertations & Theses: Full Text database ; If you have an embargo, your dissertation will be unavailable for viewing or purchase through the subscription database during the embargo period. Open Access Publishing Plus $95 fee to ProQuest; your dissertation will be available in full text through the Internet to anyone via the ProQuest Database ; if you have an embargo, your dissertation will be unavailable for viewing through the open access database during the embargo period. Optional Service: Copyright Registration $75 fee to ProQuest; ProQuest offers the optional service of registering your copyright on your behalf. The dissertation author owns the copyright to their dissertation regardless of copyright registration. Registering your copyright makes a public record of your copyright claim and may entitle you to additional compensation should your copyright be infringed upon. For a full discussion of your dissertation and copyright, see ProQuest’s Copyright and Your Dissertation . If you have questions regarding the ProQuest publishing options, contact their Author and School Relations team at 1-800-521-0600 ext. 77020 or via email at disspub@proquest.com . Princeton’s Institutional Repository, DataSpace Each Princeton University dissertation is deposited in Princeton’s Institutional Repository, DataSpace . Dissertations will be freely available on the Internet except during an embargo period. If your dissertation is embargoed, the PDF will be completely restricted during the embargo period. The bound copy, however, will be available for viewing in the Mudd Manuscript Library reading room during the embargo. Embargoes According to the Graduate School’s embargo policy , students can request up to a two-year embargo on their dissertation, with the potential for renewal by petition. If approved, the embargo would apply to the dissertation in ProQuest, as well as in Princeton’s digital repository, DataSpace . Students in the sciences and engineering seeking patents or pursuing journal articles may be approved for a shorter embargo period. Students must apply for the embargo during the Advanced Degree Application process . More information can be found on the Graduate School's Ph.D. Publication, Access and Embargoing webpage . Those who have been approved for the embargo can choose \"Traditional Publishing\" or \"Open Access Plus\" publishing when they complete their online submission to ProQuest. Mudd Manuscript Library staff will apply the embargo in the ProQuest ETD system at the time of submission of materials to the Library. In the case of Open Access Plus, the dissertation would become freely available on the ProQuest open access site when the embargo expires. The embargo in ProQuest will also apply to the embargo in Princeton’s digital repository, DataSpace Embargo Renewals Those who wish to request a renewal of an existing embargo must email Assistant Dean Geoffrey Hill and provide the reason for the extension. An embargo renewal must be requested in writing at least one month before the original embargo has expired, but may not be requested more than three months prior to the embargo expiration date. Embargoes cannot be reinstituted after having expired. Embargoes are set to expire two years from the date on which the Ph.D. was awarded (degrees are awarded five times per year at Board of Trustee meetings); this date will coincide with the degree date (month and year) on the title page of your dissertation. Please note: You, the student, are responsible for keeping track of the embargo period--notifications will not be sent. To find the exact date of an embargo expiration, individuals can find their dissertation in DataSpace , and view the box at the bottom of the record, which will indicate the embargo expiration date. The Graduate School will inform the Mudd Library of all renewals and Mudd Library staff will institute the extensions in ProQuest and DataSpace . Formatting your Dissertation Princeton University Archives' Dissertation Formatting Requirements (PDF download) document provides detailed information on how to prepare the dissertation PDF and bound volume (if you are required to submit a bound volume). Please take special note of how to format the title page (a title page example is downloadable from the upper-right-hand side of this webpage). The title page must list your adviser’s name. ProQuest's Preparing Your Manuscript guide offers additional information on formatting the PDF. Where there are discrepancies with the Princeton University Archives Dissertation Formatting Requirements document, the Princeton University Archives requirements should be followed. Special consideration should be paid to embedding fonts in the PDF. ProQuest ETD Administrator Resources and Guidelines web page offers several guides to assist you in preparing your PDF, choosing publishing options, learning about copyright considerations, and more. ProQuest's Support and Training Department can assist with issues related to creating and uploading PDFs and any questions regarding technical issues with the online submission site. Fees Whether a student pays fees to ProQuest in the ETD Administrator Site depends on the publishing option they choose, and if they opt to register their copyright (if a student selects Traditional Publishing, and does not register their copyright, no charges are incurred). Fees are to be submitted via the UMI ETD Administrator Site. Publishing and copyright registration fees are payable by Visa, MasterCard, or American Express and a small service tax may be added to the total. The options listed below will be fully explained in the ETD Administrator site. Traditional without copyright registration: $0 to ProQuest (online) Traditional with copyright registration: $75 to ProQuest (online) Open Access without copyright registration: $95 to ProQuest (online) Open Access ($95) with copyright registration ($55): $150 to ProQuest (online) Deadlines Degrees are granted five times per year at Board of Trustee meetings. Deadlines for materials to be submitted to the Mudd Manuscript Library are set by the Office of the Graduate School . The title page of your dissertation must state the month and year of the board meeting at which you will be granted your degree, for example “April 2023.” Academic Year 2023-2024 Tuesday, October 31, 2023, degree date \"November 2023\" Friday, December 29, 2023, degree date \"January 2024\" Thursday, February 29, 2024, degree date \"March 2024\" Thursday, May 9, 2024, degree date \"May 2024\" Academic Year 2024-2025 Friday, August 30, 2024, degree date \"September 2024\" Thursday, October 31, 2024, degree date \"November 2024\" Tuesday, December 31, 2024, degree date \"January 2025\" Friday, February 28, 2025, degree date \"March 2025\" Thursday, May 8, 2025, degree date \"May 2025\" Please note: If a student is granted an extension for submission of their materials after a deadline has passed, the Mudd Manuscript Library must have written confirmation of the extension from the Office of the Graduate School in the form of an email to specialcollections@princeton.libanswers.com . Access to Ph.D. Dissertations Bound Copy : One non-circulating , bound copy of each dissertation produced until and including the January 2022 degree list is held in the collection of the University Archives. For dissertations submitted prior to September 2011, a circulating , bound copy of each dissertation may also be available. Information about these dissertations can be found in Princeton University Library's main catalog . Electronic Copy (PDF) in ProQuest: ProQuest Dissertation Publishing distributes Princeton University dissertations. Members of the Princeton University community can access most dissertations through the ProQuest Dissertations and Theses subscription database, which is made available through the Princeton University Library. For students that choose \"Open Access Plus publishing,\" their dissertations are available freely on the internet via ProQuest Dissertations and Theses . Dissertations are available for purchase through ProQuest Dissertation Express . Once the dissertation has been accepted by the Mudd Library it will be released to ProQuest following the Board of Trustee meeting on which your degree is conferred.Bound copies ordered from ProQuest will be printed following release. Please note, dissertations under embargo are not available in full text through the ProQuest Dissertations and Theses subscription database or for sale via ProQuest Dissertation Express during the embargo period. Electronic Copy (PDF) in Princeton's Institutional Repository, DataSpace : Beginning in the fall of 2011, dissertations will be available through the internet in full-text via Princeton's digital repository, DataSpace . (Embargoed dissertations become available to the world once the embargo expires.) Interlibrary Loan : Dissertations that have bound copies and are not under embargo are available through Interlibrary Loan (ILL) to libraries in the United States and Canada, either through hard copy or PDF. If PDFs are available, they can be sent internationally. Submitting Your Master’s Thesis to the Mudd Manuscript Library Students who are enrolled in a thesis-based Master’s degree program must upload a PDF of their thesis to Princeton's ETD Administrator site (ProQuest) just prior to completing the final paperwork for the Graduate School. These programs currently include: The Department of Chemical and Biological Engineering (M.S.E.) The Department of Civil and Environmental Engineering (M.S.E.) The Department of Computer Science (M.S.E.) The Department of Electrical and Computer Engineering (M.S.E.) The Department of Mechanical and Aerospace Engineering (M.S.E.) The Department of Operations Research and Financial Engineering (M.S.E.) The Department of Near Eastern Studies (M.A.) The PDF should be formatted according to our Dissertation Formatting Requirements (PDF download) . The Mudd Library will review and approve the submission upon notification from the Graduate School that your final paperwork is ready for this step. Bound copies are no longer required or accepted for Master's theses. Students who are not in a thesis-based Master's degree program do not need to make a submission to the library upon graduation. If you have questions, please contact the Mudd Manuscript Library using our Ask Us form. Downloadable Documents Download Title Page Format.pdf (122.22 KB) Download Dissertation Formatting Requirements__v23.1.pdf (293.05 KB) Locations Firestone Library One Washington Road Princeton , NJ 08540 609-258-3184 Seeley G. Mudd Manuscript Library 65 Olden Street Princeton , NJ 08540 609-258-6345 Calendars: RBSC | Mudd Where to Access Your Account Ask Us! Find Material Order Images Learn About Theses & Dissertations Review Grant Opportunities Schedule a Class Visit Visit Us About Special Collections Collections and Divisions Exhibitions For Children Friends of the Library Publications Staff Directory Staff Workflows Staff Login Princeton University Library © 2024 The Trustees of Princeton University. All rights reserved. Accessibility Top"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:20:43.447952",
    "url": "https://fed.princeton.edu/cas/login?service=https%3A//gsadminportal.princeton.edu/casservice%3Freturnto%3D/homepage",
    "university_name": "Princeton University",
    "title": "",
    "content": "CAS gsadminportal_princeton_edu gsadminportal.princeton.edu Central Authentication Service NetID NetID is a required field. Password: Toggle Password Password is a required field. CAPSLOCK key is turned on! Login Change my Password or Get Help By proceeding to access and use University computing and network resources through this sign-on,\n   you agree to abide by applicable laws and University policies in your use of these resources.\n  The University's right to access, preserve, and review information stored on or transmitted through\n   these resources is described in the Access to Accounts Policy . For security reasons, please log out and exit your web browser when you are done accessing services that require authentication! © 2023 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:21.916330",
    "url": "https://gradfutures.princeton.edu/forge-connections",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Photo: Sameer A. Khan / Fotobuddy Section Menu Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Forge Connections Build a strong network of mentors, advocates, and professionals within and beyond your discipline as a source of advice, inspiration, and possible referrals. When GradFUTURES launched, we immediately received an outpouring of support from graduate alums, many of whom said they wished there was a professional development program like this when they were at Princeton. Across our programming, we help you build connections and community—and develop the same kinds of multigenerational networks that have existed for decades among Princeton’s undergraduate alums. With countless opportunities to align with fellow graduate students, graduate alums, professionals, and trailblazers, you will develop a deep roster of connections who can illuminate possibility now and as you envision your future(s). Featured Programs Graduate Alum-in-Residence Program Schedule 1:1 consultations with graduate alums working in a variety of roles across the academic, government, nonprofit, and private sectors. Graduate Alum Mentorship Program Benefit from ongoing access to a network of Princeton graduate alum mentors, who offer guidance and advice across a broad range of fields. GradFUTURES LinkedIn Group Find community and connections among and between current graduate students and those within the broader University community. “There are *a lot* of resources here in Princeton dedicated to helping students at every stage of their career exploration and planning – it can be a bit overwhelming at first! If you don't know where to begin when thinking about your future plans (I certainly didn't), just start by attending one or two events organized by GradFUTURES and chat with us about what's on your mind. We are more than happy to put you in touch with people who can best help you, and gradually you will build a network that will make the career planning process an overall exciting and empowering experience.” – Pablo Oyler-Castrillo , GS, QCB Additional Programs to Explore The Annual GradFUTURES Forum Professional Development Conference Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. The GradFUTURES Podcast Listen to the professional development stories of graduate students, graduate alums, and those who partner and collaborate with them! Trailblazers Beyond the Tenure Track: Graduate Alum Stories & Profiles Develop a vision of the journey ahead by exploring the experiences of trailblazers who have pursued careers beyond the tenure track. “When I was a graduate student at Princeton, I knew I wanted to be a librarian, but I had to figure out how to get library work experience and learn more about the library world. Most of my successes, whether in finding work at the library or gaining a better understanding of various library fields, came from reaching out to librarians, asking them about their career journeys, and learning from their advice. This outreach approach prepared me to be better equipped as a librarian candidate, and it can work for other professional fields as well.\" – Deborah Schlein, *19, NES , Near Eastern Studies Librarian, Princeton University Library “To this day, my Grad School classmates and colleagues form a central core within my professional network. Engage with those around you—not only within your discipline, but more broadly. Conversations and ideas shared with faculty members, visiting scholars, and fellow students will remain with you, a constellation of thoughts and perspectives by which to chart your professional course.\" – Natalka Pavlovsky *88, *01, MUS , Professor of Music, Rowan College of South Jersey Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:22.135010",
    "url": "https://gradfutures.princeton.edu/Forum",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Section Menu Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Star Lessons in Leadership The Annual GradFUTURES Forum Professional Development Conference Thank You for Joining us at the 2024 GradFUTURES Forum! 2024 GradFUTURES Forum: Building Clarity, Confidence, and Connections With more than a dozen engaging speakers, skill-building workshops, alumni panels, and networking sessions, the GradFUTURES Forum offers sessions with real-time relevance to success in graduate school and provide s a glimpse into a world of possibilities beyond. Visit the GradFUTURES YouTube Channel to view recordings from this year's forum. Thank you to our Sponsors! 8 Days of engaging workshops, panels, and networking events! 20+ Events with virtual and in-person attendance options! 30+ Speakers, presenters, and facilitators! 3600+ Registrants from all over the globe! Forum 2024 Speakers, Presenters, and Panelists Include: Rodney D. Priestley Dean of the Graduate School Pomeroy and Betty Perry Smith Professor of Chemical and Biological Engineering Clio Hall Award Recipient Genevieve Allotey-Pappoe, GS, MUS University Administrative Fellow Social Impact Fellow Desiree Barron-Callaci Senior Program Officer at the American Council of Learned Societies Carin Berkowitz Executive Director, NJ Council for the Humanities Jessica Calarco Professor of Sociology, University of Wisconsin-Madison Leonard Cassuto American Higher Education Learning Cohort Convener Inaugural GRADitude Award for Advancing Graduate Professional Development Recipient Chris Crawford, *22, SPIA AAAS Science & Technology Policy Fellow, USDA Amy Cuddy, *05, PSY Social psychologist, NYT-bestselling author, and award-winning Harvard lecturer Gadi Dechter Vice President for Communications and Government Affairs, Princeton University Janellen Duffy, *03, MPA Senior Vice President, River Crossing Strategy Group Austin Edwards, *23, MPP, SPIA Senior Policy Counsel at Salvation and Social Justice Ruth Gotian Speaker, Business Skills for PhDs in Academia and Beyond Chief Learning Officer; Associate Professor of Education in Anesthesiology, Weill Cornell Medicine. Julie Groeninger Assistant Vice President, Office of Government Affairs, Princeton University Ian Gunady, GS, MAE University Administrative Fellow Facilitator, Structured Problem Solving like Consultants Learning Cohort Michael Hotchkiss Assistant Vice President for Communications, Princeton University Sargun Kaur Lalia Digital Engagement and Programming Specialist, Strategic Intelligence, World Economic Forum Ann Kirschner *78, ENG Educator, Author, Entrepreneur Acting President, Hunter College Clio Hall Award Recipient Peter Krause Assistant Director/Career Coach, Dartmouth Martin Lercher Professor of Computer Science and Biology, Heinrich Heine University Camila Llerena-Olivera, GS, CEE Professional Development Associate 2023-24 Emily Miller Deputy Vice President of the AAU Jennifer Morrill Director of Media Relations, Princeton University Michelle Nedashkovskaya Policy Lead, YouTube Pablo Oyler-Castrillo, GS, QCB Professional Development Associate 2023-24 Breanne Pitt Project Research Fellow, Strategic Intelligence, World Economic Forum Adam Rosenberg, *03, PPPL Democratic Staff Director for the Energy Subcommittee of the U.S. House Committee on Science, Space, and Technology Benjamin Sacks *18, HIS Policy Researcher; Professor, Pardee RAND Graduate School Shyam Sharma Associate Professor and Graduate Program Director Program in Writing and Rhetoric, Stony Brook University Achinthya Sivalingam GS, MPA, SPIA Moderator, 2024 GradFUTURES Forum Jason Sullivan Data Analyst at Academic Analytics Future Faculty Workshop Speaker Paul M. Sutter, Ph.D. Research Professor, Institute for Advanced Computational Science, Stony Brook University Skill-Building Workshop Speaker Hansen Tjo, GS, CBE Professional Development Associate 2023-24 Robert Townsend Director of Humanities, Arts, and Culture Programs, American Academy of Arts and Sciences Itai Yanai Professor of Biochemistry and Molecular Pharmacology, NYU Grossman School of Medicine Qiqi Yang, GS, EEB Professional Development Associate 2023-24 Elizabeth Zeitler, *14 CHM Associate Board Director, Energy and Environmental Systems, National Academies of Sciences, Engineering and Medicine Past GradFUTURES Forums Resources, Recordings, and Information from the 2023 GradFUTURES Forum Resources, Recordings, and Information from the 2022 GradFUTURES Forum Resources, Recordings, and Information from the 2021 GradFUTURES Forum Resources, Recordings, and Information from the 2020 GradFUTURES Forum “I want to thank GradFUTURES for pulling together this event because there are so many issues right now in public policy that have a nexus with science and technology. We really need more students, postdocs, and faculty members to bring their advice to policymakers on these issues. Not only that, but this event is helpful for students to pursue a career path from academia to public policy. GradFUTURES has done a terrific job of building that ecosystem and community here at Princeton in order to help support those efforts.” –– Ali Nouri, *06 (MOL) , Deputy Assistant to the President and Deputy Director of the Office of Legislative Affairs, The White House Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:22.345350",
    "url": "https://gradfutures.princeton.edu/sharpen-skills",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Photo: Sameer A. Khan / Fotobuddy Section Menu Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Star Lessons in Leadership Sharpen Skills Professional development is integral to graduate education at Princeton University. It involves the systematic learning, acquisition, and application of skills and competencies that support your scholarly goals while preparing you for professional success in diverse roles within the academic, government, nonprofit, and private sectors. These competencies are in-demand in the Ph.D. labor market across all disciplines, career fields, and position types. Many are also interrelated and may be explored in any order based on your unique interests and goals. Throughout your time here, a range of programs helps you build competence and confidence in each of these highly transferable skills. Our Professional Competency Model Research & Data Analysis Writing & Public Speaking Teaching & Mentoring Leadership & Collaboration Diversity, Equity, & Inclusion Personal Well-being & Effectiveness Innovation & Entrepreneurship Career Management Progressive Acquisition & Mastery of Skills Creates Career Optionality Alongside the development of strong foundational and discipline-specific skills, we emphasize distinguishing skills that translate universally across an array of leadership environments. This sets our Ph.D.s apart on the academic job market and prepares them for success in diverse fields—including entrepreneurship. We curate, integrate, and cross-promote professional development programs offered by dozens of partners on and off campus to help graduate students build and hone these skills. In addition, we deliver more than 150+ programs including skill-building, interdisciplinary learning cohorts, mentorship, and experiential opportunities. Learn more about our professional competency model . Featured Programs Interdisciplinary Learning Cohorts Explore interdisciplinary seminars and co-curricular opportunities that bring together students, alums, faculty, and industry partners. The Annual GradFUTURES Forum Professional Development Conference (External Guests and Alums) Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. Science Policy Reflect on and identify your professional interests and future possibilities using ideation, group problem-solving, and design-thinking methods. 2024 GradFUTURES Wintersession Events Join us during this campus-wide, two-week experience that offers engaging, active, and intriguing non-graded learning and growth opportunities for the entire University community! Princeton Startup Bootcamp, Powered by VentureWell Take on an entrepreneurial mindset, collaborate across disciplines, and learn what it takes to bring an idea to market. Focus on Future You(s) Reflect on and identify your professional interests and future possibilities using ideation, group problem-solving, and design-thinking methods. Creativity Workshops Embrace innovative thinking and apply an entrepreneurial mindset toward bold, disruptive research ideas of interest to all audiences. Skill-building Workshops Participate in events and skill-building workshops throughout the year across that span key competencies and sharpen in-demand skills. 2023 GradFUTURES Wintersession Events Join us during this campus-wide, two-week experience that offers engaging, active, and intriguing non-graded learning and growth opportunities for the entire University community! The Annual GradFUTURES Forum Professional Development Conference Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. “I always imagine I'm a tree and different skills are branches and leaves that could grow in the future. My professional development is a process of knowing myself and the world, and growing those branches and leaves. Connecting with alumni in my department opened my eyes to the career choices I could have as an EEB PhD and what skillsets I could aim to develop during graduate school. By doing what I want to try, I learn what I'm passionate about and what skills I'm already good at and what skills I'd need to learn more.” – Qiqi Yang , GS, EEB Additional Programs to Explore Graduate Alum Mentorship Program Benefit from ongoing access to a network of Princeton graduate alum mentors, who offer guidance and advice across a broad range of fields. Research and Career Resources Access a range of free resources that are designed to support you in your development, progression, and career outcomes. “Many brilliant people apply to graduate school and then find that graduate school is not quite what they expected. Rather than being a retreat from the world, it is in fact a training ground for a complicated, very public job, one that requires many of the same skills as other high level positions. These include networking, scheduling time efficiently, managing multiple forms of technology, following a plethora of policies, and leading people from diverse backgrounds to accomplish a common goal while simultaneously writing, researching, and teaching. Fortunately, the graduate student professional development program at Princeton University provides training in just these types of skills and thus is an essential part of graduate student success now and in the future.\" – Wendy Laura Belcher , Professor of African Literature, Princeton University, Department of Comparative Literature and Department of African American Studies Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:27.672561",
    "url": "https://gradfutures.princeton.edu/gain-experience",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Photo: Sameer A. Khan / Fotobuddy Section Menu Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Gain Experience Pursue opportunities for personal and professional growth—and experience where your strengths and interests align. GradFUTURES experiential opportunities help you gain vital experience while exploring professional paths within the academic, government, nonprofit, and private sectors. Through highly customized fellowships, internships, and special projects, you can apply discipline-specific skills, build interdisciplinary team experience, and receive one-on-one mentoring. These experiences are: Flexible & part-time: Up to 10 hours / week during the summer or academic year Paid*: Nearly all opportunities are funded through GradFUTURES Open to International Students*: Most fellowships do not require work authorization Fellowship & Internship Programs GradFUTURES Micro-Internships in Industry Participate in a unique applied learning experience and hone professional skills and competencies while working under the direction of an industry mentor. GradFUTURES Pre-Matriculation Internships Prior to beginning your first semester of doctoral study, gain valuable professional experience and industry mentorship. GradFUTURES Higher Education Leadership Fellowships Get a behind-the-scenes look at leadership roles within higher education administration, participate in a meaningful project, and receive mentorship from a senior leader. GradFUTURES Social Impact Fellowships Gain interdisciplinary project team experience and receive 1:1 mentoring while contributing to an organization’s social impact mission. Graduate Student Professional Development Associates Co-create programs and events that reflect graduate students' unique interests, input, and innovative ideas. Community College Teaching Fellowships Shadow and receive mentoring from a tenured community college faculty member one semester, and design and teach a course of your own the next. University Administrative Fellowships Gain a deeper understanding and appreciation for university administration via staff mentorship, shadowing, and immersive projects. Additional Programs to Explore The Annual GradFUTURES Forum Professional Development Conference Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. “The press on this fellowship online led to some tenure-track job offers; people were headhunting me because of this diversity work. I’m negotiating a job offer right now. I’m grateful for the platform that gradFUTURES created for graduate students to realize projects and initiatives that we otherwise would not be able to find and participate in.\" – Joyce Chen , GS, MUS Create a Graduate Student Experience! Email Us to Learn More About Partnership View Fellowship & Internship Information for Nonprofit & Public Sector Partners Fellowship and Internship News & Updates University Administrative Fellowship Spotlight: Lindsay Griffiths (GS, English) GradFUTURES Social Impact Fellowship Spotlight: Noel Park (GS, Molecular Biology) GradFUTURES Social Impact Fellowship Spotlight: Isla Xi Han (GS, Architecture) GradFUTURES Social Impact Fellowship Spotlight: Elaine Tsui (GS, Chemistry) GradFUTURES Social Impact Fellowship Spotlight: Margaret Kurkoski (GS, Art & Archeology) GradFUTURES Summer Pre-matriculation Fellowship Spotlight: Anna Hancock (GS, Spanish & Portuguese) GradFUTURES Social Impact Fellowship Spotlight: Jonathan Aguirre (GS, Spanish & Portuguese) GradFUTURES Social Impact Fellowship Spotlight: Yuzhou Bai (GS, East Asian Studies) Funding Note and Graduate Student Employment Disclaimer All graduate students must adhere to the Graduate Student Employment policy when participating in an opportunity that is compensated or funded by an external entity. This includes participating in internships and receiving compensation from private sector organizations, paid positions at national government labs or research institutes, and research assistantships funded by institutions outside of Princeton. Graduate students must obtain approval from their faculty adviser prior to acceptance of a position and must also complete an External Opportunity Application Form (link found on this site). Faculty advisers may submit a note of support using this form . Additionally, all international graduate students must review and comply with guidelines on the Davis International Center’s Employment Page so as not to risk violating their visa immigration status. *Micro-Internships in Industry with partner organizations in the private sector may require work authorization. Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:37.860253",
    "url": "https://gradfutures.princeton.edu/explore-pathways",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Photo: Sameer A. Khan / Fotobuddy Section Menu Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Career Outcomes Explore Pathways Sharpen your vision of the future and build awareness of in-demand roles, industries, and skills through research and exploration of diverse professional pathways. Graduate school is both a career launch point and an ideal time for personal and professional exploration. We invite you to invest time in considering the multiple pathways that are open to you, and the many ways in which your graduate education will serve as a career differentiator within the academy and beyond. By engaging the insights shared by our graduate alums and partners and pursuing hands-on opportunities across fields, you can set your sights forward while deepening the impact of your graduate research. Here, we have gathered a wide range of resources that speak to the diverse interests and talents of Princeton’s graduate student cohorts. Long-Term Career Outcomes Nearly half of Princeton’s doctoral students pursue opportunities in fields beyond academia. We provide a supportive climate, resources, and professional development opportunities to enhance graduate student outcomes both within and outside of the academy, and take a transparent approach to reporting long-term career outcomes. Explore outcomes by division on the Graduate School Website . Featured Programs Humanities Expedition & Lab Explore the many ways in which a graduate degree in the humanities and social sciences can have an impact in the academy and beyond. Fellowship Spotlight Series Find out what Princeton graduate students have to say, in their own words, as they share their experiences in one of the GradFUTURES Fellowship programs. The GradFUTURES Podcast Listen to the professional development stories of graduate students, graduate alums, and those who partner and collaborate with them! Trailblazers Beyond the Tenure Track: Graduate Alum Stories & Profiles Develop a vision of the journey ahead by exploring the experiences of trailblazers who have pursued careers beyond the tenure track. Research and Career Resources Access a range of free resources that are designed to support you in your development, progression, and career outcomes. GradStories Read graduate student and alum stories that showcase the impact of professional development, and the ways in which they have applied their skills and competencies. “Most graduate students spend most of their time in their departments. But if they do that, they’ll miss the huge range of support services, professional training and experiential opportunities that the Graduate School offers! GradFUTURES, in particular, broadens graduate students’ horizons to look not only at tenure-track jobs after the PhD but also at a whole range of other career possibilities. In these challenging times, it is good to know that someone with a PhD can launch many different types of careers—and that the Graduate School can launch many different types of graduate students.\" – Kim Lane Scheppele , Laurance S. Rockefeller Professor of Sociology and International Affairs in the Princeton School of Public and International Affairs and the University Center for Human Values Additional Programs to Explore Interdisciplinary Learning Cohorts Explore interdisciplinary seminars and co-curricular opportunities that bring together students, alums, faculty, and industry partners. Future Faculty Workshops Learn about the professional lives of faculty and the landscape of faculty roles within diverse higher education institutions in the U.S. The Annual GradFUTURES Forum Professional Development Conference Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. Community College Teaching Fellowships Shadow and receive mentoring from a tenured community college faculty member one semester, and design and teach a course of your own the next. University Administrative Fellowships Gain a deeper understanding and appreciation for university administration via staff mentorship, shadowing, and immersive projects. GradFUTURES Micro-Internships in Industry Participate in a unique applied learning experience and hone professional skills and competencies while working under the direction of an industry mentor. GradFUTURES Pre-Matriculation Internships Prior to beginning your first semester of doctoral study, gain valuable professional experience and industry mentorship. Graduate Student Professional Development Associates Co-create programs and events that reflect graduate students' unique interests, input, and innovative ideas. “Research is very time consuming, but I think pausing briefly to consider what you would like to do after graduate school, and how to acquire the skills needed to get there, can make an especially big difference.” – Hansen Tjo , GS, CBE Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:53.166697",
    "url": "https://gradfutures.princeton.edu/events",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Events Featured Events (See Calendar Below for a Full List) May 23 Bootcamp on Effective Research Mentorship: Part 2 of 3 May 23 GradShares: \"Romantic Rocks, Indigenous Traces: Poetry, Geology, and Empire in Early America\" May 24 Special Collections Showcase May 28 Guided tour of \"Ulises Carrión: Bookworks and Beyond\" May 30 Bootcamp on Effective Research Mentorship: Part 3 of 3 May 31 Propelus I-Corps at Princeton (Session 1 of 2) Jun 1 Guided tour of \"Ulises Carrión: Bookworks and Beyond\" Jun 2 Guided tour of \"Ulises Carrión: Bookworks and Beyond\" Jun 14 Propelus I-Corps at Princeton (Session 2 of 2) Events List May 23 Bootcamp on Effective Research Mentorship: Part 2 of 3 May 23 GradShares: \"Romantic Rocks, Indigenous Traces: Poetry, Geology, and Empire in Early America\" May 24 Special Collections Showcase May 28 Guided tour of \"Ulises Carrión: Bookworks and Beyond\" May 30 Bootcamp on Effective Research Mentorship: Part 3 of 3 May 31 Propelus I-Corps at Princeton (Session 1 of 2) Jun 1 Guided tour of \"Ulises Carrión: Bookworks and Beyond\" Jun 2 Guided tour of \"Ulises Carrión: Bookworks and Beyond\" Jun 14 Propelus I-Corps at Princeton (Session 2 of 2) Jun 25 A.I. Platforms in Action: Understanding Azure OpenAI, AWS Bedrock, and GCP Gemini A.I. Jul 9 Introduction to GPU Computing Jul 30 Summer 2024 Software Engineering Summer School (July 30-31) Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:54.940409",
    "url": "https://graddiversity.princeton.edu/",
    "university_name": "Princeton University",
    "title": "Access, Diversity and Inclusion",
    "content": "Access, Diversity and Inclusion Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Our Team Submenu Our Team About Us For Current Students Submenu For Current Students Grad Scholars Program (GSP) Submenu Grad Scholars Peer Mentor Program Diversity Fellows Program Student Resources Submenu Student Affinity Groups University Centers and Offices Funding Submenu General Funding Sources Hanna Fellowship Kaleidoscope Newsletter Calendar of Events BADI Awards Inclusive Academy Symposium For Prospective Students Submenu For Prospective Students Prospective PhD Preview (P3) Submenu 2023 P3 Schedule P3 FAQ's Meet the ADI Team Pre-Doctoral Fellowship Initiative Submenu Pre-Doctoral Fellowship FAQs Prospective Student Resources Submenu Graduate School FAQ Virtual Workshop Series Recruitment Calendar Informational Viewbook ADI Spotlight Contacts Events News IA Symposium Log in Search Search Access, Diversity and Inclusion Imagine Princeton , Imagine the Possibilities Pause video ￭ Announcements Trustees set 2024-2025 budget, increasing spending for graduate student support Graduate students will now share in governance of the Graduate School Explore the Graduate ADI Journey Prospective Opportunities Prospective PhD Preview (P3) Pre-Doctoral Fellowship Initiative Virtual Workshop Series Incoming Students Graduate Scholars Program (GSP) Diversity Fellows Current Students Inclusive Academy Symposium Best of Access, Diversity, and Inclusion Awards We meet you where you are. Thinking of applying to Princeton's Graduate School? Meet us on the road at our 2024-25 events! Recruitment Calendar Apply Now 25 Percent of domestic students who accepted admission for AY23-24 are first-generation or low-income students 21 Percent of domestic students who accepted admission for AY23-24 are from underrepresented groups 287 Current Graduate Scholars Program members Upcoming Events May 22 ADI Graduation Reception May 22, 2024 , 4:00 pm – 6:00 pm View Full Calendar Team Access, Diversity and Inclusion Meet the team > Cost & Funding Explore funding > Engaging Community Find success > View all spotlights ADI Spotlight: Jolaun Hunter ADI Spotlight: Mélena “Mae” Laudig ADI Spotlight: Richard Thornton Footer Clio Hall, Princeton, NJ, 08544 Contact: [email protected] Footer menu gradFUTURES Student Life Apply Facebook Instagram Twitter Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:56.015351",
    "url": "https://gradfutures.princeton.edu",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search GradFUTURES Create your future(s) . On your terms. 2024 GradFUTURES Forum Highlights & Recordings Thank you for joining us at the 2024 GradFUTURES Forum! Check out our YouTube Channel for recordings of select events! Graduate student centered. Sharpen Skills: Professional Competency Model> Aligned with your research. Explore Together: Interdisciplinary Learning Cohorts > Practical and experiential. Gain Experience: Fellowships and internships > Princeton University's Graduate Student Professional Development Hub GradFUTURES empowers graduate scholars to succeed in graduate school and create futures that are fully their own. Our programs are strategically designed to complement the Graduate School’s holistic support of graduate students, helping them explore, thrive, and find a sense of belonging while at Princeton.  In a fast-changing professional landscape, graduate students are uniquely situated to engage their futures with creativity, insight, and in-demand skills that reveal multiple options within the academy and beyond. Upcoming Events May 23 Bootcamp on Effective Research Mentorship: Part 2 of 3 May 23, 2024 , 10:30 am May 23 GradShares: \"Romantic Rocks, Indigenous Traces: Poetry, Geology, and Empire in Early America\" May 23, 2024 , 3:00 pm May 24 Special Collections Showcase May 24, 2024 , 2:00 pm May 28 Guided tour of \"Ulises Carrión: Bookworks and Beyond\" May 28, 2024 , 12:30 pm View All Events Check out the GradFUTURES Podcast! Visit our podcast page for a list of episodes, transcripts, and more! Watch 2023 GradFUTURES Forum Recordings! Revisit key moments from this year's forum, or enjoy an opportunity to experience them for the first time. With dozens of speakers, skill-building workshops, alumni panels, and networking sessions, the GradFUTURES Forum offered sessions with real-time relevance to success in graduate school and provide a glimpse into a world of possibilities beyond. Access the Videos Countless ways to engage! 8 Essential career skills that build competence and confidence ! 14 Learning cohorts focused on societal, industry, and/or global trends 150+ Professional development events per year 1,000+ GradFUTURES Professional LinkedIn group members News 2024 Clio Hall Awardees to be honored at GradFUTURES Forum April 2, 2024 Internship-Fellowship Fair To Connect Graduate Students with Mentors, Opportunities March 28, 2024 AAU leader to be recognized at GradFUTURES Forum March 28, 2024 [GradFUTURES Podcast] America's Graduate Adviser: A Conversation with Leonard Cassuto March 26, 2024 View All Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:56.796365",
    "url": "https://gradfutures.princeton.edu/explore-pathways/podcast",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Home Explore Pathways Section Menu Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Career Outcomes The GradFUTURES Podcast All Episodes [GradFUTURES Podcast] America's Graduate Adviser: A Conversation with Leonard Cassuto Join Leonard Cassuto (author of Academic Writing as if Readers Matte r (forthcoming), The New PhD and The Graduate School Mess, among many other books) and Ph.D. student Hellen Wainaina to discuss graduate education's past, present, and future. Their wide-ranging conversation touches on graduate student-centered graduate education, mentorship, academic employment, teaching in a global context, writing for the public, tenure, PhDs as \"information specialists,\" academic freedom (and academic responsibility), how universities can help prepare graduate students for a range of careers, and much more! [GradFUTURES Podcast] Finding Fulfillment in France: A Conversation with Natalie Berkman Join Natalie Berkman *18 and Ph.D. student Hellen Wainaina for an engaging and personal conversation about how priorities can shift during graduate school, and how a supposed plan \"B\" can turn out to be a plan A. You'll hear about how a Ph.D. in French prepared Natalie well for a management level position, and the ways her post-Ph.D. life has included a continuation of her research agenda, as well as advocacy for career diversity. [GradFUTURES Podcast] New Philosophies for Graduate Education: A Conversation with Barry Lam *07 Join Barry Lam *07 and Ph.D. student Hellen Wainaina for an engaging and personal conversation about the ways they are rethinking what a Ph.D. can be. You'll be encouraged to center your own strengths, values, and preferences, and you'll hear firsthand about how the ways academia values public scholarship is changing--and why it must! [GradFUTURES Podcast] Telling the Scientific Story: A Conversation with Jason McSheene *15 Hellen Wainaina (GS, ENG) talks with Jason McSheene, *15 , a Medical Science Communications Specialist at Meditech Media. Jason earned his PhD from Princeton’s Department of Molecular Biology. While at Princeton, he created and co-hosted a podcast, “PhD in Progress” with his peers to  have honest, authentic conversations about their professional perspectives and aspirations. Jason talks about fulling his purpose, to champion education, equity, and empathy, through a myriad of  professional and personal opportunities. [GradFUTURES Podcast] 21st Century Graduate Education: A Conversation with Sarah-Jane Leslie *07 Hellen Wainaina (GS, ENG) talks with Sarah-Jane Leslie *07 , Class of 1943 Professor of Philosophy. Sarah-Jane has previously served as Dean of the Graduate School and Vice Dean for Faculty Development in the Office of the Dean of the Faculty. (n.b. This interview was recorded prior to Rodney D. Priestley’s appointment as the current Dean of the Graduate School.) Leslie is an affiliated faculty in the Department of Psychology and various other centers and programs across Princeton. The conversation opens up with the founding vision behind GradFUTURES, with Sarah-Jane addressing the misconception that doctoral training is only about preparing students for academic positions in universities. It is essential for both faculty and members of the administration to, she says, “recognize the imperative to prepare Ph.D. students to feel equipped and empowered to explore the entire range of career possibilities available to them.” [GradFUTURES Podcast] Unexpected Career Turns: A Conversation with Ann Kirschner *78 In the inaugural episode, Hellen Wainaina (GS, ENG) talks to Ann Kirschner *78 , University Professor at The City University of New York, author, and entrepreneur. Ann reflects on the unexpected turns her career has taken since earning a Ph.D. in English at Princeton. From working in the early days of cable television to becoming the first digital strategist for the National Football League, where she launched NFL.COM and SUPERBOWL.COM, Ann weighs in on the value of \"knowing what you know,\" understanding the value of graduate education beyond the academy, the adjunct system and the future professoriate, and the dignity of work. [GradFUTURES Podcast] Season 1 Trailer: \"Broadening the Impact of the PhD Within and Beyond the Academy\" The trailer for the GradFUTURES Podcast was premiered live at the 2022 GradFUTURES Forum! Enjoy a sampling of conversations from our first two guests: Sarah-Jane Leslie *07 (Philosophy) and Ann Kirschner *78 (English), who have both been instrumental in the creation and expansion of GradFUTURES, and both are at the heart of graduate student professional development efforts at Princeton. Our Team Hellen Wainaina, GS, ENG University Administrative Fellow Host & Executive Producer, GradFUTURES Podcast Francine Henry Audio Engineer, GradFUTURES Podcast Rebekah Haigh, GS, REL Community College Teaching Fellow University Administrative Fellow Social Impact Fellow Genevieve Allotey-Pappoe, GS, MUS University Administrative Fellow Social Impact Fellow GradFUTURES Podcast: Our Why Our podcast centers on the futures of PhDs: both those in training at Princeton, and Princeton graduate alums who are in and beyond academia. We tell the professional development stories of graduate students, graduate alums, and those who partner and collaborate with them! Find us on Apple Podcasts , Google Podcasts , Spotify , Audible , and Pocket Casts , and more. Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:42:57.026925",
    "url": "https://gradfutures.princeton.edu/partner-us",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Section Menu Academic Departments & Faculty Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award Partner with Us The success of the GradFUTURES campus-wide initiative relies on the collective expertise and commitment of faculty, staff, alums, industry, and community partners. GradFUTURES exists to empower all graduate students with the professional competencies and skills they need. The Office of the Dean of the Graduate School gratefully acknowledges the outstanding contributions of all of our partners in delivering transformative programs, resources, and experiences that prepare graduate students to pursue a diverse array of professional opportunities. Interested in partnering with us? Please email us at [email protected] . Our Partners Academic Departments & Faculty Create discipline-specific professional development programs and resources in partnership with the GradFUTURES team. Graduate Student Professional Development Associates Co-create programs and events that reflect graduate students' unique interests, input, and innovative ideas. Higher Ed Partners Work with us to offer opportunities for Princeton doctoral students to gain substantive experience in diverse educational settings. Graduate Alums Provide meaningful advice, referrals to opportunities, and inspiration as an advocate and mentor to to current graduate students. Industry Partners Partner with us to expand the range of experiential opportunities for our doctoral students to gain progressive exposure to different industries. Campus Partners Collaborate with a coalition of staff across campus who have a shared goal to expand programs, resources, and opportunities. Collaborative by Design Professional Development Working Group Launched in 2019, the Professional Development Working Group (PDWG) is a collaborative, cross-functional coalition that convenes regularly to integrate, assess, and promote all of the robust professional development programs, opportunities, and resources offered for graduate students across campus. This group’s shared mission is to expand the availability and visibility of graduate student professional development and to support this strategic priority of the Graduate School. Learn more and join us > Awards & Recognition The GRADitude Award for Advancing Graduate Professional Development The GradFUTURES GRADitude Award for Advancing Graduate Professional Development recognizes national leaders who have influenced the field of graduate professional development in profound and substantial ways. Awardees—either individuals or organizations—are recognized at the annual GradFUTURES Forum. The GradFUTURES Clio Hall Award Each year, the GradFUTURES Clio Hall Awards are presented by the Graduate School's professional development team to faculty, staff, graduate alums, and graduate students in recognition of significant contributions to the professional development of Princeton graduate students. “Partnering with the Graduate School in promoting our Education, Training and Outreach program has significantly raised awareness and increased participation from graduate students across campus.\" – Ma. Florevel (Floe) Fusin-Wischusen , Institute Manager, Princeton Institute for Computational Science & Engineering (PICSciE) We empower graduate students to create their future(s) -- on their terms. Established by the Graduate School in fall of 2019, GradFUTURES ® serves as Princeton’s professional development hub for empowering graduate student futures through a broad spectrum of skills training, mentorship, bespoke experiential opportunities and interdisciplinary learning programs. Learn more about our approach . Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:43:07.633599",
    "url": "https://gradfutures.princeton.edu/sharpen-skills/professional-competency-model",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Home Sharpen Skills Professional Competency Model Progressive Acquisition & Mastery of Skills Creates Career Optionality We emphasize skills that bridge graduate research & graduate future(s). Inspired leaders emerge at the intersection of graduate education and professional development—which is why a comprehensive learning framework underpins our work. Alongside the development of strong foundational and discipline-specific skills, we emphasize distinguishing skills that translate universally across an array of leadership environments. This sets our Ph.D.s apart on the academic job market and prepares them for success in diverse fields—including entrepreneurship. We curate, integrate, and cross-promote professional development programs offered by dozens of partners on and off campus to help graduate students build and hone these skills. In addition, we deliver more than 150 programs including: Skill-building Interdisciplinary learning cohorts Mentorship Experiential opportunities The Foundation: Eight Core Competencies Informed by labor market research, peer benchmarking, graduate alumni feedback, and Princeton’s institutional priorities, these eight core competencies span essential skills. Career Management Exploring diverse career paths, developing job search skills and materials, and building relationships that enable you to achieve your current and future professional goals. Innovation & Entrepreneurship Applying innovative, inclusive, creative, and entrepreneurial approaches and mindsets to accelerate discovery and catalyze solutions to complex problems– whether within the context of the academic research enterprise and/or new venture creation. Personal Well-being & Effectiveness Maximizing your overall well-being allows you to perform at peak effectiveness in all aspects of your academic, personal, and professional life by fostering resilience, social connectedness, balance, and a growth mindset. Diversity, Equity, & Inclusion Engaging in lifelong learning to understand and apply strategies that foster inclusion and intercultural fluency while advancing equity within various professional, institutional, organizational, and community contexts. Leadership & Collaboration Managing complex projects and working collaboratively in diverse, multidisciplinary teams to achieve mutual goals and realize a sense of shared accomplishment. Teaching & Mentoring Applying instructional pedagogies, assessment methods, and effective teaching practices to promote inclusive learning environments whether within a formal classroom setting or online, for student mentoring and tutoring, or facilitation of training programs within other organizational settings. Writing & Public Speaking Developing strong written communication and public speaking skills to effectively communicate complex topics and demonstrate your expertise and research to diverse audiences. Research & Data Analysis Conducting original and independent research within and beyond your discipline using methods that will advance knowledge and enhance understanding across many fields. “What I sense is that when you're a graduate student, you feel overwhelmed by all the things on your 'I have to do this' list. However, if you really want to prepare for your future, the skills imparted through [GradFUTURES] workshops are essential. People need to think about it that way instead of thinking, 'Oh, I don't have time for it.' I've spent decades in industry, and the people who make a bigger impact are the ones who learned those vital skills, which in the past were considered ‘soft.' They're not soft, they're essential.” – Amy Aines , CEO, Damianakes Communications. Author, Championing Science Program Highlight: GradFUTURES Learning Cohorts Established: 2019 Members: Graduate students, alumni, faculty, postdocs, industry experts Skillbuilding across interests. Exploration in community. GradFUTURES Learning Cohorts bring graduate students together with members of our professional development ecosystem to explore diverse professional options and societal, industry, and/or global trends. Rooted in a series of interdisciplinary seminars and co-curricular learning opportunities, most cohorts also offer an experiential component that makes the theoretical tangible. “It’s exciting to see how many new initiatives and opportunities for graduate student professional development are emerging here on campus, in communication, teaching, leadership, wellness, career management, and other crucial areas. I very much hope this programming will continue to grow.\" – William A. Gleason , Hughes-Rogers Professor of English and American Studies “I have made two large transitions in my career: from academia to business, and from large corporations to start-ups. Being open to new opportunities and always looking to build on my knowledge and skills have helped me tremendously with my career progression... Developing a breadth of skills (including soft skills) will help prepare one to be able to take on a wider range of opportunities that present themselves. More choices mean more possibilities for career advancement.” – Kin Chung *97, MAT , Head of Credit, Zolve Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:43:07.834142",
    "url": "https://gradfutures.princeton.edu/gradfutures-professional-development-hub",
    "university_name": "Princeton University",
    "title": "GradFUTURES",
    "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search GradFUTURES: The Professional Development Hub We empower graduate students to create their future(s)—on their terms. : Learn More about Our Work Learn More about Our Work In a fast-changing professional landscape, graduate students are uniquely situated to engage their futures with creativity, insight, and in-demand skills that reveal multiple options within the academic, government, nonprofit, and private sectors. At Princeton, we believe professional development belongs at the foundation of a modern graduate education. Graduate-student centered by design, GradFUTURES is a dynamic hub that empowers graduate scholars, researchers, and leaders to succeed in graduate school and craft futures that are fully their own. Vision, Mission & Values Find both context and inspiration in the shared vision for professional development at Princeton that unites us in all that we do. Five Pillars of GradFUTURES Strategy Learn about our professional development model, which emphasizes transferable skills, individualized pathways, and lifelong career optionality. An integrative approach that activates possibilities Professional development at Princeton is as diverse and multifaceted as our scholarly community—and it begins on day one. A broad range of programming emphasizes the in-demand skills and insights that open doors and create optionality within and beyond the academy. Recognizing the unique needs of graduate students, GradFUTURES programs and experiences are also designed to enhance one’s research and teaching while at Princeton. Our Focus: Progressive learning and the acquisition of professional skills and interdisciplinary competencies Exposure to diverse Ph.D. pathways , emerging fields, and trends across fields Bespoke immersive experiences and experiential opportunities Transformative connections between graduate students, alumni, and industry leaders Learn more about the framework “Graduate student professional development helps students build important professional skills which serve as a catalyst for interdisciplinary collaboration, creativity, and innovation. By cultivating connections between our graduate students, faculty, alumni, and partners within Princeton’s Innovation Ecosystem, we are building on-ramps to a diverse array of career paths including entrepreneurship.\" – Rodney D. Priestley , Dean of the Graduate School, Pomeroy and Betty Perry Smith Professor of Chemical and Biological Engineering “My advice for graduate students at Princeton is to take advantage of the university's extensive resources and network. There are many offices on campus, such as GradFUTURES, that are dedicated to developing students' academic, professional, and personal development skills. The knowledge that you gain from their programs can clarify and complement your intended career path. GradFUTURES has helped me build confidence in my soft skills, learn about various career paths, and connect me to some amazing individuals.” – Camila Llerena-Olivera , GS, CEE Calls to Action on Graduate Student Professional Development A Drive for Transformation Nearly all scholarly and professional associations—including the Council of Graduate Schools (CGS) and the Association of American Universities (AAU)—have called for a transformation in graduate student professional development, focusing on career diversity. Princeton's efforts to reimagine graduate student professional development have been informed by national trends as well as a comprehensive self-study described in Task Force on the Future of the Graduate School Report, 2015 . Key Recommendations: Shifting institutional culture to expose graduate students to the diverse array of pathways within and beyond the academy Increasing the transparency of outcomes data and relabeling categories to equitably recognize the range of Ph.D. outcomes across industries Improving curricular and co-curricular efforts that build professional competencies and support successful progression across fields “Some may believe that graduate school is great to advance one’s knowledge and personal growth, but that the expertise it fosters verges on the kind of specialization that might prove too narrow in the professional world. This sort of credence is especially widespread when it pertains to certain fields, like the Humanities. More than mere ‘mythbusters', the leadership and opportunities promoted by GradFUTURES provide students with invaluable practical tools that will help them magnify their professional potential.\" – André Benhaïm , Professor, Director of Graduate Studies, Department of French & Italian Let’s Connect Have an idea? Interesting in collaborating with GradFUTURES to create programs and experiences for graduate students? We are always interested in connecting with like-minded champions of gradute professional development! Reach out Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
  },
  {
    "id": 2,
    "data": "2024-05-17T19:43:13.152301",
    "url": "https://fed.princeton.edu/cas/login?service=https%3A//gradfutures.princeton.edu/casservice%3Freturnto%3D/meet-gradfutures-team",
    "university_name": "Princeton University",
    "title": "",
    "content": "CAS gradfutures_princeton_edu gradfutures.princeton.edu Central Authentication Service NetID NetID is a required field. Password: Toggle Password Password is a required field. CAPSLOCK key is turned on! Login Change my Password or Get Help By proceeding to access and use University computing and network resources through this sign-on,\n   you agree to abide by applicable laws and University policies in your use of these resources.\n  The University's right to access, preserve, and review information stored on or transmitted through\n   these resources is described in the Access to Accounts Policy . For security reasons, please log out and exit your web browser when you are done accessing services that require authentication! © 2023 The Trustees of Princeton University"
  }
]