[{"id": 6, "data": "2024-05-14T23:46:07.330841", "url": "https://umich.edu/", "university_name": "University of Michigan", "title": "", "content": "Skip global navigation University of Michigan Report Sexual Misconduct, Discrimination and Harassment Search for: Search Quick Links Academic Calendar Canvas Directory Email Email — UMHS Library Catalog Maps & Directions Schools & Colleges Wolverine Access For: Prospective Students Current Students Faculty & Staff Parents Alumni Main Menu Home About Academics Life at Michigan Athletics Research Health & Medicine Initiatives Giving Featured Stories Filmmaker Roams the World for a Good Story LSA alumna Maureen Gosling has led the life of an adventurous independent documentary filmmaker for the past 50 years. Her newest film features a Detroit-born singer and activist. Learn more about her story Hail! Class of 2024 Spring Commencement speaker Brad Meltzer told University of Michigan graduates to draw upon the magic in their lives as they enter the world and continue to grow and transform into the best versions of themselves. Congratulations to all of the U-M students who earned their degrees this spring! Go Blue! Learn more about the ceremony Go Blue! “Wherever you go, the best part is that Michigan never leaves you... You’ll spot that Block M on someone and you'll whisper, without even thinking, those magic words: Go Blue.”\r\n—Brad Meltzer Watch the commencement address Building with Origami For the first time, load bearing structures like bridges and shelters can be made with origami modules—versatile components that can fold compactly and adapt into different shapes—University of Michigan engineers have demonstrated. Learn more about this technology 19 schools and colleges — see complete list see complete list More than 275 degree-programs U-M Research: $1.86 billion in research expenditures (FY2023) Planet Blue Campus | Students, staff and faculty collaborating together to advance sustainability, university-wide. News News U-M releases high-level preview of Campus Plan 2050 Managing screen time by making phones slightly more annoying to use Laurence Alexander recommended as UM-Flint chancellor Researchers receive Javits Award for work on stroke health disparities in Mexican Americans ER screening tool can help identify youth at risk of experiencing firearm violence Visit Michigan News Visit Key Issues Public Engagement The Conversation: How cannabis, psilocybin might help Americans experiencing chronic pain 'Saturdays in the D' expands summer offerings for students and adults Q&A: Researchers hope new report fuels reproductive health care research involving minors The Conversation: Medicine doesn't just have 'conscientious objectors'—there are 'conscientious providers,' too The Conversation: 5 books to help you better understand today's campus protests In The News Marketplace A markets regulator is concerned about bets on election results ABC News 'It's a real thing': Drivers and passengers report motion sickness in EVs Bridge Michigan Michigan sheriff fought new 'red flag' gun law. Now he's using it ABC News Foreign terrorist organizations could target Pride month events: FBI, DHS View more In The News Videos University of Michigan 2024 Spring Commencement Recap Spring 2024 Honorary Degree Recipients 2024 MGoGrad: My Michigan Movie Watch More Videos Happening @ Michigan Events May 16 Featuring works by Saint Saens, Sibelius and Gade Life Sciences Orchestra Spring Concert Hill Auditorium May 20 Saltiel Life Sciences Symposium 2024: Celebrating 20 Years of Impact May 21 2024 CCAT Global Symposium on Mobility Innovation presented by Mcity and UMTRI May 15 Being Mixed Race in a Mono-racially Organized World May 18 Discovery Demo: A Whale’s Tale May 21 Saltiel Life Sciences Symposium 2024: Celebrating 20 Years of Impact May 22 2024 CCAT Global Symposium on Mobility Innovation presented by Mcity and UMTRI Visit Happening @ Michigan Academic Calendar May 27 Memorial Day (Holiday) Jun 19 Juneteenth (Holiday) Jun 24 Classes end (Spring Half) 5:00 pm Jun 25 Study Day Jun 26-27 Examinations Jun 28 Summer Half Term classes begin Jul 4 Independence Day (Holiday) View Complete Calendar Carpe Diem All Michigan, all the time There’s always something amazing happening at Michigan. Whether it’s on campus or around the world, our students, faculty, staff and alumni are out seizing the day. A sampling of images captured over the years is shown in the gallery below. 11:53 am 11:40 am 12:31 pm 12:30 pm 1:04 pm 2:54 pm 2:31 pm 2:18 pm 2:16 pm 2:54 pm 2:59 pm 3:38 pm 3:47 pm 3:05 pm 3:29 pm 3:36 pm 4:01 pm 4:47 pm 4:35 pm 4:47 pm 4:49 pm 5:33 pm 5:45 pm 6:35 pm 8:10 pm 10:27 pm 11:59 pm 11:01 pm 11:34 pm 11:33 pm University of Michigan Ann Arbor Dearborn Flint © 2024 The Regents of the University of Michigan 500 S. State Street, Ann Arbor, MI 48109 USA Privacy Notice Phone +1 (734) 764-1817 Contact us Careers Portal en Español 密西根大学 Português खबरें हिंदी में facebook X (twitter) youtube instagram linkedin"}
,
{"id": 6, "data": "2024-05-14T23:46:18.434263", "url": "https://regents.umich.edu/", "university_name": "University of Michigan", "title": "The Regents of the University of Michigan", "content": "Skip to main content Board of Regents Search Regents Meetings Archives Governance, Bylaws & Policies Vice President and Secretary of the University menu Board of Regents Regents + Jordan B. Acker Michael J. Behm Mark J. Bernstein Paul W. Brown Sarah Hubbard Denise Ilitch Ron Weiser Katherine E. White Meetings + Agendas Minutes Public Comments Email Public Comments Submit Memoirs & Memorials Archives Governance, Bylaws & Policies + University Leadership Bylaws Trademarks & Copyright Regents' Ordinance Announcements Vice President and Secretary of the University + Jon Kinsey Staff Diversity, Equity & Inclusion Search © 2019 The Regents of the University of Michigan Privacy Policy | Diversity, Equity & Inclusion The Regents of the University of Michigan Upholding U-M's mission to serve the people of Michigan and the world through preeminence in creating, communicating, preserving and applying knowledge, art and academic values, and in developing leaders and citizens who will challenge the present and enrich the future. About the Regents The University is governed by the Board of Regents, which consists of eight members elected at large in biennial state-wide elections. Learn more about the Regents Meetings see more meetings May 16 May 16, 2024 Regents' Meeting May 16, 2024 Jun 20 June 20, 2024 Regents' Meeting Jun 20, 2024 Jul 18 July 18, 2024 Regents' Meeting Jul 18, 2024 Sep 19 September 19, 2024 Regents' Meeting Sep 19, 2024 News see more news May 14, 2024 Regents shift May 16 meeting to a virtual format May 13, 2024 Laurence Alexander recommended as UM‑Flint chancellor Laurence B. Alexander, a recognized leader in higher education who for 11 years has served as chancellor of the … May 10, 2024 Board of Regents to meet virtually May 16 The Board of Regents will meet virtually at 3 p.m. May 16. Members of the public also will be able to watch a livestream … Office of the Vice President and Secretary 1109 Geddes Ave, Suite 3300 Ann Arbor, MI\n              48109-1079 734.763.5553 UM-Gateway Listing of Regents for U-M Publications Regents Contact © 2024 The Regents of the University of Michigan Produced by Michigan Creative, a unit of the Office of the Vice President for Communications"}
,
{"id": 6, "data": "2024-05-14T23:49:44.976836", "url": "https://ecrt.umich.edu/", "university_name": "University of Michigan", "title": "Ensuring Equal Opportunity for All", "content": "Skip to main content Homepage Get Help & Support Resources Supportive Measures Sexual & Gender-Based Issues Disability & Accessibility Qualified Individuals Accommodations Next Steps Outcomes Service & Support Animals ASL & CART Services Digital Accessibility Presentations & Trainings Forms Contact/Request Civil Rights Discrimination Pregnancy & Parenting Policies File a Report Reporting Form Individuals with Reporting Obligations (IRO) Responding to Disclosures Resolution Options Adaptable Resolution Process Mediation Services Mediation Consultation Form Prevention Education (PEAR) Contact PEAR About Us Our Team DEI Contact Us Remote Office Hours Annual Reports Homepage Exit This site close menu Get Help & Support Resources Supportive Measures Sexual & Gender-Based Issues Disability & Accessibility Qualified Individuals Accommodations Next Steps Outcomes Service & Support Animals ASL & CART Services Digital Accessibility Presentations & Trainings Forms Contact/Request Civil Rights Discrimination Pregnancy & Parenting Policies File a Report Reporting Form Individuals with Reporting Obligations (IRO) Responding to Disclosures Resolution Options Adaptable Resolution Process Mediation Services Mediation Consultation Form Prevention Education (PEAR) Contact PEAR About Us Our Team DEI Contact Us Remote Office Hours Annual Reports Ensuring Equal Opportunity for All The University of Michigan’s Equity, Civil Rights, and Title IX Office provides support, resources and education to promote a safe and non-discriminatory learning, living and working environment for all members of the university community. Learn more about ecrt file a report scroll for more Statement from U-M’s Title IX Coordinator, Elizabeth Seney, on final rule under Title IX April 19, 2024 On April 19, the U.S. Department of Education released its “Final Rule” under Title IX, which prohibits discrimination on the basis of sex in education programs or activities receiving federal financial assistance. These amendments clarify the scope and application of Title IX and the obligations of recipients of federal financial assistance, including the University of Michigan, to provide an educational environment free from discrimination on the basis of sex, including through responding to incidents of sex discrimination. The university is currently reviewing the new regulations. Any changes to current U-M policies will be made with consideration of the university’s commitment to preventing and addressing discrimination, harassment, and sexual misconduct, and supporting equitable access for all members of our community. Changes will be announced broadly to the U-M community and general public prior to Aug. 1, when the final regulations go into effect. The U-M Equity, Civil Rights, and Title IX Office oversees, facilitates and supports the university’s efforts to ensure equal opportunity for all persons regardless of race, color, national origin, age, marital status, sex, sexual orientation, gender identity, gender expression, disability, religion, height, weight, or veteran status in employment, educational programs, and activities and admissions. FINAL RULE UNDER TITLE IX How to get help There are several confidential campus resources for students, faculty and staff that provide support and allow you to explore all your options for getting help. SEXUAL & GENDER-BASED MISCONDUCT DISABILITY & ACCESSIBILITY (ADA) CIVIL RIGHTS DISCRIMINATION How to report Wondering if you should make a report? Learn more about the reporting process, who can help you and how to make a report. file a report ECRT Leadership Tamiko Strickman Executive Director and Special Advisor to President Allison Kushner (she/her) Director of Disability Equity and ADA Coordinator Suzanne Quinn McFadden (she/her) Director for Intake and Support Deputy Title IX Coordinator Elizabeth Seney (she/her) Title IX Coordinator Sexual and Gender-Based Misconduct Director Tanesia White (she/her) Director for Civil Rights Kaaren Williamsen PEAR Director Meet the entire team The Equity, Civil Rights, and Title IX team is here to guide you through your options, answer your questions and help you address your concerns. Meet the team equity, civil rights & title ix 2030 Administrative Services 1009 Greene Street Ann Arbor, Michigan 48109-1432 734-763-0235 Contact Us Sitemap Get Help & Support Policies File a Report Resolution Options Adaptable Resolution Process Mediation Services Prevention Education (PEAR) About Us © 2024 Regents of the University of Michigan Produced by Michigan Creative , a unit of the Office of the Vice President for Communications"}
]