{
  "id": 4,
  "date": "2024-05-18T18:13:05.068046",
  "url": "https://undergrad.admissions.columbia.edu/academics/engineering",
  "university_name": "Columbia University",
  "title": "Main navigation",
  "content": "Columbia Undergraduate Admissions Open Search and Menu Main navigation Life at Columbia Our Community Being Here Beyond Columbia Student Wellness How to Apply Understanding the Process First-Year Applicants Transfer Applicants Combined Plan Applicants Visiting Students International Applicants Affordability & Aid Cost & Aid Cost Calculator Applying for Aid Academics Columbia College Columbia Engineering Outside the Classroom Visit Virtual Experiences Campus Visits Contact Us Secondary navigation News & Updates FAQ For Parents & Guardians For Counselors Follow Admissions on Social Media Columbia on Instagram Columbia Admissions on Twitter Facebook Group Columbia on YouTube Search Search for Open Search and Menu Breadcrumb Home Academics Columbia Engineering Since its founding in 1864, students and faculty at The Fu Foundation School of Engineering and Applied Science (Columbia Engineering) have made remarkable contributions to technological and social progress, pushing the frontiers of knowledge and discovery to meet the needs of our global society. Our undergraduates join a community of engineers who are committed to upholding a legacy of Engineering for Humanity —working together to create a more sustainable, healthy, connected, secure and creative world. Image Where engineers learn to solve and to lead. Through an undergraduate course of study that features a strong engineering foundation with a liberal arts core, you’ll become a 21st century engineer, leader and innovator. Making the most of the dynamic community and extensive resources of a major research university, you’ll prepare to confront complex issues and find groundbreaking solutions to the grand challenges of our time. Engineering Undergraduate Experience Hear from students and faculty about the engineering experience here at Columbia University, an educational experience, which begins with our philosophy of hands on experience in our Art of Engineering class and our famed Core Curriculum. Areas of study Columbia Engineering students develop a powerful technical foundation, drawn from 17 exciting areas of study. And our undergraduate experience is further enriched by more than 20 liberal arts minors and more than 15 engineering minors. Explore Areas of Study student: I came to Columbia so I could be an engineer who also was aware of social institutions and histories that shaped the world today. This enhances my knowledge of the world and makes me a more ethical engineer who can truly make the world a better place for all. Aryn D. Hurst, TX Computer Science, Minor in Entrepreneurship and Innovation, Minor in Sociology Student Research Program There are many opportunities for Columbia Engineering students to be involved in research with faculty—on campus, during summer programs and abroad. No matter where they are, our undergraduate students make significant contributions to the research community, receive awards and prizes, are featured in the news and have research published. Explore Research Image Image Quick Links Columbia Engineering Home Engineering Undergraduate Experience Areas of Study Engineering for Humanity Internships Whether you engage with Columbia alumni, attend On-Campus Recruiting events or get professional guidance at the Center for Career Education, you will be set up for success. Advising Columbians have a community of support: learn about the network of advisers at Columbia that invests in your success both inside and outside the classroom Global Experiences Look at any aspect of our community and you'll see that our students are engaged both academically and experientially with the larger world—on campus, across our city and around the globe. Outcomes Whether pursuing an extraordinary job opportunity or an elite graduate program, Columbia students graduate prepared with the skills and knowledge to succeed—no matter what their next steps might be. Visit How to Apply Affordability & Aid In This Section Engineering Undergraduate Experience Areas of Study Engineering for Humanity Columbia Undergraduate Admissions Main navigation Life at Columbia How to Apply Affordability & Aid Academics Visit Secondary navigation News & Updates FAQ For Parents & Guardians For Counselors Footer menu Privacy Policy Terms of Use Accessibility University Policies Mailing List 212 Hamilton Hall Mail Code 2807 1130 Amsterdam Avenue New York, NY 10027 212-854-2522 ugrad-ask@columbia.edu Schools Columbia College Columbia Engineering Columbia University Columbia on Instagram Columbia Admissions on Twitter Facebook Group Columbia on YouTube"
}