{
  "id": 4,
  "date": "2024-05-18T18:14:43.928451",
  "url": "https://www.cs.columbia.edu/achievements/",
  "university_name": "Columbia University",
  "title": "Faculty Achievements",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence Faculty Achievements Faculty Awards and Honors Test of Time Awards for Research Teaching and Mentoring Awards Faculty Professional Service S Faculty Awards and Honors Association for Computing Machinery (ACM) ACM A.M. Turing Award: Aho (2021) ACM Distinguished Service Award: Wing (2014) ACM-EATCS Gödel Prize: Chen (2021), Papadimitriou (2012), Roughgarden (2012) ACM-Infosys Foundation Award for the Computing Sciences: Blei (2013) ACM Grace Murray Hopper Award: Roughgarden (2009), Stroustrup (1993) ACM Paris Kanellakis Theory and Practice Award: Vapnik (2009) ACM SIGCHI Lifetime Research Award: Feiner (2018) ACM SIGCOMM Lifetime Achievement Award: Schulzrinne (2022) ACM UIST Lasting Impact Award: Feiner (2010) ACM/ACT Distinguished Service Award: Wright (2019) National Academy of Engineering Aho (1999), Bellovin (2001), Galil (2004), Hirschberg (2017), Nayar (2008), Papadimitriou (2002), Stroustrup (2004), Traub (1985), Vapnik (2006), Wing (2024), Yannakakis (2011) National Academy of Sciences Aho (2022), Papadimitriou (2009), Pitassi (2022), Yannakakis (2018) American Academy of Arts and Sciences Aho (2003), Hirschberg (2018), McKeown (2019), Nayar (2011), Papadimitriou (2001), Wing (2010), Yannakakis (2020) American Philosophical Society Hirschberg (2014), McKeown (2022) National Academy of Inventors Nayar (2014), Chang (2022), Wing (2022) Royal Society of Canada Fellows Aho (2013) Anita Borg Women of Vision Award McKeown (2010) Charles Stark Draper Prize for Engineering (NAE) Stroustrup (2018) Computing Research Associates (CRA) Awards CRA Distinguished Service Award: Traub (1992), Wing (2011) Faraday Medal (IET) Papadimitriou (2019), Stroustrup (2017) Harvey Prize Papadimitriou (2019) IEEE Awards IEEE Centennial Medal: Unger (1984) IEEE Computer Society Charles Babbage Award: Papadimitriou (2004) IEEE Computer Society Computer Entrepreneur Award: Stroustrup (2004) IEEE Computer Society Computer Pioneer Award: Stroustrup (2018) IEEE Computer Society Helmholtz Award: Belhumeur and Nayar (2019) IEEE Computer Society Women of ENIAC Computer Pioneer Award: Yung (2021), Papadimitriou (2022) IEEE Computer Society W. Wallace McDowell Award: Yung (2018) IEEE James L. Flanagan Speech and Audio Processing Award: Hirschberg (2011) IEEE Internet Award: Schulzrinne (2016) IEEE Millenium Medal: Unger (2000) IEEE Emanuel R. Piore Medal: Traub (1991) IEEE William Terry Lifetime Distinguished Service Award: Schulzrinne (2010, 2011) IEEE Kiyo Tomiyasu Award: Chang (2009) IEEE John von Neumann Medal: Aho (2003), Papadimitriou (2016), Vapnik (2017) IEEE TCSE Award for Rising Star in Software Engineering: Ray (2022) IEEE Virtual Reality Academy: Feiner (2022) IEEE Innovation in Societal Infrastructure Award: McKeown (2023) Knuth Prize (ACM/IEEE) Papadimitriou (2002), Yannakakis (2005) Kolmogorov Medal Vapnik (2018) NEC C&C Foundation Award Aho (2017) John Scott Award Stroustrup (2018) AAAI Fellows Hirschberg (1994), McKeown (1994), Waltz (1990) American Association for the Advancement of Science (AAAS) Fellows Aho (1986), Chang (2010), Traub (1971), Unger (1989), Wing (2007) American Mathematical Society Fellows Traub (2012) Association of Computational Linguistics (ACL) Fellows Collins (2011), Hirschberg (2011), McKeown (2011) ACM Fellows Aho (1996), Blei (2015), Chang (2017), Coffman (1994), Feiner (2018), Hirschberg (2015), McKeown (2003), Misra (2018), Nieh (2019), Papadimitriou (2002), Pitassi (2018), Roughgarden (2023), Schulzrinne (2014), Stein (2012), Stolfo (2019), Stroustrup (1993), Traub (1994), Waltz (1999), Yannakakis (1998), Yung (2013), Wing (1998) European Association for Theoretical Computer Science (EATCS) Fellows Yung (2017) Fields Research Fellows Grinspun (2018) Guggenheim Fellowship Blei (2017), Nieh (2021), Roughgarden (2017), Unger (1967) IEEE Fellows Aho (1988), Carloni (2017), Chang (2004), Coffman (1984), Feiner (2018), Hirschberg (2017), Keromytis (2018), Misra (2016), Nieh (2019), Nowick (2009), Rubenstein (2019), Schulzrinne (2006), Stolfo (2018), Stroustrup (2005), Unger (1976), Yung (2015), Wing (2003) Institute of Mathematical Statistics Fellows Blei (2017) International Association for Cryptologic Research (IACR) Fellows Yung (2014) International Speech Communication Association (ISCA) Fellows Hirschberg (2008) Internet Hall of Fame Schulzrinne (2013) Computer History Museum Fellow Stroustrup (2015) National Cyber Security Hall of Fame Bellovin (2014) Packard Foundation Fellowships Nayar (1992), D. Pe’er (2009), Ross (1993) Simons Investigators Blei (2019) SIAM Fellows Traub (2009) Alfred P. Sloan Foundation Fellowships Blei (2010), Carloni (2008), Chen (2012), Ciocarlie (2016), Collins (2004), Geambasu (2016), Grinspun (2010), Gross (1973, Mathematics), Hsu (2016), Nowick (1995), Ross (1994), Roughgarden (2006), Servedio (2005), Sethumadhavan (2013), Song (2022), Stein (1999), Yang (2012), Yuen (2022), Zhou (2017) European Assocation for Theoretical Computer Science (EATCS) Presburger Award Chen (2015) John von Neumann Theory Prize Papadimitriou (2023), Yannakakis (2023) Prize in Game Theory and Computer Science in Honour of Ehud Kalai Papadimitriou (2008), Roughgarden (2023) The Okawa Foundation for Information and Telecommunications Okawa Prize Nayar (2022) AAAI Distinguished Service Award Waltz (2011) ACM SIGMETRICS Rising Star Award Chaintreau (2013) IEEE Intelligent Systems AI’s 10 To Watch Bareinboim (2016), Hsu (2016) Air Force Office of Scientific Research (AFOSR): Young Investigator Award Yang (2012) Borg Early Career Award (CRA-W) Kim (2016) Burroughs Wellcome Career Award Y. Erlich (2013), D. Pe’er (2007) DARPA: Young Faculty Award Bareinboim (2023), Blumberg (2010), Erlich (2017) Department of Energy: Early Career Principal Investigator Awards Misra (2002), Nieh (2003) IBM Faculty Awards: FA (faculty development, partnership), SUR (equipment) Chang (1995, 1999), Feiner (2003), Hirschberg (2005), Jebara (2013), Kaiser (1988, 1992, 1998), Malkin (2004), McKeown (1985-86, 2005), Misra (2002, 2007), Nieh (2000, SUR; 2004, SUR+FA; 2006, 2008, 2011, 2012), Ray (2019), Rubenstein (2004), Schulzrinne (1997), Stolfo (1983) IEEE CEDA Early Career Award Carloni (2012) IEEE VGTC (Visualization and Graphics Technical Committee) Virtual Reality Career Award Feiner (2014) International Speech Communication Association (ISCA) Awards Medal for Scientific Achievement: Hirschberg (2011) ISCA Special Service Medal : Hirschberg (2020) American Association for Artificial Intelligence Fellows Hirschberg (1994), McKeown (1994) National Science Foundation: Young Investigator Awards CAREER: Alman (2023), Bareinboim (2018), Bishop (2016), Blei (2008), Blumberg (2012), Carloni (2006), Chaintreau (2013), Chang (1995), Chen (2012), Collins (2004), Edwards (2002), Geambasu (2014), Gravano (1998), Grinspun (2007), Gu (2023), Jana (2019), Jebara (2004), Kim (2013), Knowles (2022), Malkin (2004), Misra (2003), Nieh (2001), Nowick (1995), D. Pe’er (2012), I. Pe’er (2009), Ray (2019), Rubenstein (2002), Schulzrinne (2000), Servedio (2004), Sethumadhavan (2011), Smith (2024), Song (2022), Stein (1996), Vondrick (2021), Weinstein (2019), Wu (2019), Yang (2011), Yuen (2022), Zheng (2015), Zhou (2016) NYI: Nayar (1991), Ross (1994) PYI: Allen (1987), Kaiser (1988), Kender (1984), McKeown (1985) Research Initiation Award (RIA): Nayar (1991), Nowick (1993), Ross (1992) Office of Naval Research: Young Investigator Awards Bareinboim (2022), Blei (2011), Carloni (2010), Chang (1998), Feiner (1991), Roughgarden (2007), Zemel (1998) NIH Awards NIH Director’s New Innovator Award: D. Pe’er (2007) NIST/NSA Awards National Computer Systems Security Award: Bellovin (2007) NY Academy of Sciences: Blavatnik Award for Young Scientists Blei (2013, Regional Winner), Collins (2012, Regional Finalist) Popular Science “Best of What’s New” Award Stolfo (2016) Popular Science “Brilliant 10” Award Geambasu (2014), Grinspun (2011) Popular Science “Top 10 Inventions” Award Nayar (2016) Presidential Early Career Awards for Scientists and Engineers (PECASE) Belhumeur (1997), Blei (2011), Roughgarden (2007), Zhou (2019) “30 under 30” Innovators in Science and Healthcare [Forbes Magazine] Lewko (2014), Zheng (2012) Edward O. Wilson Biodiversity Technology Pioneer Award Belhumeur (2011) ACM Distinguished Members Distinguished Scientist: Keromytis (2012) CATT (Center for Advanced Technology in Telecommunications) Awards Lifetime Innovation Award: Schulzrinne (2007) CHI (Computer-Human Interface) Academy Feiner (2011) Mayor’s Award for Excellence in Science and Technology (NYC) Schulzrinne (2004), Traub (1999) National Academies Boards Computer Science and Telecommunications Board (CSTB) Chair: Traub (2005-2009), Wing (2004-2005) Founding Chair: Traub (1986-1992) Computer Science and Telecommunications Board (CSTB) Committees Trust in Cyberspace: Bellovin (1999) Authentication and Privacy: Bellovin (2003) Toward a Safer and More Secure Cyberspace: Bellovin (2007) Intelligence Science and Technology Experts Group (ISTEG) under Office of Director of National Intelligence (ODNI): Stolfo (2016) Naval Studies Board Comittees Information Assurance: Stolfo (2008) Panel on Digitization and Communications Science: Stolfo (2012) National University Start-Up Competition 1st Place: StackSafe, Inc.: Keromytis , Stolfo (2008) Fellows of the New York Academy of Sciences: Traub (1999) Privacy and Civil Liberties Oversight Board (PCLOB) Technology Scholar: Bellovin (2016) Lifetime Entrepreneurial Award: Yemini (2007) Distinguished Alumni Award Misra (IIT Bombay, 2019; UMass Amherst, College of Engineering, distinguished young alumnus, 2014), Nayar (CMU, alumni achievement award, 2009) Honorary Doctorate Degrees Aho (University of Toronto, 2015; University of Waterloo, 1992; University of Helsinki, 1986) Hirschberg (Tilburg University, The Netherlands, 2018; KTH, the Royal Institute of Technology, Sweden, 2007) Papadimitriou (University of Paris, Dauphine, 2015; EPFL, 2013; National Technical University of Athens, 2012; University of Patras, 2010; University of Cyprus, 2008; University of Athens, 2004; University of Macedonia, 2003; ETH Zurich, 1997) Schulzrinne (University of Oulu, 2022) Stroustrup (University Carlos III, 2019; National Research University, ITMO, St. Petersburg, Russia, 2013) Traub (University of Central Florida, 2001) Wozniakowski (Friedrich-Schiller-University, Jena, Germany, 2008) Other Alcoa Faculty Fellowship: Nayar (1992) ACM Outstanding Contribution Award: Coffman (1987) ACM Sigmetrics Achievement Award: Coffman (2002, first awardee) ACM SIGMM Technical Achievement Award: Chang (2011) ACM SIGMOBILE Rockstar Award: Zhou (2019) AT&T Bell Laboratories PYI Matching Award: Kender (1985) AT&T Fellow: Bellovin (1998), Stroustrup (1996) BBVA Frontiers Award: Vapnik (2020) Bell Lab Fellows: Aho (1984), Stroustrup (1993), Yannakakis (1997) Bell Labs President’s Gold Award: Yannakakis (2000) BNR Young Faculty Award: Kaiser (1990) CERTH Scientific Advisory Board (Greece): Keromytis (2008) DEC Young Faculty Award: Kaiser (1986) EATCS Award: Papadimitriou (2015), Yannakakis (2020), Pitassi (2021) Esquire Magazine, Best and Brightest Award: Jebara (2008) Fast Company “Most Creative People (in Business + Innovation)”: Grinspun (2013) Ford Motor Company PYI Matching Award: Kender (1985) Harold Larnder Prize: Coffman (2011) Humboldt Foundation, Distinguished Senior Scientist Award: Traub (1992) IBM Postdoctoral Fellow: Gross (1972, mathematical sciences) IEEE Communications Society Technical Committee on Computer Communications – Outstanding Service Award: Schulzrinne (2005) Internet2 Advisory Council: Schulzrinne (2008) Katayanagi Prize: Papadimitriou (2008) Marconi Society, Board of Directors: Traub (2008) NVIDIA Pioneers of AI Award: Zemel (2016) NSF Faculty Award for Women: McKeown (1991) NTT Distinguished Scientific Achievement Award: Nayar (1994) Outstanding Woman Scientist, NY Association of Women in Science: McKeown (2000) Polish Academy of Sciences member: Wozniakowski (2008) Rockwell Trust PYI Award: Allen (1989) Rodriguez Family Junior Faculty Development Award: Kim (2013) Sigma Xi Young Investigator Award: Nieh (2004) Stanislaw Mazur Award of the Polish Mathematical Society: Wozniakowski (1988) Tucker Prize: Roughgarden (2003) Usenix Lifetime Achievement Award (“The Flame”): Bellovin (1995) VON Pioneer Award: Schulzrinne (2000) Xerox Young Faculty Award: Kaiser (1988) Test of Time Awards for Research 39th IEEE International Conference on Software Maintenance and Evolution (ICSME ’23) An Empirical Study of API Stability and Adoption in the Android Ecosystem by Tyler McDonnell, Baishakhi Ray , and Miryung Kim International Conference on Machine Learning (ICML ’23) Learning Fair Representations by Rich Zemel , Yu Wu, Kevin Swersky, Toni Pitassi , Cynthia Dwork The International Geometry Summit 2023 (IGS’23) Discrete Laplace Operators: No Free Lunch by Max Wardetzky, Saurabh Mathur, Felix Kälberer, and Eitan Grinspun 21st IEEE International Symposium on Mixed and Augmented Reality (ISMAR 2022) Perceptual Issues in Augmented Reality Revisited by Ernst Kruijff, J. Edward Swan, and Steven Feiner ACM Special Interest Group on Economics and Computation (ACM SIGecom 2022) The Complexity of Computing a Nash Equilibrium by Constantinos Daskalakis, Paul W. Goldberg, and Christos H. Papadimitriou Settling the complexity of computing two-player Nash equilibria by Xi Chen , Xiaotie Deng, and Shang-Hua Teng 35th Neural Information Processing Systems (NeurIPS 2021) Online Learning for Latent Dirichlet Allocation by Matthew D. Hoffman, David Blei , and Francis Bach 27th SIGKDD Conference on Knowledge Discovery and Data Mining (KDD2021) Collaborative Topic Modeling for Recommending Scientific Articles by Chong Wang and David Blei 61st IEEE Symposium on Foundations of Computer Science (FOCS 2020) How Bad is Selfish Routing? by Tim Roughgarden and Eva Tardos IACR International Conference on Practice and Theory of Public-Key Cryptography (PKC2020) On the Security of ElGamal Based Encryption by Yiannis Tsiounis & Moti Yung 41st IEEE Symposium on Security and Privacy (IEEE S&P 2020) Cryptovirology : Extortion-Based Security Threats and Countermeasures by Adam Young & Moti Yung ACM Conference on Computer and Communications Security (ACM CCS 2019) Hey, You, Get Off of My Cloud: Exploring Information Leakage in Third-Party Compute Clouds by Thomas Ristenpart, Eran Tromer , Hovav Shacham, Stefan Savage International Conference on Computer Vision (ICCV 2019) Attribute and Simile Classifiers for Face Verification by Neeraj Kumar, Alexander C. Berg, Peter Belhumeur, Shree Nayar IEEE International Symposium on Mixed and Augmented Reality (IEEE ISMAR 2019) Evaluating the Benefits of Augmented Reality for Task Localization in Maintenance of an Armored Personnel Carrier Turret by Steven J. Henderson and Steven Feiner IEEE Symposium on Security and Privacy (IEEE SP 2019) Encrypted Key Exchange: Password-Based Protocols Secure Against Dictionary Attacks by Steve Bellovin and Michael Merritt Very Large Data Bases (VLDB 2018) WebTables: Exploring the Power of Tables on the Web by Michael J. Cafarella, Alon Halevy, Zhe Daisy Wang, Eugene Wu , Yang Zhang North American Chapter of the Association for Computational Linguistics (NAACL 2018) Discriminative Training Methods for Hidden Markov Models: Theory and Experiments with Perceptron Algorithms by Michael Collins IEEE International Conference on Computer Communications (IEEE INFOCOM 2018) An Analysis of the Skype Peer-to-Peer Internet Telephony Protocol by Salman Baset and Henning Schulzrinne International Symposium on Wearable Computers (ISWC 2017) A Touring Machine: Prototyping 3D Mobile Augmented Reality Systems for Exploring the Urban Environment by Steven Feiner , Blair MacIntyre, Tobias Höllerer, Anthony Webster International Symposium on Research in Attacks, Intrusions and Defenses (RAID 2017) Anomalous Payload-based Network Intrusion Detection by Ke Wang and Salvatore Stolfo International Conference on Machine Learning (ICML 2016) Dynamic Topic Models by David Blei and John D. Lafferty ACM Special Interest Group on Information Retrieval (SIGIR2015) Honorable Mention Modeling Annotated Data by David Blei and Michael I. Jordan ACM Symposium on User Interface Software and Technology (UIST’10) Windows on the World: 2D Windows for 3D Augmented Reality by Steven Feiner , Blair MacIntyre, Marcus Haupt, Eliot Solomon Teaching and Mentoring Awards Columbia University Presidential Teaching Award Cannon (2016), Malkin (2019), Servedio (2013) Great Teacher Award: Society of Columbia Graduates Aho (2003), Cannon (2016), Gross (1994), Kender (1996), McKeown (2010), Nayar (2006), Servedio (2020) Columbia Engineering School (SEAS) Alumni Distinguished Faculty Teaching Award Aho (2014), Blaer (2018), Cannon (2002), Drinea (2019), Gravano (2012), Hirschberg (2009), Kender (2000), Lee (2016), Nayar (2015), Nieh (2004), Nowick (2011), Ross (2008), Servedio (2010) Edward and Carole Kim Award for Faculty Involvement Kim (2015) SEAS Outstanding Instructor Award Gross (1991-92, 1993-4) Department of Computer Science Distinguished Teaching Award Cannon (2009), Servedio (2010), Gravano (2011) Keck Foundation Engineering Teaching Excellence Award Nayar (1995) Faculty Mentorship Award: Graduate Student Council Feiner (2009) Faculty Professional Service Editorial Positions (since 2000) Alfred Aho Associate Editor, Journal of Computer and System Sciences (1981-2014) Peter Allen Associate Editor, IEEE Transactions on Robotics and Automation (1998 – 2003) Editorial Board Member, Autonomous Robots (1997 – 2004) Elias Bareinboim Editor-in-Chief, Journal of Causal Inference (2023–present) Peter Belhumeur Associate Editor, IEEE Pattern Analysis and Machine Intelligence (1999 – 2004) Steven Bellovin Associate Editor, IEEE Transactions on Secure and Dependable Computing (2004 – ) David Blei Editor-In-Chief, Journal of Machine Learning Research (2018–present) Andrew Blumberg Editor, Journal of Applied and Computational Topology (2018 – ) Associate Editor, Advances in Mathematics (2015 – ) Editor, Journal of Applied and Computational Topology (2013 – ) Editor, International Mathematics Research Notices Luca Carloni Associate Editor, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (2014 – ) Associate Editor, ACM Transactions in Embedded Computing Systems (2006 – 2013) Associate Editor, Sustainable Computing:  Informatics and Systems (2010 – 2013) Associate Editor, IEEE Transactions on Industrial Informatics (2008 – 2010) Shih-Fu Chang Associate Editor, ACM Book Series (2013 – ) Steven Feiner Associate Editor, ACM Transactions on Computer-Human Interaction (2013 – ) Editorial advisory board member, Computers & Graphics (Elsevier) (2008 -) Editorial Board Member, Springer (formerly Kluwer) International Series on Human-Computer Interaction (2002 – 2013, 2015 -) Associate Editor, ACM Transactions on Graphics (1995 – 2004) Editorial Board Member, Virtual Reality (Journal of the Virtual Reality Society) (1994 -) Editorial Board Member, IEEE Transactions on Visualization and Computer Graphics (1994 – 2000) Zvi Galil Editor-in-chief, Journal of Algorithms (1988 – 2003) Luis Gravano Associate Editor, ACM Transactions on Database Systems (2004 – 2010) Associate Editor, ACM Transactions on Information Systems (1997 – 2005) Associate Editor, IEEE Data Engineering Bulletin (2000 – 2002) Associate Editor, ACM SIGMOD Digital Symposium Collection (“DiSC”) (1998-2001) Jonathan Gross Associate Editor, CRC Press Series on Discrete Mathematics (1997 – ) Julia Hirschberg Co-editor-in-chief, Speech Communication (2003 – 2006) Editor-in-chief, Computational Linguistics (1993 – 2003) Editorial Board, Speech Communication (1993 – ) Daniel Hsu Associate Editor, ACM Transactions on Algorithms Tony Jebara Associate Editor, IEEE Transactions on Pattern Analysis and Machine Intelligence (2010 -) Action Editor, Journal of Machine Learning Research (2009 -) Action Editor, Machine Learning Journal (2007 -) Editorial Board Member, Machine Learning Journal (2004 -) Gail Kaiser Editorial Board Member, World Wide Web: Internet and Web Information Systems (Kluwer Academic Publishers) (1998 – 2004) Editorial Board Member, Software Process Improvement and Practice (Wiley & Sons) (1996 – 2003) Editorial Board Member, IEEE Internet Computing (1996 – 2003) Angelos Keromytis Associate Editor, IEE Proceedings – Information Security (2005 -) Associate Editor, ACM Transactions on Information and System Security (“TISSEC”) (2004 -) Martha Kim Associate Editor, Computer Architecture Letters (2016 – 2019) Associate Editor, ACM Transactions on Architecture and Code Optimization (2017 – ) Tal Malkin Associate Editor, Theory of Computing Journal (“ToC”) (2004 – ) Vishal Misra Associate Editor, Journal of the Association of Computing Machinery (JACM) (2013 -) Associate Editor, Elsevier Journal of Performance Evaluation (2009 -) Associate Editor, IEEE/ACM Transactions on Networking (2008 -) Shree Nayar Editorial Board Member, International Journal of Computer Vision (2000 -) Associate Editor, Pattern Recognition Journal (1995 – 2003) Board Member, Scientific Board of the International School on Robotics Science Jason Nieh Guest Editor, Special Issue on Microservices and Containers, IEEE Internet Computing, (November – December 2019) Member, Editorial Board, IEEE Internet Computing (2008 – 2010) Guest Editor, Special Issue on Virtual Machines, IEEE Pervasive Computing, (October – December 2009) Member, Editorial Board, Computer Networks Journal (COMNET) (2006 – 2008) Steven Nowick Associate Editor, ACM Journal on Emerging Technologies in Computing Systems (“JETC”) (2010 – 2015) Associate Editor, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (“TCAD”) (2003 – 2011) Associate Editor, IEEE Transactions on VLSI Systems (“TVLSI”) (2001 – 2007) Kenneth Ross Area Editor, Information Systems (2001 -) Henning Schulzrinne Associate Editor, Computer Communications (2009 – 2012) Associate Editor, Foundations and Trends in Networking (2005 – 2018) Associate Editor, ACM Transactions on Multimedia Computing (2005 – 2010) Associate Editor, ACM/IEEE Transactions on Networking (2000 – 2008) Associate Editor, IEEE Transactions on Image Processing (1999 – 2000) Associate Editor, Journal of Communications and Networks (1998 – 2001)/Division Editor (2001 – 2004) Editorial Board Member, IEEE Communication Surveys (1996 – 2000) Rocco A. Servedio Editorial Board Member, ACM Transactions on Computation Theory (2008 -) Editorial Board Member, Algorithmica (2007 -) Editorial Board Member, Machine Learning Journal (2006 – 2008) Action Editor, Journal of Machine Learning Research (2005 -) Simha Sethumadhavan Associate Editor, IEEE Computer Architecture Letters (2016 -) Guest Editor, IEEE Journal on Emerging and Selected Topics (June 2014) Guest Editor, IEEE Micro Magazine, Special Issue on Security (May 2019) Edward Shortliffe Editor-in-chief, Journal of Biomedical Informatics (2001 -) Salvatore Stolfo Editorial Board Member, IEEE Security and Privacy Magazine (2005 -) Editorial Board Member, Journal on Knowledge Discovery and Data Mining (1995 – 2007) Associate Editor, Journal of Intelligent Information Systems Joseph Traub Editor-in-chief, Journal of Complexity (1985 -) Associate Editor, Complexity (1995 -) David Waltz Associate Editor, IEEE Intelligent Systems (1998 -) Omri Weinstein Member of Editorial Board, Theory of Computing (ToC) Journal (2020 -) Henryk Wozniakowski Editor, Journal of Complexity (1998 -) Member Of Editorial Board, Numerical Algorithms (French journal) (1992 -) Member Of Editorial Board, Matematyka Stosowana (Applied mathematics Advisory Board Member, Foundation of Computational Mathematics (2000 -) Eugene Wu Associate Editor, Very Large Databases Conference (VLDB) (2021) Mihalis Yannakakis Editor-in-chief, SIAM Journal on Computing (1998 – 2003) Society/Board Chairships Shih-Fu Chang Chair, ACM Special Interest Group on Multimedia (2013 ‐ 2017) Julia Hirschberg President, International Speech Communication Association (2005 – ) IEEE Signal Processing Society Fellow Evaluating Committee (Vice-Chair, 2020 – 21, 2020 – ) NAE Section 5 Vice-Chair (2019 – 2020) Vishal Misra Society Board Vice-Chair, ACM Sigmetrics (2011 – ) Henning Schulzrinne Vice-Chair, ACM SIGCOMM (2007 – 2013) Co-chair, Internet Technical Committee of the IEEE Communications Society (1994 – 2000) Chair, IEEE Communications Society Technical Committee on Computer Communications (1999 – 2001) Joseph Traub Chair, Computer Science and Telecommunications Board (of National Academies) (2005 – 2009) Richard Zemel NSERC Industrial Research Chair in Machine Learning, Natural Sciences and Engineering Research Council of Canada (2018 – ) Canada CIFAR AI Chair, Canadian Institute for Advanced Research (2020) Conference Chairships, Steering/Technical Committee Memberships (since 2000) Steven Bellovin Program Chair, IEEE Symposium on Security and Privacy (2002) Program Chair, Usenix Security (2000) Luca Carloni General Chair of Embedded Systems Week (“ESWEEK”) (2013) General Vice-Chair of Embedded Systems Week (“ESWEEK”) (2012) Program Co-Chair, International Conference on Formal Methods and Models for Codesign (“MEMOCODE”) (2010, 2012) Program Co-Chair, International Conference on Embedded Software (“EMSOFT”) (2010) Program Co-Chair, International Symposium on Networks-on-Chips (“NOCS”) (2010) Steering Committee Member, International Symposium on Networks-on-Chips (“NOCS”) (2009 – ) Program Co-Chair, IEEE Symposium on Industrial Embedded Systems (2009) Shih-Fu Chang Co‐Organizer, NSF Workshop on Multimedia Challenges and Research Directions for the Next 10 Years (2017) Stephen Edwards General Chair, IEEE/ACM International Workshop on Logic and Synthesis (2005) Steven Feiner General Co-Chair, ACM Symposium on Virtual Reality Software and Technology (“VRST”) (2008) General Chair, International Conference on INtelligent TEchnologies for interactive enterTAINment (2008) General Chair, ACM Symposium on User Interface Software and Technology (“UIST”) (2004) General Chair, IEEE Information Visualization (2001) Program Co-Chair, International Conference on the Foundations of Digital Games (“FDG”) (2012) Program Co-Chair, IEEE Virtual Reality (2012) Program Co-Chair, IEEE International Symposium on Wearable Computers (“ISWC”) (2003) Program Co-Chair, International Symposium on Mixed Reality (ISMR) (2001) Program Co-Chair, IEEE Virtual Reality (2000) Steering Committee, ACM Symposium on Virtual Reality Software and Technology (2004 – ) Steering Committee, IEEE Computer Society Technical Committee on Wearable Information Systems (2001 – ) General Co-Chair, IEEE International Symposium on Augmented Reality (“ISAR”) (2001) Steering Committee, IEEE/ACM International Symposium on Mixed and Augmented Reality (2000 – 2008, Emeritus 2008 -) Steering Committee, IEEE Symposium on Information Visualization (1997 – 2006) Luis Gravano Co-Chair, International Workshop on the Web and Databases (“WebDB”) (2004) Program Co-Chair, ACM Conference on Information and Knowledge Management (“CIKM”) (2004) Eitan Grinspun Program Co-Chair, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (2009) Julia Hirschberg General Chair, Human Language Technologies/North American Association for Computational Linguistics (“HLT/NAACL”) Daniel Hsu Program Chair, Conference on Learning Theory (COLT) (2019) Martha Kim Vice-Chair, ISPASS Steering Committee (2019 – ) Technical Program Co-Chair, International Symposium on Workload Characterization (2016) Tony Jebara Program Co-Chair, International Conference on Machine Learning (“ICML”) (2014) Steering Committee Member, NYAS Machine Learning Symposium (2006-) Program Chair, International Conference on Development and Learning (Salk Institute for Biological Studies) (2004) General Co-Chair, Text Learning: Beyond Supervision IJCAI Workshop (2001) Angelos Keromytis Program Co-Chair, ACM Computer and Communications Security conference (“CCS”) (2009, 2010) Program Chair, 15th USENIX Security Symposium (2006) Steering Committee, ISOC Symposium on Network and Distributed System Security (SNDSS) (2006-) Program Chair, Workshop On Rapid Malcode (“WORM”) (2005) Program Co-Chair, Applied Cryptography and Network Security Conference (“ACNS”) (2005) General/program Co-Chair, OpenSIG Workshop (2003) Tal Malkin Steering committee chair, the Theory of Cryptography Conference (TCC)(2020 – ) Steering committee member, the Theory of Cryptography Conference (TCC) (2017 – ) Steering committee member, the RSA Conference, Cryptographers’ Track (CT- RSA) (2009 – 2011) General Chair, Annual Workshop on Practice and Theory in Public Key Cryptography (“PKC”) (2006) Vishal Misra Program Chair, ACM CoNeXT (2013) General Chair, ACM Sigmetrics (2010) Program Chair, ACM Sigmetrics (2008) Board Member, ACM Sigmetrics (2007 – 2011) Working Group Member, IFIP 7.3 (2005 – ) General Co-Chair, OpenSIG Workshop (2003) Jason Nieh Co-Chair, Program Committee, MobiSys (2020) Co-Chair, Program Committee, USENIX (2011) Co-Chair, Program Committee, SIGMETRICS / Performance (2009) Co-Chair, Program Committee, 1st ACM Workshop on Virtual Machine Security VMSec (2008) Vice-Chair, Program Committee, World Wide Web Conference WWW (2007) Deputy Vice Chair, Program Committee, World Wide Web Conference WWW (2006) Co-Chair, Program Committee, ACM Workshop on Operating System and Architectural Support for the On Demand IT Infrastructure OASIS (2004) Deputy Vice Chair, Program Committee, World Wide Web Conference WWW (2004) Co-Chair, Program Committee, Network and Operating Systems Support for Digital Audio and Video NOSSDAV (2001) Steven Nowick General Co-Chair, IEEE International “Async” Symposium (2005) Program Chair, IEEE/ACM International Workshop on Logic and Synthesis (2002) Steering Committee Member/co-founder, IEEE International “Async” Symposium (1994 – ) Itsik Pe’er Chair, Biology track Machine Learning in Science and Engineering (MLSE) (2020) Chair of Satellite on Genetics, Program Committee member Research in Computational Molecular Biology (RECOMB) (2017 – 2020) Baishakhi Ray Chair, ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE) Demonstration Track (2020) Chair, ACM/IEEE International Conference on Software Engineering (ICSE) Artifact Evaluation Track (2019) Chair, IEEE/ACM International Conference on Automated Software Engineering (ASE 2019) Late-Breaking Results track (2019) Kenneth Ross General Co-Chair, ACM Conference of the Special Interest Group on Management of Data (“SIGMOD”) (2013) Program Co-Chair, IEEE International Conference on Data Engineering, (“ICDE”) Industrial Track (2012) Program Co-Chair, International Conference on Very Large Databases (“VLDB”) (2008) Henning Schulzrinne General Co-Chair, ACM SIGCOMM (2020) General Co-Chair, Mobiquitous (2018) Technical Program Co-Chair, e-Energy (2011) General Co-Chair, IEEE COMSNETS (2010) General Co-Chair, IEEE P2P (2009) General Co-Chair, IEEE ICNP (2009) Technical Program Co-Chair, IFIP Networking (2009) Steering Committee (member, current chair), IEEE/ACM Transactions on Networking (2007 – 2017) Technical Program Co-Chair, IEEE IM Conference (2009) Technical Program Co-Chair, IFIP Networking Conference (2009) Technical Program Co-Chair, IPTComm Conference (2008) General Co-Chair, IPTComm Conference (2007)General Co-Chair, CoNEXT (2007) General Chair, ACM Multimedia Conference (2004) Program Chair, Internet Telephony Workshop (2001) Program Co-Chair, Network and Operating System Support for Digital Audio and Video (“NOSSDAV”) (2001) Program Chair, IEEE Infocom Conference (2000) Rocco A. Servedio Program Co-Chair, 18th International Conference on Algorithmic Learning Theory (“ALT”) (2007) Program Co-Chair, 21st Annual Conference on Learning Theory (“COLT”) (2008) Steering Committee Member, Conference on Learning Theory (“COLT”) (2005 – 2008) Steering Committee Member, International Conference on Algorithmic Learning Theory (“ALT”) (2007 – 2008) Edward Shortliffe Chair Of Organizing Committee, Medinfo Conference (2004) Brian Smith Steering Committee, Summer School on Computational Interaction (2019 – ) Salvatore Stolfo General Chair, NSF/US Department of the Treasury Workshop on Resilient Financial Information Systems (2005) Program Co-Chair, SIGKDD International Conference on Knowledge Discovery and Data Mining (2000) Joseph Traub Co-Chair, Schloss Dagstuhl Conference on Algorithms and Complexity for Continuous Problems (2004) Henryk Wozniakowski Co-Chair, Modern Computational Mathematics (2004) Eugene Wu Co-chair, SIG Management of Data (SIGMOD) Student Research Competition (2020) Co-chair SIGMOD Student Research Competition (2019) Co-Chair New York Database Day (2018) Co-chair Human in the Loop Data Analysis Workshop (HILDA) 2018 Mihalis Yannakakis Program Chair, ACM Symposium on Theory of Computing (“STOC”) (2001) Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}