{
  "id": 4,
  "date": "2024-05-18T18:13:42.855813",
  "url": "https://www.cs.columbia.edu/education/ms/computationalBiology/",
  "university_name": "Columbia University",
  "title": "Computational Biology",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence Computational Biology Computational Biology The Computational Biology Track is intended for students who wish to develop a working knowledge of computational techniques and their applications to biomedical research. Recent advances in high-throughput technologies, e.g., for DNA sequencing and for measuring RNA expression via DNA microarrays, are changing the nature of biomedical research. They empower fundamental new understandings of biological mechanisms with far-reaching applications to biological and medical sciences. To fulfill this promise, new computational techniques are needed to analyze genome sequences, protein structures, metabolic and regulatory pathways, evolutionary patterns, and the genetic basis of disease. The computational biology track seeks to provide state of the art understanding of this concomitant growth of high-throughput experimental techniques, computational techniques to analyze their data, the resulting new understandings of biological mechanisms, and their applications to pharmacological and medical practice (from diagnosis to drug design). SUMMARY OF REQUIREMENTS Complete a total of 30 points (Courses must be at the 4000 level or above) Maintain at least a 2.7 overall GPA. (No more than 1 D is permitted). Complete the Columbia Engineering Professional Development & Leadership (PDL) requirement Satisfy breadth requirements Take at least 6 points of technical courses at the 6000 level At most, up to 3 points of your degree can be Non-CS/Non-track If they are deemed relevant to your track and sufficiently technical in nature. Submit the Non-CS/NonTrack form and the course syllabus to your CS Faculty Advisor for review 1. Breadth Courses Visit the breadth requirement page for more information. 2. Required Track Courses Students are required to complete two required courses (6 points): One course from either COMS W4761 (Computational Genomics) or COMS W4762 Machine Learning for Functional Genomics and one course from either COMS W4771 or SIEO W4150/IEOR W4150/*STAT 4001. Students who have taken equivalent courses in the past and received grades of at least a B may apply for waivers and take other CS courses instead. Any course option taken but not used towards the Required Course can be counted as an elective. Students must take one of the following courses: Course ID Title COMS W4761 Computational Genomics COMS W4762 Machine Learning for Functional Genomics Students must take one of the following courses: Course ID Title COMS W4771 or STAT 4400 Machine Learning or Statistical Machine Learning STAT 4001/IEOR W4150* Probability and Statistic * STAT 4001 has replaced SIEO W4150. SIEO W4150 taken before Spring 2024 may be used to fulfill this requirement. 3. Track Electives Students are required to take two courses from the following list, at least one of which must be a 6000-level course. Other courses on this list may be used as general electives or waiver replacements when the student has received a waiver. Course ID Title COMS W4111 Introduction to Databases COMS W4252 Introduction to Computational Learning Theory COMS W4772 (E6772) Advanced Machine Learning COMS W4995 Visit the topics courses page to see which COMS 4995 courses apply to this track. COMS E6111 Advanced Database Systems COMS E6901 Projects in Computer Science (Advisor approval required) COMS E6998 Visit the topics courses page to see which COMS 6998 courses apply to this track. CMBS 5305 Topics in Mathematical Genomics and Biology BIOC W4512 Molecular Biology BIOL W4031 Genetics I BIOL W4032 Genetics II BIOL W5031 Genetics (This replaces BIOL 4031 and BIOL 4032. Courses cannot be double counted.) BIOL W4034 Biotechnology BIOL W4037 Bioinformatics of Gene Expression BIOL W4041 Cell Biology BIOL W4070 The Biology and Physics of Single Molecules BIOL W4300 Drugs and Disease BIOL W4073 Cellular and Molecular Immunology BIOL W4400 Biological Networks BIOL W4510 Genomics of Gene Regulation BIOL G6560 Human Evolutionary Genetics BCHM G4026 Biochemistry of Nucleic and Protein Synthesis BCHM G4250 Biochemistry and Molecular Biophysics BCHM G6300 Biochemistry and Molecular Biology of Eukaryotes I BCHM G6301 Biochemistry and Molecular Biology of Eukaryotes II BMEN E6480 Computational Neural Modeling and Neuroengineering GEND G4050 Advanced Eukaryotic Molecular Genetics STAT G6101 Statistical Modeling and Data Analysis APMA E4400 Introduction to Biophysical Modeling BINF G4006 Translational Bioinformatics BINF G4014 Computational Biology I: Functional and Integrative Genomics BINF G4015 Computational Systems Biology: Proteins, Networks, Function BINF G4017 Deep Sequencing BINF G6001 Projects in Biomedical Informatics ECBM E4060 Intro to Genomic Info Sci & Tech EECS E6720 Bayesian models for Machine Learning EECS E6894 Deep Learning for Computer Vision and Natural Language Processing 4. General Electives Students must complete the remaining credits of General Elective Courses at the 4000 level or above. At least three of these points must be chosen from either the Track Electives listed above or from the CS department at the 4000 level or higher. Students may also request to use at most 3 points of Non-CS/Non-Track coursework if approved by the process listed below. Non-CS/Non-Track: CS MS students may request up to 3 points of Non-CS/Non-Track points to count toward their 30-point MS program. CS Track advisor may review and approve if the course is determined to be relevant to the CS MS track and sufficiently technical in nature. Students should send the Non-CS/Non-Track Form and the course syllabus to your Track Advisor for review. Please note: At least 3 elective points must be selected from courses in biological departments Students who waive track requirements by using previous courses must still complete 30 graduate credits. This can be done by expanding their elective selection to include courses listed as required track courses and elective track courses; or by taking other graduate courses Due to a significant overlap in course material, MS students not in the Machine Learning track can only take 1 of the following courses – COMS 4771, ELEN 4903, IEOR 4525, STAT 4240, STAT 4400/4241/5241 – as part of their degree requirements The Degree Progress Checklist should be used to keep track of your requirements. If you have questions for your Track Advisor or CS Advising, you should have an updated Checklist prepared TRACK PLANNING Please visit the Directory of Classes to get the updated course listings. Please also note that not all courses are offered every semester or even every year. A few courses are offered only once every two or three years or even less frequently. Updated: 3/13/2024 Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}