{
  "id": 4,
  "date": "2024-05-18T18:13:01.434769",
  "url": "https://www.cs.columbia.edu/cpt-faqs/",
  "university_name": "Columbia University",
  "title": "CPT FAQs",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence CPT FAQs CPT Guidelines CS Advising can assist with your CPT Request; however, we do not approve CPT Applications- this can only be done by ISSO. We can sign Part 3 of your CPT Request Form and provide you with the registration information for the accompanying Fieldwork course. Please be aware: you cannot begin your internship until you receive work authorization from ISSO. Be mindful of your timeline and begin your CPT request at least ten business days before the start date of your internship. Fieldwork/CPT FAQs I'm an International Student and was just offered an internship… Now what? Congratulations ! If you are a SEAS student, please confirm your eligibility with CS Advising via the CPT Request Form, then apply for CPT with ISSO. For CPT Request Form instructions, please see below. By applying for Curricular Practical Training, or CPT, you can accept the internship within the limits of your immigration status. What is CPT? Curricular Practical Training, or CPT, is an employment authorization that allows you to accept off-campus internships related to your program’s curriculum. It is an opportunity to apply your classroom knowledge in a real-world setting, gain experience in your field, and help prepare you for the workforce. What is Fieldwork? Undergraduate Fieldwork is a free one-credit course that accompanies your internship. You can register for Fieldwork once CS Advising processes your CPT Request Form. This must be taken for a letter grade and is an essential part of the immigration requirements for CPT. It does not count towards your CS Major but can count towards your 128 credits needed for graduation. MS Fieldwork is a one-credit course you must pay for that accompanies your internship. You can register for Fieldwork once CS Advising processes your CPT application. This must be taken for a letter grade and is an essential part of the immigration requirements for CPT. MS Fieldwork can count towards your 30 credit requirement and general electives; however, it cannot count toward your 6000-level electives or track electives. Am I Eligible for Fieldwork? Undergraduate Fieldwork : If you have declared your SEAS major (are not a first-year student), have permission from your CS Faculty Advisor, and have yet to reach the max three-credit Fieldwork cap, you can apply for CPT and register for the Fieldwork course. MS Fieldwork : If you are a CS MS student who has completed two consecutive terms, has permission from your CS Faculty Advisor, and has yet to reach the maximum three-credit Fieldwork cap, you can apply for CPT and register for the Fieldwork course. Please note: if you completed your undergraduate degree at Columbia, you may be eligible to complete MS Fieldwork in your first semester. This must be verified with ISSO & CS Advising. When Should I Complete my CPT? The department recommends completing your CPT over the summer and applying for CPT at least ten business days before your intended start date. Your internship must fall within the semester of your Fieldwork course and must end before the start of the next semester to be approved by ISSO. If your internship extends into a new semester, you must renegotiate this with your future employer. Talk to a CPO if you need help having this conversation with your employer. **IMPORTANT!** Do NOT start your internship until you have received your work authorization from ISSO. Your internship may not exceed the dates listed below for the semester. Non-graduating student dates: Earliest Date Latest Date Fall 1-Sep 31-Dec Spring 1-Jan 31-May Summer The Monday following Final Examinations week, per Academic Calendar . The day before the start of the Fall semester Graduating Student dates: Earliest Date Latest Date Fall 1-Sep Official last day of the semester Spring 1-Jan Official last day of the semester Summer The Monday following Final Examinations week, per Academic Calendar . 31-Aug **Applications that fall outside of the specified dates will not be approved** Is CPT the same as OPT? No, please take a look at the information and requirements for OPT here . Can I take the Fieldwork course Pass/Fail? No, you may not pass/fail Fieldwork. It must be taken for a letter grade. I finished my CPT, now what? **This is a sample post-CPT report for reference purposes. Your post-CPT report is at the discretion of your CS Faculty Advisor, and any changes they see fit can be made. Please be sure to confirm your specific requirements when you request permission to join your advisor’s section of Fieldwork.** Post-CPT reports should be approximately 5 pages and can cover the following items: 1. Introduction: Begin the report with a brief and engaging introduction. Provide an overview of the internship, including the name of the host organization and its area of focus. You may also mention any significant achievements or recognition of the organization. 2. Goals & Tasks: Clearly outline the objectives and goals of your internship. Explain the specific tasks and responsibilities you were assigned during the internship. Be comprehensive in describing the scope of your work, including any projects you were involved in or significant contributions made to the organization. 3. Learning: Elaborate on the skills and knowledge you gained during the internship. Discuss the technologies, tools, and methodologies you were exposed to, and explain how they contributed to your professional growth. Mention any training sessions, workshops, or mentorship programs that enhanced your skills. 4. Challenges & Solutions: Describe the challenges you encountered during your internship journey. It could be technical, teamwork-related, or anything else that posed difficulties. Be honest about the obstacles you faced and, more importantly, detail the strategies you employed to overcome them successfully. 5. Contributions: Emphasize the value you brought to the host organization during your internship. Discuss your key contributions to projects, initiatives, or any other areas where your work made a tangible impact. If possible, quantify the results or outcomes achieved through your efforts. 6. Reflection: Offer a thoughtful reflection on your overall internship experience. Discuss how the internship aligned with your academic and career aspirations. Share insights into how the experience has influenced your understanding of the field and the skills you acquired that you believe will be valuable in your future endeavors. 7. Conclusion: Conclude the report with a concise summary of the most important takeaways from your internship. Reiterate the significance of the experience in shaping your professional growth and expressing gratitude to the organization and mentors for their support. In addition, students should also ensure that they obtain signatures from their internship managers as part of the internship report process. These signatures serve as an official acknowledgment from the supervisors that the student has completed the internship and fulfilled the required responsibilities. Including internship manager signatures adds credibility to the report and validates the information presented. It also demonstrates the student’s professionalism and commitment to the internship program. Your post-CPT report should be submitted to your advisor by the dates below unless an alternative deadline was provided. Summer Fieldwork – post-CPT report is due the last Friday before the start of the Fall semester Fall/Spring Fieldwork – post-CPT report is due the last day of your registered Fieldwork Course What happens if the company does not allow me to release some information about my project in my written report? Please talk with both your CS Faculty Advisor and your internship supervisor to determine a solution acceptable to both parties. As the post-CPT report is up to the discretion of your CS Faculty Advisor, they will likely be able to accommodate the privacy restrictions of your company. How closely aligned with my track does the internship need to be? The internship must be related to your track and must have educational value as judged by your advisor. I am an international student and was unexpectedly let go from my internship. What can I do? Fieldwork duration can be shortened, but you cannot drop the course as that would mean that you had worked illegally in the US. You must contact your advisor/administrator/ISSO to resolve this issue, as this would affect your legal working status. Can I extend my current CPT/Fieldwork? This will require a new CPT Request/ Application. Be mindful that the CPT process cannot and will not be expedited. It is your responsibility to obtain approvals and be proactive about deadlines. You must not begin/continue working without updated work authorization and the appropriate approvals. Please see below for the current policies for each extension. Adding more time during the same academic semester – If the new end date falls within the same academic semester you are registered for Fieldwork, you will be able to continue with the same Fieldwork course. You will be required to submit an Extension Request (you must fill out the CPT Request Google Form, select ‘ extension request ‘, upload a new CPT Request Form with a new end date, an updated signed Offer Letter with a new end date, and a new CS Faculty Advisor approval before continuing with ISSO). Your faculty advisor does not have to sign anything; however, you will need to obtain new approval and determine when you should be submitting your post-CPT report. If your advisor requires the post-CPT report prior to your new end date to be able to give you a grade for the semester, please respect this and complete the report with the information you’ve gathered. Extending CPT to a NEW academic semester – If the new end date is in the next academic semester, you will be required to register for an additional Fieldwork course, and this requires an entirely NEW application where the start and end date fall within the range of the new academic semester (you must fill out a new CPT Request Google Form, upload a new CPT Request Form with a new end date, an updated signed Offer letter with a new end date, and a new CS Faculty Advisor approval before continuing with ISSO). This will count for an additional Fieldwork credit , keep in mind the cap for Fieldwork credits is 3. Be sure to confirm your eligibility to extend into a new semester with ISSO and with CS Advising. If the semester you are extending into is the Fall or Spring semester, you will not be eligible for a full-time position but must work part-time for no more than 20 hours a week. This should also be confirmed with ISSO. Where to Begin Applying for a CPT is a multi-step process, so be sure to begin the process as soon as you can, or at least ten business days before the start of your internship. CS Advising will be able to process and sign Part 3 of your CPT Request Form and give you the registration information for the Fieldwork course. After CS Advising has processed your CPT Request, you will be ready to submit your CPT Application to ISSO using Compass. Please note you cannot begin your internship until you receive work authorization from ISSO. Click below to get started! UG CPT MS CPT PhD CPT If you have any questions regarding your CPT eligibility, please get in touch with CS Advising . If you are concerned or have questions about your international status, please contact ISSO . Connect with a Career Placement Officer if you need help applying for internships or negotiating with a prospective employer. Updated 03/19/2024 Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}