{
  "id": 4,
  "date": "2024-05-18T18:14:46.929488",
  "url": "https://www.cs.columbia.edu/education/undergraduate/",
  "university_name": "Columbia University",
  "title": "Undergraduate",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence Undergraduate UNDERGRADUATE PROGRAMS Computer Science majors at Columbia study an integrated curriculum, partially in areas with an immediate relationship to the computer, such as programming languages, operating systems, and computer architecture, and partially in theoretical computer science and mathematics. A broad range of upper-level courses is available in topics including artificial intelligence, natural language processing, computational complexity and the analysis of algorithms, computer communications, combinatorial methods, computer architecture, computer graphics, databases, mathematical models for computation, optimization, and programming environments. Through this integrated approach, students acquire the flexibility needed in a rapidly changing field; they are prepared to engage in both applied and theoretical developments in computer science as they happen. Most graduates of the Computer Science Program at Columbia step directly into career positions in computer science with industry or government or continue their education in graduate degree programs. Many choose to combine computer science with a second career interest by pursuing additional programs in business administration, medicine, or other professional studies. DEGREE PROGRAM QUICK GUIDES BS in Computer Science (SEAS) New BS Curriculum Quick Guide – Students declaring in Fall 2023 or later must follow this . Old BS Curriculum Quick Guide – Those who declared prior to Fall 2023, may choose to follow the new curriculum or the old Tracks. SEAS Bulletin – Please refer to this for more details on the SEAS school policies and important exceptions. BS in Computer Engineering (SEAS) Download Quick Guide Here BA in Computer Science (CC, GS, Barnard) CC Students, please refer to the Bulletin for more details on your school’s policies and important exceptions. GS Students may use this link ; Barnard Students should contact their Dean. New BA Curriculum Quickguide – CC/GS Students declaring in Spring 2024 or later must follow this. Barnard CS Students who join in Fall 2023 or later must follow this. Old BA Curriculum Quick Guide – CC/GS students who declared prior to Spring 2024, may choose to follow the new curriculum or the old Tracks. Barnard students who joined Barnard in or before Spring 2023 are subject to the old requirements – for additional questions or possibly exceptions, please consult your Barnard advisor. BA in Computer Science and Mathematics (CC & GS) Download Quick Guide Here BA in Data Science (CC & GS) Download Quick Guide Here The program was formerly known as Computer Science and Statistics BA in Information Science (CC & GS) Download Quick Guide Here Updated March 2021 Minor/ Concentration in Computer Science Please see the appropriate BS and BA program guides above. The Minor/Concentration in Computer Science consists of the CS Core Requirements. A Guide for CC & GS Transfer Students NEW Curriculum – BA Transfer Guide OLD Curriculum – Prior to Spring 2024 – BA Transfer Guide ADVISORS CS Advising – Administrative CS Faculty Advisors – Academic DEGREE PROGRESS CHECKLISTS & CLEARANCE FORMS BS in Computer Science (SEAS) Checklist Access the Clearance Form via Google Docs. Make a copy of this form and enter your completed and/or planned courses. Name the file “Your Name UNI – SEAS BS Graduation Clearance Form” Share with Lionmail so your advisors can review it. Email ug-advising@cs.columbia.edu or your Faculty Advisor the link! You can use this same form to check progress prior to graduation and update it each semester. SEAS BS Checklist/Clearance Form – Spring 2024 and beyond SEAS BS Checklist/Clearance Form – Tracks (Pre 2024) OLD Excel Progress Checklist BA in Computer Science (CC, GS, Barnard) Checklist Access the Clearance Form via Google Docs. Make a copy of this form and enter your completed and/or planned courses. Name the file “Your Name UNI – CC/GS/BC BA Graduation Clearance Form” Share with Lionmail so your advisors can review it. Email ug-advising@cs.columbia.edu or your Faculty Advisor the link! You can use this same form to check progress prior to graduation and update it each semester. CC/GS/BC BA Checklist/Clearance Form – Spring 2024 and beyond CC/GS/BC BA Checklist/Clearance Form – Tracks (Pre 2024) OLD Excel Progress Checklist BA in Computer Science and Mathematics (CC & GS) Checklist Download Progress Checklist Here BA in Data Science (CC & GS) Checklist Download Progress Checklist Here – Updated January 2022 Program formerly known as Computer Science and Statistics FREQUENTLY ASKED QUESTIONS (FAQ) Prospective Students Currently Enrolled Students TOPICS COURSES Undergraduate students must get permission from their faculty advisor to count any topics course toward the Major. Students may take multiple sections of COMS 4995 and/or COMS 6998, as each section will vary by content each semester. If you aren’t sure if a course is the same, please email the instructor to verify. CURRENT RESEARCH OPPORTUNITIES Internal Opportunities External Opportunities CONTACT US If you have questions about the CS Department and major/minor requirements, please email CS Advising . If you have questions about the admissions requirements, please get in touch with the following admissions offices: School of Engineering/Columbia College School of General Studies Barnard College ACADEMIC HONESTY Computer Science Department’s Academic Honesty Policy Updated 07/25/2023 Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}