{
  "id": 4,
  "date": "2024-05-18T18:06:26.473441",
  "url": "https://www.cs.columbia.edu/education/ms/",
  "university_name": "Columbia University",
  "title": "M.S.",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence M.S. MASTER OF SCIENCE PROGRAM The Master of Science (MS) program is intended for people who wish to broaden and deepen their understanding of Computer Science. Columbia University and the New York City environment provide excellent career opportunities in multiple industries. The program provides a unique opportunity to develop leading-edge in-depth knowledge of specific computer science disciplines. The department currently offers concentration tracks covering eight such disciplines. MS students are encouraged to participate in state-of-the-art research with our research groups and labs. REQUIREMENTS Complete a total of 30 points (Courses must be at the 4000 level or above) Maintain at least a 2.7 overall GPA. (No more than 1 D is permitted). The full Academic Standing Policy can be found here . Complete the Columbia Engineering Professional Development & Leadership (PDL) requirement (Not applicable to CVN students) Satisfy breadth requirements Take at least 6 points of technical courses at the 6000 level At most up to 3 points of your degree can be Non-CS/Non-track If they are deemed relevant to your track and sufficiently technical in nature. Submit the Non-CS/NonTrack form and the course syllabus to your CS Faculty Advisor for review TRACK OPTIONS Choose one of the tracks below, view each track webpage for details on requirements. Computational Biology Network Systems Computer Security Software Systems Foundations of Computer Science Vision, Graphics, Interaction, and Robotics Machine Learning MS Personalized (by faculty invite only) Natural Language Processing MS Thesis (by faculty invite only) Columbia Video Network (CVN) students should also choose from one of the above tracks. For faculty advisement, please contact the assigned track advisors . CS MS FACULTY TRACK ADVISORS CS Faculty Advisors will be assigned after you select a track in Mice. If you do not yet have a Mice account but are a CS MS student, please contact ms-advising@cs.columbia.edu . Contact your Track Advisor to get special permission for any course not specifically approved on your CS track websites . DEGREE PROGRESS CHECKLIST Students should keep an updated copy of their Degree Progress Checklist on hand for any academic progress reviews with their Faculty and/or Admin advisor. This form will also be requested a few weeks before graduation to verify your program requirements are met. HOW TO FILL OUT YOUR CHECKLIST: List all coursework that should be used to meet your CS MS program requirements For all topics courses (COMS 4995 & COMS 6998 courses) remember to include the actual course title (for example, use “COMS 4995 Hacking for Defense” NOT “COMS 4995”) For all Projects courses (COMS 6901), include the name of the instructor and how many points the course was worth For all Thesis courses (COMS 6902), include the name of the instructor and how many points the course was worth For all Personalized Track students, include the name of your track advisor on your checklist For Advanced standing – mark which courses are approved by SEAS Academics For waived Required Track courses, list which course you are using to satisfy the points requirement for the waived course. If you are following the old MS track requirements, please refer to the old requirements page TOPICS COURSES If you are interested in applying a specialized Topics in Computer Science courses (COMS 4995 or COMS 6998) to your Track electives, please view Topics Courses by Track Approval . Students may take multiple sections of COMS 4995 and/or COMS 6998, as each topic title will vary by content each semester. If you aren’t sure if a course is the same, please email your MS Faculty Track Advisor. No approval is required for the course to count as a General Elective. A list of current and recent Topics Course Descriptions can be found here . MS IN COMPUTER ENGINEERING In addition to the Computer Science MS Program, we offer the Computer Engineering MS Program jointly with the Electrical Engineering Department. More information about the program can be found in the Computer Engineering section of the SEAS bulletin and on the Computer Engineering website . DUAL MS IN JOURNALISM AND COMPUTER SCIENCE Admitted students will enroll for a total of four semesters. In addition to taking classes already offered at the Journalism and Engineering schools, students will attend a seminar and workshop designed specifically for the dual degree program. The seminar will teach students about the impact of digital techniques on journalism; the emerging role of citizens in the news process; the influence of social media; and the changing business models that will support news gathering. In the workshop, students will use a hands-on approach to delve deeply into information design, focusing on how to build a site, section, or application from concept to development, ensuring the editorial goals are kept uppermost in mind. For more information, please visit the program website . IMPORTANT AND USEFUL LINKS MS TRACK ADVISORS MS PROGRAM FAQ FIELDWORK/CPT FAQ COLUMBIA ENGINEERING RESEARCH OPPORTUNITIES COLUMBIA ENGINEERING PROFESSIONAL DEVELOPMENT & LEADERSHIP (PDL) PROGRAM COMPUTER SCIENCE ACADEMIC HONESTY POLICY ADMISSIONS INFORMATION SEAS Admission FAQ SEAS Admissions contact: seasgradmit@columbia.edu CS Admission FAQ CS Admissions contact: ms-admissions@cs.columbia.edu Questions? Email CS Advising! Updated 03/25/2024 Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}