{
  "id": 4,
  "date": "2024-05-18T18:14:35.844327",
  "url": "https://www.cs.columbia.edu/education/courses/",
  "university_name": "Columbia University",
  "title": "Courses",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence Courses Information about COMS Courses Important Note for Non-CS/CE Students Regarding Registration: Although the Computer Science department would like to make CS accessible to the broader student population, our course registration priority is our declared CS students. We will open our select COMS courses to students in other departments during the Change of Program period. Full information on Course Registration can be found here . Summer Courses – https://www.cs.columbia.edu/summer-courses/ Topics Course Descriptions This page contains the descriptions for the COMS 4995 and COMS 6998 TOPICS IN COMPUTER SCIENCE courses that have been taught. Please note that these change from semester to semester and may not be offered again. New for Fall 2024 COMS 4995: Mathematics of Machine Learning and Signal Recognition | Homayoon Beigi Prerequisites : Advanced Calculus and Linear Algebra. Knowledge of Differential Equations would be helpful. Mathematics of Machine Learning and Signal Recognition provides the mathematical background for addressing in-depth problems in machine learning, as well as the treatment of signals, especially time-dependent signals, specifically non-stationary time-dependent signals – although spatial signals such as images are also considered. The course will provides the essentials of several mathematical disciplines which are used in the formulation and solution of the problems in the above fields. These disciplines include Linear Algebra and Numerical Methods, Complex Variable Theory, Measure and Probability Theory (as well as statistics), Information Theory, Metrics and Divergences, Linear Ordinary and Separable Partial Differential Equations of Interest, Integral Transforms, Decision Theory, Transformations, Nonlinear Optimization Theory, and Neural Network Learning Theory. There will be in-depth coverage of many Neural Network Architectures, with in-depth coverage of CNN, TDNN, RNN/LSTM, Transformer, and Conformer architectures. w4995_beigi_mathematics_of_machine_learning_and_signal_recognition_description . COMS 6998: Hyperscale Infrastructure | Jason Neih Prerequisites:  W4118 Study of hyperscale computing infrastructures and technologies used to support billions of users based on case studies and research papers from AWS, Google, Meta, Microsoft, Netflix, and others. A course project is required. COMS 6998: Introduction to Deep Learning and LLM based Generative AI Systems | Parijat Dube and Chen Wang Prerequisites : An introductory graduate level machine learning course. Working knowledge of Python, Pytorch and experience using Jupyter Notebook. This course serves as a graduate-level introduction to Deep Learning systems, with an emphasis on LLM based Generative AI systems. The course will cover several topics related to Deep Learning (DL) systems and their performance. Both algorithmic and system related building blocks of DL systems will be covered including DL training algorithms, network architectures, and best practices for performance optimization. The latter half of the course will have an in-depth exploration of Large Language Models (LLMs), covering key areas towards advanced topics including attention mechanisms, transformer models, prompt engineering, LLM applications, pre- training strategies, Reinforcement Learning with Human Feedback (RLHF), efficient LLM serving techniques, fine-tuning methods, and benchmarking specifically for LLMs. The students will gain practical experience working on different stages of LLM life cycle, including model pretraining, fine tuning, and deployment. The assignments will be mostly hands-on involving standard DL and LLM frameworks (Pytorch, vLLM) and open-source technologies. COMS 6998 015 . COMS 4995 TOPICS COURSES COMS 4995 TOPICS IN COMPUTER SCIENCE COMS W4995 Advanced Algorithms | Alexandr Andoni The class covers classic and modern algorithmic ideas that are central to many areas of Computer Science. The focus is on most powerful paradigms and techniques of how to design algorithms, and measure their efficiency. The topics will include hashing, sketching, dimension reduction, spectral graph theory, optimization (linear programming, gradient descent, IPM), multiplicative weights, compressed sensing, and others. The class is designed as a “grad intro to algorithms” class, and is thus an advanced version of “Analysis of Algorithms” (COMS 4231), both in terms of content as well as pace. You need not have taken 4231, but some algorithmic exposure is expected (see prerequisites below). Hence it is suitable for those of you who have seen some algorithms class (like 4231 or easier), and/or want to take an in-depth algorithms class. The evaluation is based on homeworks and a final project.” COMS 4995 Advanced Systems Programming | Hans Montero & Jae Woo Lee https://www.cs.columbia.edu/~hans/asp-overview.html Prerequisites : COMS 3157, CSEE 3827, COMS 3134 (or equivalents). This course focuses on advanced systems programming, covering modern interfaces, libraries, and services used in today’s UNIX-based operating systems. Students will gain an understanding of how they are implemented and learn how to use them. COMS 4995 BLDNG SUCCESSFUL STARTUP | Apoorv Agarwal This course will provide visibility into the journey of building a venture-backed high-growth start-up (from inception to Series B). First-time founders make a number of mistakes that are easily avoidable. A typical mistake is to make assumptions about the market and market needs. The technology needs to work but a lot more is required to get a start-up off the ground — fundraising, sales, marketing, hiring, operations, and finance. This course will provide recipes for avoiding failure and answer common questions such as — how to find and validate an idea, how to find a co-founder, how to find investors and raise funding, how to run board meetings, how to build a team (who and how to hire at what stage), how to compensate early employees and advisors, what’s a cap table and how to manage it, etc. There will be a number of guest speakers ranging from successful CEOs to top venture capitalists. In addition to providing different perspectives, this will help students expand their professional networks. COMS 4995 COMPETITIVE PROGRAMMING | Yongwhan Lim Upon successful completion of the course, you will have mastered the fundamental knowledge required to succeed in: Competing with confidence in ICPC contest series: Columbia Locals, Greater New York Regionals, North America Championships, and World Finals. Please check the Columbia team site here. Passing with confidence in any entry-level technical interview at the top-tier companies. Attaining high ratings in any competitive programming websites (e.g., CodeForces, AtCoder, LeetCode, and etc.) We will go over topics and strategies required to succeed in the competitive programming contests! COMS 4995 Data-Driven Design for Social Innovation | Nakul Verma Professor Nakul Verma is offering a new interdisciplinary project-based COMS 4995 course in Fall 2023 “Data Driven Design for Social Innovation”. Course Description Cross-disciplinary project-based course where teams of students from various departments work together on creating products or services to address important social problems. We will introduce and study a diverse set of ethnographic, psychological, and data science tools to help students generate customer insights, and build and test prototypes for a large-scale social challenge. Student projects will be closely guided by the instructors and domain experts The final deliverables will be shared with the domain expert to determine potential application of the concepts beyond the course. This could include advancing ideas through the formation of a startup, incorporating ideas into the domain expert’s work, or establishing partnerships with organizations working on similar challenges. Course website: https://www.cs.columbia.edu/~verma/classes/ddsi/index.html COMS 4995 DEEP LRNG FOR COMP VISION | Belhumeur, Peter Recent advances in Deep Learning have propelled Computer Vision forward. Applications such as image recognition and search, unconstrained face recognition, and image and video captioning which only recently seemed decades off, are now being realized and deployed at scale. This course will look at the advances in computer vision and machine learning that have made this possible. In particular we will look at Convolutional Neural Nets (CNNs), Recurrent Neural Nets (RNNs), Long Short Term Memories (LSTMs) and their application to computer vision. We will also look at the datasets needed to feed these data-hungry approaches–both how to create them and how to leverage them to address a wider range of applications. The course will have homework assignments and a final project; there will be no exams. COMS 4995 Design using C++ | Bjarne Stroustrup. Prerequisites: Graduate standing or senior undergraduate and an interest in the use of programming languages and tools. Note: There will be no recording or remote access. Abstract: This course will use the C++ language and some C++ libraries as examples of software design and design decisions. It is not a C++ programming course though it will use the principles and design decisions that underly the major C++ features as prime examples and see how they are expressed in actual features and libraries. The evolution of those ideals and the support offered is also examined. Some experience with C++ and other languages is assumed. The book “A Tour of C++ (3rd edition)” will be read over the first half of the course to give the students a common foundation in C++. “Design” is not primarily a book skill; it involves a variety of principles and techniques that must be practiced for mastery. Consequently, the second half of the course is devoted to 3-person projects involving design, implementation, documentation, and presentation of projects of the students’ choice (after approval from the professor). Students are expected to attend other students’ presentations and see how they are expressed in actual features and libraries. The evolution of those ideals and the support offered is also examined. Some experience with C++ and other languages is assumed. The book “A Tour of C++ (3rd edition)” will be read over the first half of the course to give the students a common foundation in C++. “Design” is not primarily a book skill; it involves a variety of principles and techniques that must be practiced for mastery. Consequently, the second half of the course is devoted to 3-person projects involving design, implementation, documentation, and presentation of projects of the students’ choice (after approval from the professor). Students are expected to attend other students’ presentations. COMS 4995 ELEMENTS FOR DATA SCIENCE | Gibson, Bryan This is a DSI course therefore please refer to their website for the cross-registration instructions for NON-DS students This course is designed as an introduction to elements that constitutes the skill set of a data scientist. The course will focus on the utility of these elements in common tasks of a data scientist, rather than their theoretical formulation and properties. The course provides a foundation of basic theory and methodology with applied examples to analyze large engineering, business, and social data for data science problems. Hands-on experiments with R or Python will be emphasized. COMS 4995 ENGR SOFTWARE AS A SERVICE | Yang, Junfeng In 2011, Marc Andreessen penned a famous Wall Street Journal article “Why Software Is Eating The World.” Almost a decade later, software is still eating the world. Companies like Google, Amazon, Uber, and Airbnb are revolutionizing entire industry sectors, and even traditional enterprises have to embrace this transition to software and automate numerous tasks within their organizations in order to remain competitive. This software revolution is driven primarily by two technology trends. On the client side, billions of users now own computers and smartphones with broadband Internet access, providing each of them “instant access to the full power of the Internet, every moment of every day.” On the backend, cloud services and readily available software tools vastly simplify creating software startups in many industries, without the need to invest in infrastructure or employee training. For instance, when WhatsApp was acquired by Facebook for approximately $19.3 billion dollars, it powered hundreds of millions of users worldwide but had merely 50 employees. These technology trends not only enable software to flourish, but also fundamentally change our software engineering process. Broadband access enables developers to run their software in the cloud for users to access via browsers or mobile apps — so-called Software-as-a-Services (SaaS). The developers of SaaS products continuously gather user feedback and behavior analytics, quickly refine existing or build new product features, and deploy to production in matter of minutes to test out their ideas — so called Agile Development. This style of close collaboration with customers and fast iteration of product ideas is in stark contrast with how software was engineered two decades ago. In this course, we will study modern software engineering practices including including topics such as SaaS architecture, behavior-driven development, Ruby on Rails, and Dev/ops. For details on the topics we will cover, please check out the Course Syllabus page. COMS W4995 Geometric Data Analysis | Andrew Blumberg The goal of this class is to introduce approaches to analyzing data presented as finite metric spaces using ideas from algebraic topology and differential geometry. Prerequisites are a grounding in basic probability, statistics, and linear algebra. The class will focus on rigorous mathematical foundations and applications drawn from computational genomics. COMS 4995 HACKING 4 DEFENSE | Blaer, Paul Couse Website Solve complex technology problems critical to our National Security with a team of engineers, scientists, MBAs, and policy experts. In a crisis, national security initiatives move at the speed of a startup yet in peacetime they default to decades-long acquisition and procurement cycles. Startups operate with continual speed and urgency 24/7. Over the last few years they’ve learned how to be not only fast, but extremely efficient with resources and time using lean startup methodologies. In this class student teams develop technology solutions to help solve important national security problems. Student teams take actual national security problems and learn how to apply the Lean launchpad and Lean Startup principles, (“business model canvas,” “customer development,” and “agile engineering”) to discover and validate customer needs and to continually build iterative prototypes to test whether they understood the problem and solution. Teams take a hands-on approach requiring close engagement with actual military, Department of Defense and other government agency end-users. Team applications required. Limited enrollment. Taught by Professor Paul Blaer and Jason Cahill, Hacking for Defense™ is a university-sponsored class that allows students to develop a deep understanding of the problems and needs of government sponsors in the Department of Defense and the Intelligence Community. In a short time, students rapidly iterate prototypes and produce solutions to sponsors’ needs. This course provides students with an experiential opportunity to become more effective in their chosen field, with a body of work to back it up. For government agencies, it allows problem sponsors to increase the speed at which their organization solves specific, mission-critical problems. For more information check out http://www.h4di.org/ COMS 4995  Innovation & Design Lab | Gary Zamchick Abstract: Innovation & Design Lab inculcates the innovative mindset needed to envision inventive applications, deliver meaningful experiences to end users, and generate valuable products and services. The class is open to both undergraduate and graduate students. Gary Zamchick has worked in and out of places like AT&T Labs Research, Sarnoff, and IBM as well as boutique design firms like Rockwell Group and Parson’s Institute of Information Mapping. His projects are diverse as designing the Disney World parade, innovation labs for Coca-Cola, banking experiences for Citibank and Tata, kiosks for intelligence agencies, on-demand learning models for IBM, and illustrating the best-selling “French for Cats” humor books. He co-founded WordsEye, one of the first startups to come out of Columbia’s Innovation Entrepreneurship program. Recently, he was responsible for Innovation Strategy at Delos, a wellness company. COMS W4995 Intro to Agile Project Management | Tristian Boutros Project management skills are essential for professionals to meet the ever-growing demands of today’s businesses and to succeed in the global economy. From technology to finance, and construction to healthcare, project management skills are applicable across every industry. The Introduction to Agile Project Management course is tailored to both individuals who have some project management-related experience, but aspire to enhance these skills, and individuals who are just starting out in their careers and wish to gain new skills that will serve them a lifetime. As a student enrolled in this course, you will gain the critical knowledge, and foundation needed to initiate, plan, execute, and manage a successful engineering project using both traditional and agile project management approaches. Upon the completion of this course, you will be able to describe the basic values, principles and practices of Agile project management and Scrum, learn to develop a project or product roadmap, and the skills and tools needed to successfully execute projects to completion. This course will also outline the importance of organizational culture in project activities and how to develop and implement a project management framework that works for your company. Course work will explore essential concepts and techniques in project management and how to apply them, including terminology, methodologies, people management, process management, leadership, and enterprise strategy integration. Upon completion of the course, you will possess the knowledge to begin to study for multiple industry certifications as delivered by the Project Management Institute (PMI), Scrum Alliance and Scrum.org. COMS 4995 INTRO TO DATA VISUALIZATION | Swinehart, Christian Course Description: This course is a hands-on introduction to design principles, theory, and software techniques for visualizing data. Classes will be a combination of lecture, design studio, and lab. Through readings, design critique, and code assignments, students will learn how visual representations can help in the understanding of complex data, and how to design and evaluate visualizations for the purpose of analysis or communication. Students will develop skills in processing data and building interactive visualizations using D3. Topics include visual perception, exploratory data analysis, task analysis, graphic design, visual hierarchy, narrative, etc. Special Enrollment Procedures: Prospective students should add themselves to the waitlist and will be enrolled in the course based upon their completion of a warm-up assignment during the first week of the semester. COMS 4995 INTRO TO NETWORKS AND CROWDS | Chaintreau, Augustin This course covers the fundamentals underlying information diffusion and incentives on networked applications. Applications include but are not limited to social networks, crowdsourcing, online advertising, rankings, information networks like the world wide web, as well as areas where opinion formation and the aggregate behavior of groups of people play a critical role. Among structural concepts introduced and covered in class feature random graphs, small world, weak ties, structural balance, cluster modularity, preferential attachments, Nash equilibrium, Potential Game and Bipartite Graph Matching. The class examines the following dynamics: link prediction, network formation, adoption with network effect, spectral clustering and ranking, spread of epidemic, seeding, social learning, routing game, all-pay contest and truthful bidding. COMS 4995 LOGIC AND COMPUTABILITY | Pitassi, Toniann Topics: Propositional logic: syntax and semantics, Resolution and Propositional Sequent Calculus soundness and completeness. First order logic: syntax and semantics, First Order Sequent Calculus soundness and completeness. Godel’s Incompleteness theorems. Computability: Recursive and recursively enumerable functions, Church’s thesis, unsolvable problems. COMS 4995 Mathematics of Machine Learning and Signal Recognition | Homayoon S Beigi Mathematics of Machine Learning and Signal Recognition provides the background mathematical background for addressing in-depth problems in machine learning, as well as the treatment of signals, especially time-dependent signals, specifically non-stationary time-dependent signals – although spatial signals such as images are also considered. The course will provides the essentials of several mathematical disciplines which are used in the formulation and solution of the problems in the above fields. These disciplines include Linear Algebra and Numerical Methods, Complex Variable Theory, Measure and Probability Theory (as well as statistics), Information Theory, Metrics and Divergences, Linear Ordinary and Separable Partial Differential Equations of Interest, Integral Transforms, Decision Theory, Transformations, Nonlinear Optimization Theory, and Neural Network Learning Theory. The requirements are Advanced Calculus and Linear Algebra. Knowledge of Differential Equations would be helpful. COMS 4995 MOBILE APP DEVELOP IOS | THOMAS, HUGH Course outline and overall goals Mobile application development based on Apple’s iOS operating system and Swift programming language. The class will need to work on Apple Mac computers running Xcode, students will learn how to develop applications for iPhones/iPads/iWatch devices. Students will create mobile applications based on the latest programming patterns and frameworks in use in the mobile industry today. The class covers fundamentals essential to understanding all aspects of app development from concept to deployment on the App Store. Taught in a team environment. Students required to present their project proposals and deliver a fully functional mobile application as a final project. Class Topics Lecture 1 – Intro to Mobile Application Development & XCode IDE Lecture 2 – Intro to Swift & Storyboard (Constraints) – my first app – [Homework 1 (10%) • Lecture The App Lifecycle (App Delegate) & more Swift syntax; Intro to Source Code Control (Git) • Lecture Storyboard Navigation (Back, Tabbar, Page) [Red/green/blue] • Lecture More Swift (Delegation & TableViewControllers) [Homework 2 (10%)] • Lecture More Swift (JSON parsing from file) [Shopping list] • Lecture More Swift {Completion blocks} & Networking APIs (REST) [Homework 3 (20%)] • Lecture iOS Frameworks (Core Location/MapKit/ARKit/HealthKit) • Lecture Data Persistence (User defaults/CoreData) HW3 MIDTERM DUE (20%) • Lecture UI/UX (Accessibility/i18n/l10n) [Final Project Description] • Lecture Networking and Authentication for Enterprise Apps (REST/OAUTH/GRAPHQL) • Lecture Application Analytics Tools (app statistics, crash reports) / [Final Project storyboard] • Lecture Deploying your app (AppStore, Testflight, Enterprise distribution) • Lecture Final Project presentations to class FINAL PROJECT DUE (50% of Class Grade) COMS 4995 NEURAL NETWORKS DEEP LEAR | Zemel, Richard Website It is very hard to hand design programs to solve many real world problems, e.g. distinguishing images of cats versus dogs. Machine learning algorithms allow computers to learn from example data, and produce a program that does the job. Neural networks are a class of machine learning algorithm originally inspired by the brain, but which have recently have seen a lot of success at practical applications. They are at the heart of production systems at companies like Google and Facebook for image processing, speech-to-text, and language understanding. This course gives an overview of both the foundational ideas and the recent advances in neural net algorithms. Roughly the first 2/3 of the course focuses on supervised learning — training the network to produce a specified behavior when one has lots of labeled examples of that behavior. The last 1/3 focuses on unsupervised learning and reinforcement learning. COMS 4995 OPEN SOURCE DEVELOPMENT | Paine, Timothy Course Description: In this course, students will learn how to build and maintain open source projects. Students will be responsible for both supporting an existing open source project of their choosing, as well as creating their own open source project (both in either Python or Javascript, under the direction of the instructor). In lieu of homeworks or exams, ongoing progress reports and a final presentation on these two will serve as the grading basis for the course. The course will include an overview of general software engineering concepts, including version control, testing, modern development workflows, and software licensing, as well as a brief history of open source software including major court cases in copyright, patent, and trademark law. We will also learn about popular tools for – project management (Github, Kanban/Agile boards) – testing (GitHub Actions, Jenkins) – static analysis and coverage (Codecov, Coveralls) – documentation (GitHub Pages, Sphinx, MkDocs, Docusaurus, ReadTheDocs) – publishing (npm, PyPI, anaconda) Beyond the basics, students will learn how these tools can be integrated together in their open source projects to better manage their development and community. COMS 4995 PARALLEL FUNCTIONAL PROGR | Edwards, Stephen Prerequisites: COMS 3157 Advanced Programming or the equivalent. Knowledge of at least one programming language and related development tools/environments required. Functional programming experience not required. Functional programming in Haskell, with an emphasis on parallel programs. The goal of this class is to introduce you to the functional programming paradigm. You will learn to code in Haskell; this experience will also prepare you to code in other functional languages. The first half of the class will cover basic (single-threaded) functional programming; the second half will cover how to code parallel programs in a functional setting. COMS W4995 Semantic Representations for NLP | Daniel Bauer Most NLP tasks and applications require some level of understanding of the semantics (meaning) of linguistic expressions. The question of how to represent semantics and how to map between surface linguistic expressions to semantic representations is therefore an important part of NLP research. This course will explore some of the challenges surrounding semantic representations in various applications. We will compare a variety of approaches to representing the meaning of words and sentences from an NLP perspective, including symbolic/logic-based representations and resources, as well as modern distributional and multi-modal approaches. Requirements include homework assignments, a paper presentation, and a final project. COMS 4995 TECH INTERVIEW PREP C++ | Yongwhan Lim Upon successful completion of the course, you will have mastered the fundamental knowledge required to succeed in any entry-level technical interview at the top-tier IT companies (FAANG or equivalent). In case you are looking for a job in the IT industry upon graduation, you will get exposed to what software engineers do on a day-to-day basis. We will also touch on some system design and behavioral interview questions but, as those are typically not part of the entry-level technical interview loop, those would not be the main focus of the course COMS 4995 UBIQUITOUS SEQUENCING | Pe’er, Itshack DNA sequences are life’s information system. The recent technological revolution allowing ubiquitous collection of such sequence data opened up applications from viral identification to molecular barcoding to forensics to efficient long-term data storage and more. The class will present background to the available technologies along with an introduction to what can be gleaned from the data they produce. The class will include a significant hands-on component in hackathon format. The class is open to an interdisciplinary community of undergraduates and graduate students who will mutually benefit one another with their disciplinary skills. Specifically, students with zero background in biology are welcome. Computing background is needed at a very basic level (Intro CS, or Computing in Context, or AP CS or instructor’s approval). A detailed description of a previous run of the class is available in https://elifesciences.org/articles/14258 COMS 6998 TOPICS COURSES COMS 6998 TOPICS COURSES COMS 6998 ADV SPOKEN LANGUAGE PROCESSING | Hirschberg, Julia Course Description:  This class will introduce students to spoken language processing:  basic concepts, analysis approaches, and applications.  Applications include Text-to-Speech Synthesis, dialogue systems, and analysis of entrainment, personality, emotion, humor and sarcasm, deception and charisma. 6998 ADV TOPICS PROJ DEEP LEAR | Belhumeur, Peter This is a seminar course in which the students read, present, and discuss research papers on deep learning. The focus will be mostly on applications in computer vision, but topics in natural language processing, language translation, and speech recognition will also be read and discussed. It is expected that students taking the course will have prior experience with deep learning and neural network architectures. There will be no assignments other than reading and presentations. However, there will be a final project that students will work on throughout the duration of the semester. Enrollment is capped at 25 students. Instructor permission is required to register. COMS 6998 ADV WEB DESIGN STUDIO | Chilton, Lydia This semester, Advanced Web Design Studio is partnering with faculty and students in Journalism and Architecture to design, build and deploy “public interest technology.” We will introduce interdisciplinary design methods and principles for Human Computer Interaction — mixing Architecture, Urban Planning, Computer Science, and Journalism — that respond to the potentials as well as the adverse effects of computation on society today. Our work will be dedicated to leveraging technology to support public interest organizations. We will move beyond short-term metrics—clicks, daily active users, and private profit—to focus on fostering long-term value and local networks. Students will work together to create and deploy interdisciplinary projects in collaborative teams, with the aim of serving the public and using technology to advance justice, equality, and inclusion in society. We will also be alert to the ways in which the language of “public interest” can sometimes hide or offer alibis for other political or private interests. For the first half of the semester, coding and design exercises, and complete short readings on journalism, urban planning, and public interest technology. During the second half of the semester students will iterate their work and put their projects into action. A strict pre-requisite is to have taken COMS 4170 UI Design, or have taken an equivalent class with both web-based implementation and design components. You must also fill out the prerequisite form that will be available thru SSOL. It is also here: https://forms.gle/v3a22idw9qgubgcG9. The faculty instructors in each area are: Lydia Chilton: School of Engineering, Computer Science; Mark Hansen: School of Journalism; Laura Kurgan: Graduate School of Architecture, Planning and Preservation Here are some examples of Public Interest Technology: — Ushahidi: Since 2008, thousands have used this crowdsourcing platform in disaster settings, from violence post-election to earthquakes and floods worldwide. — OneBusAway: Results from Providing Real-Time Arrival Information for Public Transit. (2010) — Discrimination in Online Ad Delivery: Google ads, black names and white names, racial discrimination, and click advertising (2013) — Anti Eviction Mapping is a volunteer data-visualization, data analysis, and storytelling collective documenting the dispossession and resistance upon gentrifying landscapes (since 2013) COMS 6998 ALGEBRAIC TECHNIQUES IN CS | Joshua H Alman Algebraic techniques have been used in nearly every area of computer science. This course will develop some of these techniques and explore a broad range of applications. We will mostly see applications to algorithm design and complexity theory, but we will touch on applications to other areas as well. The course will focus on four main topics: Algebraic graph algorithms. The fastest known algorithms for several important graph problems use algebraic tools. Often, the graph problem appears (at first glance) to have nothing to do with algebra, and algorithm designers have found surprising algebraic connections. The polynomial method. If one can capture a computational task using a simple polynomial, then fast algorithms for manipulating polynomials can often be used to solve the problem more efficiently. In contrast, if one can show that a task cannot be captured by simple polynomials, this can often be used to prove complexity-theoretic lower bounds. Matrix rigidity. Some of the most important and applicable algorithms are for computing linear transforms such as Fourier transforms. Matrix rigidity is a powerful but poorly understood tool for understanding their complexity. A matrix is called rigid if it cannot be decomposed as the sum of a low-rank matrix and a sparse matrix. It remains an open problem to prove that any explicit family of matrices is rigid. Matrix multiplication algorithms. Matrix multiplication is prevalent in computational science and is known to be equivalent to many other computational problems in linear algebra. We will see how fast matrix multiplication algorithms are designed, including some recent developments. Evaluation will be primarily based on a final project. I will provide a list of suggestions for the project, but students are encouraged to relate their project to their interests. There will also be occasional (at most 4) homework assignments, and students will be asked to scribe a lecture. COMS 6998 CLOUD COMPUTING & BIG DAT | Sahu, Sambit This is a graduate-level course on Cloud Computing and Big Data with an emphasis on hands-on design and implementation. You will learn to design and build extremely large-scale systems and learn the underlying principles and building blocks in the design of such large-scale applications. You will be using real Cloud platforms and services to learn the concepts to build such applications. The first part of the course covers basic building blocks such as essential cloud services for web applications, cloud programming, virtualization, containers, kubernetes and micro-services. We shall learn these concepts by using and extending capabilities available in real clouds such as Amazon AWS, Google Cloud. The second part of the course will focus on the various stacks used in building an extremely large-scale system, such as (i) Kafka for event logging and handling, (ii) Spark and Spark streaming for large-scale computations, (iii) Elastic Search for extremely fast indexing and search, (iv) various noSQL database services such as DynamoDB, Cassandra, (v) cloud-native with kubernets, (vi) cloud platforms for Machine Learning and Deep Learning based applications. Several real-world applications will be covered to illustrate these concepts and research innovations. Students are expected to participate in class discussions, read research papers, work on three programming assignments, and conduct a significant course project. Given that this is a very hands-on course, it is expected that students have a decent programming background. Prerequisite: Good programming experience in any language, Concepts of Web Applications and Systems Reading Material: Lecture Notes, Reading Papers, Reference Text Books, Lot of Engineering Docs Grading: 3 Programming Assignments (35%), 2 Quizzes (25%), Project (40%) COMS 6998 COMPUTATION AND THE BRAIN | Papadimitriou, Christos Prerequisites: Familiarity with computation and algorithms. Some familiarity with Neuroscience; or willingness to venture into a vast, complex, and fascinating field. Familiarity with machine learning useful. Despite brilliant and accelerating progress in experimental Neuroscience, there is little progress towards an overarching understanding of how the Brain works. This course will cover some basic material and results in Neuroscience, both classical and recent, from a computational perspective, that is, under the hypothesis that the way the Brain works is largely computational.” COMS 6998 EMPIRICAL METHODS DATA SC | Levine, Michelle Empirical Methods of Data Science is a seminar for students seeking an in depth understanding of how to conduct empirical research in computer science. In the first part of the seminar, we will discuss how to critically examine previous research, build and test hypotheses, and collect data in the most ethical and robust manner. As we explore different means of data collection, we will dive into ethical concerns in research. Next, we will explore how to most effectively analyze different data sets and how to present the data in engaging and exciting ways. In the last part of the seminar, we will hear from different researchers on the methods they use to conduct research, lending to further conversations and in class debates about when and how to use particular research methods. The focus will be primarily on relatively small data sets but we will also address big data. COMS 6998 FOUNDATIONS OF BLOCKCHAIN | Roughgarden, TimothyThis course will provide a rigorous introduction to the mathematical analysis of blockchain protocols, including the relevant tools and definitions from game theory, economics, and distributed computing. The target audience is beginning PhD students with interest and experience in theoretical computer science. COMS 6998 FORMAL VERIFICATION SYSTE | Gu, Ronghui This course is a graduate seminar on research in the verification of system software. The goal of the class is to get the students to build provably correct software. The structure of the class will consist of students presenting research papers during lecture, and students working on a significant research project. We expect students to start working on the project in the first week or two, and continue for the entire semester, culminating in a draft research paper. Examples of project include building a certified file system, simple OS kernel, hypervisor, database system, etc. We expect projects will build on tools such as Coq, and Z3. To get students up to speed with these tools, we will offer several tutorial lectures on Coq, using parts of the Software Foundations textbook. COMS 6998 FUND SPEECH RECOGNITION | Beigi, Homayoon Fundamentals of Speech Recognition is a comprehensive course, covering all aspects of automatic speech recognition from theory to practice. In this course such topics as Anatomy of Speech, Signal Representation, Phonetics and Phonology, Signal Processing and Feature Extraction, Probability Theory and Statistics, Information Theory, Metrics and Divergences, Decision Theory, Parameter Estimation, Clustering and Learning, Transformation, Hidden Markov Modeling, Language Modeling and Natural Language Processing, Search Techniques, Neural Networks, Support Vector Machines and other recent machine learning techniques used in speech recognition are covered in some detail. Also, several open-source speech recognition software packages are introduced, with detailed hands-on projects using Kaldi to produce a fully functional speech recognition engine. The lectures cover the theoretical aspects as well as practical coding techniques. The course is graded based on a project. The Midterm (40% of the grade is in the form of a two-page proposal for the project, and the final (60% of the grade) is an oral presentation of the project plus a 6-page conference style paper describing the results of the research project. The instructor uses his own Textbook for the course, Homayoon Beigi, “Fundamentals of Speaker Recognition,” Springer-Verlag, New York, 2011. Every week, the slides of the lecture are made available to the students. COMS 6998 HIGH PERF MACH LEARNING | Parijat Dube and Kaoutar El-Maghraoui HPML-Spring2024-Syllabus During the past decades, the field of High-Performance Computing (HPC) has been about building supercomputers to solve some of the biggest challenges in science. HPC is where cutting edge technology (GPUs, low latency interconnects, etc.) is applied to the solution of scientific and data-driven problems. One of the key ingredients to the current success of ML is the ability to perform computations on very large amounts of training data. Today, the application of HPC techniques to ML algorithms is a fundamental driver for the progress of Artificial Intelligence. In this course, you will learn HPC techniques that are typically applied to supercomputing software, and how they are applied to obtain the maximum performance out of ML algorithms. You will also learn about techniques for building efficient ML systems. The course is based on PyTorch, CUDA programming, MPI. Prerequisites Knowledge of computer architecture and operating system through course work; C/C++: intermediate programming skills; Python: intermediate programming skills; Knowledge of machine learning concepts and deep learning algorithms through course work Topics covered ML/DL and PyTorch basics, PyTorch performance. Performance optimization in Pytorch, Parallel performance modeling, Intro to CUDA and CUDA programming, Math libraries for ML (cuDNN), DNNs architectures (CNN, RNN, LSTM, Attention, Transformers) in Pytorch, Intro to MPI, Distributed ML, Distributed PyTorch algorithms, parallel data loading, and ring reduction, Quantization and model compression, hw/sw co-design and co-optimization of DNNs COMS E6998 Human-Computer Interaction | Brian Smith This course is a graduate-level seminar in which we meet once a week to discuss several human–computer interaction (HCI) research papers. We will meet once a week and cover a different research area within HCI each week. The class is open to graduate students and, with instructor permission, undergraduate students. Students will be expected to read all of the papers, write weekly reflections about the papers, and present one or two of them to the class in a presentation that is roughly 20 mins long. In our discussions, we will be talking about the papers themselves as well as the research strategy and methodology behind them. Stanford’s CS 376 is an HCI seminar of similar vein. You can see the following page for their most recent syllabus of papers: https://hcicourses.stanford.edu/cs376/2018/syllabus.php (Note that research seminar courses, including both ours and Stanford’s, tend to change the list of papers covered every year.) Our syllabus will be similar in format, and I will announce the full list of papers on the first day of class. COMS 6998 Internet Measurement (syllabus, COMS, ELEN) | Ethan Katz-Bassett In this course, we will investigate important problems, techniques, results, and challenges that arise in measuring the Internet. We will explore both what measurements tell us about the Internet and how we can leverage what they tell us to improve the Internet and services that run on it. We will learn to measure various aspects of the Internet, including topology, routing and routing policies, performance, failures, traffic, and applications. Researchers often talk about Internet measurement as being analogous to astronomy, in that we take observations from afar in order to understand how a system works. The class will be discussion-based. Students will conduct small research projects in groups — in past offerings of this course, most students published their projects in peer-reviewed venues. COMS 6998 MACHINE LEARNING & CLIMATE | Kucukelbir, Alp In this course, we will study two aspects of how ml interacts with Earth’s climate. First, we will investigate how ml can be used to tackle climate change. We will focus on use cases from transportation, manufacturing, food and agriculture, waste management, and atmospheric studies. We will ask questions like: what are the requirements for applying ml to such problems? How can we evaluate the effectiveness of our analyses? Second, we will consider ml’s own impact on the climate. We will focus on the energy and computation that goes into designing, training, and deploying modern ml systems. We will ask questions like: how can we accurately track and account for ml’s own energy footprint? What strategies can we employ to minimize it? By the end of this course, you will learn about modern statistical and causal ml methods and their applications to the climate. Our focus will be the modeling of real-world phenomena using probability models, with a focus on vision, time series forecasting, uncertainty quantification, and causality. In addition, you will gain a deeper understanding about the carbon footprint of ml itself and explore how to mitigate it. COMS 6998 NATURAL LANG GEN SUMMARIZ | McKeown, Kathleen There has been tremendous progress recently in the development of models to generate language for different purposes and to produce summaries of input documents. This success has largely come about due to rapid advances in large language models. In this class, we will explore four main topics: language generation, multimodal generation, summarization and long-format question answering. We will study large language models that have been used for these different tasks and issues that arise. For example, how possible is to control the output of these large language models along different dimensions? How do we evaluate the textual output of such systems? How can we develop models to produce or summarize creative texts? What are the ethical issues surrounding these kinds of models? This class will follow a seminar style. It will include a mixture of lectures from the instructor, guest lectures and student presentations. Students who take the class will have three main assignments. 1. For each class there will be a reading assignment consisting of several research papers. Students are responsible for reading all papers. 2. Students will be part of a presentation group which will be responsible for presenting a paper and raising critiques about one or more papers in class. 3. Each student will carry out a semester long project. Each student will be required to submit a proposal for the project near the beginning of class, turn in a midterm progress report and submit a final report and code for their project. They will do a short video presentation which will be made available to the class, the Tas and the instructor for viewing. There will be no midterm or final exam. Pre-requisite: COMS 4705, Natural Language Processing or equivalent. COMS 6998 PRACT DEEP LEARNING SYS P | Dube, Parijat This course will cover several topics in performance evaluation of machine learning and deep learning systems. Major topics covered in the course: Algorithmic and system level introduction to Deep Learning (DL), DL training algorithms, network architectures, and best practices for performance optimization, ML/DL system stack on cloud, Tools and benchmarks (e.g., DAWNBench) for performance evaluation of ML/DL systems, Practical performance analysis using standard DL frameworks (tensorflow, pytorch) and resource monitoring tools (e.g., nvidia-smi), Performance modeling to characterize scalability with respect to workload and hardware, Performance consideration with special techniques like transfer learning, semi-supervised learning, neural architecture search. Emphasis will be on getting working knowledge of tools and techniques to evaluate performance of ML/DL systems on cloud platforms. The assignments will involve running experiments using standard DL frameworks (tensorflow, pytorch) and working with open source DL technologies. The students will gain practical experience working on different stages of DL life cycle (development and deployment) and understanding/addressing related system performance issues. COMS 6998 QUANTUM COMPLEXITY CRYPTO | Yuen, Henry Course Website This is an advanced, PhD-level topics class in the theory of quantum computing, focusing in particular on cutting-edge topics in quantum complexity theory and quantum cryptography. The theme of the topics this year will be Complexity of quantum states and state transformations. An n-qubit quantum state appears to be exponentially more complex than an n-bit string; a classical description of such a state requires writing down 2n complex amplitudes in general. Here are some questions that will motivate our explorations: How does this complexity manifest itself in different information-processing tasks? How can we quantify this complexity? Can this complexity be used for cryptographic applications? Does the complexity of quantum states relate to traditional concepts in complexity theory such as circuit complexity or space complexity or time complexity? A list of possible topics: Shadow tomography of quantum states Quantum state synthesis/unitary synthesis Hamiltonian learning Quantum key distribution/quantum money QMA(2) and the power of un entanglement State complexity, AdS/CFT, and quantum gravity Quantum state complexity and statistical zero knowledge Pseudorandom states and unitaries Classical vs. quantum proofs The following notes from Scott Aaronson will be frequently consulted: https://www.scottaaronson.com/barbados-2016.pdf . The goal is to explore the results and (more importantly) the questions in this field. Course work may include: scribe notes, a few assignments, and a course project. Prerequisites Must have taken: Basic linear algebra and basic probability theory. You must have taken at least one of: An upper-level CS theory course such as complexity theory/cryptography/algorithms, or Quantum computing, or Quantum physics. It is not required that you have taken a course in quantum computing/quantum information before, but it would definitely be helpful. The lectures will introduce the concepts as needed, but will go rather quickly. The course will expect high levels of mathematical maturity and comfort with proofs. To get a sense of what this course is like, take a look at the lecture notes from this Fall 2020 topics course . COMS 6998 READINGS LANGUAGE DESIGN | Bjarne Stroustrup This course involves reading, presenting, and discussing papers on programming language design. In the first lecture, I outline some dimensions of language design and give examples of aims and ideals that have driven the development of languages. I also present a (necessarily incomplete) list of classical design papers. In the second lecture, I present a paper for discussion to give an idea of how that may be done. This is not a comparative languages class nor a type-theory class. The focus on presentations should be on ideals, aims, and principles so that language features are presented simply as examples. For older languages it is possible and desirable to discuss how the ideas worked out in actual use and evolved. Uncritical “sales jobs” of languages – as are not uncommon in early descriptions of new languages – are not acceptable as presentations. You might, of course, choose to present your favorite language, but maintain a critical and objective perspective. COMS 6998 REPRESENTATION LEARNING | Vondrick, Carl The course will discuss the latest research in representation learning. Each week, we will discuss a topic by reading papers in computer vision, NLP, machine learning, and robotics. Attendance is required and every student will be expected to speak during each class. COMS 6998 SECURITY ROBUSTNESS ML SY | Yang, Junfeng Over the past few years, Machine Learning (DL) has made tremendous progress, achieving or surpassing human-level performance for a diverse set of tasks including image classification, speech recognition, and playing games such as Go. These advances have led to widespread adoption and deployment of ML in security- and safety-critical systems such as self-driving cars, malware detection, and aircraft collision avoidance systems. This wide adoption of DL techniques presents new challenges as the predictability and correctness of such systems are of crucial importance. Unfortunately, ML systems, despite their impressive capabilities, often demonstrate unexpected or incorrect behaviors in corner cases for several reasons such as biased training data, overfitting, and underfitting of the models. In safety- and security-critical settings, such incorrect behaviors can lead to disastrous consequences such as a fatal collision of a self-driving car. For example, a Google self-driving car recently crashed into a bus because it expected the bus to yield under a set of rare conditions but the bus did not. A Tesla car in autopilot crashed into a trailer because the autopilot system failed to recognize the trailer as an obstacle due to its “white color against a brightly lit sky” and the “high ride height.” Such corner cases were not part of Google’s or Tesla’s test set and thus never showed up during testing. Other examples include Microsoft’s Tay chatbot tweeting racist words because it was misled by malicious twitter users, and Google removing “gorilla” as an image class after its image classification algorithm incorrectly classified dark skined people as gorillas. These challenges have drawn huge attention from researchers in machine learning, security, systems, and programming language communities. A number of techniques and theories have been proposed to increase the robustness and security of machine learning. In this course, we will study the most practical and most important of these techniques and theories with a focus on deep learning. For details on the topics we’ll cover, please go to the Course Syllabus page. COMS 6998 SYS FOR HUMAN DATA INTERA | Wu, Eugene Human Data Interaction studies the interface between humans and data. What types of interfaces are suitable for different data tasks? Further, creating human data interfaces is extremely challenging because the responsiveness of the interface directly depends on the system architecture as well as the interface design. What system innovations are needed to simplify how effective human data interfaces can be created and used? Human Data Interaction is a nascent field, and we will study modern research in data visualization, HCI, data analysis, and data management systems. This seminar course will center around reading, reviewing, and discussing research papers. Each session will consist of a round table discussion of the week’s readings to understand the context, the technical details, and to brain storm follow up research questions. Students will work in small teams on a semester-long research project that is within the scope of the course topic. COMS 6998: The Economics of Cyber Security| Adam Hastings & Simha Sethumadhavan Prerequisites : COMS 4181 or equivalent; and at least two additional COMS or CSEE 41xx or 48xx classes or equivalent with instructor approval. Description: Designing modern computer systems requires computer systems engineers to balance factors of human behavior, ethics, incentives, economics, policy, laws, and regulations, in addition to traditional engineering requirements like performance, cost, scalability, and security. This class will prepare computer systems engineers to design systems to meet these modern, multi-faceted needs. COMS 6998 TOPICS IN CLOUD COMPUTING \\ Kostis Kaffes One of the most significant transformations in the computer sector over the last decade has been the rise of cloud computing. Companies are progressively transferring their tasks to external cloud platforms and utilizing advanced global services that were previously unattainable within individual data centers. Nonetheless, the construction and utilization of cloud systems entails tackling numerous intricate research challenges. This research seminar will explore both industrial and academic contributions to cloud computing. Participants will engage in guest presentations delivered by prominent authorities in the field, analyze and guide discussions on research papers, and collaborate in small groups to undertake a research project throughout the semester. COMS 6998: Topics in Mobile X | Xia Zhou Prerequisites: Because this is a high-level course, we assume that students already have a solid understanding of the basics of some areas, including networking, communication, and machine learning. There are multiple ways of demonstrating a networking and machine learning background, including taking undergraduate networking classes, machine learning classes, or equivalent classes, and experiences of working on related projects. The course project is an important part of this class. Students must have good programming skills and project experience. Abstract: Topics in Mobile X is an upper-level course on mobile computing and ubiquitous systems, covering a broad range of advanced and interdisciplinary topics in mobile computing, networking, and applications. All these topics center on unique challenges faced on bringing computation, networking, and applications to the mobile computing platform — a platform that is constrained in form factor, energy, and computation power, with examples such as smartphones, smart watches or wrist bands, smart glasses, and more. Example topics include mobile communication and networking, mobile sensing, mobile human-to-computer interaction (HCI), mobile learning/AI, and mobile security. For each topic, we will study both conventional perspectives and recent research trends. Students will learn key principles in mobile computing research, understand the state of the art in this research area, and gain experience of carrying out original research through class projects. The end goal is to generate publishable results by the end of the term. In addition, students will practice their skills in paper reading/writing and public presentation in the form of weekly research essays, class discussions, paper critiques, project reports and presentations. As a research-oriented course, this course is based on research papers in top-tier conferences. No particular textbooks are required, but following textbooks are good references for students to refresh networking background and better understand papers. Theodore Rappaport. Wireless Communications: Principles and Practice. William Stallings. Wireless Communications and Networks. Pei Zheng, Larry L. Peterson, Bruce S. Davie, and Adrian Farrel. Wireless Networking Complete. James Kurose and Keith Ross. Computer Networking: A Top-Down Approach. Larry Peterson and Bruce Davie. Computer Networks: A Systems Approach. Andrew S. Tanenbaum. Computer Networks. Course Website: https://www.cs.columbia.edu/~xia/mobilex/ COMS 6998 TOPICS IN ROBOTIC LEARNING | Song, Shuran This is an advanced seminar course that will focus on the latest research in machine learning for robotics. More specifically, we study how machine learning and data-driven method can influence the robot’s perception, planning, and control. For example, we will explore the problem of how a robot can learn to perceive and understand its 3D environment, how they can learn from experience to make reasonable plans, and how they can reliably act upon with the complex environment base on their understanding of the world. Students will read, present, and discuss the latest research papers on robot learning as well as obtain experience in developing a learning-based robotic system in the course projects. COMS 6998 Types, Languages, and Compilers | Stephen Edwards An advanced course on modern programming language and type theory with a focus on functional languages and concrete implementations. The goal is to become fluent in the concepts and formalisms typical of papers in conferences such as POPL. Judgments, Logic, and Inductive Definitions; Context-free Grammars; the Lambda Calculus; the Simply Typed Lambda Calculus; Type Inference, Hindley-Milner-Damas; Operational Semantics; Proof Assistants, Dependent Type Systems, and the Curry-Howard Correspondence. Prerequisites: COMS 4115 Programming Languages and Translators; COMS 3203 Discrete Mathematics; COMS 3261 Computer Science Theory. Equivalents acceptable COMS E6998 Virtual Technologies for Cloud Computing | Jason Nieh Prerequisites: COMS 4118 Operating Systems or the equivalent. This course will cover the underlying technologies that enable major cloud computing providers to deliver computing resources to consumers on-demand over the Internet, focusing primarily on virtualization and Infrastructure as a Service (IaaS) cloud models. Topics to be covered will include many aspects of the design and implementation of hypervisors and containers, ranging from architectural support for virtualization to live migration to cloud computing security. The course will have homework assignments and a final project, both of which will involve systems programming. COMS 6998: Unconditional Lower Bounds and Derandomization | Rocco Servedio Prerequisites : The most important prerequisite is “mathematical maturity”; you should be comfortable with proofs, basic discrete math, combinatorics, probability, and linear algebra. If you have questions about your mathematical readiness you should contact the instructor before enrolling. COMS 4236 (Introduction to Computational Complexity) is good preparation, but this is not required. The course will not include any programming. Description : This is a course about unconditional lower bounds and complexity-theoretic pseudorandom generators for restricted models of computation. We will study many unconditional lower bounds and derandomization results for interesting and important models of computation, covering various “gens” of the field that have been discovered over the past few decades. There will be an emphasis on techniques and we will highlight many open questions along the way. http://www.cs.columbia.edu/~rocco/Teaching/S24/ COMS 6998 VIRTUAL AND AUGMENTED REALITY | Feiner, Steven This course will cover selected topics in VR and AR. There are two main components, with everyone participating in both: papers and projects. Papers: Throughout the semester, we will be reading, presenting, and discussing papers that address important research themes in VR and AR. Each of you will be individually responsible for reading and commenting on all the papers and for participating in a team presentation of a selected set of papers related to one theme. Projects: You will be developing a project in a small (individual or 2-3 person) team using the Unity 3D development environment. Projects will use either headset-based VR or phone-based AR. Through the generosity of a Provost Emerging Technology Grant, I expect to lend an Oculus Quest to each of you doing a headset-based VR project. Thus, members of all team projects can work remotely from each other without needing to share equipment. While you can generate your own project idea, I will encourage you to choose from a collection of projects co-advised with faculty and students in other schools, ranging from Medicine and Dentistry, to Social Work. Prerequisites: You will ideally have taken COMS W4172 (3D User Interfaces and Augmented Reality) or equivalent and be comfortable with developing in Unity. However, I am willing to admit students who don’t have this background, with the understanding that you will need to get up to speed with Unity, starting early in September. Please fill out the survey linked to the course SSOL entry, which is a necessary precondition to being admitted to the course. Intro Courses Computing in Context (COMS W1002) is a computer science course for non-majors, emphasizing computational methods for text analysis while teaching Python programming. The class combines lectures in basic computer science with lectures and projects applying those methods to multiple disciplines within the liberal arts, including digital humanities, social science, and econ financing. For more information, see It’s a Computing Revolution in the Liberal Arts . Introduction to Computing for Engineers and Applied Scientists (ENGI E1006) introduces computational thinking, algorithmic problem solving, and Python programming with projects designed around applications in science and engineering. Intended for first-year SEAS students. Emerging Scholars Program (COMS W1404) is a 1-point, pass/fail, semester-long program that concentrates on the collaborative and problem-solving aspects of computer science. Weekly workshops give students an extra opportunity to explore CS-related topics and fields. Previous Years: 2021 - 2022 | 2022 - 2023 | 2023 - 2024 | 2024 - 2025 Filter by Term --All-- Spring 2024 Fall 2023 Course Title Course Number (Registrar Call #) Term Instructor Day(s) Time Location Introduction To Computer  Science And Programming In Java COMS W 1004-002 ( 12052 ) Spring 2024 Cannon, Adam H TR 1:10 PM - 2:25 PM 417 IAB More Details Intro To Comp For Eng/app ENGI E 1006-001 ( 12126 ) Spring 2024 Paine, Timothy TR 5:40 PM - 6:55 PM 301 PUP More Details Emerging Scholars Prog Seminar COMS W 1404-001 ( 12053 ) Spring 2024 Cannon, Adam H Fr 8:40 AM - 9:55 AM 502 NWC More Details Emerging Scholars Prog Seminar COMS W 1404-002 ( 12054 ) Spring 2024 Cannon, Adam H Fr 10:10 AM - 11:25 AM 502 NWC More Details Emerging Scholars Prog Seminar COMS W 1404-003 ( 12055 ) Spring 2024 Cannon, Adam H Fr 11:40 AM - 12:55 PM 502 NWC More Details Emerging Scholars Prog Seminar COMS W 1404-004 ( 12056 ) Spring 2024 Cannon, Adam H Fr 1:10 PM - 2:25 PM 502 NWC More Details Emerging Scholars Prog Seminar COMS W 1404-005 ( 12057 ) Spring 2024 Cannon, Adam H Fr 2:40 PM - 3:55 PM 502 NWC More Details Emerging Scholars Prog Seminar COMS W 1404-006 ( 12058 ) Spring 2024 Cannon, Adam H Fr 4:10 PM - 5:25 PM 502 NWC More Details Emerging Scholars Prog Seminar COMS W 1404-007 ( 12059 ) Spring 2024 Cannon, Adam H Fr 9:30 AM - 10:45 AM 253 ENG More Details Emerging Scholars Prog Seminar COMS W 1404-008 ( 12061 ) Spring 2024 Cannon, Adam H Fr 11:00 AM - 12:15 PM 253 ENG More Details Emerging Scholars Prog Seminar COMS W 1404-009 ( 12063 ) Spring 2024 Cannon, Adam H Fr 12:30 PM - 1:45 PM 253 ENG More Details Emerging Scholars Prog Seminar COMS W 1404-010 ( 12064 ) Spring 2024 Cannon, Adam H Fr 2:00 PM - 3:15 PM 253 ENG More Details Dev Tech COMS W 3102-001 ( 12065 ) Spring 2024 Ahamed, Shoaib Fr 6:10 PM - 8:00 PM 451 CSB More Details Data Structures in Java COMS W 3134-001 ( 12067 ) Spring 2024 Borowski, Brian S. MW 4:10 PM - 5:25 PM 301 URI More Details Data Structures in Java COMS W 3134-002 ( 12068 ) Spring 2024 Borowski, Brian S. MW 5:40 PM - 6:55 PM 301 URI More Details Advanced Programming COMS W 3157-001 ( 12069 ) Spring 2024 Lee, Jae Woo TR 4:10 PM - 5:25 PM 417 IAB More Details Discrete Mathematics: Introduction To Combinatorics and Graph Theory COMS W 3203-001 ( 12070 ) Spring 2024 Salleb-Aouissi, Ansaf TR 10:10 AM - 11:25 AM 301 URI More Details Discrete Mathematics: Introduction To Combinatorics and Graph Theory COMS W 3203-002 ( 12071 ) Spring 2024 Salleb-Aouissi, Ansaf TR 11:40 AM - 12:55 PM 301 URI More Details Computer Science Theory COMS S 3261-001 ( 12072 ) Spring 2024 Alman, Josh MW 2:40 PM - 3:55 PM 417 IAB More Details Computer Science Theory COMS S 3261-022 ( 12073 ) Spring 2024 Yannakakis, Mihalis TR 11:40 AM - 12:55 PM 501 NWC More Details Fundamentals of Computer Systems CSEE W 3827-001 ( 12121 ) Spring 2024 Rubenstein, Dan TR 10:10 AM - 11:25 AM 207 MAT More Details Fundamentals of Computer Systems CSEE W 3827-002 ( 12122 ) Spring 2024 Rubenstein, Dan TR 11:40 AM - 12:55 PM 428 PUP More Details Fieldwork COMS W 3999-005 ( 15685 ) Spring 2024 Andoni, Alexandr - More Details Fieldwork COMS W 3999-006 ( 15688 ) Spring 2024 Bauer, Daniel - More Details Fieldwork COMS W 3999-007 ( 15689 ) Spring 2024 Belhumeur, Peter N - More Details Fieldwork COMS W 3999-008 ( 15690 ) Spring 2024 Bellovin, Steven M. - More Details Fieldwork COMS W 3999-009 ( 15707 ) Spring 2024 Elhadad, Noemie - More Details Fieldwork COMS W 3999-010 ( 15691 ) Spring 2024 Blaer, Paul S - More Details Fieldwork COMS W 3999-011 ( 15692 ) Spring 2024 Blei, David - More Details Fieldwork COMS W 3999-012 ( 15696 ) Spring 2024 Cannon, Adam H - More Details Fieldwork COMS W 3999-013 ( 15697 ) Spring 2024 Carloni, Luca - More Details Fieldwork COMS W 3999-014 ( 15698 ) Spring 2024 Chaintreau, Augustin - More Details Fieldwork COMS W 3999-015 ( 15700 ) Spring 2024 Chen, Xi - More Details Fieldwork COMS W 3999-016 ( 15739 ) Spring 2024 Pitassi, Toniann - More Details Fieldwork COMS W 3999-017 ( 15705 ) Spring 2024 Drinea, Eleni - More Details Fieldwork COMS W 3999-018 ( 15706 ) Spring 2024 Edwards, Stephen A. - More Details Fieldwork COMS W 3999-020 ( 15708 ) Spring 2024 Feiner, Steven K - More Details Fieldwork COMS W 3999-021 ( 15709 ) Spring 2024 Geambasu, Roxana - More Details Fieldwork COMS W 3999-022 ( 15710 ) Spring 2024 Gravano, Luis - More Details Fieldwork COMS W 3999-023 ( 15767 ) Spring 2024 Zemel, Richard - More Details Fieldwork COMS W 3999-024 ( 15713 ) Spring 2024 Hirschberg, Julia B. - More Details Fieldwork COMS W 3999-025 ( 15715 ) Spring 2024 Hsu, Daniel J - More Details Fieldwork COMS W 3999-026 ( 15716 ) Spring 2024 Jana, Suman - More Details Fieldwork COMS W 3999-027 ( 15684 ) Spring 2024 Alman, Josh - More Details Fieldwork COMS W 3999-028 ( 15718 ) Spring 2024 Kaiser, Gail E - More Details Fieldwork COMS W 3999-029 ( 15720 ) Spring 2024 Kender, John R - More Details Fieldwork COMS W 3999-030 ( 15753 ) Spring 2024 Song, Shuran - More Details Fieldwork COMS W 3999-031 ( 15721 ) Spring 2024 Kim, Martha A - More Details Fieldwork COMS W 3999-032 ( 15725 ) Spring 2024 Lee, Jae Woo - More Details Fieldwork COMS W 3999-033 ( 15727 ) Spring 2024 Malkin, Tal G - More Details Fieldwork COMS W 3999-034 ( 15728 ) Spring 2024 McKeown, Kathleen - More Details Fieldwork COMS W 3999-035 ( 15729 ) Spring 2024 Misra, Vishal - More Details Fieldwork COMS W 3999-036 ( 15733 ) Spring 2024 Nayar, Shree K - More Details Fieldwork COMS W 3999-037 ( 15734 ) Spring 2024 Nieh, Jason - More Details Fieldwork COMS W 3999-038 ( 15682 ) Spring 2024 AlQuraishi, Mohammed - More Details Fieldwork COMS W 3999-039 ( 15737 ) Spring 2024 Pe'er, Itsik G - More Details Fieldwork COMS W 3999-040 ( 15744 ) Spring 2024 Ross, Kenneth A - More Details Fieldwork COMS W 3999-041 ( 15746 ) Spring 2024 Rubenstein, Dan - More Details Fieldwork COMS W 3999-042 ( 15747 ) Spring 2024 Salleb-Aouissi, Ansaf - More Details Fieldwork COMS W 3999-043 ( 15749 ) Spring 2024 Schulzrinne, Henning G - More Details Fieldwork COMS W 3999-044 ( 15750 ) Spring 2024 Servedio, Rocco A. - More Details Fieldwork COMS W 3999-045 ( 15751 ) Spring 2024 Sethumadhavan, Simha - More Details Fieldwork COMS W 3999-046 ( 15755 ) Spring 2024 Stolfo, Salvatore J - More Details Fieldwork COMS W 3999-047 ( 15694 ) Spring 2024 Blumberg, Andrew - More Details Fieldwork COMS W 3999-048 ( 15762 ) Spring 2024 Wu, Eugene - More Details Fieldwork COMS W 3999-049 ( 15763 ) Spring 2024 Yang, Junfeng - More Details Fieldwork COMS W 3999-050 ( 15764 ) Spring 2024 Yannakakis, Mihalis - More Details Fieldwork COMS W 3999-051 ( 15768 ) Spring 2024 Zheng, Changxi - More Details Fieldwork COMS W 3999-052 ( 15745 ) Spring 2024 Roughgarden, Tim - More Details Fieldwork COMS W 3999-053 ( 15770 ) Spring 2024 Zussman, Gil - More Details Fieldwork COMS W 3999-054 ( 15699 ) Spring 2024 Chang, Shih-Fu - More Details Fieldwork COMS W 3999-056 ( 15732 ) Spring 2024 Muresan, Smaranda - More Details Fieldwork COMS W 3999-057 ( 15726 ) Spring 2024 Lipson, Hod - More Details Fieldwork COMS W 3999-058 ( 15731 ) Spring 2024 Mueller, Andreas - More Details Fieldwork COMS W 3999-059 ( 15703 ) Spring 2024 Ciocarlie, Matei - More Details Fieldwork COMS W 3999-060 ( 15701 ) Spring 2024 Chilton, Lydia B - More Details Fieldwork COMS W 3999-061 ( 15735 ) Spring 2024 Papadimitriou, Christos H - More Details Fieldwork COMS W 3999-062 ( 15758 ) Spring 2024 Verma, Nakul - More Details Fieldwork COMS W 3999-063 ( 15752 ) Spring 2024 Smith, Brian A - More Details Fieldwork COMS W 3999-064 ( 15687 ) Spring 2024 Bareinboim, Elias - More Details Fieldwork COMS W 3999-065 ( 15711 ) Spring 2024 Gu, Ronghui - More Details Fieldwork COMS W 3999-066 ( 15759 ) Spring 2024 Vondrick, Carl - More Details Fieldwork COMS W 3999-067 ( 15719 ) Spring 2024 Katz-Bassett, Ethan - More Details Fieldwork COMS W 3999-068 ( 15743 ) Spring 2024 Ray, Baishakhi - More Details Fieldwork COMS W 3999-069 ( 15722 ) Spring 2024 Knowles, David - More Details Fieldwork COMS W 3999-070 ( 15704 ) Spring 2024 Dear, Tony - More Details Fieldwork COMS W 3999-071 ( 15702 ) Spring 2024 Cidon, Asaf - More Details Fieldwork COMS W 3999-072 ( 15760 ) Spring 2024 Wing, Jeannette M - More Details Fieldwork COMS W 3999-073 ( 15742 ) Spring 2024 Rambow, Owen C. - More Details Fieldwork COMS W 3999-074 ( 15761 ) Spring 2024 Wright, Rebecca - More Details Fieldwork COMS W 3999-075 ( 15723 ) Spring 2024 Krstovski, Kriste - More Details Fieldwork COMS W 3999-076 ( 15724 ) Spring 2024 Kucukelbir, Alp - More Details Fieldwork COMS W 3999-077 ( 15693 ) Spring 2024 Blikstein, Paulo - More Details Fieldwork COMS W 3999-079 ( 15748 ) Spring 2024 Santolucito, Mark - More Details Fieldwork COMS W 3999-080 ( 15730 ) Spring 2024 Morrison-Smith, Sarah - More Details Fieldwork COMS W 3999-081 ( 15765 ) Spring 2024 Yu, Zhou - More Details Fieldwork COMS W 3999-082 ( 15766 ) Spring 2024 Yuen, Henry - More Details Fieldwork COMS W 3999-083 ( 15714 ) Spring 2024 Horesh, Lior - More Details Fieldwork COMS W 3999-084 ( 15695 ) Spring 2024 Borowski, Brian S. - More Details Fieldwork COMS W 3999-085 ( 15769 ) Spring 2024 Zhou, Xia - More Details Fieldwork COMS W 3999-086 ( 15686 ) Spring 2024 Azizi, Elham - More Details Fieldwork COMS W 3999-088 ( 15756 ) Spring 2024 Thakoor, Kaveri - More Details Fieldwork COMS W 3999-089 ( 15740 ) Spring 2024 Plancher, Brian - More Details Fieldwork COMS W 3999-090 ( 15712 ) Spring 2024 Gursoy, Gamze - More Details Fieldwork COMS W 3999-091 ( 15736 ) Spring 2024 Pappu, Vijay - More Details Fieldwork COMS W 3999-092 ( 15717 ) Spring 2024 Kaffes, Kostis - More Details Introduction to Databases COMS W 4111-001 ( 12074 ) Spring 2024 Ross, Kenneth A MW 2:40 PM - 3:55 PM 309 HAV More Details Introduction to Databases COMS W 4111-002 ( 12075 ) Spring 2024 Ferguson, Donald F. Fr 10:10 AM - 12:40 PM 417 IAB More Details Programming Languages and Translators COMS W 4115-001 ( 12077 ) Spring 2024 Gu, Ronghui MW 4:10 PM - 5:25 PM 501 SCH More Details Operating Systems, I COMS W 4118-001 ( 12079 ) Spring 2024 Kaffes, Kostis TR 4:10 PM - 5:25 PM 501 NWC More Details Computer Networks CSEE W 4119-002 ( 12160 ) Spring 2024 Zhou, Xia TR 11:40 AM - 12:55 PM 451 CSB More Details Computer Systems for Data Science CSEE W 4121-002 ( 12974 ) Spring 2024 Sahu, Sambit Th 7:00 PM - 9:30 PM 417 IAB More Details Computer Graphics COMS W 4160-001 ( 13865 ) Spring 2024 Fadaifard, Hadi TR 7:10 PM - 8:25 PM 451 CSB More Details Animation COMS W 4167-001 ( 12080 ) Spring 2024 Zheng, Changxi TR 4:10 PM - 5:25 PM 451 CSB More Details User Interface Design COMS W 4170-001 ( 12081 ) Spring 2024 Chilton, Lydia B MW 1:10 PM - 2:25 PM 417 IAB More Details 3D User Interfaces and Augmented Reality COMS W 4172-001 ( 12082 ) Spring 2024 Feiner, Steven K TR 1:10 PM - 2:25 PM 227 MUDD More Details Analysis of Algorithms I CSOR W 4231-001 ( 12124 ) Spring 2024 Drinea, Eleni TR 11:40 AM - 12:55 PM 833 MUDD More Details Analysis of Algorithms I CSOR W 4231-002 ( 12125 ) Spring 2024 Papadimitriou, Christos H TR 10:10 AM - 11:25 AM 451 CSB More Details Advanced Algorithms COMS W 4232-001 ( 12084 ) Spring 2024 Andoni, Alexandr MW 2:40 PM - 3:55 PM 633 MUDD More Details Principles of Innovation and Entrepreneurship (co-instructor: William Reinisch) COMS W 4460-001 ( 12085 ) Spring 2024 Reinisch, William MW 8:40 AM - 9:55 AM 415 CEPSR More Details Artificial Intelligence COMS W 4701-001 ( 12086 ) Spring 2024 Dear, Tony MW 2:40 PM - 3:55 PM 501 NWC More Details Artificial Intelligence COMS W 4701-002 ( 12087 ) Spring 2024 Dear, Tony MW 4:10 PM - 5:25 PM 501 NWC More Details Natural Language Processing COMS W 4705-001 ( 12088 ) Spring 2024 Bauer, Daniel MW 2:40 PM - 3:55 PM 451 CSB More Details Natural Language Processing COMS W 4705-002 ( 12090 ) Spring 2024 Bauer, Daniel Fr 10:10 AM - 12:40 PM 301 PUP More Details Machine Learning for Data Science COMS W 4721-001 ( 12843 ) Spring 2024 Verma, Nakul Fr 1:10 PM - 3:40 PM 501 SCH More Details Computer Vision II: Learning COMS W 4732-001 ( 12091 ) Spring 2024 Vondrick, Carl Fr 10:10 AM - 12:40 PM 451 CSB More Details Computational Aspects of Robotics COMS W 4733-001 ( 14014 ) Spring 2024 Dear, Tony Fr 1:10 PM - 3:40 PM 501 NWC More Details Computational Genomics CBMF W 4761-001 ( 12050 ) Spring 2024 Pe'er, Itsik G MW 5:40 PM - 6:55 PM 1127 MUDD More Details Machine Learning COMS W 4771-001 ( 12092 ) Spring 2024 Verma, Nakul TR 1:10 PM - 2:25 PM 451 CSB More Details Machine Learning COMS W 4771-002 ( 12093 ) Spring 2024 Verma, Nakul TR 2:40 PM - 3:55 PM 451 CSB More Details Embedded System Design CSEE W 4840-001 ( 12033 ) Spring 2024 Edwards, Stephen A. MW 1:10 PM - 2:25 PM 451 CSB More Details Geometric Data Analysis COMS W 4995-001 ( 12095 ) Spring 2024 Blumberg, Andrew TR 8:40 AM - 9:55 AM 1024 MUDD More Details Competitive Programming COMS W 4995-002 ( 12096 ) Spring 2024 Lim, Yongwhan MW 5:40 PM - 6:55 PM 1024 MUDD More Details Intro To Data Visualizati COMS W 4995-003 ( 12098 ) Spring 2024 Swinehart, Christian Th 4:10 PM - 6:40 PM 1127 MUDD More Details Applied Computer Vision COMS W 4995-004 ( 12099 ) Spring 2024 Reiter, Austin TR 5:40 PM - 6:55 PM 451 CSB More Details Empirical Methods Data Sc COMS W 4995-005 ( 12101 ) Spring 2024 Levine, Michelle F Fr 10:10 AM - 12:40 PM 1127 MUDD More Details Innovation & Design Lab COMS W 4995-006 ( 12102 ) Spring 2024 Zamchick, Gary Tu 1:10 PM - 3:40 PM 1127 MUDD More Details Causal Inference For Data COMS W 4995-030 ( 12956 ) Spring 2024 Kelleher, Adam Tu 7:00 PM - 9:30 PM 413 KNT More Details Applied Machine Learning COMS W 4995-031 ( 12951 ) Spring 2024 Pappu, Vijay Mo 7:00 PM - 9:30 PM 209 HAV More Details Applied Machine Learning COMS W 4995-032 ( 12965 ) Spring 2024 Pappu, Vijay We 4:10 PM - 6:40 PM 329 PUP More Details Advanced Database Systems COMS E 6111-001 ( 12107 ) Spring 2024 Gravano, Luis Tu 12:10 PM - 2:00 PM 750 CEPSR More Details Topics in Software Engineering COMS E 6156-001 ( 12108 ) Spring 2024 Kaiser, Gail E TR 10:10 AM - 11:25 AM 337 MUDD More Details Human-Computer Interaction COMS E 6178-001 ( 12109 ) Spring 2024 Smith, Brian A Fr 10:10 AM - 12:40 PM 545 MUDD More Details Advanced cryptography COMS E 6261-001 ( 12625 ) Spring 2024 Malkin, Tal G Th 1:10 PM - 3:40 PM 327 MUDD More Details Hardware Security COMS E 6424-001 ( 12111 ) Spring 2024 Sethumadhavan, Simha Mo 7:00 PM - 9:30 PM 451 CSB More Details Computational Imaging COMS E 6732-001 ( 12113 ) Spring 2024 Nayar, Shree K Mo 4:10 PM - 6:00 PM 453 CSB More Details Embedded Scalable Platforms CSEE E 6868-001 ( 12123 ) Spring 2024 Carloni, Luca We 6:10 PM - 8:00 PM 327 MUDD More Details TECH WRITING FOR CS AND ENGINRS COMS E 6915-006 ( 12114 ) Spring 2024 Kayfetz, Janet Fr 10:10 AM - 12:00 PM 644 MUDD More Details Adv Spoken Language Proce COMS E 6998-001 ( 12115 ) Spring 2024 Hirschberg, Julia B. Tu 4:10 PM - 6:00 PM 1127 MUDD More Details Fund Speech Recognition COMS E 6998-003 ( 12117 ) Spring 2024 Beigi, Homayoon Th 7:00 PM - 9:30 PM 633 MUDD More Details Generative Models Fr Code COMS E 6998-004 ( 12118 ) Spring 2024 Ray, Baishakhi Fr 2:10 PM - 4:00 PM 337 MUDD More Details Program Analysis Approx COMS E 6998-005 ( 12119 ) Spring 2024 Jana, Suman Th 1:10 PM - 3:40 PM 1127 MUDD More Details Uncond Low Bnds Derandmzn COMS E 6998-006 ( 12242 ) Spring 2024 Servedio, Rocco A. Tu 1:10 PM - 3:40 PM 1024 MUDD More Details High Perf Mach Learning COMS E 6998-007 ( 12626 ) Spring 2024 El Maghraoui, Kaoutar Th 7:00 PM - 9:30 PM 750 CEPSR More Details Private Systems COMS E 6998-008 ( 12840 ) Spring 2024 Geambasu, Roxana Th 12:10 PM - 2:00 PM 480 CSB More Details Adv Topics Proj Deep Lear COMS E 6998-011 ( 15072 ) Spring 2024 Belhumeur, Peter N We 2:10 PM - 4:00 PM 301 URI More Details Introduction To Computer  Science And Programming In Java COMS W 1004-001 ( 11451 ) Spring 2024 Cannon, Adam H TR 11:40 AM - 12:55 PM 417 IAB More Details ADV SYSTEMS PROGRAMMING COMS W 4995-008 ( 12104 ) Spring 2024 Montero, Hans We 4:10 PM - 6:40 PM 451 CSB More Details INTERMDTE COMPUTING IN PYTHON COMS  3132-001 ( 15110 ) Spring 2024 Janak, Jan Fr 1:10 PM - 3:40 PM 413 KNT More Details Topics In Computer Science, I COMS E 6998-012 ( 18808 ) Spring 2024 Sethumadhavan, Simha Tu 6:10 PM - 8:00 PM 516 HAM More Details Fieldwork COMS W 3999-093 ( 20868 ) Spring 2024 Toler-Franklin, Corey - More Details Graph Theory COMS W 4203-001 ( 20497 ) Spring 2024 Zhang, Yihao lisa We 7:00 PM - 9:30 PM 451 CSB More Details NETWORKS CROWDS AND THE WEB COMS  4223-001 ( 15083 ) Spring 2024 Chaintreau, Augustin TR 4:10 PM - 5:25 PM 833 MUDD More Details Machine Learning Theory COMS  4773-001 ( 12094 ) Spring 2024 Hsu, Daniel J TR 8:40 AM - 9:55 AM 451 CSB More Details Appl Machine Learn Cloud COMS E 6998-010 ( 13237 ) Spring 2024 Chung, I-Hsin Th 4:10 PM - 6:40 PM 829 MUDD More Details Computing in Context COMS W 1002-001 ( 11194 ) Fall 2023 Cannon, Adam H TR 2:40 PM - 3:55 PM 309 HAV More Details Computing in Context COMS W 1002-002 ( 11196 ) Fall 2023 Cannon, Adam H TR 2:40 PM - 3:55 PM 326 URI More Details Computing in Context COMS W 1002-003 ( 11197 ) Fall 2023 Cannon, Adam H TR 2:40 PM - 3:55 PM 313 FAY More Details Computing in Context COMS W 1002-004 ( 11545 ) Fall 2023 Cannon, Adam H TR 2:40 PM - 3:55 PM 415 CEPSR More Details Introduction To Computer  Science And Programming In Java COMS W 1004-001 ( 11546 ) Fall 2023 Blaer, Paul S MW 2:40 PM - 3:55 PM 309 HAV More Details Introduction To Computer  Science And Programming In Java COMS W 1004-002 ( 11547 ) Fall 2023 Blaer, Paul S MW 5:40 PM - 6:55 PM 417 IAB More Details Intro To Comp For Eng/app ENGI E 1006-001 ( 11300 ) Fall 2023 Bauer, Daniel MW 10:10 AM - 11:25 AM 417 IAB More Details COMPUTING IN CONTEXT REC COMS W 1012-001 ( 11548 ) Fall 2023 Cannon, Adam H Th 7:10 PM - 8:00 PM 825 MUDD More Details COMPUTING IN CONTEXT REC COMS W 1012-002 ( 11198 ) Fall 2023 Cannon, Adam H Fr 10:10 AM - 10:50 AM 825 MUDD More Details COMPUTING IN CONTEXT REC COMS W 1012-003 ( 11199 ) Fall 2023 Cannon, Adam H Fr 11:00 AM - 11:50 AM 825 MUDD More Details COMPUTING IN CONTEXT REC COMS W 1012-004 ( 11200 ) Fall 2023 Cannon, Adam H Fr 2:00 PM - 2:50 PM 825 MUDD More Details COMPUTING IN CONTEXT REC COMS W 1012-005 ( 11201 ) Fall 2023 Cannon, Adam H Fr 9:00 AM - 9:40 AM 825 MUDD More Details COMPUTING IN CONTEXT REC COMS W 1012-006 ( 11202 ) Fall 2023 Cannon, Adam H Fr 1:00 PM - 1:50 PM 825 MUDD More Details COMPUTING IN CONTEXT REC COMS W 1012-007 ( 11203 ) Fall 2023 Cannon, Adam H Th 7:10 PM - 8:00 PM 327 MUDD More Details COMPUTING IN CONTEXT REC COMS W 1012-008 ( 11204 ) Fall 2023 Cannon, Adam H Fr 1:00 PM - 1:50 PM 337 MUDD More Details COMPUTING IN CONTEXT REC COMS W 1012-009 ( 11205 ) Fall 2023 Cannon, Adam H Th 7:10 PM - 8:00 PM 306 URI More Details COMPUTING IN CONTEXT REC COMS W 1012-010 ( 11206 ) Fall 2023 Cannon, Adam H Fr 11:00 AM - 11:50 AM 337 MUDD More Details Dev Tech COMS W 3102-001 ( 17021 ) Fall 2023 Stolfo, Emily Mo 6:10 PM - 8:00 PM 750 CEPSR More Details Clean Object-Oriented Design COMS W 3107-001 ( 11207 ) Fall 2023 Kender, John R MW 4:10 PM - 5:25 PM 633 MUDD More Details Data Structures in Java COMS W 3134-001 ( 11208 ) Fall 2023 Borowski, Brian S. MW 4:10 PM - 5:25 PM 301 URI More Details Data Structures in Java COMS W 3134-002 ( 11209 ) Fall 2023 Borowski, Brian S. MW 5:40 PM - 6:55 PM 301 URI More Details ESSENTIAL DATA STRUCTURES IN C/C++ COMS W 3136-001 ( 11210 ) Fall 2023 Paine, Timothy TR 5:40 PM - 6:55 PM 451 CSB More Details Advanced Programming COMS W 3157-001 ( 11211 ) Fall 2023 Lee, Jae Woo TR 2:40 PM - 3:55 PM 301 PUP More Details Advanced Programming COMS W 3157-002 ( 11212 ) Fall 2023 Lee, Jae Woo TR 5:40 PM - 6:55 PM 301 PUP More Details Discrete Mathematics: Introduction To Combinatorics and Graph Theory COMS W 3203-001 ( 11213 ) Fall 2023 Dear, Tony MW 2:40 PM - 3:55 PM 301 PUP More Details Discrete Mathematics: Introduction To Combinatorics and Graph Theory COMS W 3203-002 ( 11214 ) Fall 2023 Dear, Tony MW 4:10 PM - 5:25 PM 428 PUP More Details Computer Science Theory COMS W 3261-001 ( 11215 ) Fall 2023 Pitassi, Toniann MW 8:40 AM - 9:55 AM 451 CSB More Details Computer Science Theory COMS W 3261-002 ( 11216 ) Fall 2023 Pitassi, Toniann MW 10:10 AM - 11:25 AM 451 CSB More Details Computers and Society COMS W 3410-001 ( 11217 ) Fall 2023 Baecker, Ronald Tu 5:30 PM - 8:00 PM 750 CEPSR More Details Fundamentals of Computer Systems CSEE W 3827-001 ( 11287 ) Fall 2023 Kim, Martha A TR 11:40 AM - 12:55 PM 309 HAV More Details Fundamentals of Computer Systems CSEE W 3827-002 ( 11288 ) Fall 2023 Kim, Martha A TR 1:10 PM - 2:25 PM 309 HAV More Details Fieldwork COMS W 3999-005 ( 14378 ) Fall 2023 Andoni, Alexandr - More Details Fieldwork COMS W 3999-006 ( 14381 ) Fall 2023 Bauer, Daniel - More Details Fieldwork COMS W 3999-007 ( 14382 ) Fall 2023 Belhumeur, Peter N - More Details Fieldwork COMS W 3999-008 ( 14383 ) Fall 2023 Bellovin, Steven M. - More Details Fieldwork COMS W 3999-009 ( 14400 ) Fall 2023 Elhadad, Noemie - More Details Fieldwork COMS W 3999-010 ( 14384 ) Fall 2023 Blaer, Paul S - More Details Fieldwork COMS W 3999-011 ( 14385 ) Fall 2023 Blei, David - More Details Fieldwork COMS W 3999-012 ( 14389 ) Fall 2023 Cannon, Adam H - More Details Fieldwork COMS W 3999-013 ( 14390 ) Fall 2023 Carloni, Luca - More Details Fieldwork COMS W 3999-014 ( 14391 ) Fall 2023 Chaintreau, Augustin - More Details Fieldwork COMS W 3999-015 ( 14393 ) Fall 2023 Chen, Xi - More Details Fieldwork COMS W 3999-016 ( 14431 ) Fall 2023 Pitassi, Toniann - More Details Fieldwork COMS W 3999-017 ( 14398 ) Fall 2023 Drinea, Eleni - More Details Fieldwork COMS W 3999-018 ( 14399 ) Fall 2023 Edwards, Stephen A. - More Details Fieldwork COMS W 3999-020 ( 14401 ) Fall 2023 Feiner, Steven K - More Details Fieldwork COMS W 3999-021 ( 14402 ) Fall 2023 Geambasu, Roxana - More Details Fieldwork COMS W 3999-022 ( 14403 ) Fall 2023 Gravano, Luis - More Details Fieldwork COMS W 3999-023 ( 14459 ) Fall 2023 Zemel, Richard - More Details Fieldwork COMS W 3999-024 ( 14406 ) Fall 2023 Hirschberg, Julia B. - More Details Fieldwork COMS W 3999-025 ( 14408 ) Fall 2023 Hsu, Daniel J - More Details Fieldwork COMS W 3999-026 ( 14409 ) Fall 2023 Jana, Suman - More Details Fieldwork COMS W 3999-027 ( 14377 ) Fall 2023 Alman, Josh - More Details Fieldwork COMS W 3999-028 ( 14410 ) Fall 2023 Kaiser, Gail E - More Details Fieldwork COMS W 3999-029 ( 14412 ) Fall 2023 Kender, John R - More Details Fieldwork COMS W 3999-030 ( 14445 ) Fall 2023 Song, Shuran - More Details Fieldwork COMS W 3999-031 ( 14413 ) Fall 2023 Kim, Martha A - More Details Fieldwork COMS W 3999-032 ( 14417 ) Fall 2023 Lee, Jae Woo - More Details Fieldwork COMS W 3999-033 ( 14419 ) Fall 2023 Malkin, Tal G - More Details Fieldwork COMS W 3999-034 ( 14420 ) Fall 2023 McKeown, Kathleen - More Details Fieldwork COMS W 3999-035 ( 14421 ) Fall 2023 Misra, Vishal - More Details Fieldwork COMS W 3999-036 ( 14425 ) Fall 2023 Nayar, Shree K - More Details Fieldwork COMS W 3999-037 ( 14426 ) Fall 2023 Nieh, Jason - More Details Fieldwork COMS W 3999-038 ( 14375 ) Fall 2023 AlQuraishi, Mohammed - More Details Fieldwork COMS W 3999-039 ( 14429 ) Fall 2023 Pe'er, Itsik G - More Details Fieldwork COMS W 3999-040 ( 14436 ) Fall 2023 Ross, Kenneth A - More Details Fieldwork COMS W 3999-041 ( 14438 ) Fall 2023 Rubenstein, Dan - More Details Fieldwork COMS W 3999-042 ( 14439 ) Fall 2023 Salleb-Aouissi, Ansaf - More Details Fieldwork COMS W 3999-043 ( 14441 ) Fall 2023 Schulzrinne, Henning G - More Details Fieldwork COMS W 3999-044 ( 14442 ) Fall 2023 Servedio, Rocco A. - More Details Fieldwork COMS W 3999-045 ( 14443 ) Fall 2023 Sethumadhavan, Simha - More Details Fieldwork COMS W 3999-046 ( 14447 ) Fall 2023 Stolfo, Salvatore J - More Details Fieldwork COMS W 3999-047 ( 14387 ) Fall 2023 Blumberg, Andrew - More Details Fieldwork COMS W 3999-048 ( 14454 ) Fall 2023 Wu, Eugene - More Details Fieldwork COMS W 3999-049 ( 14455 ) Fall 2023 Yang, Junfeng - More Details Fieldwork COMS W 3999-050 ( 14456 ) Fall 2023 Yannakakis, Mihalis - More Details Fieldwork COMS W 3999-051 ( 14460 ) Fall 2023 Zheng, Changxi - More Details Fieldwork COMS W 3999-052 ( 14437 ) Fall 2023 Roughgarden, Tim - More Details Fieldwork COMS W 3999-053 ( 14462 ) Fall 2023 Zussman, Gil - More Details Fieldwork COMS W 3999-054 ( 14392 ) Fall 2023 Chang, Shih-Fu - More Details Fieldwork COMS W 3999-056 ( 14424 ) Fall 2023 Muresan, Smaranda - More Details Fieldwork COMS W 3999-057 ( 14418 ) Fall 2023 Lipson, Hod - More Details Fieldwork COMS W 3999-058 ( 14423 ) Fall 2023 Mueller, Andreas - More Details Fieldwork COMS W 3999-059 ( 14396 ) Fall 2023 Ciocarlie, Matei - More Details Fieldwork COMS W 3999-060 ( 14394 ) Fall 2023 Chilton, Lydia B - More Details Fieldwork COMS W 3999-061 ( 14427 ) Fall 2023 Papadimitriou, Christos H - More Details Fieldwork COMS W 3999-062 ( 14450 ) Fall 2023 Verma, Nakul - More Details Fieldwork COMS W 3999-063 ( 14444 ) Fall 2023 Smith, Brian A - More Details Fieldwork COMS W 3999-064 ( 14380 ) Fall 2023 Bareinboim, Elias - More Details Fieldwork COMS W 3999-065 ( 14404 ) Fall 2023 Gu, Ronghui - More Details Fieldwork COMS W 3999-066 ( 14451 ) Fall 2023 Vondrick, Carl - More Details Fieldwork COMS W 3999-067 ( 14411 ) Fall 2023 Katz-Bassett, Ethan - More Details Fieldwork COMS W 3999-068 ( 14435 ) Fall 2023 Ray, Baishakhi - More Details Fieldwork COMS W 3999-069 ( 14414 ) Fall 2023 Knowles, David - More Details Fieldwork COMS W 3999-070 ( 14397 ) Fall 2023 Dear, Tony - More Details Fieldwork COMS W 3999-071 ( 14395 ) Fall 2023 Cidon, Asaf - More Details Fieldwork COMS W 3999-072 ( 14452 ) Fall 2023 Wing, Jeannette M - More Details Fieldwork COMS W 3999-073 ( 14434 ) Fall 2023 Rambow, Owen C. - More Details Fieldwork COMS W 3999-074 ( 14453 ) Fall 2023 Wright, Rebecca - More Details Fieldwork COMS W 3999-075 ( 14415 ) Fall 2023 Krstovski, Kriste - More Details Fieldwork COMS W 3999-076 ( 14416 ) Fall 2023 Kucukelbir, Alp - More Details Fieldwork COMS W 3999-077 ( 14386 ) Fall 2023 Blikstein, Paulo - More Details Fieldwork COMS W 3999-079 ( 14440 ) Fall 2023 Santolucito, Mark - More Details Fieldwork COMS W 3999-080 ( 14422 ) Fall 2023 Morrison-Smith, Sarah - More Details Fieldwork COMS W 3999-081 ( 14457 ) Fall 2023 Yu, Zhou - More Details Fieldwork COMS W 3999-082 ( 14458 ) Fall 2023 Yuen, Henry - More Details Fieldwork COMS W 3999-083 ( 14407 ) Fall 2023 Horesh, Lior - More Details Fieldwork COMS W 3999-084 ( 14388 ) Fall 2023 Borowski, Brian S. - More Details Fieldwork COMS W 3999-085 ( 14461 ) Fall 2023 Zhou, Xia - More Details Fieldwork COMS W 3999-086 ( 14379 ) Fall 2023 Azizi, Elham - More Details Fieldwork COMS W 3999-090 ( 14405 ) Fall 2023 Gursoy, Gamze - More Details Fieldwork COMS W 3999-091 ( 14428 ) Fall 2023 Pappu, Vijay - More Details Introduction to Databases COMS W 4111-001 ( 11218 ) Fall 2023 Gravano, Luis TR 1:10 PM - 2:25 PM 301 PUP More Details Introduction to Databases COMS W 4111-002 ( 11219 ) Fall 2023 Ferguson, Donald F. Fr 10:10 AM - 12:40 PM 417 IAB More Details Fundamentals of Large-Scale Distributed Systems COMS W 4113-001 ( 11220 ) Fall 2023 Geambasu, Roxana Fr 10:10 AM - 12:40 PM 451 CSB More Details Programming Languages and Translators COMS W 4115-001 ( 11221 ) Fall 2023 Ray, Baishakhi TR 11:40 AM - 12:55 PM 451 CSB More Details Operating Systems, I COMS W 4118-001 ( 11222 ) Fall 2023 Nieh, Jason TR 4:10 PM - 5:25 PM 501 NWC More Details Engineering Software-as-a-Service COMS W 4152-001 ( 11223 ) Fall 2023 Yang, Junfeng TR 8:40 AM - 9:55 AM 833 MUDD More Details Advanced Software Engineering COMS W 4156-001 ( 11224 ) Fall 2023 Kaiser, Gail E TR 10:10 AM - 11:25 AM 501 NWC More Details Computer Graphics COMS W 4160-001 ( 11549 ) Fall 2023 Fadaifard, Hadi TR 7:10 PM - 8:25 PM 451 CSB More Details User Interface Design COMS W 4170-001 ( 11225 ) Fall 2023 Smith, Brian A TR 1:10 PM - 2:25 PM 428 PUP More Details Security I COMS W 4181-001 ( 11226 ) Fall 2023 Jana, Suman MW 1:10 PM - 2:25 PM 451 CSB More Details MALWARE ANALYSIS&REVERSE ENGINEERING COMS W 4186-001 ( 11227 ) Fall 2023 Sikorski, Michael Th 4:10 PM - 6:40 PM 825 MUDD More Details Analysis of Algorithms I CSOR W 4231-001 ( 11294 ) Fall 2023 Roughgarden, Tim TR 8:40 AM - 9:55 AM 451 CSB More Details Analysis of Algorithms I CSOR W 4231-002 ( 11296 ) Fall 2023 Roughgarden, Tim TR 10:10 AM - 11:25 AM 451 CSB More Details Introduction To Computational Complexity COMS W 4236-001 ( 11228 ) Fall 2023 Yuen, Henry MW 1:10 PM - 2:25 PM 524 MUDD More Details ALGORITHMS FOR DATA SCIENCE CSOR W 4246-001 ( 11297 ) Fall 2023 Drinea, Eleni TR 11:40 AM - 12:55 PM 833 MUDD More Details ALGORITHMS FOR DATA SCIENCE CSOR W 4246-002 ( 11299 ) Fall 2023 Drinea, Eleni TR 1:10 PM - 2:25 PM 329 PUP More Details Introduction to Computational Learning Theory COMS W 4252-001 ( 11229 ) Fall 2023 Servedio, Rocco A. MW 8:40 AM - 9:55 AM 428 PUP More Details Introduction To Cryptography COMS W 4261-001 ( 11230 ) Fall 2023 Malkin, Tal G TR 10:10 AM - 11:25 AM 142 URI More Details Introduction to Quantum Computing COMS W 4281-001 ( 11231 ) Fall 2023 Yuen, Henry MW 11:40 AM - 12:55 PM 326 URI More Details Programming and Problem Solving COMS W 4444-001 ( 11232 ) Fall 2023 Ross, Kenneth A MW 1:10 PM - 2:25 PM 327 MUDD More Details Principles of Innovation and Entrepreneurship (co-instructor: William Reinisch) COMS W 4460-001 ( 11233 ) Fall 2023 Reinisch, William Fr 10:10 AM - 12:40 PM 644 MUDD More Details Artificial Intelligence COMS W 4701-001 ( 11234 ) Fall 2023 Salleb-Aouissi, Ansaf TR 10:10 AM - 11:25 AM 501 SCH More Details Artificial Intelligence COMS W 4701-002 ( 11235 ) Fall 2023 Salleb-Aouissi, Ansaf TR 11:40 AM - 12:55 PM 501 SCH More Details Natural Language Processing COMS W 4705-001 ( 11236 ) Fall 2023 Bauer, Daniel MW 1:10 PM - 2:25 PM 309 HAV More Details Natural Language Processing COMS W 4705-002 ( 11237 ) Fall 2023 Yu, Zhou MW 1:10 PM - 2:25 PM 501 SCH More Details Natural Language Processing COMS W 4705-032 ( 16894 ) Fall 2023 Simion, Andrei A We 7:00 PM - 9:30 PM 717 HAM More Details Computer Vision I: First Principles COMS W 4731-001 ( 11238 ) Fall 2023 Nayar, Shree K MW 10:10 AM - 11:25 AM 501 NWC More Details Ml For Functional Genomic COMS W 4762-001 ( 11239 ) Fall 2023 Knowles, David MW 4:10 PM - 5:25 PM 451 CSB More Details Machine Learning COMS W 4771-001 ( 11240 ) Fall 2023 Hsu, Daniel J TR 1:10 PM - 2:25 PM 451 CSB More Details Machine Learning COMS W 4771-002 ( 11241 ) Fall 2023 Hsu, Daniel J TR 2:40 PM - 3:55 PM 451 CSB More Details Causal Inference COMS W 4775-001 ( 11242 ) Fall 2023 Bareinboim, Elias MW 4:10 PM - 5:25 PM 750 CEPSR More Details Computer Architecture CSEE W 4824-001 ( 11290 ) Fall 2023 Sethumadhavan, Simha MW 10:10 AM - 11:25 AM 501 SCH More Details System-on-Chip Platforms CSEE W 4868-001 ( 11291 ) Fall 2023 Carloni, Luca TR 11:40 AM - 12:55 PM 633 MUDD More Details Parallel Functional Progr COMS W 4995-001 ( 11243 ) Fall 2023 Edwards, Stephen A. MW 5:40 PM - 6:55 PM 633 MUDD More Details Design Using C++ COMS W 4995-002 ( 11244 ) Fall 2023 Stroustrup, Bjarne Fr 10:10 AM - 12:40 PM 608 SCH More Details Math Mach Learn Sig Recog COMS W 4995-003 ( 11245 ) Fall 2023 Beigi, Homayoon Th 4:10 PM - 6:40 PM 1127 MUDD More Details Tech Interview Prep C++ COMS W 4995-004 ( 11246 ) Fall 2023 Lim, Yongwhan TR 5:40 PM - 6:55 PM 1024 MUDD More Details Competitive Programming COMS W 4995-005 ( 11247 ) Fall 2023 Lim, Yongwhan Mo 7:00 PM - 9:30 PM 1127 MUDD More Details Empirical Methods Data Sc COMS W 4995-006 ( 11248 ) Fall 2023 Levine, Michelle F MW 11:40 AM - 12:55 PM 415 CEPSR More Details Mobile App Develop Ios COMS W 4995-007 ( 11249 ) Fall 2023 Thomas, Hugh TR 4:10 PM - 5:25 PM 451 CSB More Details Hacking 4 Defense COMS W 4995-008 ( 11250 ) Fall 2023 Cahill, Jason Tu 4:10 PM - 6:40 PM 644 MUDD More Details Data-drvn Dsgn Social Inn COMS W 4995-009 ( 11251 ) Fall 2023 Verma, Nakul Fr 1:10 PM - 3:40 PM 601 FLS More Details Neural Networks Deep Lear COMS W 4995-010 ( 11252 ) Fall 2023 Zemel, Richard MW 2:40 PM - 3:55 PM 451 CSB More Details Deep Lrng For Comp Vision COMS W 4995-011 ( 11253 ) Fall 2023 Belhumeur, Peter N TR 2:40 PM - 3:55 PM 428 PUP More Details Applied Machine Learning COMS W 4995-020 ( 12881 ) Fall 2023 Pappu, Vijay Tu 4:10 PM - 6:40 PM 833 MUDD More Details Applied Machine Learning COMS W 4995-021 ( 12882 ) Fall 2023 Pappu, Vijay Th 7:00 PM - 9:30 PM 417 IAB More Details Applied Deep Learning COMS W 4995-031 ( 16893 ) Fall 2023 Simion, Andrei A Mo 7:00 PM - 9:30 PM 501 NWC More Details Operating Systems, II COMS E 6118-001 ( 11255 ) Fall 2023 Nieh, Jason Th 2:10 PM - 4:00 PM 337 MUDD More Details Topics in Software Engineering COMS E 6156-001 ( 11256 ) Fall 2023 Ferguson, Donald F. Fr 1:10 PM - 3:40 PM 417 IAB More Details Modeling and performance evaluation CSEE W 6180-001 ( 11292 ) Fall 2023 Misra, Vishal Fr 1:10 PM - 3:40 PM 233 MUDD More Details ANONYMITY & PRIVACY COMS E 6184-001 ( 11257 ) Fall 2023 Bellovin, Steven M. Mo 6:20 PM - 8:10 PM 480 CSB More Details Analysis of Algorithms, II COMS E 6232-001 ( 11259 ) Fall 2023 Yannakakis, Mihalis We 4:10 PM - 6:00 PM 516 HAM More Details Virtual And Augmented Rea COMS E 6998-001 ( 11260 ) Fall 2023 Feiner, Steven K We 2:10 PM - 4:00 PM 337 MUDD More Details Natural Lang Gen Summariz COMS E 6998-002 ( 11261 ) Fall 2023 McKeown, Kathleen We 4:10 PM - 6:00 PM 503 HAM More Details Topics In Robotic Learnin COMS E 6998-003 ( 11262 ) Fall 2023 Song, Shuran Fr 10:10 AM - 12:00 PM RTBA BTBA More Details Engr Web3 Blockchain Apps COMS E 6998-004 ( 11263 ) Fall 2023 Yang, Junfeng Tu 10:10 AM - 12:00 PM 327 MUDD More Details Topics In Mobile X COMS E 6998-005 ( 11264 ) Fall 2023 Zhou, Xia Fr 1:10 PM - 3:40 PM 627 MUDD More Details Readings Language Design COMS E 6998-006 ( 11266 ) Fall 2023 Stroustrup, Bjarne Th 12:10 PM - 2:00 PM 327 MUDD More Details Fund Speech Recognition COMS E 6998-009 ( 11269 ) Fall 2023 Beigi, Homayoon Th 7:00 PM - 9:30 PM 1127 MUDD More Details Cloud Computing & Big Dat COMS E 6998-010 ( 11270 ) Fall 2023 Sahu, Sambit Mo 6:10 PM - 8:00 PM 451 CSB More Details Machine Learning &climate COMS E 6998-011 ( 11271 ) Fall 2023 Kucukelbir, Alp Tu 4:10 PM - 6:00 PM 326 URI More Details Adv Web Design Studio COMS E 6998-012 ( 11273 ) Fall 2023 Chilton, Lydia B Fr 12:10 PM - 2:00 PM 1127 MUDD More Details Analysis Of Networks & Cr COMS E 6998-013 ( 11275 ) Fall 2023 Chaintreau, Augustin Tu 12:10 PM - 2:00 PM 1127 MUDD More Details Robust Controllable Ml COMS E 6998-014 ( 11277 ) Fall 2023 Zemel, Richard Th 2:10 PM - 4:00 PM RTBA BTBA More Details Algorithms For Massive Da COMS E 6998-015 ( 11279 ) Fall 2023 Andoni, Alexandr MW 2:40 PM - 3:55 PM 1024 MUDD More Details Formal Verification Syste COMS E 6998-016 ( 11281 ) Fall 2023 Gu, Ronghui Th 2:10 PM - 4:00 PM 627 MUDD More Details Algebraic Techniques In T COMS E 6998-018 ( 11285 ) Fall 2023 Alman, Josh Tu 4:10 PM - 6:00 PM 825 MUDD More Details Causal Trustworthy Ai COMS E 6998-019 ( 15229 ) Fall 2023 Bareinboim, Elias Mo 6:10 PM - 8:00 PM 327 MUDD More Details Topics Cloud Computing COMS E 6998-020 ( 15230 ) Fall 2023 Kaffes, Kostis Fr 10:10 AM - 12:00 PM 829 MUDD More Details Intro Property Testing COMS E 6998-021 ( 15236 ) Fall 2023 Chen, Xi Fr 2:10 PM - 4:00 PM 337 MUDD More Details Foundations Data Privacy COMS E 6998-022 ( 16561 ) Fall 2023 Cummings, Rachel Fr 10:10 AM - 12:40 PM 326 URI More Details Introduction to Information Science COMS W 1001-001 ( 11190 ) Fall 2023 Cannon, Adam H TR 11:40 AM - 12:55 PM 330 URI More Details Formal Verif HW SW Systems CSEE E 6863-001 ( 11293 ) Fall 2023 Ivancic, Franjo We 6:10 PM - 8:00 PM 451 CSB More Details Topics In Computer Science, I COMS E 6998-008 ( 11268 ) Fall 2023 El Maghraoui, Kaoutar Th 7:00 PM - 9:30 PM 326 URI More Details Intrusion Detection Systems COMS E 6185-001 ( 11258 ) Fall 2023 Seiden, Mark We 2:10 PM - 4:00 PM 603 HAM More Details Special Topics In Computer Science, I COMS W 4995-013 ( 20652 ) Fall 2023 Zamchick, Gary Tu 1:10 PM - 3:40 PM 545 MUDD More Details Machine Learning Datasets COMS E 6998-025 ( 20663 ) Fall 2023 Marino, Kenneth Fr 4:10 PM - 6:00 PM 644 MUDD More Details Computational Techniques In Pixel Processing COMS W 4165-001 ( 20707 ) Fall 2023 Wolberg, George TR 8:40 AM - 9:55 AM 545 MUDD More Details Dev Tech COMS W 3102-002 ( 20662 ) Fall 2023 Ahamed, Shoaib Fr 6:10 PM - 8:00 PM 451 CSB More Details Emerging Scholars Prog Seminar COMS W 1404-001 ( 20584 ) Fall 2023 Cannon, Adam H Fr 8:40 AM - 9:55 AM 413 HAM More Details Elements for Data Science COMS W 4995-030 ( 16892 ) Fall 2023 Cupallari, Andi Mo 7:00 PM - 9:30 PM 833 MUDD More Details Emerging Scholars Prog Seminar COMS W 1404-002 ( 20585 ) Fall 2023 Cannon, Adam H Fr 10:10 AM - 11:25 AM 413 HAM More Details Emerging Scholars Prog Seminar COMS W 1404-003 ( 20586 ) Fall 2023 Cannon, Adam H Fr 11:40 AM - 12:55 PM 413 HAM More Details Emerging Scholars Prog Seminar COMS W 1404-004 ( 20587 ) Fall 2023 Cannon, Adam H Fr 1:10 PM - 2:25 PM 413 HAM More Details Emerging Scholars Prog Seminar COMS W 1404-005 ( 20588 ) Fall 2023 Cannon, Adam H Fr 2:40 PM - 3:55 PM 413 HAM More Details Emerging Scholars Prog Seminar COMS W 1404-006 ( 20589 ) Fall 2023 Cannon, Adam H Fr 4:10 PM - 5:25 PM 413 HAM More Details Emerging Scholars Prog Seminar COMS W 1404-007 ( 20590 ) Fall 2023 Cannon, Adam H Fr 9:30 AM - 10:45 AM 309 HAM More Details Emerging Scholars Prog Seminar COMS W 1404-008 ( 20591 ) Fall 2023 Cannon, Adam H Fr 11:00 AM - 12:15 PM 309 HAM More Details Emerging Scholars Prog Seminar COMS W 1404-009 ( 20592 ) Fall 2023 Cannon, Adam H Fr 12:30 PM - 1:45 PM 309 HAM More Details Emerging Scholars Prog Seminar COMS W 1404-010 ( 20593 ) Fall 2023 Cannon, Adam H Fr 2:00 PM - 3:15 PM 309 HAM More Details Fieldwork COMS W 3999-089 ( 14432 ) Fall 2023 Plancher, Brian - More Details Fieldwork COMS W 3999-092 ( 20715 ) Fall 2023 Kaffes, Kostis - More Details Adv Mach Lrng Health &med COMS W 4995-014 ( 20725 ) Fall 2023 Joshi, Shalmali Fr 2:00 PM - 4:00 PM 253 ENG More Details Internet Measurement COMS E 6998-023 ( 20650 ) Fall 2023 Katz-Bassett, Ethan We 4:10 PM - 6:40 PM 644 MUDD More Details Adv Computer Networks COMS E 6998-024 ( 20651 ) Fall 2023 Katz-Bassett, Ethan TR 2:40 PM - 3:55 PM 303 URI More Details Fieldwork COMS W 3999-088 ( 14448 ) Fall 2023 Thakoor, Kaveri - More Details Updated 10/27/2023 Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}