{
  "id": 4,
  "date": "2024-05-18T18:13:55.142167",
  "url": "https://www.cs.columbia.edu/areas/compio/",
  "university_name": "Columbia University",
  "title": "Computational Biology",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence Computational Biology AI and CRISPR Precisely Control Gene Expression David Knowles and collaborators develop RNA-based predictive models. David Knowles Wins NSF CAREER Award Award supports computer scientist’s work to develop bioinformatics tools and methods to better understand RNA splicing’s role in ALS, cancer, and neuron development. About The Computational Biology Group brings together interdisciplinary and cross-disciplinary individuals and skillsets to tackle problems in high throughput genomics, systems biology, and genetics. The group develops computational methods to analyze high throughput data on genetic variants within species, primarily human SNP, and sequencing data. The student and postdoc body in the group is very diverse in terms of undergraduate background as well as current PhD program or postdoctoral affiliation. The group meets weekly giving an opportunity for students to present their research internally and feedback on one another’s work. Weekly meetings occasionally give host to guest speakers, include a journal club, or extracurricular activities. Faculty and Affiliates Andrew Blumberg David Knowles Itsik Pe'er Kenneth Ross Ansaf Salleb-Aouissi Mohammed AlQuraishi Elham Azizi Noemie Elhadad Gamze Gursoy Research Labs Computational Biology Bi-Group Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}