{
  "id": 4,
  "date": "2024-05-18T18:13:15.747452",
  "url": "https://www.cs.columbia.edu/education/ms/nlp/",
  "university_name": "Columbia University",
  "title": "The Natural Language Processing Track",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence The Natural Language Processing Track Natural Language Processing The Natural Language Processing (NLP) track is intended for students who wish to gain expertise in NLP technologies and applications. NLP technologies are of central importance in automating the analysis of text and speech databases and in enabling man-machine interactions through natural language. This track will help you develop leading-edge knowledge of these technologies. SUMMARY OF REQUIREMENTS Complete a total of 30 points (Courses must be at the 4000 level or above) Maintain at least a 2.7 overall GPA. (No more than 1 D is permitted). Complete the Columbia Engineering Professional Development & Leadership (PDL) requirement Satisfy breadth requirements Take at least 6 points of technical courses at the 6000 level At most, up to 3 points of your degree can be Non-CS/Non-track If they are deemed relevant to your track and sufficiently technical in nature. Submit the Non-CS/NonTrack form and the course syllabus to your CS Faculty Advisor for review 1. Breadth Courses Visit the breadth requirement page for more information. 2. Required Track Courses Students are required to complete the following 3 courses. Students who have taken equivalent courses in the past and received grades of at least a B may apply for waivers and take other CS courses instead. Course ID Title COMS W4705 Natural Language Processing COMS 4706/ E6998 Spoken Language Processing (COMS 4706), or Advanced Spoken Language Processing (COMS 6998) or Fundamentals of Speech Recognition; (Spring 2017 approved substitute: COMS E6998.004 Computational Models of Speech and Language) COMS E6998 One additional topics course that focuses on NLP 3. Elective Track Courses Students are required to complete 2 courses out of the following list; at least 1 course must be a 6000-level CS course. Since other departments vary their offerings considerably from year to year, it is possible to count such courses toward the MS degree; please propose courses you think might be suitable to your track advisor. Course ID Title COMS W4170 User Interface Design COMS W4172 3D User Interfaces COMS W4252 Introduction to Computational Learning Theory COMS W4701 Artificial Intelligence COMS W4771 or W4721* Machine Learning or Machine Learning for Data Science COMS W4772 Advanced Machine Learning COMS 4995 Visit the topics courses page to see which COMS 4995 courses apply as electives for this track. COMS E6901 Projects in Computer Science (Advisor approval required) COMS E6998 Visit the topics courses page to see which COMS 6998 courses apply as electives for this track. SIEO W4150** Probability and Statistics ECBM E6040 Neural Networks and Deep Learning EECS E6894 Deep Learning for Computer Vision and Natural Language Processing ELEN E4810 Digital Signal Processing ELEN E6829 Speech/Audio Processing-Recognition PSYC G4232 Production and Perception of Language PSYC G4275 Contemporary Topics in Language and Communication PSYC G4205 Models of Cognition PSYC 4236 Machine Intelligence PSYC G4470 Psychology and Neuropsychology of Language PSYC G6006 Introduction to Statistical Modeling in Psychology * Due to significant overlap, students can receive credits for only one of these courses (either COMS W4771 Machine Learning or COMS W4721 Machine Learning for Data Science). ** STAT 4001 taken Spring 2018 or prior may count as a substitute for Probability and Statistics/Advanced Data Analysis 4. General Electives Students must complete the remaining credits with General Elective Courses at the 4000 level or above. At least three of these points must be chosen from either the Track Electives listed above or from the CS department at the 4000 level or higher. Students may also request to use at most 3 points of Non-CS/Non-Track coursework if approved by the process listed below. Non-CS/Non-Track: CS MS students may request up to 3 points of Non-CS/Non-Track points to count toward their 30-point MS program. CS Track advisor may review and approve if the course is determined to be relevant to the CS MS track and sufficiently technical in nature. Students should send the Non-CS/Non-Track Form and the course syllabus to your Track Advisor for review. *Due to a significant overlap in course material, MS students not in the Machine Learning track can only take 1 of the following courses – COMS 4771, COMS 4721, ELEN 4903, IEOR 4525, STAT 4240, STAT 4400/4241/5241 – as part of their degree requirements. **Known non-track CS course** CSOR E4995 Topics in Computer Science and IEOR – Financial Software Systems Please note: Students who waive track requirements by using previous courses must still complete 30 graduate credits. This can be done by expanding their elective selection to include courses listed as required track courses and elective track courses; or by taking other graduate courses The Degree Progress Checklist should be used to keep track of your requirements. If you have questions for your Track Advisor or CS Advising, you should have an updated Checklist prepared TRACK PLANNING Please visit the Directory of Classes to get the updated course listings. Please also note that not all courses are offered every semester or even every year. A few courses are offered only once every two or three years or even less frequently. Updated 10/17/2023 Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}