{
  "id": 4,
  "date": "2024-05-18T18:14:23.674143",
  "url": "https://www.cs.columbia.edu/education/undergraduate/prospectivefaq/",
  "university_name": "Columbia University",
  "title": "Prospective Student FAQ",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence Prospective Student FAQ Prospective Students Thank you for your interest in our CS@CU programs! Please be sure to read through our pages and complete keyword searches to help you gather information and make the most informed decision possible regarding the next step in your educational career. Columbia University Admissions Offices UNDERGRADUATE PROGRAMS Undergraduates wanting to major in computer science first apply through one of four undergraduate schools: Columbia College Barnard College School of Engineering and Applied Science (SEAS) School of General Studies APPLICATION PRIORITY DEADLINES Applications received and considered complete by these priority deadlines will be reviewed in the first or second priority group of applications. We recommend you submit your application a couple of weeks before the priority deadline to ensure that all materials, including recommendation letters, are received by the deadline. CS Programs Fall Spring Doctoral: MS/PhD*, PhD December 15 October 15 Master of Science (CS MS) Priority: January 15 October 15 Final Deadline: February 15 MS Express Application (Columbia Undergrads only) Regular: February 15 October 15 Final Deadline: May 1st Dual MS, CS & Journalism January 15 N/A CS@CU MS Bridge Program February 15th N/A WHY CS@CU? Is there a specific emphasis on expertise and research within the Computer Science Department at Columbia? Which areas of CS are particularly strong at Columbia? The Department of Computer Science at Columbia has distinguished research strengths in a number of areas, including vision and computer graphics, computer and network security, networks, machine learning, computer architecture, and natural language processing. Examples of specific research groups are: Graphics and User Interfaces Security; Intrusion Detection Languages & Compilers Machine Learning Speech and Natural Language Processing Network Computing Software Systems Vision and Robotics A complete list of research groups can be found here . Why should I pursue an undergraduate degree in Computer Science at Columbia? Columbia University offers a Bachelor of Arts and a Bachelor of Science in Computer Science. The BA major encourages students to obtain broad exposure to the arts, humanities, and social sciences while providing them with the appropriate Computer Science background necessary for graduate study or a professional career. The BS major encourages students to obtain broad exposure to the engineering core while providing the proper Computer Science background for further activities in academia or industry. Most Computer Science program graduates at Columbia step directly into career positions in Computer Science with industry or government or continue their education in graduate degree programs. Many choose to combine Computer Science with a second career interest by taking additional programs in business administration, medicine, or other professional studies. Students graduating from Columbia’s Computer Science Department find themselves well-suited to continue graduate-level studies in top-name institutions.  However, all students who complete the program have the knowledge required to pursue various careers either within the computer industry or elsewhere. What makes your Computer Science program stand out compared to other top programs and institutions? Many of the CS teaching faculty are leaders in their research field and/or have extensive experience in industry and private sector research labs. CS majors at Columbia have the opportunity to be taught and advised by world-renowned computer scientists who have well-developed collaborative relationships with companies such as Bell Labs, IBM, Lucent, and Microsoft, as well as other leaders in the field. Finally, Columbia’s location allows students to take advantage of the proximity to many potential future employers based in New York City and the city’s many cultural attractions. What opportunities are there to get involved in Computer Science research at Columbia? The Computer Science department has many research opportunities available during the academic year– many of the faculty sponsor undergraduate and master’s students for research projects in their groups. Typically, the faculty sponsors the students for credit, but in some cases, projects also provide a stipend. Please see the list of departmental research areas . There are additional Research Opportunities posted online that students can get involved with. What research, internship, and fellowships opportunities exist during the summer months, and how do I participate? There are multiple ways for students to get involved in research as a Columbia student. Current Research Opportunities are posted online. CS Advising also sends research opportunities to students via the student list-serves email. These can be for credit or pay. Additional opportunities are also advertised through the Center for Career Education (CCE). Our Career Placement Officers can assist students with applying for and interviewing for internships and fellowships. What kinds of career opportunities would this major/concentration prepare me for? In addition to graduate study, our students have gone on to a variety of careers either within the computer industry or elsewhere. Generally, the majority of our graduates have found positions at established computer/software companies (e.g., Microsoft, Google), research labs (e.g., IBM), or Wall Street firms (e.g., Morgan Stanley and Goldman Sachs). Other graduates have found positions at smaller companies or startups (e.g., foursquare). A few students have gone on to work or study outside of the field of Computer Science, applying their knowledge of the discipline to another field, such as business, medicine, or law. For more information regarding Career Opportunities and placements, click here . What percentage of your Computer Science undergraduates go on to graduate school? According to a recent survey, approximately 20 to 30% of our graduates go on to graduate school. How does the Computer Science program differ between the School of Engineering and Applied Sciences (SEAS), Columbia College, Barnard, and General Studies? The Computer Science major for SEAS students is more rigorous than other colleges. SEAS students take a minimum of 74 to 75 points, whereas Columbia College, Barnard, and General students CS majors pursue the same program with a minimum of 41 to 44 points. These students take more credits toward their college requirements and less towards the major than SEAS students. The courses available and opportunities for research do not differ. Is it possible to do a double major with an entirely different subject (e.g., English)? It may be possible to complete a double major in these circumstances as a Columbia College or General Studies student. Please consult your Advising Dean. What are the differences between the Computer Science and Computer Engineering degrees? While there is substantial cross-over between the two disciplines, in general, the Computer Science major focuses more on theory, software, and applications, whereas Computer Engineering focuses more on computer hardware, digital system development, and system design. Does the CS department process undergraduate admissions? No, the Office of Undergraduate Admissions processes undergraduate applications. If you have specific questions about admissions, please contact the Office of Undergraduate Admissions. THE APPLICATION PROCESS- BRIDGE, MS, DOCTORAL What are the application requirements? Please see the official application requirements on the SEAS website here . The CS Department does not manage the application requirements or process. How do I apply? To apply, submit an online application . Once you register with a valid email address, you can log on as frequently as you need to fill out your application data. Submit the application when it is complete. What is the full application process? Details of each step are included within the online application, but in summary: STEP 1: Complete and submit an online application. Refer to the SEAS Admissions Page STEP 2: After you submit the application, reference requests are sent to your recommendation providers. STEP 3: Your application will be assigned to faculty on the Admissions committee and pass through several stages of review. STEP 4: Official decision notifications will be sent out via email. How much is the application fee? Please see the official application requirements on the SEAS website here . What is the minimum GPA required to be admitted? There is no minimum; however, the average GPA of the admitted Bridge students is 3.7 on a 4-point scale. Who should I contact to confirm the receipt of my official documents? Due to the high volume of inquiries, requests to check the receipt of materials cannot be granted. Refer to the online application portal at SEAS Admissions. What are the application deadlines? Official deadlines are posted by SEAS here: https://www.gradengineering.columbia.edu/graduate-admissions/application-requirements Fall 1st priority deadline: January 15 Fall 2nd final deadline: February 15 We strongly encourage all applicants to meet the 1st deadline. Spring deadline: October 15th We will begin application review after the 1st priority deadline for all complete applications. A complete application consists of all application materials being uploaded and entered into the application system, including reference letters. Those applications that are completed after the deadline may be reviewed on a rolling basis. If you have any questions, please email. Can I apply for admission to the summer semester? We do not accept MS or Doctoral students in the Summer and Fall admitted students cannot begin in the Summer. Bridge Students can and should start in the Summer. What are the admission requirements? You should have an undergraduate degree in computer science or a related discipline. If your undergraduate degree is in a different field, you are required to have completed at least four computer science courses covering foundations of the field and basic programming and two mathematics courses. Please refer to the CS@CU MS Bridge Program for the courses recommended. If you do not have this foundational coursework but still feel you are qualified for the MS program, then your qualifications should be clearly outlined in your application through your resume, statement, and reference letters. If you are interested in pursuing this foundational coursework at Columbia, then you may be interested in the CS@CU MS Bridge Program here . Do I have to take these prerequisite courses at Columbia University? No, you do not need to take the coursework at Columbia, but the courses must be completed at an accredited university, not via a boot camp or MOOC. If you are interested in pursuing this foundational coursework at Columbia then you may be interested in the CS@CU MS Bridge program, which incorporates all the foundational/bridge coursework and the MS coursework into one program. Learn more about CS@CU MS Bridge Program here . Do you offer a path to take this foundational/bridge coursework at Columbia University? You may be interested in the CS@CU MS Bridge program which incorporates all the foundational/bridge coursework and the MS coursework into one program. Learn more about CS@CU MS Bridge Program here . I applied previously, can I reuse my old application materials? Applicants who were previously admitted and did not attend may reactivate their applications for one of the two terms following their original application. Candidates who do not request reactivation within the year are required to submit a new application.  Please be aware that candidates who reactivate their applications are essentially reapplying for admission, as admission will not be guaranteed. Columbia does not defer admission . Applicants who were not previously admitted are not eligible to reactivate their application. Instead, they must complete an entirely new application for admission. For more information, please contact seasgradmit@columbia.edu or visit their website . I already have an MS/Doctoral Degree. Will that disqualify me from applying? Applicants with existing MS or doctoral degrees are not prohibited from applying to any CS@CU program. All degrees should be listed in the application process. Transcript: My transcripts are not in English. What should I do? SEAS Graduate Student Affairs administers this policy; please see their website on this topic and send follow-up questions directly to their team . My course grades on my undergraduate transcript are based on a different scale from Columbia's. What can I do? SEAS Graduate Student Affairs administers this policy; please see their website on this topic and send follow-up questions directly to their team . Personal Statement: What should I write about in my personal statement? The purpose of the Personal Statement is for you to share more about your past experiences and to discuss how these experiences have contributed to your personal and professional growth. It allows the applicant the opportunity to explain to the admission committee the distinct qualities and commitment they can bring to the Columbia Engineering community. A few topics that you may want to address in your Personal Statement include: Describe the reasons you are interested in this program and discuss any relevant past experience. If you have relevant work or research experience, please indicate how it helped you decide on your career path. What are your post-graduation plans or career goals? What do you hope to gain from this program? What about this program excites you? If there are any special circumstances that need to be brought to the attention of the Admission Committee, please include that information. What are recommended formatting and word count guidelines for the personal statement? The purpose of the Personal Statement is for you to share more about your past experiences and to discuss how these experiences have contributed to your personal and professional growth. It allows the applicant the opportunity to explain to the admission committee the distinct qualities and commitment they can bring to their department and to the overall Columbia Engineering community. We recommend that your Personal Statement be between 250 and 1,000 words. Your application will not be negatively impacted and should exceed this recommendation. Please do not email us to request permission to exceed this recommendation, no permission is necessary. If possible, the following format is preferred: All margins should be at least one inch, and the left and right margins should be equal. The text should be double-spaced. The preferred fonts are 10-point Arial or 12-point Times New Roman; however, any legible serif or sans-serif standard font may be used. Do not use script or ornamental fonts. Your name should appear in the Header or Footer of every page. It is integral to the admissions process that you write and submit this Personal Statement on your own. Any evidence of plagiarized materials may result in denial or revocation of admission. A few topics that you may want to address in your Personal Statement include: Describe how your background has prepared you to pursue an advanced degree in the field of engineering or applied science at Columbia University. Describe the reasons you are interested in this program and discuss any relevant past experience. If you have relevant work or research experience, please indicate how it helped you decide on your career path. What are your post-graduation plans or career goals? What do you hope to gain from this program? What about this program excites you? If there are any special circumstances that need to be brought to the attention of the Admission Committee, please include that information. Follow-up questions can be sent to the SEAS Graduate Admissions team: seasgradmit@columbia.edu . Recommendation Letter: What is the deadline for the arrival of the recommendations or other materials supporting my application? Your entire application, including recommendation letters, should be complete by the deadline. You cannot submit an incomplete application. If your recommender needs to make changes, you should contact seasgradmit@columbia.edu . My recommenders cannot submit their letters of recommendation electronically. Can I have them sent as hard copies via mail? We require electronic submission of recommendations. Email seasgradmit@columbia.edu with any related issues. Can my recommenders send letters of recommendation from their non-institutional email addresses (e.g. Gmail, Hotmail, Yahoo)? You should use the professional email address/contact information for all of your recommendation providers. Email seasgradmit@columbia.edu with any related issues. My Recommendation provider does not have a current business card, what should they do? They can upload a current employee ID or badge. Email seasgradmit@columbia.edu with any related issues. Financial Support Document: Do I need to submit the financial document along with my application? International students will be asked to submit the financial statement after they are accepted into the program through the I-20 application process. There is no need for you to submit it before the decision is made. Technical Problems: I'm having problems entering data, completing the interview, and/or uploading documents in the online application system; what can I do? SEAS Graduate Student Admissions administers this policy; please see their website on this topic and send follow-up questions directly to their team . Being Forwarded to the MS Application Pool from the PhD Application Pool: I applied to the PhD program, but I have received a notice that I have been admitted to the MS program. What does this mean? Your application to the PhD program was unsuccessful, but since you indicated that you would like to be considered for the MS program, your application was forwarded to the MS application pool for consideration. I applied for the PhD program, was unsuccessful, and have been offered a place on the MS program. If I join the MS program, can I reapply for the PhD program later? Yes, after entering the MS program, you can apply for the PhD program the following year, and transfer into the PhD program if you are successful. Decision: When will I receive a decision on my application? The Committee reviewers evaluate all applications and make admission decisions. As soon as that decision is made, you will be notified by email to the address specified on your online application. We cannot respond to requests for updates on decisions. I submitted my application a while ago and still have not heard about a decision yet. Has a decision been made? If you have not received the email notification yet, that means the application is still being evaluated. As soon as a decision is made, you will be notified automatically via email. Due to the high volume of applications, we cannot respond to requests for updates on decisions. If I am denied admission, may I receive feedback on the reasons behind the decision? Unfortunately, due to the high volume of applications received, the Department cannot provide specific feedback on the decisions made. Funding Information: Are there funding opportunities? US students are encouraged to apply for scholarships, merit fellowships, and loans. Visit the FFSEAS Official Financial Aid and Educational Financing for more information. International students are advised to pursue fellowship programs available through their countries of origin. Bridge Program Applicants , please note that as this is a non-degree awarding program, there is no financial or visa support available until the student transitions to the CS MS portion of their program. Reactivation: I have been offered admission to the MS program, but my situation has changed and I want to enroll in a later semester. What should I do? You will have to reactivate your application and pass the review process again. Your online application and official documents are held for a maximum of 12 months from your original submission date and can be reactivated once within this time without repaying the application fee. SEAS does not permit “deferring” – the application will be reviewed again with the new applicant pool and admission is not guaranteed. I want to apply for admission for the Fall or Spring semester in one year's time or more, but I cannot see my semester of choice in the online system. What can I do? Applications are only accepted up to a maximum of two semesters in advance. Check back at a later date when your semester of choice will be activated to receive applications. I was denied admission. Can I reactivate my application? No, you cannot reactivate your rejected application. You can reapply to the program by creating a new online application with all materials resubmitted. Please be aware that you will need to pay the application fee again when you create a new application. I am reactivating my application. Do I need to submit my test scores? If you have previously applied to the CS graduate program and submitted official scores the first time through ETS and those scores are still valid, then you do not need to resubmit them with your current application. If your test scores have expired as of the new application deadline, you need to retake the exam and submit those new scores. COLUMBIA VIDEO NETWORK (CVN) What is Columbia Video Network (CVN)? CVN is the graduate distance learning program of Columbia University’s School of Engineering & Applied Science (SEAS). CVN enables students globally to pursue residency-free, fully accredited engineering courses and degree programs completely via the Internet, allowing students to view their lectures anytime and anywhere. If you are interested in the distance learning program, please visit their website here . Can I apply to CVN and transfer to in-person or visa versa? It is not possible to transfer between the in-person and CVN CS MS within the first semester. Students who have successfully completed at least one semester and are deemed to be making good academic progress can apply for a one-time transfer. This will be reviewed both by the CS department and CVN. TEST SCORES Is the GRE required? The Graduate Record Examination (GRE) is currently optional. If you have taken the exam and would like to provide your scores, you may, but it is not required. Students who do not submit scores will not be penalized in the graduate admissions review process. We expect the GRE to be required again in the future for the CS@CU MS Bridge Program in Computer Science. Please see the SEAS application requirements online here . Is there a minimum GRE score for admission? No, we do not have a minimum GRE score required for admission; however, the average GRE scores of admitted Bridge students are: Average GRE Q: 161 Average GRE A: 4 Average GRE V: 159 We anticipate that applicants to the CS@CU MS Bridge program will come to us with a variety of different backgrounds. The GRE will help, along with the rest of your application, to identify your strengths and areas in which the program can benefit you. What are the GRE and TOEFL institutional codes for the Columbia University Department of Computer Science? How do I send IELTS scores to Columbia University? Use the Columbia University code 2111. It is not necessary to enter the department code. Please have your official GRE and TOEFL scores sent to us directly by ETS , using the Columbia University institutional code 2111. It is not necessary to enter the department code. For IELTS scores, enter your TRF number on the application for admission. Our office downloads IELTS scores that have been transmitted to our e-download account. Please contact your test center and​ request that your scores be sent to ​the IELTS e-download account. You may select Columbia Engineering by searching for Columbia University under “List of Organizations subscribing to the E-TRF Query” and then selecting “The Fu Foundation School.” We will not accept paper IELTS test report forms. Please refer to the SEAS Standardized Test Scores FAQ for more information on this process. For follow-up inquiries, we encourage you to contact seasgradmit@columbia.edu directly. Who is required to submit standardized test scores? Please refer to the SEAS Standardized Test Scores FAQ for more information on this process. For follow-up inquiries, we encourage you to contact seasgradmit@columbia.edu directly. Do you have minimum language scores? No, for the Internet-based TOEFL test, we recommend a total score of 101. For IELTS, 7 is the recommended score for admission. These are not strict cutoffs; we will, of course, consider applicants with other scores. COSTS I would like to request an application Fee Waiver. How can I do that? Eligible applicants are welcome to apply for an application fee waiver. Application fee waivers may be available for students who meet certain criteria including, U.S. citizens or permanent residents currently enrolled in a U.S. School with financial need, U.S. Military personnel/veterans, and students who participate in special programs (listed on the waiver form). To apply follow the steps in the order listed below: 1. Create an online application account to begin to apply for admission and complete the program selection page. 2. Complete and submit the Application Fee Waiver Request Form with the required documentation.- https://apply.engineering.columbia.edu/register/feewaiverform How much does the program cost? Tuition rates are set by the University and updated each summer. Tuition and fees are posted online here . REGISTRATION Can I study part-time? Domestic students and those without visa restrictions may pursue the CS MS part-time – there is a maximum of 5 years to complete the degree. Doctoral degree students are expected to be on campus full-time. Bridge students study part-time but may take a full-time courseload if they choose to. Do you offer classes at X time? Course availability changes by semester. Please refer to the Directory of Classes for the current semester and examples of previous semester schedules. QUESTIONS We receive an enormous volume of emails with application-related questions. Please read this page carefully before sending us an email . Questions about particular research groups or individual faculty members should be directed to the appropriate faculty members by email. Transcripts, GRE/TOEFL/ IELTS, fee waivers Office of Graduate Student Affairs Undergraduate Admissions Office of Undergraduate Admissions CS MS Admissions MS Admissions CS PhD Admissions PhD Admissions CVN MS Program CVN Updated 11/06/2023 Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}