{
  "id": 4,
  "date": "2024-05-18T18:13:40.822437",
  "url": "https://www.cs.columbia.edu/education/ms/softwareSystems/",
  "university_name": "Columbia University",
  "title": "The Software Systems Track",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence The Software Systems Track Software Systems Track The Software Systems track is for students who want to pursue knowledge of software development and software systems methodologies and technologies. Software plays a key role in practical, real-world computing systems and applications. This track enables students to understand and master classic and current software systems and provides the fundamentals for later self-study as well as the construction of future software systems. SUMMARY OF REQUIREMENTS Complete a total of 30 points (Courses must be at the 4000 level or above) Maintain at least a 2.7 overall GPA. (No more than 1 D is permitted). Complete the Columbia Engineering Professional Development & Leadership (PDL) requirement Satisfy breadth requirements Take at least 6 points of technical courses at the 6000 level At most, up to 3 points of your degree can be Non-CS/Non-track If they are deemed relevant to your track and sufficiently technical in nature. Submit the Non-CS/NonTrack form and the course syllabus to your CS Faculty Advisor for review 1. Breadth Courses Visit the breadth requirement page for more information. There are four breadth courses , two of which can be covered by the track requirements, plus one course chosen from Theory and the other from AI and Apps. 2. Required Track Courses Students are required to complete the following three courses: COMS W4115, COMS W4118, and COMS 4156. ( COMS W4995 Engineering Software as a Service can be substituted for COMS W4156 Advanced Software Engineering.) Students who have taken equivalent courses in the past and received grades of at least a B may apply for waivers and take other CS courses instead. Course ID Title COMS W4115 Programming Languages and Translators COMS W4118 Operating Systems I COMS W4152* OR COMS W4156* Engineering Software as a Service OR Advanced Software Engineering * Both COMS W4152 and W4156 offered only in the fall Check the registrar’s website for definitive information as to which courses are offered in a given semester. 3. Elective Track Courses Part I Students are required to complete at least two 4000-level courses (6 credits) selected from the following list of track courses. Note: some of the 4000-level electives are offered every semester, and some are offered only one semester per year, while others are not offered regularly. If you have questions about courses or your course plan, reach out to your CS track advisor. Course ID Title COMS W4111 Introduction to Databases COMS W4112 Database System Implementation COMS W4113 Fundamentals of Large-Scale Distributed Systems COMS W4117 Compilers and Interpreters CSEE W4119 Computer Networks COMS W4130 Principles and Practice of Parallel Programming COMS W4156 Cloud Computing (Fall 2024 and beyond) COMS W4170 User Interface Design COMS W4181 Computer Security I COMS W4444 Programming and Problem Solving CSEE W4840 Embedded Systems COMS W4995 * Topics in Computer Science (Visit the topics courses page to see which COMS 4995 courses apply to this track.) ** Topics in Computer Science (4995) sections must be approved as qualifying “Software Systems” track courses by your Software Systems Track Advisor. Typically this would mean topics offered by a software systems faculty member or by an affiliated adjunct. COMS W4187 Security Architecture and Engineering is no longer offered; students who took 4187 when it was offered in the past may include it as a 4000-level track course. It has been replaced in the track by COMS W4181 Computer Security I. Students who completed COMS W4186 Malware Analysis and Reverse Engineering prior to Fall 2020 may include it as a 4000-level track course. It has been replaced in the track by CSEE W4840 Embedded Systems. Check the registrar’s website for definitive information as to which courses are offered in a given semester. 4. Elective Track Courses Part II Students are required to complete at least two 6000-level courses (6 credits) selected from the following pre-approved list. Note: some of the 6000-level electives are offered only one semester per year, while others are not offered regularly. If you have questions about courses or your course plan, reach out to your CS track advisor. Course ID Title COMS E6111 Advanced Database Systems COMS E6113 Topics in Database Systems COMS E6114 Advanced Distributed Systems COMS E6117 Topics in Programming Languages and Translators COMS E6118 Operating Systems II COMS E6121 Reliable Software COMS E6156 Topics in Software Engineering COMS E6156 Cloud Computing (Prior to Fall 2024) COMS E6178 Human-Computer Interaction COMS E6184 Anonymity & Privacy COMS E6424 Hardware Security COMS E6901 * Projects in Computer Science (Advisor approval required) COMS E6998 * Topics in Computer Science (Visit the topics courses page to see which COMS 6998 courses apply to this track.) CSEE 6863 Formal Verification of Hardware and Software Systems EECS E6897 Distributed Storage Systems Big Data ELEN E6883 An Introduction to Blockchain Technology **Projects in Computer Science (6901) and Topics in Computer Science (6998) courses must be approved as qualifying “Software Systems” electives by your Software Systems Track Advisor. Typically this would mean topics/projects offered by a software systems faculty member or by an affiliated adjunct. COMS E6900 Tutorial in Computer Science (with an appropriate faculty member) can be substituted for E6901 with the advisor’s approval. Check the registrar’s website for definitive information as to which courses are offered in a given semester. 5. General Electives Students must complete the remaining credits with General Elective Courses at the 4000 level or above. Three credits must be from a graduate CS course and can be chosen from either the Track Electives listed above or from the CS department at the 4000 level or higher. Students may also request to use at most 3 points of Non-CS/Non-Track coursework if approved by the process listed below. Non-CS/Non-Track: CS MS students may request up to 3 points of Non-CS/Non-Track points to count toward their 30-point MS program. CS Track advisor may review and approve if the course is determined to be relevant to the CS MS track and sufficiently technical in nature. Students should send the Non-CS/Non-Track Form and the course syllabus to your Track Advisor for review. **Due to a significant overlap in course material, MS students not in the Machine Learning track can only take one of the following courses – COMS 4771, COMS 4721, ELEN 4903, IEOR 4525, STAT 4240, STAT 4400/4241/5241 – as part of their degree requirements. ** Known non-technical CS courses ** COMS W4995 The Business of Software Delivery CSOR E4995 Financial Software Systems COMS 4995 or 6998 Int Agile Project Management COMS 4995 or 6998 Intro to DevOps TRACK PLANNING Please visit the Directory of Classes to get the updated course listings. Please also note that not all courses are offered every semester or even every year. A few courses are offered only once every two or three years or even less frequently. Updated: 4/18/2024 Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}