{
  "id": 4,
  "date": "2024-05-18T18:14:50.686837",
  "url": "https://www.cs.columbia.edu/people/faculty/",
  "university_name": "Columbia University",
  "title": "Faculty by Name",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence Faculty by Name Faculty Emeritus In Memoriam Alman, Josh Assistant Professor of Computer Science Office: 504 CSB Phone: Email: josh@cs.columbia.edu Interests: theory, algorithms, complexity, algebra in computation Andoni, Alexandr Associate Professor Office: 420 Mudd Phone: Email: andoni@cs.columbia.edu Interests: Algorithmic foundations of massive data, including sublinear algorithms, high-dimensional geometry, theoretical machine learning Bareinboim, Elias Associate Professor Office: 605 CEPSR Phone: 212-853-8438 Email: eb@cs.columbia.edu Interests: Causal Inference, Artificial Intelligence, and Machine Learning. Bauer, Daniel Lecturer in Discipline Office: 704 CEPSR Phone: 212-853-8463 Email: bauer@cs.columbia.edu Interests: Natural Language Processing, Machine Learning, Computer Science Education Belhumeur, Peter N Professor Office: 623 CEPSR Phone: 212-853-8460 Email: belhumeur@cs.columbia.edu Interests: computer vision; graphics; image-based rendering; face recognition Bellovin, Steven M. Percy K. and Vida L. W. Hudson Professor of Computer Science Office: 454 CSB Phone: 212-853-8427 Email: smb@cs.columbia.edu Interests: security, networks, privacy, public policy Blaer, Paul S Senior Lecturer in Discipline Office: 703 CEPSR Phone: 212-853-8441 Email: pblaer@cs.columbia.edu Interests: robotics, vision, sensor planning, 3D modeling, mobile computing, computer science education Blei, David Professor, Joint with Statistics Office: 430 Mudd Phone: 212-853-8472 Email: david.blei@columbia.edu Interests: Statistical machine learning, topic models, scalable Bayesian computation Blumberg, Andrew Professor, Joint with Mathematics Phone: Email: andrew.blumberg@columbia.edu Interests: Topological and geometric data analysis, computational biology, computer security Borowski, Brian S. Lecturer in Discipline Office: 625 CEPSR Phone: 212-853-8487 Email: borowski@cs.columbia.edu Interests: Algorithms, applied signal processing for communications and music technology, computer science education Cannon, Adam H Senior Lecturer in Discipline Office: 459 CSB Phone: 212-853-8431 Email: cannon@cs.columbia.edu Interests: machine learning, pattern recognition, data mining Carloni, Luca Professor and Department Chair Office: 450F CSB,466 CSB Phone: 212 853 8425 Email: luca@cs.columbia.edu Interests: System-on-Chip (SoC) Platforms, Embedded Systems, System-Level Design, Computer-Aided Design Chaintreau, Augustin Associate Professor Office: 610 CEPSR Phone: 212-853-8454 Email: augustin@cs.columbia.edu Interests: Networked Algorithms, Social Networks, Mobile Computing, Stochastic Networks Chang, Shih-Fu Joint, Richard Dicker Professor of Electrical Engineering Phone: 212-854-6894 Email: sfchang@ee.columbia.edu Interests: multimedia, computer vision, machine learning, information retrieval, signal processing Chen, Xi Professor Office: 503 CSB Phone: 212-853-8436 Email: xichen@cs.columbia.edu Interests: Algorithmic Game Theory and Economics, Complexity Theory Chilton, Lydia B Assistant Professor Office: 612 CEPSR Phone: 212-853-8456 Email: lc3251@columbia.edu Dear, Tony Lecturer in Discipline Office: 712 CEPSR Phone: Email: tony.dear@columbia.edu Interests: Robotics, Planning, Reinforcement Learning Drinea, Eleni Senior Lecturer in Discipline, Computer Science and Operations Research Phone: 2128549258 Email: eleni@cs.columbia.edu Interests: information theory, network coding, randomized, online and approximation algorithms, network analysis, and dimensionality reduction techniques Edwards, Stephen A. Associate Professor Office: 462 CSB Phone: 212-853-8433 Email: sedwards@cs.columbia.edu Interests: Compilers, Embedded systems, VLSI, computer-aided design, digital systems, languages Feiner, Steven K Professor Office: 609 CEPSR Phone: 212-853-8453 Email: feiner@cs.columbia.edu Interests: Human-computer interaction, graphics and user interfaces, 3D user interfaces, augmented reality, virtual environments, knowledge-based design of graphics and multimedia,  mobile and wearable computing, computer games, healthcare, information visualization, Geambasu, Roxana Associate Professor Office: 461 CSB Phone: 212-853-8432 Email: roxana@cs.columbia.edu Interests: distributed systems, operating systems, security and privacy, cloud computing, mobile computing Gravano, Luis Professor Office: 706 CEPSR Phone: 212-853-8465 Email: gravano@cs.columbia.edu Interests: databases, information retrieval, web search, social media, information extraction Gu, Ronghui Tang Family Assistant Professor of Computer Science Office: 515 CSB Phone: 212-853-8444 Email: rg3123@columbia.edu Hirschberg, Julia B. Percy K. and Vida L. W. Hudson Professor of Computer Science Office: 705 CEPSR Phone: 212-853-8464 Email: julia@cs.columbia.edu Interests: Computational Linguistics/Natural Language Processing, prosody, emotional speech, spoken dialogue systems, deceptive speech, entrainment/alignment in dialogue, text-to-scene generation, speech summarization, code-switching Hsu, Daniel J Associate Professor Office: 426 Mudd Phone: 212-853-8473 Email: djhsu@cs.columbia.edu Interests: algorithmic statistics, machine learning, privacy Jana, Suman Associate professor Office: 412 Mudd Phone: Email: suman@cs.columbia.edu Interests: security and privacy, applied cryptography, operating systems, software engineering Kaffes, Kostis Assistant Professor Office: 624 CEPSR Phone: 212-853-8449 Email: kkaffes@cs.columbia.edu Kaiser, Gail E Professor Office: 607 CEPSR Phone: 212-853-8452 Email: kaiser@cs.columbia.edu Interests: software systems, static and dynamic program analysis, software testing, software security, applications of AI to software engineering and vice versa Kender, John R Professor Office: 622 CEPSR Phone: 212-853-8459 Email: jrk@cs.columbia.edu Interests: Computer vision; video understanding; visual user interfaces; artificial intelligence Kim, Martha A Associate Professor Office: 469 CSB Phone: 212-853-8435 Email: martha@cs.columbia.edu Interests: Computer Architecture, Hardware Systems, Hardware/Software Interaction and Parallel  Hardware and Software Systems Knowles, David Assistant Professor Office: 520 CSB Phone: 212-853-8448 Email: dak2173@columbia.edu Interests: machine learning, computational biology, genomics. Lee, Jae Woo Senior Lecturer in Discipline Office: 715 CEPSR Phone: 212-853-8467 Email: jae@cs.columbia.edu Interests: Computer Science Education, Networks, Software Engineering, Cloud Computing Malkin, Tal G Professor Office: 514 CSB Phone: 212-853-8443 Email: tal@cs.columbia.edu Interests: cryptography, complexity theory, security, randomized algorithms McKeown, Kathleen Henry and Gertrude Rothschilds Professor of Computer Science Office: 722 CEPSR Phone: 212-853-8469 Email: kathy@cs.columbia.edu Interests: natural language processing, summarization, multimedia, digital libraries Misra, Vishal Professor Office: 512 CSB Phone: 212-853-8442 Email: vishal.misra@columbia.edu Interests: Networking, with particular attention to net neutrality and the economics of the Internet; modeling and performance evaluation; information theory Nayar, Shree K T. C. Chang Professor of Computer Science Office: 621 CEPSR Phone: 212 853 8458 Email: nayar@cs.columbia.edu Interests: Computer Vision, Computer Graphics, Robotics, Human-Computer Interfaces Nieh, Jason Professor Office: 518 CSB Phone: 212-853-8446 Email: nieh@cs.columbia.edu Interests: operating systems, mobile computing, cloud computing, networking, security Papadimitriou, Christos H The Donovan Family Professor Office: 456 CSB Phone: 212-853-8429 Email: christos@cs.columbia.edu Interests: Algorithms, Complexity, Economics, Game Theory, Evolution, Neuroscience, Machine Learning Pe'er, Itsik G Professor Office: 505 CSB Phone: 212-853-8437 Email: itsik@cs.columbia.edu Interests: Computational biology, genomics, bioinformatics Pena-Mora, Feniosky Joint, Edwin Howard Armstrong Professor of Civil Engineering and Engineering Mechanics and Professor of Earth and Environmental Engineering and of Computer Science Phone: 2128543082 Email: Feniosky@columbia.edu Interests: Information technology support for collaboration in preparedness, response and recovery during disasters involving critical physical infrastructures; change management, conflict resolution, sustainable construction, visualization, augmented reality, and processes integration during the design and development of large-scale civil engineering systems Pitassi, Toniann Jeffrey L. and Brenda Bleustein Professor of Engineering Office: 513 CSB Phone: Email: tp2684@columbia.edu Ray, Baishakhi Associate Professor Office: 604 CEPSR Phone: 212-853-8451 Email: rayb@cs.columbia.edu Interests: Software Testing, AI based Software Engineering,  Empirical Software Engineering, Program Analysis Ross, Kenneth A Professor Office: 510 CSB Phone: 212-853-8439 Email: kar@cs.columbia.edu Interests: database systems, query processing, declarative languages, genetics Roughgarden, Tim Professor Office: 410 Mudd Phone: 212-853-8474 Email: tr@cs.columbia.edu Interests: Theory, Algorithms, Algorithmic Game Theory, Mechanism Design, Blockchains Rubenstein, Dan Professor Office: 816 CEPSR Phone: 212-853-8477 Email: danr@cs.columbia.edu Interests: Computer networks, Network Robustness and Security, Multimedia  networking, Performance Evaluation, Algorithms Salleb-Aouissi, Ansaf Senior Lecturer in Discipline Office: 702 CEPSR Phone: 212-853-8462 Email: as2933@columbia.edu Interests: Data Mining, Machine Learning, Frequent patterns, Classification, Ranking, Rule Learning Schulzrinne, Henning G Julian Clarence Levi Professor Office: 720 CEPSR Phone: 212-853-8468 Email: hgs@cs.columbia.edu Interests: Computer networks; multimedia systems; mobile and wireless systems; ubiquitous and pervasive computing Servedio, Rocco A. Professor Office: 517 CSB Phone: 212-853-8445 Email: rocco@cs.columbia.edu Interests: computational complexity theory; randomness in computing; computational learning theory; sublinear-time algorithms Sethumadhavan, Simha Professor Office: 465 CSB Phone: 212-853-8434 Email: simha@cs.columbia.edu Interests: Computer Architecture; Security, VLSI design; High Performance Computing Smith, Brian A Assistant Professor Office: 611 CEPSR Phone: 212-853-8455 Email: brian@cs.columbia.edu Interests: Human-Computer Interaction, Accessibility, Social Computing, Wearable Computing, Games, Augmented Reality, Computer Vision Stein, Clifford Professor, Joint with Industrial Engineering and Operations Research Office: 306 Mudd Phone: 212-854-5238 Email: cliff@cs.columbia.edu Interests: algorithms, combinatorial optimization, network algorithms, scheduling, theory of computation Stolfo, Salvatore J Professor Office: 606 CEPSR Phone: 212.853.8478 Email: sal@cs.columbia.edu Interests: computer security; intrusion  and anomaly detection; embedded device security; data mining/machine learning Stroustrup, Bjarne Professor Office: 464 CSB Phone: Email: bs2286@columbia.edu Interests: distributed systems, design, programming techniques, software development tools, and programming languages Vapnik, Vladimir Professor Phone: 212-854-0003 Email: vv2116@columbia.edu Interests: machine learning, empirical inference, statistical learning theory Verma, Nakul Senior Lecturer Office: 726 CEPSR Phone: 212-853-8471 Email: verma@cs.columbia.edu Interests: Machine Learning, High-Dimensional Statistics; Learning Theory; Non-Linear Representations of Data Vondrick, Carl YM Associate Professor of Computer Science Office: 618 CEPSR Phone: 212-853-8457 Email: cv2428@columbia.edu Interests: Computer Vision, Machine Learning, Robotics, Perception Wing, Jeannette M Executive Vice President for Research, Professor of Computer Science Office: 1401 NWC Phone: 212-853-0681 Email: wing@columbia.edu Interests: Trustworthy AI, Security and Privacy, Probabilistic Programming, Formal Methods, Data Science Wu, Eugene Associate Professor Office: 421 Mudd Phone: 212-853-8475 Email: ewu@cs.columbia.edu Interests: database, visualization, data cleaning, crowd sourcing, interaction, data explanation Yang, Junfeng Professor Office: 519 CSB Phone: 212-853-8447 Email: junfeng@cs.columbia.edu Interests: Operating Systems, Programming Languages, Security, Distributed Systems, Software Engineering, Networks Yannakakis, Mihalis Percy K. and Vida L. W. Hudson Professor of Computer Science Office: 455 CSB Phone: 212-853-8428 Email: mihalis@cs.columbia.edu Interests: algorithms, complexity theory, combinatorial optimization, databases, testing and verification Yu, Zhou Associate Professor Office: 723 CEPSR Phone: 212-853-8470 Email: zy2461@columbia.edu Interests: Natural language processing, Multimodal Analysis, Machine Learning, Human-Computer Interaction Yuen, Henry Associate Professor Office: 511 CSB Phone: Email: hsy2116@columbia.edu Interests: quantum computation, quantum information, complexity theory, cryptography Zemel, Richard Trianthe Dakolias Professor of Engineering and Applied Science and Professor of Computer Science Office: 619 CEPSR Phone: Email: zemel@cs.columbia.edu Zheng, Changxi Associate Professor Office: 603 CEPSR Phone: 212-853-8450 Email: cxz@cs.columbia.edu Interests: Computer graphics, physically-based multi-sensory animation, computational acoustics, scientific computing, robotics Zhou, Xia Associate Professor Office: 626 CEPSR Phone: 212-853-8488 Email: xia@cs.columbia.edu Interests: Mobile computing, wireless networking and systems, human-computer interaction, mobile health Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}