{
  "id": 4,
  "date": "2024-05-18T18:13:34.038557",
  "url": "https://www.cs.columbia.edu/education/ms/breadthRequirement/",
  "university_name": "Columbia University",
  "title": "Breadth Requirement",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence Breadth Requirement Breadth Requirements All students must complete the 4 course Breadth Requirement. To fulfill this requirement, take 1 course from Group 1 (Systems), 1 course from Group 2 (Theory), 1 course from Group 3 (AI and Applications), and 1 more course from any of the three approved lists for a total of 4 courses. Only the courses listed in the table below may be used for Breadth. Exceptions to the table below will not be made . 6000-level courses cannot be used for Breadth. The only joint-CS courses permitted are as specified below; all other breadth courses must be strictly “COMS.”  Regardless of the course number, courses labeled “certificate only” or named “xxx for Data Science” or similar may not be applied to the MS breadth requirement. Breadth courses may overlap with a required track or track/general elective course. Refer to your track page for more details. For a course overlap to be possible, the course must be listed on your track page and in the chart below. Please be advised that all students will still need 30 credits to complete the CSMS degree. All breadth courses must be taken at Columbia and cannot be waived or substituted. Group Approved Courses 1. Systems All COMS 41xx courses plus COMS W4995 “Engineering Software as a Service” except COMS 4121, COMS 416x and COMS 417x All COMS 48xx courses COMS 4444 The following cross-listed courses also count toward the Systems breadth requirement: CSEE 4119, EECS 4340, CSEE 4823, CSEE 4824, CSEE 4840, CSEE 4868 2. Theory All COMS 42xx courses plus COMS W4995 – “Advanced Algorithms”, “Randomized Algorithms” and CSOR 4231 ( not CSOR 4246) 3. AI & Applications All COMS 47xx courses except COMS 4721 and COMS 4776 All COMS 416x and COMS 417x CBMF 4761 plus COMS W4995 – “Machine Learning Theory” (Spring 2020 ONLY) & COMS 4995 “Causal Inference” (Spring 2020 ONLY) Questions? Email CS Advising! Updated: 09/21/2023 Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}