{
  "id": 4,
  "date": "2024-05-18T18:13:09.841879",
  "url": "https://www.cs.columbia.edu/education/ms/topics-courses/",
  "university_name": "Columbia University",
  "title": "ML Track Topics Course Approvals",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence ML Track Topics Course Approvals TOPICS COURSES Below are tables with topics courses that have been offered over the last few years. The tables also show which tracks each course can be applied to for the MS in Computer Science degree -“X” means the course counts towards that track. If you have any questions, please contact CS Advising . Approval requests for courses not listed on these charts should be directed to your MS Faculty Advisor . COMS 4995 “X” means the course counts towards that track Course Computational Biology Computer Security Foundations Machine Learning Natural Language Processing Network Systems Software Systems Vision and Graphics CS/Journalism Advanced Algorithms x x x x Algorithms, Incentives, and Learning x x x x Arts Rsch: Interactive Stories x Applied Deep Learning X X X Applied Machine Learning X x x Blockchains and their Applications Business of Software Delivery x Competitive Programming X Crypto & Financial Processes x x Data Sci Tech Entrepreneurship x x Deep Learning (Iddo Drori) x X x x x Deep Learning for Computer Vision (Peter Belhumeur) X X x x X Design Using C++ x Digital Geometry Processing x x Elements of Data Science: A First Course X X X Engineering Software as a Service X Fund. of Distributed Systems x x GPU Computing x x Hacking 4 Defense x x x Internet Tech Econ Policy x Int Agile Project Management x Intro to Data Visualization x x X x Intro to DevOps Intro to Networks & Crowds x x x x Intro Social Networks x Intro to Semantic Web x Introduction to Computer Security x Language Library Design C++ x Logic and Computability X Machine Learning for Functional Genomics X X Machine Learning Theory X Mathematics of Machine Learning and Signal Recognition x ML w/ Applications in Finance X ML w/Probabilistic Programming X Methods in Unsupervised Learning X X X X X Multilingual Language Technology and Language Diversity X X Networks & Crowds X X X X Neural Networks Deep Learning X X X Open source Development X X Optimization Methods in Machine Learning X X X Parallel Functional Programming X Randomized Algorithms X X X Secure Software Development x x X x Semantic Representations for NLP X X X Topics in Financial Computing Video Game Development x Video Game Technology (Production) and Design x VoIP Security x x COMS 6998 “X” means the course counts towards that track Course Computational Biology Computer Security Foundations Machine Learning Natural Language Processing Network Systems Software Systems Vision and Graphics CS/Journalism 3D UI Curriculum Design x Advanced Distributed Systems x x x x Advanced Image-Based Vision and Rendering x Advanced Internet Routing x Advanced ML for Personalization x x Adv Sem Computational Genomics x Advanced Spoken Language Processing X X X Adv. Topics in Comp. Geometry x Adv. Topics in Complexity Theory x Adv. Topics Proj Deep Learning x x x x Adv. Topics in Machine Learning x x x x Advanced Topics in Programming Language/Compilers x x Advanced Topics in Security x Advanced Video Game Development x Advanced Web Design Studio x x x X Algebraic Techniques in CS X Algo Techniques Massive Data x x x x Algorithms for Dealing with Massive Data x x Algorithms for Massive Data X Algorithms Through Geometric Lens x x x Algorithmic Game Theory x x Algorithmic Graph Theory x x Analysis of Networks & Crowds X X X X Bandits & Reinforcement Learning x x x x x x Bayesian Analysis for NLP x x Biological Networks x Cellular Networks Mobile Compt x Cloud Computing x x x Cloud Computing and Big Data x x x X x x X x Cloud and Mobile Challenges x x Cloud and Mobile Security x Cognitive Computing IBM Watson x x x Computation & the Brain x X x x Comp Methods/High Thrghpt SEQ x Computational Models of Speech and Language x x Comp Models of Social Meaning x x x Computational Aspects of Geometrical Design x Computational Human Genetics x Cpm Vis Machine Learning Mobile Platform x x x Content Distribution x Content Networking x Cybersecurity Tech Policy Law X x x Data Science & Entrepreneurship x x Database Topics in Research & Practice x Dialog Systems (Conversational AI) x Digitally Mediated Storytelling x x Econ of Social Networks x x x Embedded Scalable Platforms x Empirical Methods of Data Science X X X X X ENGR WEB3 BLOCKCHAIN APPS X Experimental Analysis Algos x x Formal Hardware & Software Verification x Formal Verification X Formal Verification/HW/SW Syst x x Formal Verification of System Software X Foundations of Blockchains X Fund of Speaker Recognition/Fund of Speech Recognition* X X X X X X Geometry Processing and Animation x Graphics & Comp Motion x High-Dimensional Data Analysis x x High Performance Machine Learning X Humanoid Robotics x Information Theory in CS X X X Info Theory in Theoretical CS x x x Interactive Data Exploration Systems x x x x Int Agile Project Management Internet Economics x Intro to Brain Computer Interaction x x Intro to DevOps Intro/Distributed Data Mining x x Intro to Project Management (general elective only) Lower Bounds of Theoretical CS x Machine Learning and Climate x Machine Learning Datasets x Machine Learning for NLP x x Machine Translation x x Malware Analysis Rev Eng as COMS 6998 only x x x Micro-service Apps & APIs x x Microservice/Cloud Apps x ML W/Probabilistic Progr x Mobile Computing x Mobile Computing with iPhone and Android x Mobile HCI x Modern As-a-Service App Development x x x x Modern Internet App Development x x x Modern Internet Service Oriented Application Development x x x Modern Serverless Cloud Apps x x NLP: Computer Models of Soc. Meaning x NLP for the Web x x Network Systems Implementation x Network Theory x x x x x Next Generation Network Arch x Practical Cryptography x Practical Deep Learning x Practical Deep Learning System Performance X Practical Privacy Technologies X X Probabilistic Programming x x Privacy in Online Social Networks x x PRIVACY PRESERVING SYS X X Q&A Tech for IBM Watson x Quantum Computing: Theory and Practice x x Randomness in Computing x Readings Language Design X X Representation Learning X x x X Research Seminar in Computational Genomics x Resilient Hardware Systems x x Search Engine Technology x x x x Security and Robustness of ML Systems x X X X Semantic Tech in IBM Watson x x Seminar in Animation and Geometry Processing x Seminar in Evolutionary and Comparative Genomics x Seminar on Biological Networks x Seminar on Spoken Dialogue Systems x Social Networks x x x x x x Software Defined Network x Software Security and Exploitations x Statistical Methods for NLP x x Storytelling with Streaming Data x Sublinear Time Algos Learning x x The Synthetic Control Method X x X Systems for Human Data Interaction X X The TSP in Theory and Practice x Topics in Computational Complexity x x x Topics in Computer Vision x Topics in Datacenter Networking x x x Topics in Human Language Technology x x x Topics in Learning Theory x x x x Topics in Networked Tags x x x Topics in Robotic Learning X X Topics in Virtual and Augmented Reality X X Ubiquitous Genomics x Virtual Machines x x X Web Application Servers – Arch-Design x X *Due to significant overlap, students can receive credits for only one of these courses. Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}