{
  "id": 4,
  "date": "2024-05-18T18:14:12.557062",
  "url": "https://www.cs.columbia.edu/academic/student-life/",
  "university_name": "Columbia University",
  "title": "Student Life",
  "content": "Skip to content Skip to content Columbia University in the City of New York Toggle navigation About About the Department Department Lectures Events Newsletters Directory Research Technical Reports Research in the News Press Interviews Computing Research Facilities Faculty Faculty by Name Affiliates Faculty Achievements Open Positions Academics Undergraduate Programs MS Program PhD Program MS Bridge Program Computer Engineering Program Dual MS in Journalism and Computer Science Program Courses & Registration Academic Honesty Admissions Admissions Information Prospective Student FAQ Affiliated Programs Advising & Student Services Academic Advising Careers Student Awards Student Life and Organizations Research Areas Machine Learning Vision & Robotics Networking Computer Engineering Software Systems Computational Biology Security & Privacy NLP & Speech Theory Graphics & User Interfaces Theory Graphics & User Interfaces NLP & Speech Security & Privacy Computational Biology Software Systems Computer Engineering Networking Vision & Robotics Machine Learning Artificial Intelligence Student Life Student Organizations Conference Funding Application Department Life Campus Life NYC Life Reporting cyberbullying, discrimination, and sexual harassment Located in NYC, one of the most diverse cities in the world, the Computer Science Department at Columbia University (CS@CU) supports the diversity of the student population, encourages students to participate in student organizations and social events, and provides support to further students’ academic and professional and career development. Student Organizations Women in Computer Science (WiCS). Encourages, guides, and provides outreach to female undergraduates, graduate students, and post-docs within computer science, as well as faculty and staff. Membership is open to anyone–inside or outside CS@CU–interested in promoting women in computer science. WiCS members visiting Watson’s Manhattan HQ Women in Science at Columbia (WISC). Facilitates networking, support, mentoring and outreach among women graduate students and post-docs within the science departments. The Application Development Initiative (ADI). Nurtures student creativity and technological aptitude by creating a community and resources for student developers of all talents and interests. Engineering Graduate Student Council (EGSC). Maintains communication between administrators and graduate students. Students discuss their concerns and issues; cultivate respect, interaction, and friendship among peers; represent engineering graduate students in correlation with other student-run organizations in the university community; and maintain relations with alumni and career services to help students in their professional career development. Arts & Sciences Graduate Council (ASGC). Acts as a liaison between graduate students and administrators. Students have the ability to voice common concerns–housing, health care, study space and locations, and computer services–and sponsor academic, cultural, and social events and workshops that enhance the quality of student life. Student Governing Board (SBG). Represents and works for the needs of Columbia’s student organizations. SGB commits to the principle of community self-government, and believes that students’ needs are best professed and expressed by the students themselves. Conference Funding Application The Computer Science department has a limited pool of funding available to undergraduate and MS CS students who would like to present at a CS-related conference during the academic year. Since the pool is limited and we cannot guarantee funding to every student who wishes to be funded for a conference, we request that you submit the application below so that we can review your request for funding. The department will review your request and get back to you with a decision within 2 weeks of the request submission date. Please note that funding is prioritised for students attending the Grace Hopper Celebration, the ACM Richard Tapia Celebration of Diversity in Computing, and the National Society of Black Engineers Regional Conference. Requests for funding to attend other conferences will be considered on a case-by-case basis, and priority will go to students who are presenting papers at these conferences. Conference Funding Application Form Academic Development Distinguished Lecturers Series COMS W3157 Advanced Programming Hackathon Department Life CS@CU organizes social events throughout the year for students and faculty to meet informally. Everyone is encouraged to participate. Trips – In past semesters CS@CU students have organized such trips as whitewater rafting, hiking, skiing, ice skating, bowling, comedy club night, and jazz club night. BBQs – Every semester, CS@CU PhD students organize a BBQ in the CS courtyard and lounge. Coffee Hour – The CS@CU student services team organizes a monthly coffee hour for all students, faculty and staff of the CS department. Ice Cream Socials – Everyone loves ice cream! Student organizations such as WiCS , EGSC , and ADI also host professional and social events during the academic year. Student Awards CS@CU recognizes the outstanding performance and exemplary service of undergraduate and graduate students to the CS@CU community every year with the following student awards : Andrew P. Kosoresow Memorial Award for Outstanding Performance in TA’ing and Service Paul Charles Michelman Memorial Award for Exemplary Service to the Computer Science Department CS Service Award (PhD students) Campus Life Columbia Athletics – For information on work-out facilities, sporting events and tickets, and hours of operation, see the GoColumbiaLions main page: CU Arts Initiative – Looking for some aesthetic stimulation? How about some authentic musical and theatrical performances? CU Arts Initiative has information about and resources for the latest arts, films, and theatrical performance, as well as information about NYC museums and culture sites. CU Arts Initiative is an excellent resource for NYC cultural activities for the CU community, and can provide students with ticket discounts and free admission to some programs, activities, and performances around the city. Miller Theatre – A part of CU Arts Initiative, as well as a nationally recognized cultural center for artistic talent, Miller Theatre explores and provides audiences with contemporary opera, classical music, dance, and film. Miller Theatre is open to the public, but gives Columbia students discounts. Information on directions, shows, performances, and times can be found here . International Students and Scholars Office (ISSO) – ISSO welcomes more than 10,000 students, interns, scholars, and accompanying family members from nearly 150 countries and offers its international clientele an array of services through the ISSO. For information about services, activities, and programs, see the ISSO website . Center for Student Advising (CSA) – For the use of undergraduates, CSA works with Academic Success programs and the Undergraduate Scholars Program. Advisors help plan academic programs each semester, answer questions about degree and Core requirements (for Columbia College undergraduates and first-year/sophomore students) and nontechnical requirements (for SEAS undergraduates), as well as help with any student inquiries or concerns. CSA works with faculty and other administrators to help generate student success. Center for Career Services – Career Services provides students with help finding a job or internship; they also provide counseling sessions and practice interviews, as well as offers current students with connections to alumni. Career Services creates career fairs and host special events for current student, as well as provide students help with various career resources, such as workshops on resumes & CVs, interviewing, cover letters, negotiating, and networking, in a variety of different fields. Student Health Services at Columbia – Provides students with health services and promotes student well-being. Columbia University’s Health Questions and Answer Site – In connection with Columbia’s Health Services, Go Ask Alice! allows students to ask questions or search for information regarding fitness and nutrition to relationships. Undergraduate and Graduate Housing – Provides undergraduate and graduate student with hospitable services and a place to stay while they study. Columbia’s Housing websites provide students with information regarding different residential housing options, on-campus and off-campus residencies, and guest/conference accommodations. See Columbia’s Graduate Housing and Undergraduate Housing websites for more information. Shuttle Buses – Shuttle buses travel among the Morningside campus, Lamont, Studebaker, the Medical Center, Harlem Hospital, and the George Washington Bridge Bus Terminal. Shuttle service is available to all Columbia University affiliates with valid University ID, free of charge. For more information about the shuttle buss and other 24-hour transportation services, visit Columbia’s Transportation website . Other Information : For information regarding the Office of the Dean, Community Development, and Admissions and Financial Aid, as well as other topics of interest, see Columbia’s Student Affairs webpage. Information regarding Columbia’s policies and procedures can be found here . NYC Life Popular Restaurants in Morningside Heights Café s & Bakeries Levain Bakery* – 2167 Frederick Douglass Blvd. Max Caffe* – 1261 Amsterdam Ave. The New York Basics – 1090 Amsterdam Ave. Hungarian Pastry Shop – 1030 Amsterdam Ave. Chokolat Patisserie – 3111 Broadway Joe Coffee – 550 West 120th Street (on campus – Northwest Corner Building) Kuro Kuma – 121 La Salle Street Double Dutch Espresso – 2194 Frederick Douglass Blvd. Nous Espresso* – Graduate Student Center in Philosophy Hall Restaurants Max Soha* (Italian) – 1274 Amsterdam Ave. Flat Top* (American) – 1241 Amsterdam Ave. La Salle Dumpling Room* (Chinese) – 3141 Broadway Xi’an Famous Foods* (Chinese) – 2675 Broadway Lolo’s Seafood Shack* (Caribbean seafood) – 303 West 116th Street Roti Roll* (Indian) – 994 Amsterdam Ave. Doaba Deli* (Indian) – 945 Columbus Ave. Himalayan Curry House (Indian) – 254 West 108th Street Friedman’s (American) – 1187 Amsterdam Ave. Community Food & Juice (American/healthy) – 2893 Broadway Jin Ramen (Japanese) – 3183 Broadway Sweetgreen (Salads) – 2937 Broadway Bettolona (Italian) – 3143 Broadway Dinosaur BBQ (bbq) – 700 West 125th Street The Mill (Korean) – 2895 Broadway Arts & Crafts Beer Parlor* (bar food) – 1135 Amsterdam Ave. Brownie’s Cafe (sandwiches/salads) – basement of Avery Hall (* = recommended by CS@CU students) Grocery Stores Near Campus M2M – 2935 Broadway Apple Tree – 1225 Amsterdam Ave Morton Williams – 2941 Broadway Westside Market – 2840 Broadway Fairway – 2328 12th Ave. Best Market – 2817 Frederick Douglass Blvd. Health Services Near Campus Columbia Health Center : John Jay Hall, 4th floor Columbia Counseling and Psych Services : Alfred Lerner Hall, 8th Floor CityMD Urgent Care – 2710 Broadway St Luke’s Hospital – 1111 Amsterdam Ave. Morningside Heights/Harlem Landmarks Cathedral of St. John the Divine General Grant National Memorial Apollo Theater Tom’s Restaurant (aka Monk’s from Seinfeld) …and Columbia is home to the most famous classroom in NYC! Other Helpful Links Columbia Arts Initiative : cultural event listings around NYC, discounted tickets to movies, theater, museums. Columbia Public Safety Bike Safety Tips : how to bike safely in NYC, free bike registration with the NYPD, discounted bike locks MTA TripPlanner : to find the best public transit route to wherever you need to go in NYC. NYC Rent Guidelines Board : What every New Yorker needs to know about rental housing. Columbia Off-Campus Housing Assistance NYCgo : The official guide to NYC NYC Basic Tips & Etiquette : A funny (and useful!) cartoon guide. The Free Food Facebook Group Reporting cyberbullying, discrimination, and sexual harassment Reporting cyberbullying Cyberbullying is any communication received via social media or email that seeks to intimidate, harass, threaten, or otherwise do harm. It also encompasses transmitting materials in violation of the University’s sexual harassment, hostile workplace or protection of minors policies, or that violates the policies of external networks and resources. Report cyberbullying to the CUIT Service Desk ( https://cuit.columbia.edu/service-desk ), either by calling 212-854-1919 during daytime hours, visiting the Walk-in Center at 202 Philosophy Hall (daytime hours only), or submitting a ticket at https://cuit.columbia.edu/service-desk. CUIT will forward cyberbullying complaints to the Director of Computer Security in the CISO office. The Director, working with Public Safety, OGC and Student Conduct and Community Standards, will determine if the offensive material exists on a University resources. Material stored on external systems (e.g., Facebook, LinkedIn, Snap Chat, etc.) cannot be directly mitigated by Columbia. Other departments may be involved depending on the target of the bullying. Updated 02/06/2018 Reporting discrimination, harassment, gender-based misconduct (sexual assault, domestic and dating violence, stalking) If you are a student, click here to report an incident.  (Staff and faculty report incidents to the office of Equal Opportunity and Affirmative Action at http://eoaa.columbia.edu/eoaa-policies-and-procedures .) Filling out the form will initiate an investigation and you will be contacted the next business day by a case manager. Depending on the type of incident, it will be handled either by the Student Conduct and Community Standards (SCCS), which investigates harassment and general student misconduct, or by the Title IX coordinator https://sexualrespect.columbia.edu/columbias-title-ix-coordinator , which investigates gender-based misconduct. For policies and procedures regarding gender-based misconduct, go here . SCCS, Title IX, and EOAA work closely together and will assign your case to the most appropriate case manager, while also offering referrals for counseling, medical attention, legal consultations, and other resources. During business hours, you can also call or visit the SCCS or Title IX Coordinator. Student Conduct and Community Standards 800 Watson, 612 West 115th Street 212-854-6872 http://studentconduct.columbia.edu/ Title IX Coordinator 201A Kent Hall (Amsterdam Ave./116th) 212-853-1276 https://sexualrespect.columbia.edu/ columbias-title-ix-coordinator FAQ What happens once I file a report? You will receive a call back by the next business day by a case manager assigned to you. Depending on the type of case, the incident will be investigated by the Student Conduct and Community Standards (SCCS), which investigates harassment and general student misconduct, or by the Title IX Coordinator, which investigates gender-based misconduct. Can I file a report anonymously? You can, but without a way for the case manager to contact you for more information, it severely limits the ability to follow up and investigate the incident. Will the police be involved? It depends on whether the incident rises to the level of police involvement and what you want to have happen. Columbia will not forward a case to the police against your wishes unless a reported incident is serious and endangers others within the community. In that case, Columbia has a duty to move a case forward. Neither the Student Conduct and Community Standards (SCCS) or Title IX Coordinator is confidential. Confidential services and counseling are provided by Sexual Violence Reponse and Counseling and Psychological Services . Will my report remain confidential? Neither the Student Conduct and Community Standards (SCCS) or Title IX Coordinator is confidential. Confidential counseling and emotional support for students is available through Sexual Violence Response (SVR) and Counseling and Psychological Services , both of which have on-campus offices and are open for drop-in visits. The Ombuds Office —available to students, faculty, and staff—offers a confidential place to discuss workplace and academic concerns while offering explanations of policies and procedures. Updated 03/18/2024 Find open faculty positions here . Computer Science at Columbia University Upcoming Events View All >> In the News Press Mentions Columbia University in the City of New York School of Engineering and Applied Science SEAS Undergraduate Admissions SEAS M.S./Ph.D. Application Data Science Institute CS Advising MICE CRF Resources for Faculty and Staff Copyright FAQ Computer Science Department 500 West 120 Street, Room 450 MC0401 New York, New York 10027 Main Office: +1-212-853-8400 Directions Map Directory © Columbia Webmaster Privacy Policy Dean Boyce's statement on amicus brief filed by President Bollinger President Bollinger announced that Columbia University along with many other academic institutions (sixteen, including all Ivy League universities) filed an amicus brief in the U.S. District Court for the Eastern District of New York challenging the Executive Order regarding immigrants from seven designated countries and refugees. Among other things, the brief asserts that “safety and security concerns can be addressed in a manner that is consistent with the values America has always stood for, including the free flow of ideas and people across borders and the welcoming of immigrants to our universities.” This recent action provides a moment for us to collectively reflect on our community within Columbia Engineering and the importance of our commitment to maintaining an open and welcoming community for all students, faculty, researchers and administrative staff. As a School of Engineering and Applied Science, we are fortunate to attract students and faculty from diverse backgrounds, from across the country, and from around the world. It is a great benefit to be able to gather engineers and scientists of so many different perspectives and talents – all with a commitment to learning, a focus on pushing the frontiers of knowledge and discovery, and with a passion for translating our work to impact humanity. I am proud of our community, and wish to take this opportunity to reinforce our collective commitment to maintaining an open and collegial environment. We are fortunate to have the privilege to learn from one another, and to study, work, and live together in such a dynamic and vibrant place as Columbia. Sincerely, Mary C. Boyce Dean of Engineering Morris A. and Alma Schapiro Professor      -   Location:  \n                 Speaker: },  \n                 Series:   }  Bio }         Interests:    }  Courses This Semester   ( -)   } Close"
}