[
  {
    "id": 9,
    "date": "2024-05-21T10:57:25.733783",
    "url": "https://www.stanford.edu/admission/",
    "university_name": "Stanford University",
    "title": "Search Stanford:",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Admission Explore the possibilities of a Stanford education. 7,841 Undergraduate students Class of 2027 from 76 countries + 49 states 9,688 Graduate students Undergraduates Undergraduate Admission About 1,700 freshmen and 30 transfer students enroll at Stanford each year. We review each applicant with an eye to academic excellence, intellectual vitality, and personal context. Undergraduate Admission Undergraduate Financial Aid Stanford meets the full financial need of every admitted undergrad who qualifies for assistance. Tuition is covered for undergrads with family incomes under $150,000. Tuition, room, and board are covered for undergrads with family incomes below $100,000. Undergraduate Financial Aid Profile of the Class of 2027 Class of 2027 Graduate Studies Graduate Admission More than 200 degree programs are offered across seven schools at Stanford. Admission requirements vary greatly among them. Graduate Admissions Financing Graduate Study The cost of graduate study at Stanford — and the resources available for financial support — vary by degree, school and enrollment status. About 85% of Stanford graduate students receive financial assistance. Graduate Student Funding Vice Provost for Graduate Education The Office of the Vice Provost for Graduate Education offers information for prospective students of the 200+ graduate degree programs offered at Stanford. Information for Prospective Students Financial Aid We are committed to making a world-class education affordable. About 65% of students receive financial aid toward the cost of attendance Tuition covered for undergrads with family incomes below $150,000 Tuition, room, & board covered for undergrads with family incomes below $100,000 Graduate aid available based on available funds and academic merit More About Financial Aid Applying To Other Programs Summer Session High school students, current Stanford students, and other college students can all apply to participate in eight-week summer academic programs. Summer Session Lifelong Learning Stanford offers valuable opportunities in continuing adult education, executive, and professional programs, and special programs for K-12 students. Continuing Education Programs Postdocs Information for postdoctoral scholars seeking positions at Stanford University. Postdoctoral Positions Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "date": "2024-05-21T10:57:54.672355",
    "url": "https://www.stanford.edu/",
    "university_name": "Stanford University",
    "title": "Search Stanford:",
    "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Stanford Explore Stanford Main Content A Societal Mission Stanford was founded almost 150 years ago on a bedrock of societal purpose. Our mission is to contribute to the world by educating students for lives of leadership and contribution with integrity; advancing fundamental knowledge and cultivating creativity; leading in pioneering research for effective clinical therapies; and accelerating solutions and amplifying their impact. More about Stanford Campus News Stories about people, research, and innovation across the Farm Science & Engineering Five surprising facts about the sun Education Jo Boaler: The case for ‘math-ish’ thinking Science & Technology The surprising relationship between marine worms and the algae that live inside them Science & Engineering How racism impacts support for affordable housing Social Sciences Clayman Institute at 50 Community & Culture Meet Yannie Tan More campus news Academics Preparing students to make meaningful contributions to society as engaged citizens and leaders in a complex world Undergraduate Education Rich learning experiences that provide a broad liberal arts foundation and deep subject-area expertise Undergraduate Education Graduate Education Unsurpassed opportunities to participate in the advancement of entire fields of knowledge Graduate education Driving impact Continuing adult education, executive and professional programs, and programs for K-12 students Lifelong Learning Seven schools in which to pursue your passions Medicine Law Humanities & Sciences Engineering Education Sustainability Business More about academics Profile of Hawa Racine Thiam “Before coming to Stanford, I was thinking in terms of understanding. Now I feel that I can start thinking in terms of creating.” Hawa Racine Thiam Assistant Professor of Bioengineering More Research Driving discoveries vital to our world, our health, and our intellectual life 15 Institutes cross disciplinary boundaries 20 Libraries hold over 12 million items $1.98 Billion sponsored research budget More about research Upcoming Events More events Health Care Advancing human health through innovative research, education, and care Stanford Medicine Leading a worldwide revolution in precision health through biomedical research, education, and clinical enterprises Stanford Medicine Stanford Health Care Leveraging expertise and advanced technology  to deliver unparalleled care for each patient’s unique needs Stanford Health Care Stanford Children’s Health The only health care network in the Bay Area – and one of the few in the country – exclusively dedicated to pediatric and obstetric care Stanford Children’s Health More about health care Profile of Meet Nadia Hemmat “Getting into Stanford was just such an amazing shock. But once I got here and became so involved, got to meet all these wonderful people, I feel like I fit right in — and like I belonged here the whole time.” Meet Nadia Hemmat Class of 2023 More Campus Life Building a vibrant community of creative and accomplished people from around the world Student Life A residential campus with diverse housing, exceptional dining, and over 600 student organizations Student Affairs Arts & Culture A rich tradition of fostering creativity and a vibrant arts district on campus Stanford Arts Recreation & Wellness State-of-the-art facilities and fitness programs to encourage movement and play Recreation & Wellness More about campus life Athletics Providing student-athletes the opportunity to achieve excellence both in competition and in the classroom Home of Champions Stanford’s 135 NCAA championships are the most for any university, a product of an unrivaled culture of excellence and continued support from the campus community National Championships Olympic Excellence The Cardinal has produced at least one medalist in every Olympics in which the U.S. has competed since 1912, totaling 296 medals from 177 medalists Medals Multidimensional Impact Stanford student-athletes have achieved local, national, and global impact through community involvement and advocacy Athlete Stories More about athletics Admission Offering extraordinary freedom to explore, to collaborate, and to challenge yourself Explore the possibilities of a Stanford education as you map out your college journey. We look for distinctive students who exhibit an abundance of energy and curiosity in their classes, activities, projects, research, and lives. Stanford meets the full financial need of every admitted undergrad who qualifies for assistance. More than two-thirds of undergrads receive some form of financial assistance. Generally, tuition is covered for families with incomes below $150,000. More about admission Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
  },
  {
    "id": 9,
    "date": "2024-05-21T10:58:25.128805",
    "url": "https://bulletin.stanford.edu/academic-polices/student-conduct-rights/nondiscrimination",
    "university_name": "Stanford University",
    "title": "Stanford University",
    "content": "Skip to main content Stanford University Academic Calendar 2023-24 Schedule of Classes Bulletin Archive Get Help Search . . . Stanford University Home Programs Courses Academic Policies Academic Policies A-Z Academic Progress Requirements Admissions Courses Degree Requirements Enrollment Examinations Financial Aid Grading Graduation Grievances Leaves and Returns Student Conduct and Rights Transfer and Test Credit Tuition and Fees Veterans and Military Benefits Home / Academic Policies / Student Conduct and Rights / Nondiscrimination Policy Nondiscrimination Policy Stanford University admits qualified students of any race, color, national or ethnic origin, sex, age, disability, religion, sexual orientation, gender identity, veteran status, or marital status to all the rights, privileges, programs, and activities generally accorded or made available to students at the University. Consistent with its obligations under the law, in the administration of the University's programs and activities, Stanford prohibits unlawful discrimination on the basis of race, color, national or ethnic origin, sex, age, disability, religion, sexual orientation, gender identity or expression, veteran status, marital status or any other characteristic protected by applicable law; Stanford also prohibits unlawful harassment including sexual harassment and sexual violence.  This policy applies to Stanford programs and activities both on and off-campus, including overseas programs. Contact Information Stanford’s Title IX Coordinator has been designated to handle inquiries regarding regarding this nondiscrimination policy: Kingscote Gardens (2nd floor), 419 Lagunita Drive, Stanford, CA 94305, (650) 497-4955 (voice), (650) 497-9257 (fax), titleix@stanford.edu (email). Individuals may also file complaints directly with the Office for Civil Rights, within the United States Department of Education, by following the information on this website: https://www2.ed.gov/about/offices/list/ocr/complaintintro.html . Quick Links Get Help Academic Calendar Tuition & Fees Enrolling in Courses Bulletin Quick Links About Stanford Share Feedback Schools Doerr School of Sustainability Graduate School of Business Graduate School of Education School of Engineering School of Humanities and Sciences School of Law School of Medicine Stanford University Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305."
  }
]