[
  {
    "id": 8,
    "date": "2024-05-21T10:57:23.924040",
    "url": "https://college.harvard.edu/admissions",
    "university_name": "Harvard University",
    "title": "Primary Navigation",
    "content": "Skip to main content Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public Video description: Aerial shots of Harvard, students around campus Admissions Breadcrumb Home - Admissions On This Page: Overview Why Harvard Visit & Connect How to Apply Afford Harvard Admissions Statistics Policies and Reporting Overview The Future is Calling Harness your curiosity and learn about the world—and yourself. Through our liberal arts and sciences curriculum, you'll discover how to use your passions to build a bright future. Frequently Asked Questions How will the delayed FAFSA processing impact admissions or financial aid decisions? Do not worry! Delayed FAFSA submissions will not impact the timing of admissions or financial aid decisions at Harvard. If you are admitted and if you have submitted the CSS Profile and all necessary tax returns to IDOC by our financial aid application deadline, your financial aid decision will be available at the time of admission. As always, if you complete those parts of your financial aid application after the deadline, there is no penalty or reduction in the amount of aid you can receive, but you may experience a delay in receiving your aid decision. Paying the admissions application fee is a hardship for my family. Can I get a waiver? We are committed to making the application process accessible for all students. If the admissions application fee presents a hardship for you or your family and you plan on applying for financial aid, the fee will be waived. Please follow the steps below to request a fee waiver: Common Application Confirm that you meet at least one of the indicators of economic need and then select “Yes” to the prompt “ You are eligible for application fee waivers if you meet one or more of the following criteria.\" Complete the fee waiver signature. Coalition Application, Powered by Scoir Confirm that you meet at least one of the indicators of economic need listed in the Fee Waiver section of your Profile. If you do not meet one of the indicators of economic need, you may enter the Harvard-specific fee waiver code on the payment page: JH3S5Q2LX9 Transfer Applicants Please see the Transfer Application Requirements for information about requesting a transfer application fee waiver. What admissions criteria do you use? There is no formula for gaining admission to Harvard. Academic accomplishment in high school is important, but the Admissions Committee also considers many other criteria, such as community involvement, leadership and distinction in extracurricular activities, and personal qualities and character. We rely on teachers, counselors, and alumni to share information with us about an applicant's strength of character, their ability to overcome adversity, and other personal qualities. How can I add new accomplishments/awards/accolades to my submitted application? We understand that you might receive new recognitions or awards after you’ve submitted your application. We welcome the submission of this additional notable information. You may upload information about notable accomplishments and awards using the Applicant Portal . Why Harvard Discover what makes Harvard the standard for liberal arts and sciences education. From our unparalleled academics to our revolutionary financial aid, we strive to offer the best resources to the next generation of leaders. Read more about choosing Harvard Crimson Pride Harvard is home to 42 Division I intercollegiate sports teams - more than any other college in the country. Innovation From physical spaces to funding, Harvard provides the support for students to investigate and explore their world. Groundbreaking Research Undergraduates have access to more than $7 million in funding to pursue research in the sciences, social sciences, arts, or humanities. Creative Expression Theater, Dance, and Media - one of Harvard's newest concentrations - is just one of the many pathways in the arts and humanities. Visit & Connect Visit & Connect From your own home, or while walking around Cambridge, there are lots of ways to explore our campus. Click any of the links below to learn more about everyday life at Harvard. Quick Links Explore Harvard Virtual Tour Online Information Sessions Read Student Stories Join Our Email List Take a Virtual Tour Apply How to Apply We’ll guide you through the Common Application or Coalition Application, Powered by Scoir, and answer any questions you have along the way. Quick Links First-Year Applicants Application Requirements Transfer Applicants International Applicants Visiting Undergraduate Students U.S. Military Veterans Admissions Deadlines November 1 - Restrictive Early Action Restrictive Early Action applicants are notified by mid-December. January 1 - Regular Decision Regular Decision applicants will be notified by the end of March. Learn About Applying Restrictive Early Action Afford Harvard Harvard is affordable for all admitted students. Financial aid covers all demonstrated need for all students, regardless of citizenship or citizenship status. Families making under $85,000 a year pay nothing for their student's education, and families making between $85,000-$150,000 pay 0-10% of their incomes. Learn more about financial aid Calculate Your Estimated Scholarship How affordable is Harvard? See for yourself with our Net Price Calculator. Net Price Calculator Spotlights and Stories My Favorite Places On / Around Campus As I look back on my 4 years, I would like to share some of my favorite places around Harvard's campus. Read Full Story Latest Stories Love Letter to BASHA: BASHA Recap Part 2 Dear BASHA, as we come to the end of the 2023-2024 academic year, I want to applaud the board of the Bengali Association of Students at Harvard for putting together so many events. Read Full Story Goodbye, Harvard Read Full Story First Time Visiting the Boston Children's Hospital My Unusual Path to Neuroscience, and Research I’d always wanted to do research, but getting into it was one of the most intimidating things I’ve done in college. Read Full Story View all student stories Admissions News College accepts 1,937 to Class of 2028 March 28th, 2024 College accepts 692 under Early Action Program December 14th, 2023 Harvard further expands financial aid to ease access March 31st, 2023 View all news Admissions Statistics Admissions Statistics Harvard welcomes students from across the country and all over the world, with diverse backgrounds and far-ranging talents and interests. Quick Links Admissions Statistics Diversity and Access Guide: Application Tips Financial Aid Fact Sheet A Profile of the Admitted Class of 2027 Statistics 56,937 56,937 Applicants 1,966 1,966 Admitted students 16 16 % International students 55 55 % Receive need-based scholarships Learn More About Harvard Join our email list to download our brochure and stay in touch. Sign Up Related Topics First-Year Applicants Here's everything you need to know about applying to Harvard College as a first-year applicant. Apply For Financial Aid We strive to make our financial aid application as streamlined as possible. Application Requirements Here you'll find a detailed explanation of each requirement of the application, including teacher recommendations, test scores, and school reports. Policies and Reporting Annual Fire Safety Report The Harvard University Environmental Health and Safety Department publishes the Annual Fire Safety Report , which includes fire safety polices, evacuation procedures, and fire statistics. Clery (Campus Security) Act The University is required by federal law (The Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act, 20 U.S.C. 1092(f), known as the “Clery Act”) to publish an annual security report. A copy of the report as well as the disclosure procedures can be found on the Harvard University Police website . Code of Conduct Harvard University is committed to the highest standard of ethics and conduct, and financial aid staff are bound to the conflict of interest and commitment policies applicable to all Harvard employees. Harvard has adopted a Code of Conduct relating to educational loan programs. Copyright Infringement Harvard University is committed to maintaining the integrity and availability of the Harvard network for the vital educational and research purposes for which it was designed and prohibits the use of its network to violate the law, including the U.S.Copyright Act. Please read the annual copyright disclosure . Disability University Disability Services serves as a central resource on disability-related information, procedures and services for the University community and provides expertise in the development, implementation, and acquisition of standard disability-related University practices, procedures and resources. FERPA The Family Educational Rights and Privacy Act of 1974, as amended (“FERPA”) is a federal law that gives students certain rights with respect to their education records. More information is available on the Registrar’s website . Retention and Graduation Rates As required, we have reported our graduation rates of degree-seeking, first-time, full-time undergraduates to the department via the IPEDs website . Additional rates for students in select categories can be found on this chart . Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification. Toggle Admissions Submenu Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Skip to site header Skip to main content"
  },
  {
    "id": 8,
    "date": "2024-05-21T10:57:24.634608",
    "url": "https://college.harvard.edu/",
    "university_name": "Harvard University",
    "title": "Primary Navigation",
    "content": "Skip to main content Harvard College Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public Home - Harvard College Slides Congratulations, Class of 2024! Your future begins today. A tradition marking 373 years of academic achievement Celebrating a transformative educational journey Slide Controls The following controls are not necessary for screen readers because all slides are available in the preceding list \"As you begin the next phase in your life journey, I hope you will continue to embrace a learner’s mindset. Learning is not a destination in and of itself; it is a journey best undertaken to improve your life and that of others.\" Rakesh Khurana Danoff Dean of Harvard College Start Your Journey Explore Harvard Academics Academics Through intellectual vitality, the Harvard College community seeks to establish a culture in which all members speak, listen, and ask questions of each other – and ourselves – with curiosity and respect. Fields of Study Fields of Study At Harvard College, students choose a \"concentration,\" which is what we call a major. With more than 3,700 courses in 50 undergraduate fields of study, you'll have plenty of chances to find your passion. Diversity & Inclusion Diversity & Inclusion Harvard fosters a living and learning environment where you can celebrate your individuality—and where you can explore the shared ideas and experiences that connect us all. Faculty Faculty Working side by side with undergraduates, Harvard professors encourage students to see with new eyes. Through research, coursework, and casual interactions, students and faculty learn from and challenge each other on a daily basis. Residential Life Residential Life The residential community system is one of Harvard's best known traditions - first-years live together in Harvard Yard, and then students spend the next three years in one of Harvard's historic Houses. Student Life Student Life From your professors and House advisors to your friends and teammates, Harvard is a vibrant community where you can feel supported and encouraged. No matter where you come from, Harvard is home. Athletics Athletics Harvard is home to 42 nation-leading Division I intercollegiate sports teams. Our outstanding varsity athletes excel in competition, fuel Crimson pride across campus, and carry on the rich legacy of Harvard Athletics. Health & Wellbeing Health & Wellbeing Caring for your mental and physical well-being positions you to do your best in the classroom or in any endeavor you pursue. Harvard has a wide array of opportunities that provide a strong foundation to help you stay healthy and maximize wellbeing. Cambridge & Boston Cambridge & Boston Cambridge and Boston are separated by the Charles River but share a vibrant student population, an exciting blend of cultures, and a stimulating urban pulse. These two cities will host some of your most cherished memories. College Guides College Guides These guides cover many topics - including applying and financial aid, funding summer research, and navigating Harvard's many campus resources. Prospective Students Application Requirements Application Requirements Interested in applying to Harvard College? This page gives detailed instructions about each component of the application. Most information applies to first-year and transfer applicants. Financial Aid Overview Financial Aid Overview You can afford Harvard. The Griffin Financial Aid Office provides need-based aid that allows us to bring the best students to Harvard, regardless of their ability to pay. Net Price Calculator Net Price Calculator Try out this calculator tool to get a quick estimate of what your family would be expected to contribute to the cost of a Harvard education. Diversity & Access Diversity & Access When students come to Harvard, they bring their perspective on the world—an understanding that is deeply tied to their culture, background, and experiences. The result is a diverse, open-minded community where dialogue and debate are not only encouraged—they're inevitable. Visit Our Campus Visit Our Campus We welcome you to attend a campus visit of Harvard College. A campus visit consists of a one hour information session with an admissions officer and 1-2 current students, followed by a one hour campus tour. Online Information Session Online Information Session Join Harvard College admission officers and students for a live online information session with Q&A. Virtual Tour Virtual Tour Use our Virtual Tour to discover spaces that aren't even available on an in-person campus tour, such as classrooms, laboratories, residence halls, and more. International Applicants International Applicants We welcome applications from all over the world. Our admissions and financial aid processes are the same for all applicants - regardless of nationality or citizenship. Transfer Applicants Transfer Applicants Each year, we accept a small group of exceptional students to transfer to Harvard from other similar liberal arts programs. U.S. Military veterans may be particularly interested in our transfer program. Frequently Asked Questions Frequently Asked Questions Visit this page to read through the most frequently asked questions about applying to Harvard. Current Students Concentrations Concentrations At Harvard College, students choose a \"concentration,\" which is what we call a major. With more than 3,700 courses in 50 undergraduate fields of study, you'll have plenty of chances to find your passion. College Offices College Offices The staff of Harvard's campus offices ensure you always have somewhere to turn for help navigating college life. Improve your study skills, take the first step on the path to career success, or enliven your day with an infusion of arts and culture. Financial Aid Application Information Financial Aid Application Information This page includes helpful information about financial aid application deadlines, the CSS Profile, the FAFSA, and other required forms. Events Calendar Events Calendar Discover what's happening on campus. News & Announcements News & Announcements Check out this page for the latest updates on Harvard's campus. Messages to Students Messages to Students Read the latest leadership statements here. Navigating Campus Navigating Campus Navigating day-to-day campus life is made easier with this collection of important resources and information for booking spaces, student activities and organizations, academics, health and wellness support, and more. Health & Wellbeing Health & Wellbeing Caring for your mental and physical well-being positions you to do your best in the classroom, on the field, or in any endeavor you set your mind to. Harvard has a wide array of opportunities that provide a strong foundation to help you stay healthy and learn about methods to maximize wellbeing. Parents & Families Family Resource Page Family Resource Page We hope the information on this page helps parents, family members, or guardians of prospective or current Harvard students along the journey from applying to graduating. First-Year Experience Office (FYE) First-Year Experience Office (FYE) Meet the office that most directly supports first-year students. This page offers information about making the transition from high school to college. Parent & Family Engagement Office Parent & Family Engagement Office We are committed to providing resources and opportunities for parents and families to learn about the College and share in the milestones your student will experience during their time at Harvard. Family Weekend Family Weekend During Family Weekend each fall, families can experience Harvard College through the eyes of their student. Attend courses, meet faculty, talk to other families, and receive valuable information about the Harvard experience. Messages to Parents & Families Messages to Parents & Families Check out this page to read the most recent messages for parents and families of students. High School Counselors Counselor Resources Counselor Resources The Admissions Committee considers counselors as invaluable colleagues and partners in the college selection and application process. We hope the information on this page is helpful to you as you guide your students. Application Requirements Application Requirements Read about the application requirements for first-year applicants and transfer students as well as deadlines for application rounds. Financial Aid Financial Aid Harvard offers incredibly generous financial aid packages. We hope you'll advise students to learn more about the financial support as they consider Harvard - it is likely more affordable than they expect! Net Price Calculator Net Price Calculator This quick estimator tool will give students and their families estimates of what they'd be expected to contribute to the cost of a Harvard education. Nearly 1/4 of our Harvard families pay nothing for their student to attend. Application Tips Guide Application Tips Guide This guide provides tips about every section of the application and the Harvard supplement. Commencement Past and Present Dating back to 1642, the journey of countless graduates began with Commencement. Explore past and present commencement content! More from the Graduating Class @harvardcollege Introducing your Class of 2024 Marshals! 📣 #Harvard #HarvardCollege #ClassOf2024 #2024ClassMarshals #ClassMarshals #HarvardMarshals #ExtremeMusic #fyp #SitcomIntro #Obsessed #HarvardStudent #HarvardStudents #Students #EduTok #CollegeTok #Harvard2024 #Harvard24 ♬ original sound - harvardcollege - Harvard College @harvardcollege Commencement is only 43 days away 🫣 #Harvard #HarvardCollege #CollegeGraduation #Commencement2024 #CongratsClassOf2024 #ClassOf2024 #CapCut ♬ original sound - harvardcollege - Harvard College @harvardcollege Congratulations Class of 2023. You have fulfilled the mission of the College 🥹 #Harvard #HarvardCollege #CollegeTok #EduTok #LifeAtHarvard #CollegeLife #HarvardLife #HigherEducation #College #Graduation #CongratsGrads #Grads #Commencement #HarvardCommencement #372ndCommencement #ClassDay #DeanKhurana #Speech #Inspirational #fyp #Wisdom #Serendipity ♬ Piano pop sound inspired by graduation ceremony - 4.5Music @harvardadmissions Commencement Hustle. 👀 peep Jacinda Arden as the 2022 Commencement Speaker! #commencement #harvardgrad #harvard2022 #classof2022🎓 #harvardyard #newzealand #jacindaardern #fyp ♬ GOOD VIBES - Ellen Once Again @harvardadmissions 🎉 Congrats Harvard Class of 2023 #🎓 #graduation #commencement #tomhanks #harvardgrad #fyp ♬ original sound - Harvard Admissions Commencement Event Schedule Make the most of this momentous milestone and celebrate with pride. View Schedule Groups Student Stories Featured Stories What Happens After You Graduate? Author: Hannah Class of '23\n Alumni Reflections From A Graduated Senior Author: Perrin Class of '23\n Alumni Reflections as a Senior: My Favorite Moments Author: Mayowa Class of '23\n Alumni Read more student stories What is a \"liberal arts & sciences\" education? The liberal arts & sciences offer a broad intellectual foundation for the tools to think critically, reason analytically and write clearly. These proficiencies will prepare students to navigate the world’s most complex issues, and address future innovations with unforeseen challenges. Shaped by ideas encountered and created, these new modes of thinking will prepare students for leading meaningful lives, with conscientious global citizenship, to enhance the greater good. What is a \"liberal arts & sciences\" education? How many courses does Harvard offer? Harvard offers more than 3,700 courses. For a complete copy of the course catalog, please visit registrar.fas.harvard.edu . How many courses does Harvard offer? How large are classes? Some introductory courses as well as several other popular courses have large enrollments. Yet, the median class size at Harvard is 12. Of the nearly 1,300 courses offered last fall, for example, more than 1,000 of them enrolled 20 or fewer students. How large are classes? What is Harvard's graduation rate? The College's graduation rate is normally 98 percent, among the highest at American colleges and universities. Everyone admitted to Harvard has the ability to complete all academic requirements successfully. What is Harvard's graduation rate? Is on-campus housing guaranteed? Harvard guarantees housing for all four years. First-year students live in one of the 17 dormitories in or adjacent to historic Harvard Yard. Self-selected groups of students are assigned to one of 12 residential Houses for the final three years of undergraduate study. About 350 to 500 students live in a House, each of which includes its own dining hall, library, advising staff, and many other resources. Read more about residential life . Is on-campus housing guaranteed? Where will I take my meals? First-year students all eat together in Annenberg Hall. During sophomore through senior year, students typically eat in the dining hall located within their Houses, although students can choose to eat at other House dining halls as well. See more about dining . Where will I take my meals? A Better World Together Harvard is committed to creating an inclusive living and learning environment for every member of our community. Diversity & Inclusion Quick Links Current Students Resources Reapply for Financial Aid College Offices Advising Student Employment Research Funding Explore Events Study Abroad Student Stories Cambridge & Boston Prospective Students Explore Visit & Explore Why Harvard Academic Environment Virtual Tour Guide to Preparing for College All Guides & Resources for Prospective Students Apply What We Look For First-Year Applicants Application Requirements Apply for Financial Aid International Applicants View all resources Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification."
  },
  {
    "id": 8,
    "date": "2024-05-21T10:58:17.042405",
    "url": "https://internationaldataprivacy.harvard.edu",
    "university_name": "Harvard University",
    "title": "",
    "content": "Skip to content HARVARD.EDU Menu Toggle extended navigation Additional Privacy Disclosures under Non-US Law for Individuals Located Outside the United States Last Updated: September 15, 2023 Introduction These privacy disclosures (these “Disclosures”) provide information on collection and use of data about individuals located in a Relevant Country (as defined below). In these Disclosures, “ Personal Data ” means information relating to an identified or identifiable individual; an identifiable individual is one who can be identified, directly or indirectly, by use of any identifier or characteristic specific to that individual. “ Relevant Law ” means any non-U.S. jurisdiction’s personal data protection law that applies to the processing of Personal Data by a Harvard Entity. “ Relevant Country ” means a country which has enacted a Relevant Law. “ In-scope Processing ” means the collection, use, handling, processing or sharing of Personal Data by a Harvard Entity when those activities are within the scope of any Relevant Law. “ Harvard Entity ” means a Harvard University school, center, or other Harvard unit or Harvard-controlled entity. These Disclosures apply only to In-scope Processing.  Please note that, depending on the situation, some of the Harvard activities described below may in the given case not constitute In-scope Processing as that term is used in these Disclosures. Further, these Disclosures apply only to the Harvard Entities that link to these Disclosures or expressly adopt them in writing. In these Disclosures the words “we,” “us” or “our” refer to any such Harvard Entities.  In some cases, a Harvard Entity or other Harvard unit may provide other information about its In-scope Processing in its own supplemental or separate disclosures. These Disclosures concern In-scope Processing by any means, including hardcopy (such as paper applications or forms) and electronic means (such as websites and mobile applications). A. How We Collect and Use Personal Data We use the Personal Data that we collect to carry on various institutional and educational activities as described in more detail below. The ways in which we collect and use your data vary depending on the relationship between you and us.  The following sections of these Disclosures describe in more detail how and why we collect and use Personal Data in various circumstances that may involve In-scope Processing. 1. Personal Data We Collect Websites and Mobile Applications As is true of most digital platforms, we obtain certain data automatically when you use one of our websites or mobile applications, such as your IP address, browser type and device type.  Certain web-forms also collect Personal Data you provide, for example when you enter data into form fields.  If we also process data through our websites or mobile applications for one of the activities described further below, those descriptions will provide additional information about how those data are collected and used.  We and our third-party vendors use this Personal Data for the primary purposes of conducting analytics, improving our websites, responding to your requests and providing you with relevant information including program offerings that we believe may be of interest. Read More What Personal Data Do We Collect? We and our third-party vendors collect Personal Data through websites and mobile applications, often as a result of users volunteering their data. We and our third-party vendors may collect: Contact Information : for example, your name, home address, email address, phone number and social media usernames; Log Files : Information collected automatically when you are interacting with websites or mobile applications, for example, IP address, browser type, internet service provider, pages visited (including referring/exit pages), operating system, date/time stamp and/or clickstream data; Cookies and Similar Technologies : Information collected automatically through cookies and similar technologies. For more information regarding our use of cookies and similar technologies, see the “Cookies and Similar Technologies” section below; Location Information : We may use your IP address to identify the general geographic area from which you are accessing our website. Our mobile applications may collect more precise location information about you to provide functions identified in the application, such as a map feature; and Mobile Device Sensor Information : Some of our mobile applications may use various sensors and components of your mobile device (for example, your camera or microphone) to collect information for the purposes of providing you with additional functions and features. What is the Purpose of Processing? We process your Personal Data collected on our websites and mobile applications: To facilitate our online interactions with you, for example, by responding to your requests; To operate, maintain and improve our websites and mobile applications, for example, by conducting analytics to improve and manage our websites and mobile applications, analyze user trends, and create custom audience lists; To collect data about you and your activities online over time and across different websites and social media channels for marketing purposes, including delivering relevant marketing communications to you; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to facilitate transactions requested by you and meet our contractual obligations (for example, registering you for events); to pursue our legitimate interests (for example, website analytics); as necessary for compliance with a legal obligation; or on the basis of your consent, where applicable. Admissions and Financial Aid We collect and use various kinds of Personal Data when you apply for admission to a Harvard School or to a program or course offered by us, and when you apply for financial aid, if available. The primary source of these data is your voluntary submissions. We may solicit additional data, for example, from interviewers as part of the admissions process, if applicable, or from other available sources when we are looking for potential candidates for admission in connection with recruiting activities. The Personal Data collected by us, or on our behalf, during the admissions process are used for the primary purposes of considering your candidacy for admission to the relevant School, program or course, evaluating your eligibility for financial aid, if applicable, and, if you are admitted and enroll, facilitating your education (such as by sharing Personal Data with registrars and others in order to enable your enrollment and participation in the School, program or course to which you have been admitted). Read More What Personal Data Do We Collect? We collect Personal Data as part of our admissions process and financial aid process. We also collect Personal Data in connection with registration for open enrollment programs.  We and our third-party vendors (including, but not limited to, application and admissions/financial aid data base vendors such as the Common Application, the College Board, Technolutions, the Law School Admissions Council and the American Medical College Application Service) may collect: Contact Information : for example, your name, home address, email address and phone number; Demographic Information : for example, gender, age, and other information you may volunteer, such as in your application or essay; Education History : for example, your prior schools, transcripts, school activities and disciplinary records; Testing History : for example, standardized testing and corresponding identity verification documentation; Personal Information and History : for example, personal interests, extracurricular activities, recommendations, other personal information you may choose to volunteer, including in your application or your essay, and other information we may learn about your background; Health and Dietary Information : for example, immunization records, plus medical information or dietary preferences volunteered by you that may indicate a need for accommodations; Employment History : for example, job title, location and work experience; Personal Financial Information : for example, government identification number, personal and business tax reports, wage reports and statements, bank statements, socioeconomic status, scholarships and grants, and family support; Family Information : including family member names, ages, education information, occupations, wages and savings; Payment Information : depending on your means of payment, your payment card number or your bank and bank account number; and Log Files, Cookies, Location Information, and Mobile Device Sensor Information : When you use our websites or mobile applications, we also may collect additional information about you and your device as described in the “Websites and Mobile Applications” section above. What is the Purpose of Processing? We process your Personal Data as part of our admissions and financial aid processes: To consider your candidacy for admission and eligibility for financial aid; To respond to your requests and communicate admissions and financial aid decisions; To facilitate our operations relating to the admissions and financial aid process; To conduct research and analytics (for example, relating to application and admissions trends); To provide you with services related to the course or program, including assistance with travel, residential lodging and dietary or medical needs. To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to pursue our legitimate interests (for example, providing educational offerings and conducting admissions research); to process transactions requested by you and meet our contractual obligations (for example, to process your application for admission); as necessary for compliance with a legal obligation (for example, financial aid reporting); or on the basis of your consent, where applicable. How is My Personal Data Used if I Am Admitted? If you are admitted to a School or program or course offered by us, your Personal Data will be shared as necessary for registration and enrollment, including, as applicable, with the registrar of the school admitting you.  Your Personal Data may also be shared as necessary to deliver and administer your education and related activities with other persons or entities, including Harvard departments, faculty and staff, financial aid sources, and governmental authorities.  For example, your name and other contact information may be shared with a professor in whose course you enroll, in order to administer financial aid, with Harvard University Health Services to enable you to obtain treatment, or for other reasons consistent with our efforts to provide educational services to you. Alumni and Donors We collect and use various kinds of Personal Data about alumni, donors and prospective donors from a number of sources, including data you provide to us, for example, when you update your alumni or donor profile, connect with us on social media, complete a donation form or register to attend Harvard events.  If you were a student or studied at Harvard University, some of your Personal Data are transferred from your student record into our alumni databases.  We may also collect Personal Data from publicly available sources or third-party sources that support our operations.  The Personal Data collected by us, or on our behalf, are used for the primary purpose of providing you opportunities to engage with Harvard, alumni, donors, prospective donors and students through interactions, events and your gifts or donations.  We may disclose your data to other Harvard affiliated entities and individuals such as alumni clubs and shared interest groups or volunteers in connection with the purposes described below. Read More What Personal Data Do We Collect? We and our third-party vendors may collect: Contact Information : for example, your name, home address, email address, phone number and social media usernames; Demographic Information : for example, gender, age, and other information you may volunteer; Personal Information and History : for example, personal interests, charitable activities, other personal information you may choose to volunteer and other information we may learn about your background; Education History : for example, prior and subsequent schools, awards, honors and student activities; Employment Information : for example, your title, employer, location and work experience; Harvard Affiliations : for example, your social network, group memberships and Harvard-related correspondence; Financial Information : for example, your contribution history, publicly available data on wealth and assets, and contributions to other organizations; Payment Information : for example, when you register for an event, make a donation or request a service, depending on your means of payment, your payment card number or your bank and bank account number, and government identification number where legally required; Contribution History : your contribution history to Harvard; Health and Dietary Information : for example, medical information or dietary preferences volunteered by you that may indicate a need for accommodations; Your Image : for example, when a photograph or other image is used in online networking or announcements, or when you participate in Harvard events that are recorded by photography or video; Family Information : for example, family member names, ages, occupations and relevant medical information (if volunteered in advance of events); and Log Files, Cookies, Location Information, and Mobile Device Sensor Information : When you use our websites or mobile applications, we also may collect additional information about you and your device as described in the “Websites and Mobile Applications” section above. What is the Purpose of Processing? We process your Personal Data as part of our alumni and donor outreach and services: To provide you and your family opportunities to engage with Harvard, alumni and students; To facilitate alumni and donor communications, events, fundraising (including identifying prospects) and operations; To request and process your contributions and subscriptions; To communicate with you about other opportunities for giving, and to understand better your interests and how you might help support Harvard through volunteerism and philanthropy; To improve our alumni and donor services, analyze engagement and contribution trends, and create custom experiences; To provide you with services, including assistance with travel, residential lodging and dietary or medical needs; To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to pursue our legitimate interests (for example, requesting gifts or donations); to process transactions requested by you and meet our contractual obligations (for example, registration for events or processing of donations); as necessary for compliance with a legal obligation (for example, to provide required tax information); or on the basis of your consent, where applicable. Online Education We collect your Personal Data when you apply or register for online education offerings. We and they also collect Personal Data when you participate in online courses, programs and activities.  In some cases, our collection of Personal Data from you in connection with online education activities takes place as part of a “hybrid” program in which you also may participate in person, or as part of remote learning occurring in a course or program that is ordinarily conducted in person. The Personal Data collected by us, or on our behalf, are used for the primary purposes of providing you with online education, and, if applicable, evaluating your qualification for related certificates or credit. Read More What Personal Data Do We Collect? We and our third-party vendors may collect: Contact Information : for example, your name, home address, email address and phone number; Payment Information : depending on your means of payment, your payment card number or your bank and bank account number, and government identification number where legally required; Demographic Information : for example, gender, age and date of birth; Personal Information and History : for example, personal interests, other information about yourself that you volunteer in profiles or otherwise on the online learning platform, and other information we may learn about your background; Education Information : for example, schools, transcripts, awards and honors; Employment Information : for example, your title and employer, history and work experience; Health and Dietary Information : for example, medical information or dietary preferences volunteered by you that may indicate a need for accommodations; Learner Interaction and Participation Data : for example, exchanges with other learners, forum contributions, community posts, and your participation in class sessions or other online events that are transmitted or recorded in audio and/or visual form; Course Engagement and Assessment Data : for example, assignment responses, test scores and course interactions (such as the ways in which you move through and interact with the course materials); Log Files : for example, IP address, browser type, internet service provider, pages visited (including referring/exit pages), operating system, date/time stamp and/or clickstream data; Cookies and Similar Technologies : information collected automatically through cookies and similar technologies when you are interacting with our online education offerings. For more information regarding our use of cookies and similar technologies, see the “Cookies and Similar Technologies” section; Location Information : for example, latitude, longitude, date and time (the precision of these data varies greatly and is determined by factors controlled by your device or mobile service provider); Mobile Device Sensor Information : some of our mobile applications may use various sensors and components of your mobile device (for example, your camera or microphone) to collect information for the purposes of providing you with additional functions and features; and Your Image : for example, where you voluntarily provide a photograph or other image for use in an online course or program (for example, in a profile), or where you have decided to use a remote proctoring third-party service software (such as Proctorio) for the purposes of remotely completing an examination or assessment for a Harvard Entity offering remote proctoring services, or where you appear in a video transmission or recording. What is the Purpose of Processing? We process your Personal Data for online education: To provide and administer the course, program or activity in which you are participating, including evaluating your success in and engagement with the online education offering; To respond to your requests and communicate with you regarding current or future courses, programs or activities; To provide you with services related to the course, program or activity, including assistance with travel, residential lodging and dietary or medical needs; To conduct research (for example, in the areas of education and cognitive science) and analytics related to our online education offerings; To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to pursue our legitimate interests (for example, providing educational offerings and evaluating your performance); to process transactions requested by you and meet our contractual obligations (for example, registering you for an online education course); as necessary for compliance with a legal obligation; or on the basis of your consent, where applicable. In-Person or Hybrid Educational Programs Conducted in Relevant Countries We conduct certain educational programs in Relevant Countries, including executive education offerings and summer school programs, among others, and collect Personal Data as part of our administration of these offerings. The Personal Data collected by us, or on our behalf, are used for the primary purposes of providing educational offerings and, if applicable, evaluating qualification for certificates and credit. Read More What Personal Data Do We Collect? We and our third-party vendors may collect : Contact Information : for example, your name, home address, email address and phone number; Payment Information : depending on your means of payment, your payment card number or your bank and bank account number, and government identification number where legally required; Demographic Information : for example, gender, age and date of birth; Personal Information and History : for example, personal interests, profession and other information about your background; Education Information : for example, your schools, transcripts, school activities and disciplinary records, awards and honors; Employment Information : for example, your title and employer, employment history and work experience; Health and Dietary Information : for example, medical information or dietary preferences volunteered by you that may indicate a need for accommodations; Course Assessment Data : for example, assignment responses, test scores and course evaluations; Learner Participation Data : for example, your participation in class sessions or other online events that are transmitted or recorded in audio and/or visual form; Residential Information : for example, local host information and personal preferences that you volunteer; Your Image : for example, for inclusion in a class roster to be distributed to classmates and faculty, where applicable; and Log Files, Cookies, Location Information, and Mobile Device Sensor Information : When you use our websites or mobile applications, we also may collect additional information about you and your device as described in the “Websites and Mobile Applications” section above. What is the Purpose of Processing? We process Personal Data relating to in-person or hybrid educational programs in Relevant Countries: To provide and administer the course or program in which you are participating, including sharing information about you with other participants, providing academic guidance and evaluating your success in the course or eligibility for a degree or certificate; To provide you with services related to the course or program, including assistance with travel, residential lodging and dietary or medical needs. To respond to your requests and communicate with you regarding current or future courses or programs; To conduct analytics to improve our educational offerings; To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to pursue our legitimate interests (for example, conducting analytics to improve program offerings); to process transactions requested by you and meet our contractual obligations (for example, providing educational programs); as necessary for compliance with a legal obligation; or on the basis of your consent, where applicable. Research Our researchers, research collaborators and service providers may collect, use and share your Personal Data as part of a research study in which you have agreed to participate as a research subject, or in which your existing data are used.  Most often, before any Personal Data are collected for research purposes, as a research subject you will be provided a consent and/or authorization form relating to the specific research project that explains the types of data collected and the purposes for which such data will be processed and shared.  In such a case, the description of the collection and use of your Personal Data provided in the consent and/or authorization form will replace the information provided here.  The Personal Data collected by our researchers, research collaborators and service providers, or on their behalf, are used for the primary purposes of furthering the particular research project and more generally for supporting research and understanding in fields of academic study. Examples of Personal Data that may be collected for research purposes are listed below.  Of course, a single research study will rarely collect all of these types of data.  If you have questions about the processing of your data in connection with a research study, you should contact the Harvard personnel who are conducting the research or the contact persons named in any consent form you signed when you joined the study. Read More What Personal Data Do We Collect? Examples of Personal Data that we and our third-party collaborators or service providers may collect for research purposes include the following.  Please note that in most cases these data, if identifiable, would initially be provided voluntarily by you: Contact Information : for example, your name, home address, email address and phone number; Payment Information : your bank and bank account number, and government identification number where legally required, for processing compensation if you are being paid in connection with the research; Demographic Information : for example, race, ethnicity, gender, age, education, profession, occupation, income level and marital status, photo or other image; Personal Information and History : for example, personal interests, profession, and other information about your background; Family Information : for example, family members, ages, occupations and health; Employment History : for example, employers, titles, wages, work experience, trade union membership and disciplinary record; Education History : for example, schools, transcripts, awards, honors and disciplinary records; Health and Dietary Information : for example, doctor’s records, surgical records, immunizations and medications, allergies and dietary preferences; Biometric Data : for example, facial measurements, finger prints and retinal scans; Genetic Data : for example, genetic information obtained from your biological samples; Course Engagement and Assessment Data : for example, assignment responses, test scores and course interactions (including, for example, the ways in which you move through and interact with the course materials); Log Files : for example, IP address, browser type, internet service provider, pages visited (including referring/exit pages), operating system, date/time stamp and/or clickstream data; Cookies and Similar Technologies : Information collected automatically through cookies and similar technologies. For more information regarding our use of cookies and similar technologies, see the “Cookies and Similar Technologies” section; and Location Information : for example, latitude, longitude, date and time (the precision of these data varies greatly and is determined by factors controlled by your device or mobile service provider); and Mobile Device Sensor Information : for example, health-related information that may be available through an application using a sensor or component of your mobile device. If you are a researcher, research collaborator or service provider, we may collect your contact, payment, employment and education information to administer the study, manage our relationship and compensate you for your work. What is the Purpose of Processing? We may process your Personal Data for research in accordance with the purposes of the particular research projects, and also: To further research and understanding in fields of academic study; To enroll you in a particular research study as a research subject; To administer the study; To make reports to project funders and other project participants; To satisfy legal compliance requirements; or To make required reports to tax authorities on payments to research subjects, researchers and service providers. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance:  to pursue our legitimate interests (for example, conducting research); to process transactions requested by you and meet our contractual obligations (e.g., paying faculty, employees, research collaborators and research subjects); as necessary for compliance with a legal obligation (for example, to report adverse events to regulatory authorities like the U.S. Food & Drug Administration that oversee the safety of medical products and research); as necessary for the performance of tasks we carry out in the public interest (for example, to further research and understanding in fields of academic study); where processing is necessary for scientific or historical research purposes and performed consistent with required data protection safeguards; or on the basis of your consent, where applicable. Employees, Job Applicants and Service Providers We collect your Personal Data when you apply to work for us in a Relevant Country.  Further Personal Data collection occurs at hiring and throughout your relationship with us. We may also collect Personal Data about personnel of vendors providing services to us in a Relevant Country. The Personal Data collected by us, or on our behalf, are used for the primary purposes of providing employment, engaging with service providers, legal compliance, and enabling employees and service providers to utilize our services and facilities. Read More What Personal Data Do We Collect? We and our third-party vendors may collect: Contact Information : for example, your name, home address, email address and phone number; Payment Information : your bank and bank account number for processing your compensation; Tax Information : for example, government identification number, wages and filing status; Personal Information and History : for example, marital status and other information about your background, and when relevant for your position or required by law, credit history, driving record, self-reported and publicly available criminal records, citizenship and work authorization status; Employment and Work History : for example, prior employers, titles, wages, work experience and disciplinary record; Education Information : for example, schools, transcripts, awards, honors and disciplinary records; Family Information : for inclusion in benefits plans; Demographic Information : for example, gender, age and date of birth; Health Information : for example, medical information volunteered by you that may indicate a need for accommodations; Your Image : for example, when a photograph or other image is used for Harvard identification cards or in announcements; and Log Files, Cookies, Location Information, and Mobile Device Sensor Information : When you use our websites or mobile applications, we also may collect additional information about you and your device as described in the “Websites and Mobile Applications” section above. What is the Purpose of Processing? We process your Personal Data for employment or other work relationship and job application purposes: To evaluate your application for employment or other work relationship and communicate hiring decisions; To engage with service providers; To administer and facilitate workforce-related processes and operations, including compensation processing and the provision of employee benefits; To provide you with support services, including assistance with travel and dietary or medical needs; To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance:  to pursue our legitimate interests (for example, managing internal administrative tasks); to process transactions requested by you and meet our contractual obligations (for example, managing employment or other work relationships); as necessary for compliance with a legal obligation (for example, to provide required information to tax authorities); or on the basis of your consent, where applicable. 2. Personal Data We Obtain from Third Party Sources As part of our In-scope Processing, we may obtain certain Personal Data about you from third party sources, which we may use for the purposes and in the ways described in “How We Collect and Use Personal Data” above and in “Additional Uses of Personal Data” below.  In some cases, we may obtain your consent for additional uses. Partners and Service Providers We use partners and service providers, such as admissions application facilitators (for example, the Common Application and the College Board), payment processors (for example, CyberSource and UPay TouchNet), analytics providers (for example, Google and Qualtrics), and platform providers (for example, Salesforce and Instructure/Canvas) to provide services for us.  Some of these partners have access to Personal Data about you that we may not otherwise have (for example, when you sign up directly with that provider) and may share some or all these data with us. Single Sign-On Some of our online offerings or research activities may allow you to register and login through a third-party platform.  When you login to our offering or activity through a third-party platform, you allow us to access and collect any Personal Data from your third-party platform account permitted under the settings and privacy statement of that platform. Supplemental Personal Data We may receive Personal Data from third-party sources, such as public or private databases (for example, compilations of email or postal addresses) and publications (for example, news reports), or companies or institutions that may sponsor or facilitate your participation in one of our programs, which we may also add to existing Personal Data. 3. Additional Uses of Personal Data In addition to the uses described above, including under “How We Collect and Use Information” and “Personal Data We Obtain from Third Party Sources,” we may use your Personal Data for the following purposes.  These additional uses may under certain circumstances be based on your consent, or may be necessary to fulfill our contractual commitments to you, for legal compliance, or to pursue our legitimate interest in the following activities: Conducting our operations and administering and developing our educational offerings; Administering fellowships, grants and other programs in support of individual study and research projects; Responding to your requests for research assistance; Processing and responding to your requests or inquiries of any other kind; Providing you with newsletters, articles, service alerts or announcements, event invitations, volunteer opportunities, and other information that we believe may be of interest to you; Requesting gifts and donations; At your request, processing and fulfilling transactions for merchandise or other Harvard products; Providing travel-related services to you at your request; Alerting you about a safety or security announcement; Conducting research, surveys and similar inquiries to help us understand trends and needs of our applicants, students and others; Meeting the requirements of our accreditors; Disclosing directory information as described here ; Performing marketing, promotions and advertising, either directly or through third-parties.  These activities may include interest-based advertising, targeted advertising and online behavioral advertising in order to increase the likelihood that the content will be of interest to you; Ensuring the rights, safety and security of our students, faculty, fellows, employees and others; Preventing, investigating, taking action regarding or providing notice of fraud, unlawful or criminal activity, other misconduct, security or technical issues, or unauthorized access to or use of Personal Data, our website or data systems; or Responding to subpoenas, court orders, or other legal process; fulfilling and enforcing our agreements and legal rights; protecting the health, safety, rights or property of you, us or others; and meeting legal obligations. 4. Data Retention We will retain your Personal Data for as long as is necessary for the purposes set out in these Disclosures, in accordance with Relevant Law and the legal bases for acquiring the data. For example, we may generally retain Personal Data as follows: For as long as may be required under applicable law; As needed to resolve disputes or protect our legal rights; Where processing is based on your consent, for the period of time necessary to carry out the processing activities to which you consented; Where processing is based on contract, for the duration of the contract plus some additional limited period of time that is necessary to comply with law or that represents the statute of limitations for legal claims that could arise from the contractual relationship; Where processing is based on the public interest, for the period of time that continues to serve that underlying interest. Where processing is based on our legitimate interests, for a reasonable period of time based on the particular interest, taking into account the fundamental interests and the rights and freedoms of the data subjects.  In some cases, where Personal Data was primarily processed and retained on the basis of consent, contract, the public interest, or other bases described in these Disclosures, we may continue thereafter to retain the data based on a legitimate interest. Consistent with the foregoing guidance, some data may be retained indefinitely. B. How We Share and Disclose Personal Data We share your Personal Data with third parties in the ways described in these Disclosures, including the “How We Collect and Use Personal Data” section above, as well as between Harvard Entities.  Additionally, we may share information as described below: Service Providers We share your Personal Data with third-party service providers that complete transactions or perform services on our behalf or for your benefit, such as: Payment and contribution processing; Customer relationship management services; Marketing and analytics; Processing admissions applications and applications for financial aid; Alumni and donor outreach and engagement; Event registration and coordination; Providing course platforms or tools that enable or enhance our offerings; Course registration and administration; Course evaluations and assessments; Enrollment verification; Research insights and analytics; Research collaboration; Educational operations and collaborations; Performing workforce administration and operations; System maintenance and security; Facilitating other transactions with you; and Assisting with our legal compliance. Partners We may share your Personal Data with other institutions for the purposes of delivering programs and services, such as: Cross-registration for courses and events with other universities; Course registration and administration; Course evaluations and assessments; Study at other universities including study abroad at foreign universities; Online education offerings through online platforms; Research arrangements with other universities or partners; and Events and activities of Harvard-affiliated clubs and shared interest groups. Third-Party Mobile App Providers If you use certain of our mobile applications, your mobile device may gather and transfer your Personal Data, including location information, to other applications, functions and tools within your mobile device. Social Media Platforms We may also use services provided by third parties (such as social media platforms) to serve targeted ads or sponsored content on third-party platforms. Legal Process, Safety and Terms Enforcement We may disclose your Personal Data to legal or government regulatory authorities as required by law.  We may also disclose your Personal Data to third parties in connection with claims, disputes or litigation, when otherwise required by law, or if we determine that disclosure is necessary to protect the health, safety, rights or property of you, us or others, or to enforce our legal rights or contractual commitments that you have made. C. International Data Transfers Much of our Personal Data processing takes place in the United States, though sometimes we or third parties with whom we share data may process data in other countries.  The data protection laws in the United States and other countries may provide less protection than such laws in your Relevant Country.  In the event we transfer your Personal Data outside your Relevant Country as part of our In-scope Processing, we rely where required on appropriate or suitable safeguards or specific legal provisions permitting such transfers under the Relevant Law. When transferring Personal Data from a country in the European Economic Area (EEA) or from the United Kingdom (UK) to a country outside the EEA and the UK, we may base such transfers on contracts containing legally authorized data protection clauses referred to as Standard Contractual Clauses.  You may request a copy of the Standard Contractual Clauses relevant to any such transfer of your Personal Data by contacting us as set forth in the “ Contact Us ” section below. D. Cookies and Similar Technologies Whenever you visit or use our websites or online services, we may deploy cookies and related technologies (“Cookies”) to collect certain personal information about you. We use the information in order to enhance and personalize the experience, to help provide our services, to analyze website and service usage, and to help improve the websites and our related services. To find out more about cookies, visit https://www.internetcookies.org/. Third parties may also use Cookies embedded in our sites to collect information about your online activities over time and across different websites you visit. This information may be used by third parties to provide advertising tailored to your interests on other websites, apps and services you visit. You can review your Internet browser settings, typically under the sections “Help” or “Internet Options,” to exercise choices you have for certain Cookies, or you can opt out of the collection and use of some Cookies through tools like the Network Advertising Initiative opt-out page. If you disable or delete certain Cookies in your settings, you may not be able to use features of our websites. We may use third party analytics such as Google Analytics or similar analytics services. For information on how Google processes and collects information using Google Analytics, please see www.google.com/policies/privacy/partners/, and for how to opt out, please see https://tools.google.com/dlpage/gaoptout. The opt-outs described above may not work for all browsers or devices. If you have any questions regarding our use of cookies and other similar technologies, please contact us as set forth in the “Contact Us” section below. E. Rights You May Have To the extent required by Relevant Law, upon your reasonable and good faith request, we will inform you whether we hold any of your Personal Data as part of our In-scope Processing.  With respect to your Personal Data collected and used in our In-scope Processing, under the Relevant Law you may also be able to: obtain a copy of your Personal Data in an easily accessible format; request that we correct or update any of your Personal Data that is inaccurate; restrict or limit the ways in which we use your Personal Data; object to the processing of your Personal Data; request the deletion of your Personal Data; and request that we transmit your Personal Data to another party. To submit a request, please complete the Non-US Data Subjects Rights Request Form .  Because we want to avoid taking action regarding your Personal Data at the direction of someone other than you, we may need to ask you for information verifying your identity.  We will respond to your request within a reasonable timeframe. If our In-scope Processing as to your Personal Data is solely based on your consent, in certain cases you may also have the right under a Relevant Law to withdraw your consent to our processing.  If you withdraw your consent to the use or sharing of your Personal Data for the purposes set out in these Disclosures, or otherwise limit our use of your Personal Data or request its deletion, we may no longer be able to provide you some or all of the related services. Please note that, in certain cases, we may continue to process your Personal Data after you have withdrawn consent or requested that we delete your Personal Data, if we have a legal basis to do so.  For example, we may need to retain certain data to comply with an independent legal obligation, for achieving the lawful purposes for which we obtained the data, or for such reasons as keeping our services and operations safe and secure or safeguarding our rights or the rights or safety of others. If you have any complaints regarding our privacy practices, you may be able to make a complaint to your national data protection authority, supervisory authority, or other legal authority. F. User Generated Content Some of our online activities, such as course websites, listservs, chat rooms and bulletin boards, enable users to submit their own content.  Please remember that any Personal Data you submit or post as user-generated content in these circumstances could in some cases be seen by others or become public.  You should exercise caution when deciding to disclose your personal, financial or other information in such submissions or posts.  We cannot prevent others from using that information in a manner that may violate these Disclosures, the law or your personal privacy and safety.  We are not responsible for the results of such postings. G. Updates to the Disclosures We may update these Disclosures from time to time without prior notice by posting revised Disclosures.  You can determine when these Disclosures were last revised by checking the Last Updated date at the beginning of these Disclosures. H. Representatives Representatives in the European Union : Name:   Harvard Global Research Support Centre Ireland DAC Online: GDPR Representative Form Address:  Harvard Global Research Support Centre Ireland DAC Attention: GDPR Representative 10 Earlsfort Terrace Dublin 2 D02 T380 Ireland Representative in the UK : Harvard Global UK Online: GDPR Representative Form Address:  Harvard Global UK Attention: GDPR Representative 71 Queen Victoria Street London, United Kingdom EC4V 4BE I. Contact Us If you have any questions, comments, requests or concerns about these Disclosures or other privacy-related matters, you may contact us in the following ways: Online: GDPR Representative Form Address:  Harvard University Attention: International Privacy Disclosures Coordinator Suite 370 1033 Massachusetts Avenue Cambridge, MA 02138 USA Harvard University Massachusetts Hall Cambridge, MA 02138 Copyright © 2024 The President and Fellows of Harvard College | Accessibility | Digital Accessibility | Report Copyright Infringement Log In close menu close search Search Search Site"
  },
  {
    "id": 8,
    "date": "2024-05-21T10:58:32.095544",
    "url": "https://registrar.fas.harvard.edu/student-information-privacy",
    "university_name": "Harvard University",
    "title": "Student Records and Privacy",
    "content": "Skip to main content Main Menu Utility Menu Search HARVARD.EDU GA4 Tracking Code - DO NOT REMOVE FAS Registration Forms Handbooks Reports Courses my.harvard Help Search Bar Calendars Learning Tuition and Fees Academic Programs Check-In Enrollment Cross-Registration Take Exams Records Student Records and Privacy Transcripts Degree/Enrollment Verification Placement and Standardized Exam Scores Data/Reporting Services Graduation Apply to Graduate Submit Your Dissertation Diplomas Honors Commencement Teaching Create Courses Sectioning Grading Administer Exams Academic Advising Report (AAR) Training and Documentation Spaces For Courses For Sections/Events For Student Organizations HOME / RECORDS / Student Records and Privacy What's on this page? About your student record Update your personal information Access your student record Family Educational Rights and Privacy Act (FERPA) Education records Directory information FERPA blocks Other disclosures permitted under FERPA Related forms Who is this for? Everyone About your student record All students have access to their own education records. You may contribute to your student record if you feel there is need for clarification. To be useful, your student record must be accurate and complete. The officials who maintain your student record are in charge of the functions reflected in the records and the offices where the records are kept. In FAS these officials include: FAS Registrar's Office Officers of the Graduate School of Arts and Sciences, Harvard College, and Faculty of Arts and Sciences Update your personal information The my.harvard student information system contains directory information for each student such as your: Name Address Phone number Email Emergency contact Missing person contact You can update this information at any time via my.harvard via the Personal Information tab. We highly recommend reviewing your personal information every 3 months. Learn how to update your personal information Access your student record In-person requests: Due to COVID-19, we will not accept in-person student record requests until further notice. If you would like to view your student record ( education records ), complete the appropriate step below based on your school or alumni status. You must indicate which records you would like to view in order for your form to be processed. Harvard College students Complete the Undergraduate Student Record Request form Send your completed form to fileviewing@fas.harvard.edu from your Harvard-issued (@college.harvard.edu) email address Once we receive your request, we will gather the appropriate records and give you access within 45 days of receiving your request GSAS students For access to your GSAS student record, please contact GSAS Student Affairs at studaff@fas.harvard.edu Alumni Complete the Alumni Student Record Request form Send your completed form to fileviewing@fas.harvard.edu from an email address on file with Harvard Alumni Affairs Once we receive your request, we will gather the appropriate records and give you access within 45 days of receiving your request Guidelines for viewing your student record When a record contains information about more than one student, the student requesting access may inspect and review only the portion of the record relating to them. You are not permitted to view letters and statements of recommendation to which you waived your right of access, or that were placed in your file before January 1, 1975. You should direct any questions you have about the accuracy of your education records to the person in charge of the office that maintains the records. If you still have questions, please contact the Associate Registrar for Operations, at registrar@fas.harvard.edu . If you are unable to resolve issues through informal communications, you may need to resolve challenges concerning the accuracy of records during a hearing. Family Educational Rights and Privacy Act (FERPA) The Family Educational Rights and Privacy Act of 1974, as amended (FERPA) is a federal law that gives students certain rights with respect to their education records. Note: As an institutional policy Harvard FAS does not offer a FERPA waiver form or parental release form for access to student information. Education Records We routinely maintain records that describe and document your work and progress as a student in the Faculty of Arts and Sciences. Your education records generally include information such as: Permanent and local addresses Admissions records Enrollment status Course grades Reports and evaluations Completion of requirements and progress toward the degree Records of disciplinary actions Letters of recommendation Directory Information Directory information is information that under FERPA can be made available to the general public. Faculty of Arts and Sciences Directory Information All FAS students have the following directory information in their record: Full name Reported date of birth Dates of attendance Concentration Class year Digitized image (please note that while Harvard classifies photos and images as directory information, these are rarely released to parties outside the University without your permission) Local or campus residence address and telephone number University email address Secondary school (for College students) Undergraduate college (for GSAS students) Hometown or city at the time you applied for admission Original class at time of matriculation Degree candidate status Date of graduation (actual or expected) Degree(s) received with field of concentration and level of honors granted (if any) Department of study University prizes, fellowships, and similar honors awarded In certain cases, your and your parents' or guardians' home addresses and telephone numbers Harvard College students may have additional directory information in their record including: House affiliation Height and weight (members of athletic teams only) Student employees, in certain circumstances, may have additional directory information in their record including: Job title Teaching appointment (if applicable) Employing department and dates of employment Harvard University Directory Information Please note that Harvard University's definition of directory information may include additional components and that University-level directory information requests may therefore include additional pieces of information. FERPA blocks You may prevent FAS from disclosing your directory information—this is called a FERPA block. If you would like to enable a FERPA block, you must inform the FAS Registrar's Office, ordinarily in person ( view business hours ). Possible consequences of enabling a FERPA block include: Missed mailings, messages, and announcements Not being able to verify your enrollment or degree status Not being included in the Harvard Commencement program If you have previously chosen to enable a FERPA block, you can reverse your decision by emailing the Registrar's Office at registrar@fas.harvard.edu . Other disclosures permitted under FERPA In addition to permitting the disclosure of directory information , FERPA allows FAS to disclose education records without your knowledge or consent under certain circumstances. For example, disclosure is permitted to Harvard officials with a legitimate educational interest in the records. This means that the person needs your information in order to fulfill their professional responsibilities including: including instructional, supervisory, advisory, administrative, academic or research, staff support or other duties. Harvard officials include: Faculty Administrators Clerical employees Professional employees Harvard University Health Services staff members Harvard University Police Department officers Agents of the University, such as independent contractors or vendors performing functions on behalf of FAS or the University Members of Harvard's governing boards Students serving on an official FAS, College, GSAS or University committee, or assisting other Harvard officials in performing their tasks Your education record also may be shared with parties outside the University under certain conditions, including, for example, in situations involving a health and safety emergency. Additionally, the FAS Registrar's Office will forward your education records to other agencies or institutions that have requested your records and in which the student seeks or intends to enroll or is already enrolled so long as the disclosure is for purposes related to your enrollment or a transfer to another institution. If either Harvard College or the Graduate School of Arts and Sciences finds that you have committed a disciplinary violation involving a crime of violence or a non-forcible sex offense, then FAS also may, if legally permitted and appropriate in the judgment of Harvard College or the Graduate School of Arts and Sciences, disclose certain information about the disciplinary case. The disclosure may include: Your name Violation committed Sanction imposed Student rights under FERPA Under both Harvard policy and FERPA, as a student or former student you may inspect and review certain components of your education records maintained by Harvard. You may: Exercise limited control over other people's access to your education records Seek to correct your education records if you believe them to be inaccurate, misleading or otherwise in violation of your FERPA rights File a complaint with the U.S. Department of Education if you believe Harvard has not complied with the requirements of FERPA Be fully informed of your rights under FERPA Complaints regarding alleged violation of rights of students under FERPA may be submitted in writing within 180 days to the Family Policy Compliance Office, US Department of Education, 400 Maryland Avenue, S.W., Washington, DC 20202-5920. Related Forms Student Withdrawal Form Withdraw from Harvard Griffin GSAS Record Request Form – Current Students Request to view your student file. (Harvard Griffin GSAS students should contact the Harvard Griffin GSAS Office of Student Affairs.) Cancellation of Non-Resident Status All student record forms Need Assistance? Student Data and Privacy Support Email : registrar@fas.harvard.edu with student record or FERPA questions Email : fileviewing@fas.harvard.edu to submit your Student Record Request Form Resources U.S. Department of Education – About FERPA Current student Record Request Form (PDF) Records Student Records and Privacy Transcripts Degree/Enrollment Verification Placement and Standardized Exam Scores Data/Reporting Services Website Problem Tab Report Website Problem Faculty of Arts and Sciences Registrar's Office Smith Campus Center 1350 Massachusetts Avenue, Suite 450 Cambridge, MA 02138 Tel: 617-495-1543 Fax: 617-495-0815 Virtual office hours 10:00am-12:00pm ET, on Mondays, Tuesdays, Thursdays, and Fridays About the FAS Registrar's Office Who We Are Contact Us Message Center Academic Calendars Handbooks Forms Reports People Information For Alumni Instructors Staff Students Find your Registrar's Office If you are not enrolled or teaching in the Faculty of Arts and Sciences, please contact the Registrar's Office for your school. Access list of Harvard Registrars JavaScript CSS Styles Admin Login Copyright © 2024 The President and Fellows of Harvard College | Privacy | Accessibility | Digital Accessibility | Report Copyright Infringement"
  }
]