{
  "id": 10,
  "date": "2024-05-20T13:15:28.240733",
  "url": "https://mba.wharton.upenn.edu/admissions-faqs/",
  "university_name": "University of Pensylvania",
  "title": "Wharton MBA Admissions FAQs",
  "content": "Skip to content Skip to main menu Faculty Youth Program Undergrad MBA EMBA PhD Exec Ed Wharton Online Alumni Search Wharton Mobile menu toggle MBA Program Menu Facts & Figures Class Profile The Value of a Wharton MBA MBA or EMBA? Academics Program Details Curriculum Majors Interdisciplinary Programs MBA/MA Lauder Joint Degree in International Studies Program Francis J. & Wm. Polk Carey JD/MBA Program MBA in Healthcare Management Major Wharton/Engineering Dual Degree Program International Study Opportunities Leadership Ventures & Experiential Learning Faculty Student Life Extracurricular Activities Diversity at Wharton Nontraditional Students Living in Philly Careers & Network Career Services Alumni and Network MBA Stories Applying Start or Continue an Application Application Timeline and Deadlines Application Requirements Interview Process Deferred Admission Moelis Advance Access Program Visiting Wharton Attend an Event Recorded Webinars Connect with an Admissions Fellow Admissions FAQs Admissions Blog Financing Events All Events Alumni-led Events Application Tips Events Campus Visits Diversity Events Information Sessions JD/MBA Events Lauder MBA/MA Events Moelis Advance Access Events Contact Us Applying » Admissions FAQs Frequently Asked Questions Wharton MBA Admissions FAQs The following are the most Frequently Asked Questions (FAQs) we receive from prospective students interested in the Wharton MBA Program. In addition, the MBA Admissions Blog has the latest news from Admissions and Financial Aid. If you’re unable to find an answer to your MBA program questions, please contact us to ask your question directly to an MBA admissions team member. Visiting & Getting in Touch with the Wharton MBA Program What can I do when I visit campus? You can take a campus tour, sit in on a live class, and attend a student panel. These activities are not available May through September when classes are not in session. For more information, explore the Visit Campus page. How can I contact Wharton alumni in my area? Alumni often attend our admissions information sessions and receptions all over the world. To find an event close to you, please check the Admissions Events page . As an international prospective student, I need a visa to come to the U.S. for a campus visit. Will Wharton or the University of Pennsylvania sponsor me or provide a letter of support that I may use when I apply for a visa? The university is unable to sponsor individual visits to the campus. The Office of International Programs , which handles visa and immigration issues at the university, may only support students who have been admitted to and intend to enroll at the school. For more information & resources for international applicants, please refer to our International MBA Students page . MBA Admissions Process and Requirements Do I need to hire an admissions consultant to get into Wharton? Hiring a paid admissions consultant isn’t necessary to gain admission to the Wharton MBA program. Our goal is to have a transparent evaluation process, as we believe in providing each applicant with an equal opportunity for success. While we certainly encourage you to have a trusted family member or peer review the written portion of your application for clarity and accuracy, we do not believe that professional services are needed.  If you have questions during the application process, we recommend seeking guidance through our website and visit opportunities . When should I apply, and when is the application deadline? Wharton offers three rounds of admissions. To determine which is the best round for you, please visit the Application Deadlines page. We encourage all applicants to apply in the year preceding their start at Wharton. Our general policy is not to grant deferrals. All requests will be handled on a case-by-case basis. What are the minimum requirements to apply to the Wharton MBA program? The minimum requirements to apply to the MBA program include: Completion of an undergraduate program in an accredited U.S. college or its equivalent in another country. Results of the Graduate Management Admissions Test (GMAT) or the Graduate Record Examination (GRE). Submission of the Wharton application. Results of an English Language Test (TOEFL, PTE, or IELTS) unless you have earned an undergraduate or Master’s degree in an English-speaking country or from an institution in which English is the language of instruction. To waive an English language test, you must include a letter requesting the waiver in your application AND documentation that your education was in English. For more information on the application process, go to the Admissions Requirements page. I already have an MBA. Can I apply to the Wharton program? Yes. We do not exclude candidates who have an MBA or any other graduate degree. You should, however, fully explain your reasons for pursuing a second MBA in your application. I earned an undergraduate degree that only took three years. Am I eligible to apply to the Wharton MBA Program? Several universities around the world offer three year undergraduate programs. If you have received a Bachelor’s degree upon completion of such a program, you are eligible to apply to the Wharton MBA program. How many applications do you receive each year for the MBA program? We typically receive 6,000 to 7,000 applications in a given year. Approximately 75% to 80% of all applicants are qualified for admission. Of these, we generally admit about 1,000 candidates for a class of about 840 students. Check out more facts & figures from our most recently admitted class on the Class Profile page . Do I need an interview, and if so, how can I arrange one? We interview by invitation only. After we review the completed application, we select candidates for interviews. No candidate is admitted without an interview. Read more about the details and how to prepare for our Team-Based Discussion interview format . Can I get my decision over the Web or by e-mail, telephone, or fax? All applicants receive their decision letter over the Web via their online account. We do not release decisions over the telephone or via e-mail or fax. If admitted, you will receive additional information, along with a hard copy of your admissions letter, via regular mail. Start and manage your application status on the Wharton MBA Application Portal . How long does it typically take for an applicant to receive a decision after he/she has submitted his/her application? After your application is submitted to the Wharton MBA program you can expect the following timeline for updates from the admissions team. Applicants who are invited to interview will be notified via email on the interview invitation dates listed below. The interview invitation email will include a link to schedule an interview, and resources to prepare for an interview. Integrated Joint Degree Program Application and Decision Timelines Please note, the following integrated joint degree programs accept applications only in Round 1 and Round 2, and follow the above-listed application timelines for Rounds 1 and 2. To learn more about each program, click the links below: Francis J. & Wm. Polk Carey JD/MBA Program MBA/MA Lauder Joint-Degree in International Studies Program How does Wharton notify applicants of their status? Applicants who are not moving forward in the application process will be notified via email on the same dates listed above. For example, if you are not invited to interview, you will be notified on the same timeline as those applicants who are invited. After the interview process, you will be notified whether you’re admitted or not on the above-listed decision release dates for the round in which you applied. Applicants who do not move forward in the application process are encouraged to revisit their application and consider reapplying during Round 1 or 2. For advice and guidelines around reapplication, see the Reapplication section in our Application Requirements page. What should I know about the GMAT and GRE tests? All applicants must submit results of either the Graduate Management Admission Test (older version or Focus Edition, both now referred to as GMAT) or the Graduate Record Examination (GRE). We accept scores from tests taken at a test center or at home/online. All at-home tests are monitored by a human proctor online. Scores may be self-reported; when self-reporting your score(s) in the application please list your highest score first. Should you receive an offer of admission, official scores will then be requested for verification. You should register for a test at least one month before you plan to take it. You must complete the GMAT or GRE before we can process your application. We recommend that you take your test no later than 2 weeks prior to the application deadline. This will ensure that you are able to submit your application with all scores. Scores are valid for five years after the test date. Test codes for the Wharton MBA Program are: GMAT: G56-97-73 GRE: 6802 What is the average TOEFL? Do you keep scores submitted in prior years? The average TOEFL score for those students in the Class of 2022 who were required to take it was 115 . We keep TOEFL scores submitted within the previous two years or as long as they are valid (two years from the test date). If you studied at an English speaking institution please request a TOEFL waiver in our application as your TOEFL score is waived. If we cannot locate your official report, we will verify it with ETS. For more information, go to Admissions Process . Can I submit the English for International Opportunity (IELTS) exam results instead of the TOEFL or PTE? As of the 2023-2024 application cycle, we will accept the IELTS, TOEFL and PTE exam score. We also pay careful attention to a student’s GMAT (verbal percentile and AWA score), written and spoken English, recommender observations, and exposure to language, in addition to the GRE. Applicants who earned a baccalaureate or advanced degree at an institution in which the medium of instruction was English, or who have had considerable exposure to the language, may waive the test. A waiver request may be submitted as part of your application. Learn about other important information and resources for international applicants on our International MBA students page. Are application fee waivers available? Application fee waivers are only granted to students for whom the application fee would create an extreme financial hardship or for U.S. military active duty or veteran applicants. Applicants who wish to request a fee waiver must start their application and e-mail feewaiver@wharton.upenn.edu with information detailing their financial need. We will then follow up for supporting documentation. Requests must be submitted no later than 15 days prior to application submission, and no requests will be granted after the application deadline for the round in which you applied. For veterans or active duty applicants, reach out to our admissions office when you are ready to submit your application. Work Experience Before Applying to the MBA Program Work experience isn’t mandatory for applying to the MBA program but the admissions committee does seek individuals who will come to the program with diverse experiences and professional maturity. Check out our Class Profile page for an idea of the work experience and background of our most recently admitted class. How much work experience do most accepted students have? Is there a particular type of work experience Wharton seeks? The average student has worked for five or six years between graduating from college and entering the MBA program. The program does accept early career candidates with limited or no experience who exhibit strong managerial and professional potential. The Admissions Committee looks for individuals who exhibit professional maturity. In other words, we evaluate work experience not in terms of years, but the depth and breadth of an individual’s position, his or her contributions to the work environment, and level of responsibility and progression. Wharton looks for diversity in the professional backgrounds of its admitted students just as it does in all other parts of our applicants’ profiles. No one industry is favored over another, and experience in a Fortune 500 company does not have higher value than experience in a small business or public institution. Does graduate education count as work experience? While we recognize the value of graduate academic work, we do not count academic work as professional work experience. Does time spent in the military count as work experience? Absolutely. The service provides many rich and varied opportunities for professional growth and development. Military candidates are evaluated based on the same criteria as other candidates, including the nature and scope of the work, the skill sets required, work progression, and general leadership and management skills developed. Does time spent in the Peace Corps, on a Latter Day Saints’ mission, or other voluntary assignment or internship count as work experience? Certainly. As with all work experiences, we are interested in the skills acquired on the job and level of progression (measured by scope of responsibilities, job title, salary). I am still an undergraduate student. How can I increase my chances for admission? We welcome applicants directly from undergraduate programs who are motivated and exhibit strong leadership and managerial potential. When preparing for the Wharton MBA program, consider that the stronger your quantitative background, the better prepared you will be to take finance, statistics, accounting, economics, and other quantitative courses offered in our curriculum. For example, calculus and/or statistics are good foundation courses. We do accept students without this type of background, but we like to see evidence of a capacity to handle these types of topics (e.g., strong quantitative GMAT scores, strong academic performance in quantitative subjects). We are also interested in your history of involvement in extra-curricular activities, community service, and hobbies. We advise undergraduates to apply in the Fall prior to the academic year in which they want to enroll in the program. Admission to the program is contingent upon successful completion of the undergraduate degree. For current undergraduates , the Moelis Advance Access Program provides a guaranteed deferred admission pathway for undergraduate seniors accepted into the program. I have less than your average four years of work experience. Is this a disadvantage in the admissions process? Each year, we welcome several early career candidates (individuals with 0 to 3 years of professional work experience) into our program. We are more interested in the skills you have acquired to date, including leadership and management opportunities, than the number of years you have been in the work force. We consider both the skills you have demonstrated to date and your future potential. Check out our most recent Class Profile for additional context on the background and work experience of this year’s accepted class. Is an applicant at a disadvantage without previous course work in business? No. Many students at Wharton have not had business courses prior to entering the program. Generally, 40% of our class consists of people with liberal arts backgrounds. Pre-term offers incoming students an opportunity to “brush up” on their quantitative skills before classes begin. Candidates are also encouraged to complete introductory courses in calculus and statistics prior to entrance, since much of the course work requires quantitative skills. Please go to Non-traditional Backgrounds for more information. Online Application Questions When you submit your Wharton MBA application via the Wharton Application Portal you may have a few questions as you make updates & submissions. This section highlights some of the most common questions we receive on this process, but please reach out to our admissions office for any specific issues not reflected here. How does the system work? You may already have an account on the Wharton Web Application System if you have completed your profile through the “Let’s Get Acquainted” Form, or if you started or completed your MBA application through the Wharton Web Application System . If you encounter problems logging on, please email mbaoperations@wharton.upenn.edu . I created an account and began and/or submitted my application. But, when I log into my account, information I entered is missing and/or my application does not appear to have been submitted. What happened to my information? The problem you encountered typically happens when two accounts are inadvertently created. To determine if you have more than one account on our system, please follow the instructions below: Return to the login page. Click on the “Search” button in the user login box at the top right-hand corner of the page. A PIN lookup box will appear. Complete the required fields for first name, last name, birth date, and e-mail address. Then click “Search.” An e-mail(s) will be sent to you with your login and password information for each of your accounts. Please check both to see which one is active and make a note of it. If you continue to encounter problems, please contact mbaoperations@wharton.upenn.edu . When should I check the system after submitting the application? You should allow three weeks for us to process your online account and update your online status to reflect receipt of your online application and any supporting materials. Will I receive an e-mail when decisions are made? How do we know when to check the system? You will receive an e-mail each time your status changes, including when we release a decision. Once you receive an e-mail, you need to check your status online (the e-mail only indicates there is a change, but it does not indicate what the change is). How do I calculate my GPA if my university or college does not provide one? Students reporting grades from institutions that do not evaluate academic performance on a 4.0 GPA scale should NOT convert their scores to a GPA. Report your scores or grades as your university lists them in your official transcripts, including an explanation of the grading scheme if needed. Keep in mind that we have students from more than 70 countries in our program and have broad expertise in grading methods around the world. Interdisciplinary Programs Questions Customize your MBA experience with our interdisciplinary programs. The Wharton MBA FAQ covers each response in as much detail as necessary, but if your interdisciplinary MBA questions remain unanswered, visit the interdisciplinary page for more details. Am I able to apply to the Lauder Program after I have started the Wharton MBA Program? The academic calendar for first-year students in the Lauder Program begins in May. Students that have been accepted to the Wharton MBA Program in Round 1 or Round 2 can apply separately to the Lauder Program and still will be expected to start the program in May. Students cannot apply to the Lauder Program after they have started their first or second years at Wharton. For more information about applying to the Lauder Program, please visit the Lauder website or contact lauderinfo@wharton.upenn.edu . Can I combine the Lauder Program with a degree program other than the Wharton MBA? The Lauder Institute also offers a joint JD/MA program in partnership with Penn Law. For more information about the Lauder JD/MA, please visit this website . Is Health Care Management a major or a separate program? Health Care Management (HCM) is one of the 18 majors offered through the Wharton MBA Program. The Health Care Management major differs from other majors in that students must select this major at the time of application to Wharton. HCM integrates academic and professional development, helping students to obtain summer and permanent positions in all parts of the health care sector, including consulting firms, health care venture capital and private equity, digital health, health care analytics firms, biotechnology, pharmaceutical firms, hospitals, insurers, and government agencies. If prospective students wish to explore the Health Care Management major, the HCM department is happy to arrange either a telephone conversation or a meeting with June Kinney, the Associate Director of HCM. Please find more information on the application process here . If I am not accepted into the Health Care Management major, can I still be admitted to Wharton? Your application will be evaluated specifically for the Health Care Management major. If the Admissions Committee feels you are not best suited for HCM but could be a good fit for the MBA program more broadly, you will be considered for Wharton. If I am admitted to a dual degree program with the Harvard Kennedy School (HKS) or the School of Advanced Studies (SAIS), can I start my degree at HKS or SAIS instead of Wharton? Applicants should apply to Wharton during the application cycle directly preceding their desired Wharton start date. If you are admitted to both programs and do not want to begin at Wharton, you will need to request a deferral and will be subject to our deferral policy. Deferrals typically are only granted for extenuating circumstances. Are there any dual degree programs that will not allow me to start at Wharton? The School of Design requires all dual degree students to start at Penn Design. The Harvard Kennedy School encourages students interested in the MPA/ID dual degree to start at HKS. If I want to apply to a dual degree program, do I have to apply to the Wharton MBA Program and the other program separately? Unless otherwise noted on the Interdisciplinary Programs website, you must submit separate applications and materials to both programs. Some schools will have strict application requirements around testing, recommendations, and essays. Please follow the admissions requirements for each individual school. Are admissions decisions for integrated dual degree programs made by one committee? Applicants to the MBA/MA Lauder Joint Degree in International Studies, the Francis J. & Wm. Polk Carey JD/MBA Program, and the MBA in Health Care Management will receive one joint decision. Can I create my own dual degree with a school not listed on the website? We cannot accept any credits from other programs. You can pursue another program in your own time, but you would still be required to complete all Wharton credit units as prescribed by the full-time MBA program. As a full-time MBA student, you are expected to be at Wharton and pay tuition for four full semesters. How do I learn more about a graduate program not listed on the Wharton Interdisciplinary Programs website? If you are interested in other programs not listed on the website, please contact the program office of that respective program. How many credit units can I take at other Penn graduate schools while a Wharton MBA student? All Wharton MBA students can take four to six credit units at other Penn graduate schools . Can I apply to a dual degree program after starting at Wharton? For most dual degree programs, you can apply to the other program during your first year at Wharton. However, this may extend your time at Penn. Can I connect with a current student that is a part of a specific dual degree program? Due to the volume of such requests, we are unable to connect prospective students with current students in every dual degree program. Please review the profiles of our Admissions Fellows and request to be connected with a current MBA student who most closely aligns with your interests. What if I want to pursue a degree beyond the master’s level at Penn? Please speak with the PhD department of your interest if you intend to continue your studies beyond the master’s level. Deferred Admissions with the Wharton MBA Advance Access Programs The Wharton MBA Advance Access Programs are deferred admission programs that offer undergraduates seniors a guaranteed pathway to the Wharton MBA program after pursuing 2-4 years of work experience after graduation. Please visit the Deferred Admission Programs section to learn about each program, view frequently asked questions, and learn about upcoming events. Miscellaneous Frequently Asked Questions I heard that Wharton is offering some of its core courses online through Coursera. Where can I find out more information about this? Yes, as part of a greater Penn initiative, Wharton has recently launched nine non-credit, massive open online courses (MOOCs) available at no cost through Coursera . More information about these offerings is available on the Wharton.Online site , Penn’s Open Learning Initiative site, our Coursera FAQS page, and the University’s Coursera homepage . Registration for these courses is available directly through Coursera.org . How will changes to the curriculum affect current applicants? Wharton fully implemented the new curriculum in 2012 and has received much positive student feedback regarding the new course structure and resources. The new curriculum offers increased flexibility based on your background and experience with strengthened emphasis in microeconomics, statistics, ethics and legal responsibility, leadership and communications. New MBA graduates will have access to tuition-free executive education every seven years throughout their careers. See curriculum . Are transfer credits accepted? Wharton does not accept transfer credits, but does encourage students to waive required core courses, either by furnishing the required academic or professional credentials or passing Wharton’s waiver examinations. Waiving courses gives you the opportunity to take more electives. Can I reapply to the MBA Program? You can reapply to the MBA program, but not during the same academic year. For more information, visit the Reapplicants section in Admissions Requirements . What is the median compensation package for graduating MBA students? The median Annual Base Salary for graduates of the Class of 2020 was $150,000. Other compensation included tuition reimbursement, relocation expenses, mortgage assistance, automobiles, stock options, etc. For more detailed information, please see the MBA Career Management’s Annual Career Statistics . Does Wharton offer a one-year, a part-time, an evening, or a distance-learning MBA? Wharton offers the Wharton MBA for Executives program, a two-year program that offers the same MBA degree in an executive format, delivered in Philadelphia and San Francisco. Other (non-MBA) programs that may interest you are executive programs offered by Wharton Executive Education . I’m fluent in another language. How can that help me with my MBA? Consider the joint MBA/MA – Lauder program if you are interested in acquiring an expertise in a specific region and speak one of these nine languages relatively well: Arabic, French, German, Hindi, Japanese, Mandarin Chinese, Portuguese, Russian or Spanish. In addition, Wharton offers many opportunities to participate in career treks or global consulting in which you can immerse yourself in the culture and language. See Global Learning . We hope that the information on this page has been useful in your educational journey. If you have any further questions you would like to ask MBA admissions , please contact us directly. Start or Continue an Application Application Timeline and Deadlines Application Requirements Interview Process Deferred Admission Moelis Advance Access Program Visiting Wharton Attend an Event Recorded Webinars Connect with an Admissions Fellow Admissions FAQs Admissions Blog Back To Top Additional Links MBA Program Facts & Figures Academics Student Life Careers & Network MBA Stories Applying Financing Events Contact Us Featured Links MBA Events Read our Blog Programs Undergraduate MBA EMBA Doctorate Executive Education Wharton Online Locations Philadelphia San Francisco Beijing The Power of Wharton Global Influence Analytics Entrepreneurship & Innovation Featured Give to Wharton Alumni Knowledge@Wharton Recruiters & Corporations Wharton Faculty About Us Research Centers Departments Resources Contact Us News Faculty & Staff Twitter Facebook YouTube Instagram Support Wharton © 2024 The Wharton School, The University of Pennsylvania | MBA Program | Privacy Policy | Report Accessibility Issues and Get Help"
}