{
  "id": 10,
  "date": "2024-05-20T13:15:23.006620",
  "url": "https://www.nursing.upenn.edu:443/admissions/",
  "university_name": "University of Pensylvania",
  "title": "Admissions",
  "content": "Apply Give News & Events Information For Students Alumni Parents Faculty & Staff Search Close search Search Go to search results A world-class city filled with art and culture and an incredible campus that offers cutting edge resources–that’s what students receive at Penn Nursing. And that’s just the start. Penn Nursing and the wider university offer something for everyone, as well as a lifelong community. Penn Nursing is globally known for educating dynamic nurses—because our School values evidence-based science and health equity. That’s where our expertise lies, whether in research, practice, community health, or beyond. Everything we do upholds a through-line of innovation, encouraging our exceptional students, alumni, and faculty share their knowledge and skills to reshape health care. Penn Nursing students are bold and unafraid, ready to embrace any challenge that comes their way. Whether you are exploring a career in nursing or interested in advancing your nursing career, a Penn Nursing education will help you meet your goals and become an innovative leader, prepared to change the face of health and wellness. Penn Nursing is the #1-ranked nursing school in the world. Its highly-ranked programs help develop highly-skilled leaders in health care who are prepared to work alongside communities to tackle issues of health equity and social justice to improve health and wellness for everyone. Penn Nursing’s rigorous academic curricula are taught by world renowned experts, ensuring that students at every level receive an exceptional Ivy League education . From augmented reality classrooms and clinical simulations to coursework that includes experiential global travel to clinical placements in top notch facilities, a Penn Nursing education prepares our graduates to lead. About At a Glance Who We Are Mission and Values Social Justice Sustainability History Legacy of Leadership Our Leadership Dean Faculty Senate Faculty Senate Committees Board of Advisors Our Faculty Emeriti & Retired Faculty Diversity, Equity, and Inclusion Our Commitment Accreditation Admissions How To Apply General FAQs International Applicants Ask Us Anything Admissions Events Visit Penn Nursing Directions Financial Aid Undergraduate Graduate PhD External Scholarships Current Students Contact Financial Aid Admitted Students BSN Students Master of Professional Nursing Students Streamlined MSN Students MSN & DNP Students PhD Students Contact Us Request Information Guidance Counselors Academics A Penn Nursing Education Learning Through Simulation Anatomy-Physiology Lab Team Care Mentorship Study Abroad Submatriculation Undergraduate Honors Program Undergraduate Programs Bachelor of Science in Nursing Major in Nutrition Minors Dual Degrees Master’s Programs Master of Science in Nursing Master of Professional Nursing Master of Science in Nutrition Science Minors Dual Degrees Certificates Doctoral Programs Doctor of Nursing Practice DNP Scholarly Projects Doctor of Philosophy in Nursing Dual Degrees Our Expertise Research Research Centers Faculty Research Interests Student Research Faculty Publications Innovation Design Thinking for Health Innovation Accelerator Innovation Colloquiums Nurse Innovation Fellowship Meet the Fellows FAQs Apply Now Summer Innovation Institute Practice Faculty in Practice Academic Practice Partners Preceptors Resources Preceptors of the Year Request More Information Global Health Student Opportunities Semester Abroad Programs Short Term & Independent Programs Internship & Fellowship Programs International Visitors Partnerships Peace Corps World Health Organization Penn Global Nursing Fellowship For Alumni For Host Organizations Vingroup-Penn Alliance Global Bites Travel Resources Community Engagement Community Partnerships Student Initiatives Community Service Courses Student Life The Student Experience Organizations Traditions Cultural Resources Service & Support Admissions Admissions How To Apply General FAQs International Applicants Ask Us Anything Admissions Events Visit Penn Nursing Directions Financial Aid Undergraduate Graduate PhD External Scholarships Current Students Contact Financial Aid Admitted Students BSN Students Master of Professional Nursing Students Streamlined MSN Students MSN & DNP Students PhD Students Contact Us Request Information Guidance Counselors There are so many reasons you might choose to become a Penn Nurse. Is it the prospect of studying with renowned faculty at one of the nation’s elite research universities? Or is it the access to world-class clinical and research opportunities? It could be our incredibly ambitious, tight-knit, and supportive student body . Or the fact that our alumni are leading nursing science and practice, and are changing the face of healthcare everyday, in every setting imaginable. We hope you’ll join us. Take the next step We are your resource Penn Nursing’s Admissions and Financial Aid teams are here to guide you. From planning a visit to answering questions about the application and aid, we will be your #1 resource while taking these next steps. Learn more about our programs View our upcoming admissions events to understand more about our academic programs that interest you, meet the faculty, and be introduced to the curriculum. View upcoming events Are you ready to begin your application? View our frequently asked questions or see what you need to apply. Start an application Upcoming Admissions Events May 22\t\t\t\t | 6:00pm Spring 2024 Graduate Programs Info Session June 14\t\t\t\t | 12:00pm Spring 2024 Graduate Programs Info Session View all events For Nine Consecutive Years, Penn Nursing is Ranked the #1 Nursing School in the World The University of Pennsylvania School of Nursing (Penn Nursing) holds its number one spot as the world’s leading nursing school according to a recent ranking by QS World University . The rankings highlight the world’s top universities in 55 different subject areas from 1,559 institutions, of which 64 universities are new to the rankings. Read More For Nine Consecutive Years, Penn Nursing is Ranked the #1 Nursing School in the World Director of Harvard Global Nursing Leadership Program to be 2024 Penn Nursing Commencement Speaker Stephanie Ferguson, PhD, RN, FAAN , the Director of the Harvard Global Nursing Leadership Program and Professor of the Practice of Health Policy and Management at the Harvard T.H. Chan School of Public Health , will serve as the 2024 Penn Nursing commencement speaker. The event will take place at 3:00 PM EST on Monday, May 20, 2024, at the Kimmel Center for the Performing Arts . Read More Director of Harvard Global Nursing Leadership Program to be 2024 Penn Nursing Commencement Speaker Become a Penn Nurse 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement 2023 Commencement Related Links Annual Security & Fire Safety Report Take the next step View Programs Plan a Visit See Yourself Here follow along @pennursing Facebook Twitter Instagram LinkedIn YouTube Contact Us Careers Maps & Directions School Directory Privacy Policy Nondiscrimination Statement Report Accessibility Issues & Get Help Logins: Web Support Sharepoint Login Editor Login Back to top"
}