{
  "id": 10,
  "date": "2024-05-18T18:06:27.057909",
  "url": "https://www.upenn.edu/admissions",
  "university_name": "University of Pensylvania",
  "title": "Breadcrumb",
  "content": "Skip to main content Go to site search Go to primary navigation Go to resources navigation Penn Home Toggle Site Navigation Toggle Site Search Academics More Academics Undergraduate Graduate Schools Global Initiatives Interdisciplinary Online Learning Off-campus Learning Libraries Admissions & Aid Athletics Research & Innovation More Research & Innovation Research Enterprise Research News Life at Penn More Life at Penn Arts & Culture Community Involvement More Community Involvement Penn & Philadelphia Diversity Groups & Organizations Housing & Dining Health & Wellness Safety & Security More Safety & Security Emergency Contacts Emergency Preparedness Spirituality & Religion About More About Office of the President Trustees & Administration In Principle and Practice History Securing a Sustainable Future More Securing a Sustainable Future Climate Investments Sustainability Initiatives Research & Teaching News & Announcements News, Media, & Communication Services FAQ Policies Facts Toggle Site Search Resources Current Students Faculty & Staff Parents Alumni Visitors A-Z Directory Webmail Services Give to Penn Search Search Close Breadcrumb Home / Admissions & Aid Admissions & Aid Penn (also known as UPenn) is committed to making its inclusive, innovative, and impactful Ivy League education available to the best and brightest students, regardless of their economic circumstances. A generous financial aid budget and inclusive aid policies make matriculating at Penn an attainable goal for students from the widest possible range of backgrounds. Every day, Penn embodies this truth: Our unique perspectives and backgrounds brought together make us strong, resilient, and singularly prepared to define the future. Applying to Penn The college application process is a meaningful journey that encourages students to reflect on themselves, their community, and their interests. Your voice matters, and we can’t wait to hear your story. Undergraduate Admissions When applying to Penn, undergraduates are asked to choose one of the University’s four undergraduate schools (the College, Wharton, Penn Engineering, or Penn Nursing), or a coordinated dual-degree, accelerated, or specialized program that will serve as home base throughout their academic journey. All admitted students will be admitted to the specific school or program for which they applied. Preparing for First-Year Admission Penn accepts the Common Application and Coalition Application. There is no preference for either format and both applications are treated equally in Penn’s process. Penn is also a proud QuestBridge partner institution. Preparing for Transfer Admission As with first-year admissions, the Common Application and Coalition Application are accepted for those wishing to transfer to Penn, and the use of the following resources are encouraged: Checklist and Deadlines, Curricular Requirements, Eligibility Guidelines, Transfer Credit. Graduate Admissions Penn’s graduate and professional programs are housed in 12 schools on one campus. Each graduate program has a separate admissions process. Applicants apply directly to the program of interest. All questions about the admissions process should be directed to the program of interest. Undergraduate Admissions CONTACT Admissions Visitor Center Claudia Cohen Hall, Ground Floor 249 S. 36th Street Philadelphia, PA 19104-6376 (215) 898-7507 Contact Us Graduate Admissions Contact Penn does not have a central Office of Graduate Admissions. All questions about the admissions process should be directed to your academic program of interest. Grant-based Financial Aid The cornerstone of Penn’s initiative to increase access for students from all socioeconomic backgrounds is its grant-based financial aid program. Since 2004, the University has awarded $3.1 billion in undergraduate aid to more than 25,000 students. Forty-five percent of traditional undergraduate students received grant-based financial aid in 2022-23. Ongoing gifts from generous alumni and supporters are expanding Penn’s robust undergraduate grant-based financial aid program and growing graduate and professional student aid to minimize the burden of debt. Penn's All-Grant Policy Graduate Admissions Offices School of Arts & Sciences The Wharton School Annenberg School for Communiciation School of Dental Medicine Stuart Weitzman School of Design Graduate School of Education School of Engineering and Applied Science Penn Carey Law Perelman School of Medicine School of Nursing School of Social Policy & Practice School of Veterinary Medicine Talking admissions with Whitney Soule As vice provost and dean of admissions, Soule is challenged daily with thinking strategically about undergraduate enrollment at Penn—from recruitment to application processes and all that goes into admitting a class, to how financial aid and retention fits into the mix. Read More Penn Virtual Tour From West Philadelphia to the comfort of your own home, we invite you to explore Penn through a virtual tour of our historic campus. Get a glimpse inside our state-of-the-art classrooms, hear from current students and faculty, and catch live performances by members of our community as you stroll down Locust Walk. Penn Virtual Tour Philadelphia, PA 19104 Telephone: (215) 898-5000 Contact Us Maps Parking Navigate Alumni Athletics Diversity Health Care Libraries Online Learning Penn Global Penn's Heritage As America’s first university, Penn has a history that dates back to 1740 and shares many ties with the colonial city of Philadelphia and the birth of our nation. Our History Disclaimer Emergency Services Nondiscrimination Privacy Policy Report Accessibility Issues and Get Help Report Copyright Infringement Back To Top"
}