{
  "id": 10,
  "date": "2024-05-20T13:15:16.539454",
  "url": "https://www.library.upenn.edu/",
  "university_name": "University of Pensylvania",
  "title": "Get Started",
  "content": "Get Started Get Started Close My Account Make an Appointment Reserve a Space Guides by Subject Off-Campus Access Resource Sharing Alumni and Guest Accounts Alumni Access Menu Homepage Ask Ask a Librarian Close Send Us a Question Skip to main content Skip to site search Skip to primary navigation Skip to About Penn libraries menu Skip to Get Started menu Skip to Live Chat Phone 215-898-7555 Report Accessibility Issues and Get Help Access to the College Green area of campus will be restricted until further notice . Current students, faculty, and staff with a valid Penn card, as well as Alumni Weekend attendees with name badges, may enter and exit Van Pelt-Dietrich Library Center through the Rosengarten Undergraduate Study Center on the ground floor, and may enter and exit the Fisher Fine Arts Library through the 34th Street entrance to Meyerson Hall. See our Service Alerts for details. Close Penn Libraries logo Toggle Site Navigation Toggle Site Search Help With More Help With Borrowing Research and Scholarship Instruction and Course Support Guides by Subject Equipment Software and Tools Digital Scholarship and Data Services Digitization (SCETI) Featured Services Off-Campus Access Alumni Access Quick Start Guide Collections More Collections About Our Collections Collections by Subject Collection Development Policies Search Our Catalog Notable Collections University Archives Contact a Subject Librarian Suggest a Purchase Philadelphia Area Archives Strategies for Special and Global Collections Libraries & Spaces More Libraries & Spaces Libraries and Locations Access and Visitor Information Find and Reserve Spaces Albrecht Music Library Annenberg Library Biddle Law Library Center for Global Collections Chemistry Library Education Commons Fisher Fine Arts Library Holman Biotech Commons Kislak Center for Special Collections, Rare Books and Manuscripts Levy Dental Medicine Library LIBRA--Penn Libraries Research Annex Library at the Katz CAJS Lippincott Library of the Wharton School Math/Physics/Astronomy Library Penn Museum Library University Archives University Records Center Van Pelt-Dietrich Library Center Veterinary Medicine Libraries Weigle Information Commons News & Events More News & Events News Events Exhibits Social Media About Penn Libraries About Us Staff Directory Hours Policies and Guidelines for Users Accessibility Diversity, Equity and Inclusion Community Engagement Strategic Plan Service Alerts Support Us Toggle Site Search Search Library Website Search Close Penn Libraries Search Franklin Homepage Hours My Account Ask Just graduated? Alumni Services Graduation doesn’t mean the end of your journey with the Penn Libraries! As a University of Pennsylvania alum, you can continue to experience a variety of events and exhibits, access select print and e-resources, and more. Find out how Using the Library Quick Start Guide Borrow Books and More Get Expert Help Find a study space Teaching Borrow Books and More Search the Franklin Catalog Use Franklin to find books, journal articles, databases, CDs and DVDs, and anything else in the Penn Libraries collections. Get Off-Campus Access Need to access subscription materials like journals, databases, and ebooks when you’re not on campus? Check out our cheat sheet. Request Scans Our library staff can scan book chapters and articles for quick delivery directly to your inbox. Receive Books by Mail When you register for Books By Mail, you can request to have books sent to your off-campus address anywhere in the United States. Get Expert Help Ask a Question Anytime Explore our archive of Frequently Asked Questions. Can’t find the answer you’re looking for? Submit your question anytime, and we’ll respond within 24 hours. Book a Consultation Book an in-person or virtual consultation with a librarian or technology consultant with expertise in your field of study, copyright, digital fabrication, or statistical and design software. Find Your Personal Librarian From Accounting to Veterinary Medicine, one of our subject specialists can tailor help to your particular focus. Find a study space Browse our spaces Explore our array of flexible and innovative spaces, from collaborative or quiet study spots to classrooms designed for active learning and equipped with the latest technology. Reserve a room Already know exactly which room you need? Head directly to our room reservation system. Explore our library locations Like to study in the middle of the night? Need specialized databases at your fingertips? Looking for a location close to your classes? Find out how to visit all our library locations across campus—and beyond—and discover which one suits your needs best. Teaching Explore Canvas and Related Resources Find support, training, and instructional design services for Canvas—Penn’s learning management system—and related educational technologies. Book a Classroom Space Use our spaces finder to book a classroom with the setup and technology that suits your needs. Course Reserves Set aside books, films, and sound recordings for classroom use. Featured Collections The Penn Libraries' global collections encompass hundreds of languages and scripts across a broad range of subject areas, preserving the rich cultural and scholarly record from Africa, East Asia, Latin America, the Middle East, Eastern Europe, and South Asia. Read about some of our unique recent acquisitions. show-hide control Khajistan and the Shaping of Pakistani Cultural Histories The Penn Libraries is collaborating with preservation organization Khajistan to acquire ephemera, magazines, pulp fiction, and rare books that document the cultural history of Pakistan, Afghanistan, and Iran. Nova khata: A Ukrainian Folk Art Journal in Interwar Galicia The Penn Libraries has recently acquired several issues of the women’s journal Nova khata (New Home), which offer a unique window into Ukrainian culture as it existed a century ago in Galicia. Exploring Chinese Internet Literature To more accurately reflect the diversity of literature in China, the Penn Libraries has made a special effort to add recent internet novels that have been published in print form to our collection. Upcoming Events View all List Workshop May 22, 2024 Copyright Chat: Authorship and Generative AI In this copyright chat, copyright advisor Stephen Wolfson will discuss authorship in copyright law and when works generated by artificial intelligence may qualify for copyright protection. 11:00am - \n            12:00pm Meyerson Conference Room, 2nd Floor, Van Pelt-Dietrich Library Center Open to the Public Workshop May 23, 2024 Coffee with a Codex: Book of Hours On May 23, curator Dot Porter will bring out Ms. Codex 1566, an illuminated Book of hours, use of Metz , with a calendar, the Hours of the Virgin, the Penitential Psalms and Litany, and the Office of the Dead. Written in Metz, France, between 1375 and 1399. 12:00pm - \n            12:30pm Online Open to the Public Workshop May 27, 2024 Canvas 101 for Faculty and Staff This workshop will introduce basic Canvas functions that will allow participants to do the following: set profile and notifications; navigate the Canvas interface; create content for a Canvas site; and post files, images, and videos. 12:00pm - \n            12:45pm Virtual Open to Penn Students, Faculty, and Staff Subscribe to our newsletter 3420 Walnut Street, Philadelphia, PA 19104-6206 (215) 898-7555 Privacy Policy Campus libraries map Committees Resources for Staff Welcome to your library. Report Accessibility Issues and Get Help instagram facebook twitter linkedin"
}