{
  "id": 10,
  "date": "2024-05-20T13:15:15.964132",
  "url": "https://global.upenn.edu/",
  "university_name": "University of Pensylvania",
  "title": "Utility Navigation",
  "content": "Skip to main content announcement At this time, we recommend all Penn-affiliated travel to Israel, West Bank, Gaza, and Lebanon be deferred.  If you are planning travel to any of these locations, please reach out to travelsafety@pobox.upenn.edu for the most up to date risk assessment and insurance exclusions. As a reminder, it is required that all Penn-affiliated trips are registered in MyTrips .  If you have questions, please contact travelsafety@pobox.upenn.edu . International Travel Guidance Utility Navigation Utility Links University of Pennsylvania Office of the Provost Penn Global Secondary Nav Penn Global For Penn Students For Penn Faculty For Alumni & Friends Group Created with Sketch. Group Created with Sketch. search Group Created with Sketch. full menu Primary Nav Penn Global About News Map Campus Resources Grants Support Drawer Menu Penn Global About Explore Back to main menu Our Strategic Framework Our Offices Explore Back to main menu Office of the Vice Provost for Global Initiatives Explore Back to main menu Our Team Perry World House Penn Biden Center Penn Abroad International Student & Scholar Services Global Support Services Our Team News Map Explore Back to main menu Penn in Africa Penn in Asia Explore Back to main menu Penn in China Penn in Latin America and the Caribbean Explore Back to main menu Penn in Latin America & the Caribbean (PLAC) Explore Back to main menu Who We Are What We Do Explore Back to main menu Annual PLAC Symposium Explore Back to main menu 2022 PLAC Symposium Pulitzer International Reporting Student Fellowship Connect with PLAC Penn in Oceania Penn in the Middle East Penn in Northern America Campus Explore Back to main menu Global at Penn's Schools Global Centers & Programs Resources Grants Explore Back to main menu Global Engagement Fund China Research and Engagement Fund India Research and Engagement Fund Holman Africa Research and Engagement Fund Apply for a Convening Grant Apply for a Research Grant Manage My Grant Grants Database Support Search Group Created with Sketch. Bringing the World to Penn and Penn to the World Penn Global provides strategic direction to the University of Pennsylvania on its global endeavors, with a focus on the efficient investment of university resources. Encompassing seven reporting offices, Penn Global leverages its broad and deep expertise to advise the University on its global activities and to collaborate with Penn’s schools, centers, communities and partners to deliver a comprehensive suite of global programming that generates positive impact around the world. Meet the Penn Global Offices What Are You Looking For? Penn Global Offices International Student & Scholar Services Penn Abroad Perry World House Penn Biden Center Office of the Vice Provost for Global Initiatives Global Support Services Penn Global Finance & Administration Information To Help You... Travel Abroad Explore the resources and services available to prepare the Penn community for their travel abroad. Make an Impact Engage with Penn centers and programs to broaden the university's impact across the globe. Support Your Global Activities Discover the resources and services available to support the business and administrative functions of Penn's global activities. Fund Your Global Activities Learn about the opportunities designed to provide financial and logistical assistance to the Penn community for their global endeavors. Penn Global News See All News Penn Global Awards $1.5 million in Research and Engagement Awards by \n  Penn Global Read More Penn Abroad director on making study abroad accessible and her first passport stamp by \n  Penn Today Read More Call for Applications: Penn Global - Perry World House Policy Fellows Program by \n  Penn Global Read More @PennGlobal Follow Us 10th Anniversary Highlights (AY2022-2023) Celebrating 10 Years of Penn Global Celebrating Penn Global's 10th anniversary Looking back at 10 years of global engagement Celebrating Penn's international students Recognizing the work and impact of our partners Reconnecting with stakeholders abroad Advancing Penn's global engagement Assessing the future of global higher education Bringing the world to Penn & Penn to the world Celebrating Penn Global's 10th anniversary 2022 marked 10 years since the inception of Penn Global - a decade since the adoption of the University’s first global strategic framework. To commemorate, Penn Global hosted a series of events to highlight the transformative impact of Penn Global on the University and celebrate Penn’s commitment to global engagement. View Photos from Events Looking back at 10 years of global engagement The hub for all things global on campus looks back at its impact over the decade and ahead to what the next 10 years of research, policy, and engagement with the world will bring. Read More at Penn Today Celebrating Penn's international students Penn’s campus community includes students from all parts of the globe, bringing their unique experiences and soaking in all the University has to offer. Read More at Penn Today Recognizing the work and impact of our partners In October 2022, Penn Global hosted a reception to celebrate its 10th anniversary and recognize the deep impact of our many campus partners and international stakeholders in advancing Penn's global mission. View Photos from the Reception Reconnecting with stakeholders abroad Penn Global traveled around the world to reconnect with the Penn community abroad and engage students, alumni and global partners around the University's global mission, and celebrate the Penn's long-standing commitment to global engagement. View More Photos on Instagram Advancing Penn's global engagement As part of Penn's global mission, UPIASI, CASI, and Penn Global partnered to host the Penn India Engagement Forum in Delhi, India in January 2023 to address the challenges and opportunities in India's post-Covid recovery and onward development. Read More at ANI Assessing the future of global higher education Organized by Penn Global and the Graduate School of Education, the conference brought together leaders from higher education, government, corporations and other entities to consider the range of challenges and opportunities acing globally oriented colleges and universities. Read More at Penn Today Bringing the world to Penn & Penn to the world Our mission is to bring the world to Penn and Penn to the world. Learn how Penn Global has helped to shape the University as a global institution over the last 10 years as it prepares for the next ten years of global engagement. View Video on YouTube 01 / 08 3539 Locust Walk University of Pennsylvania Philadelphia, PA 19104 global@upenn.edu Penn WebLogin ©2024 University of Pennsylvania, Philadelphia, PA 19104 Footer Menu Office of the Provost Report Accessibility Issues and Get Help Privacy Policy"
}