{
  "id": 10,
  "date": "2024-05-20T13:15:25.179971",
  "url": "https://admissions.upenn.edu/visit-connect/contact-us",
  "university_name": "University of Pensylvania",
  "title": "Site Navigation",
  "content": "Skip to main content Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Search Close Menu Close Search keywords Search Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Contact Us Thank you for your interest in the University of Pennsylvania. We are eager to connect applicants, parents, and counselors with the information they need to navigate the admissions process. We are here to help. Navigate Section Contact Us Visit Penn Penn Perspectives Ask Have a question for Penn Admissions? Find answers to your questions about visiting campus, application materials, specialized programs, financial aid and more! Frequently Asked Questions Submit your question(s) directly online, so we can get you the information you need. Submit A Question Join our mailing list to get updates about virtual events, news from our office and insight into the college admissions process. Join Our Mailing List Phone and Fax Numbers Our staff is available to speak with you Mondays through Fridays, from 9:30 am - 12:30 pm and 2:00 pm - 5:00 pm Eastern Time. Phone: (215) 898-7507 Fax: (215) 898-9670 Mailing Address University of Pennsylvania Office of Admissions 3535 Market Street, Suite 850 Philadelphia, PA 19104 When possible, please submit applicant materials electronically. Admissions Visitor Center Claudia Cohen Hall, Ground Floor 249 S. 36th Street Philadelphia, PA 19104 Contact Us By Region Please see below for admissions contact information by region. NORTHEAST REGION Email the Northeast Region Team: northeastteam@admissions.upenn.edu State Admissions Contact Connecticut Barkley Barton Maine Andrew Campbell Massachusetts Andrew Campbell New Hampshire Andrew Campbell New York (Rockland and Westchester Counties) Suzannah Bretz New York (Manhattan, Bronx) Jessica Ward Regosch New York (Upstate New York and Brooklyn, Queens, Staten Island) Micaela Beigel New York (Long Island) Suzannah Bretz Rhode Island Andrew Campbell Vermont Andrew Campbell MID-ATLANTIC REGION Email the Mid-Atlantic Region Team: midatlanticteam@admissions.upenn.edu State Admissions Contact Delaware Courtney Bradshaw Maryland Zoe Osborne New Jersey (Southern Jersey, Camden, Burlington, Jersey Shore, Pinelands, & Monmouth Counties) Andria Board New Jersey (Essex, Southern Passaic, Hudson, Bergen, Morris, Northern Passaic, Sussex, Warren, & Hunterdon Counties) Samantha Cardenas New Jersey (Middlesex , Somerset, Mercer, & Union Counties) Tina Pierce Fragoso Pennsylvania (All counties except Philadelphia) Ana Del Puerto and F. Wykle Pennsylvania (Philadelphia County) Courtney Bradshaw Washington, D.C. Andria Board SOUTH REGION Email the South Region Team: southteam@admissions.upenn.edu State Admissions Contact Alabama Mwanasha Warrakah-VanWright Arkansas Mwanasha Warrakah-VanWright Florida Crissy Iglesias Georgia Sara Cohen Louisiana Mwanasha Warrakah-VanWright Kentucky Reshan Selvavelautham Mississippi Mwanasha Warrakah-VanWright North Carolina Sara Cohen Oklahoma Reshan Selvavelautham Puerto Rico Crissy Iglesias South Carolina Sara Cohen Tennessee Reshan Selvavelautham Texas Kevin Strong U.S. Virgin Islands Crissy Iglesias Virginia Molly Scherner West Virginia Molly Scherner WEST and MIDWEST REGION Email the West/Midwest Region Team: westmidwestteam@admissions.upenn.edu State Admissions Contact Alaska Billy Gannon Arizona Katerina Davidson California Natalie Zamora Colorado Hosea Wah Guam Jordan Pascucci Hawaii Barkley Barton Idaho Billy Gannon Illinois Caroline Bormann Indiana Caroline Bormann Iowa Xena Wang Kansas Xena Wang Michigan Xena Wang Minnesota Xena Wang Missouri Xena Wang Montana Hosea Wah Nebraska Xena Wang Nevada Katerina Davidson New Mexico Katerina Davidson North Dakota Xena Wang Ohio Xena Wang Oregon Billy Gannon South Dakota Xena Wang Utah Hosea Wah Washington Billy Gannon Wisconsin Xena Wang Wyoming Hosea Wah INTERNATIONAL REGION Email the International Region Team: internationalteam@admissions.upenn.edu Region Admissions Contact Africa (Sub-Saharan Africa) Elisabeth O’Connell Africa (North Africa) Justin Mazur Asia (Central Asia) Akosua Ako-Addo Asia (China) Barbara Stoddard Asia (East and Southeast Asia) Elisabeth O’Connell Asia (South Asia) Kristen Pantazes Caribbean and Bermuda Crissy Iglesias Central and South America William Canon Europe and Eurasia (Continental Europe and Ireland) Jessica Ward Regosch, Barbara Stoddard, and Akosua Ako-Addo Europe and Eurasia (United Kingdom) Jordan Pascucci Europe and Eurasia (Turkey) Justin Mazur Middle East Justin Mazur North America (Canada) Madeleine Jacobs North America (Mexico) Ana del Puerto Oceania Elisabeth O’Connell 1 College Hall, Room 1, Philadelphia, PA 19104-6376 Footer Menu Join the mailing list Contact Us Accessibility Privacy Policy NACAC Partnership Agreement"
}