{
  "id": 10,
  "date": "2024-05-18T18:09:33.471525",
  "url": "https://admissions.upenn.edu/how-to-apply/apply-for-admissions/first-year-admission",
  "university_name": "University of Pensylvania",
  "title": "Site Navigation",
  "content": "Skip to main content Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Search Close Menu Close Search keywords Search Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask First-Year Admission We’re interested in learning all about you: what you love, your strengths, your challenges, your interests, and how these pieces come together to make you a distinct individual who will actively grow and contribute to the Penn community. Navigate Section Apply for Admission Apply for Admission sub-navigation First-Year Admission: Checklist First-Year Admission Homeschool Applicants QuestBridge QuestBridge Finalists Ranking Penn Undocumented Students Student Athletes International Applicants Transfer Admission What Penn Looks For Penn accepts Common App and the Coalition Application . We have no preference for either format and treat both applications equally in our process. We encourage you to review the features of each application format and use the platform that suits you best. You should submit only one application per admissions cycle and not mix-and-match across platforms. Apply Via Common App Apply Via The Coalition Application QuestBridge Applicants Penn is a proud QuestBridge partner institution and participates in the National College Match program for high-achieving students with significant financial need. We will accept the QuestBridge Application from QuestBridge National College Match Finalists in lieu of Common App or the Coalition Application. For more details on QuestBridge and the National College Match program, please visit their website . Apply via the QuestBridge Application Application Dates & Deadlines Early Decision: November 1, 2023 Regular Decision: January 5, 2024 Application Fee: $75 or fee waiver for those who qualify. First-Year Checklist & Deadlines Admissions Plans (Early vs. Regular) Early Decision Penn’s Early Decision program is binding, meaning that if you are admitted, you are obligated to accept our offer of admission. By mid-December, you will receive one of three possible outcomes from your Early Decision application: You are admitted into the University of Pennsylvania . As part of our Early Decision program, you are committed to accepting our offer of admission. You must withdraw any active applications you have to other colleges/universities. The only instance in which you could request to be released from our Early Decision binding agreement is if your financial need can’t be met, which would be determined only after consulting with Penn’s Student Financial Services office. You are deferred for consideration during Regular Decision . Your application will be considered among our Regular Decision candidates and you will no longer be bound by the Early Decision binding agreement. You will receive final notification of our decision in late March/early April. Instructions on how to provide updates to your application will be found on your applicant portal. You are denied under the Early Decision program . Your application process for this cycle year is complete. If you are still interested in Penn, you are welcome to re-apply during the next application cycle. * We will notify all Early Decision applicants of the exact time and date of our decision release at least one week ahead of time so that they can be aware of when to expect their admissions decision. We appreciate that attending Penn is a tradition for many families. The Admissions Office identifies legacy applicants based on the information provided in a student’s application and defines “legacy” as being either a child or grandchild of alumni. Legacies who apply to Penn—like all applicants—receive thorough consideration in the application process. Although applicants considering applying through Early Decision must submit their applications earlier (November 1st) than Regular Decision applicants (January 5th), the process of applying is no different. Please refer to our Checklists & Deadlines page for more information. Regular Decision If you’re a Regular Decision applicant to the University of Pennsylvania and are accepted by another school under a binding Early Decision program, you must inform the Office of Admissions and withdraw your Penn application. You are admitted into the University of Pennsylvania . You have been accepted and are now invited to join the incoming first-year class. You will have until the admitted student reply date to accept or decline our offer of admission. You are waitlisted . You have been placed on the waitlist and do not currently have a seat in the incoming class. If you choose to remain on the waitlist -- and if space allows -- you will be considered for admission later in the spring or summer. You are denied admission under the Regular Decision program . Your application process for this cycle year is complete. If you are still interested in Penn, you are welcome to re-apply during the next application cycle. Decision Notification Timeline Notification of Decision Early Decision: Mid-December 2023 Regular Decision: By April 2024 Admitted Student Reply/Enrollment Confirmation Early Decision: January 5, 2024 Regular Decision: May 1, 2024 Pre-college Credit Please note: These polices are in effect for students entering in the Fall of 2018 and beyond. They remain under ongoing review by the faculty of the University and are subject to change without notice. Current students should consult their home school offices for policies in effect at the time of their matriculation. COVID-19 Update: Penn will continue to grant credit and placement for these exams. We understand some scores will now be based on online tests, while other scores will be based on year-long academic coursework. Testing agencies are making prudent decisions to prevent large gatherings of people. We are in communication with testing agencies around the world and we support them in the decisions they feel they need to make. The University of Pennsylvania may award credit or advanced course standing to students who have taken Advanced Placement, International Baccalaureate, or other internationally-recognized examinations. Scores warranting University credit vary by department. Matriculating students seeking credit for Advanced Placement (AP) exams must have official score reports sent directly to the Office of the University Registrar by the Educational Testing Service. See Advanced Placement chart below. Matriculating students seeking credit for International Baccalaureate (IB) exams must have official score reports sent directly to the Office of Admissions by the International Baccalaureate Organization. See International Baccalaureate chart below. Matriculating students seeking credit for A-Level exams must email their original A-Level certificates to the Office of Admissions (Attention: Eddrena Owens, eddrenao@upenn.edu) in order to have their scores evaluated for credit. See GCE Advanced (A) Level Exam Policy chart below. Pre-College and Dual Enrollment Course Work Credit is not awarded for college-level coursework undertaken at other institutions while a student is enrolled in high school or in the summer after high school. Such coursework is considered a part of a student’s preparation for a Penn education. It is used in consultation with the student’s academic advisor to inform decisions about placement into appropriate courses at Penn. Students who enroll in regular undergraduate courses at Penn prior to their matriculation into an undergraduate degree program at the University, during the academic year or in the summer sessions, may elect to have that coursework merged with their undergraduate transcript, in which case it will count toward their undergraduate degree requirements, and the grades will be included in their grade point average. Advanced Placement Examination Score Penn Credit Awarded Art History 5 Waiver for ARTH 1010 or ARTH 1020, consult with undergraduate chair Art (Studio) 5 No credit (possible exemptions for majors, portfolio considered) Biology No credit Chemistry♦ 5 EAS 091 (1 c.u.), for Engineering students only 5 NURS 0061 (0.5 c.u.), for Nursing students only Computer Science A 5 CIS 1100 (1 c.u.) Computer Science Principals No credit Economics Micro 5 Economics 0100 waiver Macro 5 Economics 0200 waiver English Language/Composition No credit Literature/Composition No credit Environmental Science No credit European History No credit French Language 5 French 1000 (1.cu.) (fulfills language requirement) 4 No credit (fulfills language requirement) German Language 5 German 0400 (1 c.u.) (fulfills language requirement) 4 No credit, (must pass the department exam to fulfill language requirement) Government and Politics No credit Human Geography No credit Italian Language and Culture 5 ITAL 1000 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Japanese 5 JPAN 0400 (1 c.u.) (fulfills language requirement) 4 No credit (must pass the departmental exam to fulfill language requirement) Latin 5 Latin 0400 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Latin - Literature 5 Latin 0400 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Latin - Vergil 5 Latin 0400 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Mathematics AB No credit Mathematics BC♦ 5 Math 1400 (1 c.u.) (2023 and earlier) Math 1300 (1 c.u.) (Students entering Penn in 2024 onward) Music Theory No credit Physics 1 5 Physics 0101 (1.5 c.u.) Physics 2 5 Physics 0102 (1.5 c.u.) Physics-C (Mechanics) 5 Physics 0150 (1.5 c.u.) Physics-C (Electricity and Magnetism) 5 Physics 0151 (1.5 c.u.) Psychology 5 Psychology 0001 Waiver Spanish Language 5 Spanish 1000 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Spanish Literature 5 Spanish 1200 (1 c.u.) (fulfills language requirement) 4 No credit (fulfills language requirement) Statistics 5 STAT 1010 waiver or STAT 1110 waiver 5 NURS 2300 (1 c.u.), for Nursing students only United States History No credit World History No credit International Baccalaureate Higher Level Examination Score Penn Credit Awarded Anthropology No credit Biology No credit Chemistry♦ 7, 6 EAS 091 (1 c.u.), for Engineering students only Economics 7, 6 Economics 0100 and 0200 Waiver English A/B No credit French A 7, 6 French 1212 (1 c.u.) 5 French 1000 (1 c.u.) French B 7, 6 French 1000 (1 c.u.) Geography No credit German A 7, 6 German 2100 (1 c.u.) (fulfills language requirement) 5 German 0400 (1 c.u.) (fulfills language requirement) German B 7, 6 German 0400 (1 c.u.) (fulfills language requirement) History of the Americas No credit History of Europe No credit Latin 7 Latin 0400 (1 c.u.) (fulfills language requirement) 6 No credit (fulfills language requirement) Mathematics♦ No credit Music No credit Philosophy 7, 6 Phil 1000 (1 c.u.) Physics 7, 6 Phys 0150 (1.5 c.u.) and Physics 0102 (1.5 c.u.) Psychology 7, 6 Waiver for Psychology 0001 Spanish A 7, 6 Spanish 1200 (1 c.u.) (fulfills language requirement) 5 Spanish 1000 (1 c.u.) (fulfills language requirement) Spanish B 7, 6 Spanish 1000 (1 c.u.) (fulfills language requirement) Theater Arts 7, 6, 5 Departmental review on case-by-case basis ♦ An internal departmental examination is also available for credit once enrolled at Penn. GCE Advanced (A) Level Exam Policy Examination Grade of A* or A or B Grade of C Accounting No credit No credit Biology No credit No credit Chemistry A* or A = EAS 091 (1 c.u.), for Engineering students only No credit Economics A* or A = Waiver Econ 0100 & 0200 B = no waiver No credit English No credit No credit French A* or A = Fren 1212 (1 c.u.) (fulfills language requirement) A- = no credit (fulfills language requirement) B = no credit No credit Greek A* or A = Greek 0400 (1 c.u.) (fulfills language requirement) B = no credit (fulfills language requirement) No credit History No credit No credit Latin A* or A = Latin 0400 (1 c.u.) (fulfills language requirement) B = no credit (fulfills language requirement) No credit Math w/Special paper w/merit (Cambridge) No credit No credit Physics A* or A = Physics 0150 (1.5 c.u.) and Physics 0151 (1.5 c.u.) B = Physics 0101 (1.5 c.u.) and Physics 0102 (1.5 c.u.) No credit Spanish A* or A = Spanish 1200 (1.cu) (fulfills language requirement) A- = no credit (fulfills language requirement) B = no credit No credit Continue to Transfer Admission 1 College Hall, Room 1, Philadelphia, PA 19104-6376 Footer Menu Join the mailing list Contact Us Accessibility Privacy Policy NACAC Partnership Agreement"
}