{
  "id": 10,
  "date": "2024-05-18T18:09:37.802262",
  "url": "https://gradadm.seas.upenn.edu/how-to-apply/",
  "university_name": "University of Pensylvania",
  "title": "How to Apply",
  "content": "Graduate Admissions Contact Us Doctoral Master’s Research News & Events About Us Online Programs Apply Now How to Apply Penn students and alumni are shaping the future of engineering and transforming the world. Are you ready to join them? The application process is straightforward, and we’re here to help. We evaluate your application holistically based on the following components: The Application When you’re ready, start your online application here . Your Professional Resume We look at your resume to learn about your job skills, the depth of your professional experience, your leadership experience and more. A Personal Statement In two pages or less, write an essay that answers the questions below. (But if you’re applying to the Integrated Product Design program, see the IPD-specific questions here .) Use specific examples where possible. Why are you interested in this program? What have you done that makes you a great candidate? How will you benefit from the program? How do you plan to contribute to the student community in Penn Engineering while you’re here? Why will you succeed in the program? What will you do/accomplish once you have completed the program? Letters of Recommendation Please provide two letters of recommendation (three for the CIS Ph.D. and BE Ph.D. “Medical Physics” concentration only), including one from a faculty member who is familiar with your scholarly abilities. Your letter writers will receive an email when you enter their contact information in the application for admission. The email provides a link to fill out a form and upload their letter. We don’t have any formal requirements or guidelines for how the letters should be written. Transcripts When you apply, please submit an unofficial transcript from each university or college where you earned course credit. Your transcripts must be in English. If your original transcript is not in English, we encourage you to use a transcript evaluation and translation service such as Educational Perspectives . If you are from a Chinese institution, we encourage you to use the Center for Student Services and Development . For applicants using WES transcript evaluation, please arrange to have your report sent to: University of Pennsylvania Dept: SEAS Graduate Admissions (Engineering) Official transcripts are only required if you have been admitted and choose to enroll. The Application Fee Please pay the $90 nonrefundable application fee along with your online application. You may qualify for a fee waiver if you are in one of the following categories: US citizens or permanent residents with proven low-income background Applicants with Penn or military affiliation Eligible students from a US partner institution applying to an Accelerated Master’s program If you meet one of these criteria, your fee will be automatically waived. GRE (Optional) The GRE is optional during the 2024-2025 application cycle, and it won’t hurt your application if you choose not to take it. But if you have taken the exam and received valid scores, we encourage you to submit them. Here’s what you need to know if you decide to submit your scores: The institution code to use for the GRE exam is 2888. Test results must be valid at the time you submit your application. You must take the exam by the application deadline. English Language Proficiency (for international students) If you are an international applicant or a non-US citizen or permanent resident and English is not your native language, you must submit official scores for (1) the Test Of English as a Foreign Language (TOEFL), (2) the International English Language Testing System (IELTS), or (3) Duolingo English Test (DET). The institution code for the TOEFL exam is 2888. Test results must be valid when you submit your application. You must take the exam by the application deadline. Test scores from at-home administration of the GRE and TOEFL exams are accepted. Please send your IELTS score report electronically to “University of Pennsylvania School of Engineering and Applied Science.” Please send your DET score report electronically to “ University of Pennsylvania – School of Engineering and Applied Science – Graduate.” Test Waivers To have the English-language requirement waived, you must meet one of the following criteria by the time of matriculation: Graduate from a program in the United States; Attend school in a country in which English is recognized as the official language; or, Graduate from an institution where the medium of instruction is English, and this is indicated on the unofficial transcript If you meet one of these criteria, this requirement will be automatically waived. Recommended Scores You don’t have to achieve a particular score to be admitted, but we recommend that you aim for at least the following scores: TOEFL: 100 IELTS: 7.5 DET: 135 Ph.D. Admissions Timeline 15 Sep Application opens 15 Dec Application deadline 15 Apr Admissions decisions released **Release Update: Decisions are released on a rolling basis. Applicants can expect a decision by April 15. Master’s Degree Admissions Timeline 15 Sep Application opens 1 Nov Early admissions deadline (for CIS, Data Science, and MCIT on-campus programs with two deadlines) 14 Jan Early admissions decisions released 1 Feb Regular admissions deadline 1 Apr Regular admissions decisions released Funding Your Education A degree from Penn Engineering is an excellent investment in your future. Find out more about costs, scholarships and other funding opportunities. Learn About Funding Request Information Fill out our form to learn more about graduate programs at Penn Engineering. Request Information Facebook Twitter YouTube LinkedIn Instagram University of Pennsylvania ©2024 | Privacy Policy Report Accessibility Issues and Get Help | Report Website Issues"
}