{
  "id": 10,
  "date": "2024-05-18T18:09:25.727720",
  "url": "https://www.vet.upenn.edu/education/admissions",
  "university_name": "University of Pensylvania",
  "title": "Education at Penn Vet",
  "content": "UPENN About Who We Are Campuses News Room Diversity at Penn Vet Our History Events Education VMD Admissions Incoming VMD Students Graduate Programs Dual Degree Programs Continuing Education Clinical Training Research Training Accreditation Research Areas of Research Centers, Laboratories & Initiatives Clinical Trials | VCIC Academic Departments Core Resources & Facilities News, Events & Conferences One Health Giving Meet the Team People Faculty Faculty/Clinician Search Alumni Find a VMD Contact Penn Vet Vet Hospitals New Bolton Center Care for horses & livestock/farm animals Emergencies Appointments Clinical Services Diagnostic Laboratories Facilities Get Directions News & Events Referring Veterinarians Ryan Veterinary Hospital Care for cats, dogs & other companion animals Ryan Hospital Guidelines Emergencies Appointments Clinical Services Diagnostic Laboratories Facilities Get Directions About Ryan Hospital Referring Veterinarians Contact New Bolton Center Kennett Square, PA Emergencies & Appointments: 610-444-5800 Directions Ryan Hospital Philadelphia, PA Emergencies: 215-746-8911 Appointments: 215-746-8387 Directions facebook instagramm LinkedIn Home Education Education at Penn Vet Penn Vet is a world leader in educating future veterinarians and researchers, setting the standard in curricular excellence. We define tomorrow's veterinary leaders through the diversity and breadth of our educational offerings. Since the first graduating class in 1887, Penn Vet has had more than 6,000 veterinarians pursue careers like, veterinary medicine, research, and public health. They have done so in both private and non-profit sectors such as pharmaceutics, biotech, and public policy. The majority of Pennsylvania's practicing veterinarians are Penn Vet grads. Their most vital tasks include ensuring food safety, and care to our animal agriculture industry. Take that next step in making an impact. For students like Alexis Massey (V’26) and David Vega (V’26), the impact of a scholarship lasts far beyond the four years it takes to earn a VMD; it is a gift that transcends a lifetime. Discover the many aspects of education at Penn Vet VMD Admissions Looking to study at Penn Vet? Visit our Admissions section... The VMD Curriculum The VMD Curriculum is unique. Find out how it works... Financial Matters Learn about costs, tuition, fees, and how to pay for your education... Student Life There's more to school than class. Check out student life options... Graduate Programs Interested in animal welfare? Explore our graduate programs... Dual-Degree Programs Reach beyond your VMD. Look into dual-degrees... Continuing Education It doesn't end with a VMD. Learning is a life-long pursuit... Supplemental Information Form Access the Supplemental Information Form System now... Questions? admissions@vet.upenn.edu or 215-898-5434. Penn Vet Accreditation Read about Penn Vet's Accreditation... Resources Apply to Penn Vet Maps & Directions Contact Penn Vet Accreditation Careers Penn Vet Library Staff Portal Emergency Information Student Portal Connect Facebook Flickr LinkedIn YouTube RSS Legal Report Accessibility Issues and Get Help Copyright Info Privacy Disclaimer ©2024 University of Pennsylvania, School of Veterinary Medicine 3800 Spruce Street - Philadelphia, PA 19104"
}