{
  "id": 10,
  "date": "2024-05-18T18:10:20.410311",
  "url": "https://www.sas.upenn.edu/graduate-division",
  "university_name": "University of Pensylvania",
  "title": "Graduate Division",
  "content": "Skip to main content School of Arts and Sciences - University of Pennsylvania University of Pennsylvania School of Arts & Sciences College of Arts & Sciences Graduate Division College of Liberal & Professional Studies Search Search Menu School of Arts and Sciences - University of Pennsylvania SAS_logo_white-sticky Graduate Division About Dean's Welcome History Contact Programs Graduate Groups Certificate Programs Summer Research-Early Identification Program Ivy+ Exchange Scholar Program News & Announcements Current Students Principles for Graduate Teaching and Mentorship Dissertation and Theses Deposit Policies Funding Resources & Support Reporting Concerns 2024 Commencement Ceremony The Graduate Division of the School of Arts & Sciences Presents: Graduate School in 3, 2, 1 Prospective Students Application Information Admissions FAQ Explore Philadelphia Diversity & Inclusion Search Graduate Division We’re the Graduate Division Home to more than 30 graduate groups spanning the humanities and social and natural sciences, the Graduate Division at Penn Arts & Sciences is here to support your research. Create New Knowledge Home to expert faculty, archives, and state-of-the art equipment, Penn Arts & Sciences will help you grow into a leader in your field. At the Frontiers Our graduate groups offer a rigorous education, guiding students as they pursue advanced research and begin to make their own original contributions at the frontiers of knowledge. Previous Next 1 / 3 News & Announcements Previous Next 1 / 2 SAS Graduate Division Ceremony: Featured Graduation Speakers The Graduate Division is pleased to announce that our keynote speaker for graduation 2024 will be Professor Dorothy Roberts. View Article 2024 Penn Grad Talks Winners Congratulations to this year's winners of Penn Grad Talks! View Article At Ben Talks NYC, A Journey from Ocean Depths to Outer Space In a room overlooking New York's Bryant Park, more than 200 alums heard from scientists studying coral reefs, fractures on the Earth's surface, and the expansion of the universe. View Article A Conversation About Free Speech In the first Living the Hard Promise event from Penn Arts & Sciences, Sophia Rosenfeld, Walter H. Annenberg Professor, spoke with Associate Dean for Graduate Studies Beth S. Wenger about the purpose, history, and challenges of open expression on campus. View Article Graduate Division 2024 Commencement Ceremony Mark your calendars! View Article 2023 SAS Dean's Scholars Penn Arts & Sciences has named 9 students from the Graduate Division as 2023 Dean's Scholars. This honor is presented annually to students who exhibit exceptional academic performance and intellectual promise. View Article 2024 Commencement The 2024 Commencement Ceremony for Master's and PhD recipients will take place on Friday, May 17, 2024, in Irvine Auditorium. We will live-stream the event on the linked page below for anyone who cannot attend in person. We look forward to celebrating the class of 2024! Graduation 2024 Information Grad Students in the News Previous Next 1 / 2 Uniting passions for architecture, preservation, and the Near East Marc Marín Webb, who studied architecture in Berlin and Barcelona, is studying the impact of genocide on the built heritage of the Yezidi community in Iraq. View Article Penn’s ‘philosophers in residence’ engage Philadelphia youth with the hard questions Ph.D. students Jacqueline Wallis and Afton Greco are embedded at the Academy at Palumbo in South Philadelphia, where they give philosophy lessons on curriculum-relevant topics and run an after-school Philosophy Club. View Article In Japan, teaching a multitude of creative anthropology practices Penn anthropologists in the Center for Experimental Ethnography led workshops at Ritsumeikan University on performance, film, mapping, sound, and collaging. View Article Finding new ways to evaluate voters’ beliefs In his dissertation research, joint communication and political science doctoral student Nicholas Dias searches for new ways to gauge voter competency. View Article Race and Romance Sociology Ph.D. candidate Olivia Hu is studying how people choose romantic partners across race lines, and how those relationships affect their understandings of social difference. View Article Lessons From 17th Century \"New Netherland\" Through study of the fur and wampum trade between the Lenape and Dutch in the 1600s, fourth-year history Ph.D. candidate Molly Leech is aiming to recenter Indigenous contributions to global trade. View Article Graduate Groups Learn about our 33 graduate groups in the humanities and social and natural sciences. Learn more Penn Grad Talks Penn Grad Talks is an annual TED Talk-style event where Penn Arts & Science grad students showcase their knowledge and research while competing for prizes. Watch the 2024 presentations College of Arts & Sciences Graduate Division College of Liberal & Professional Studies Quick School Links Penn Arts & Sciences A-Z Academic Departments Faculty Index Computing Resources for Faculty Penn Resources Libraries Directory Calendar News Donate Contact Us Copyright © 2024  The Trustees of the University of Pennsylvania Report Accessibility Issues and Get Help Penn Weblogin"
}