{
  "id": 10,
  "date": "2024-05-20T13:15:27.953732",
  "url": "https://www.dental.upenn.edu/admissions-academics/",
  "university_name": "University of Pensylvania",
  "title": "",
  "content": "News & Events Contact Alumni Continuing Education Give About Us HR & Faculty Affairs Inside PDM Search: Submit Search Menu Admissions & Academics DMD Program Admissions DMD Curriculum Clinical Education Community Outreach / Service Learning Honors Program Dual-Degree Options Leonard Davis Institute Summer Research Fellowship Tuition & Fees Prospective Student Learning Opportunities National & International Externships Close Graduate Dental Education Programs Admissions Advanced Education in General Dentistry Program Endodontic Program Oral Medicine Residency Program Oral Maxillofacial Surgery Residency/M.D. Orthodontic Program Pediatric Dentistry Program Periodontic Program Periodontic/Orthodontic Program Dual Periodontics Prosthodontics Program Prosthodontic Program Close Advanced Graduate Degree Programs Doctor of Science in Dentistry Master of Advanced Dental Studies (MADS) Master of Oral Health Sciences (MOHS) for Non-U.S.-Trained Dentists Master of Oral Health Sciences (MOHS) for Predental Track Students Master of Science in Oral and Population Health (MOPH) Master of Science in Oral Biology Close Program for Advanced Standing Students Admissions Requirements Tuition and Fees Close Bio-Dental Consortial Programs for High School Students Bio-Dental Consortial Programs for High School Students Close Financial Aid DMD Financial Aid and the Dean’s Scholarship Federal Loan Options General Student Scholarship and Loan Repayment Programs Minority Student Scholarships International Student Scholarships Close Technical & Health Standards Technical & Health Standards Close Office of Faculty Diversity & Mentorship Office of Faculty Diversity & Mentorship Close Faculty Search Faculty Search Close Academic Calendar Academic Calendar Close Close Student Life Career Services Office Student Housing Student Health and Wellness Student Organizations University Life Living in Philadelphia International Dental Student Exchange Program Close Departments Basic & Translational Sciences Endodontics Oral Medicine Oral and Maxillofacial Surgery / Pharmacology Orthodontics Periodontics Preventive & Restorative Sciences Division of Community Oral Health Division of Pediatric Dentistry Division of Restorative Dentistry Close Multicultural Affairs Office of Multicultural Affairs & Inclusion Office of Faculty Diversity & Mentorship Statement on Inclusion Policy on Diversity Resources Close Global Center for Integrative Global Oral Health International Dental Student Exchange Program Close Research Research Overview Research Programs Talking Research Research Day ACCE Day Close Center for Innovation & Precision Dentistry About Our Team & Partners Research & Technologies Training & Education CiPD Symposium Funding Resources Support News & Events Close Center for Clinical and Translational Research About Us Research Projects Close Center for Integrative Global Oral Health Cochrane Oral Health Collaborating Center at Penn Dental Medicine About Us Leadership/Faculty Lecture Series Education Publications Oral & Planetary Health Policies at Penn Dental Medicine A Stakeholder Dialogue – Accelerating Oral Health Research and Evidence-informed Policies in the WHO African Region Close Care Center for Persons with Disabilities Personalized Care Suite Care Center for Persons with Disabilities Personalized Care Suite Close Student Research Summer Research Basic & Translational Research Honors Program Research Advisors Student Research Group Summer 2023 Student Researchers Close Core Facilities Live Cell Imaging Core Tissue Processing Laboratory Transmission Electron Microscope Close OMS Research Collaborative OMS Research Collaborative Close Research Support and Services Research Support and Services Close Close Patient Care News & Events Contacts / Visitor Info Alumni Continuing Education Giving Opportunities About Us Human Resources Inside PDM Home // Admissions & Academics Admissions & Academics Along with its DMD program, including dual-degree opportunities through other Penn graduate program, Penn Dental Medicine offers postgraduate training in all the dental specialty areas as well as Master of Science in Oral Biology and Doctor of Science in Dentistry degrees. In addition, the School’s advanced graduate degree programs include a Master of Oral Health Sciences for both DMD track students and non-U.S.-trained dentists . Its academic programs also include a Program for Advanced Standing Students for internationally-trained dentists. DMD Degree Program DMD students gain a thorough grounding in the latest clinical techniques and emerging technologies in diverse clinical settings. Graduate Dental Education Programs Residents pursue postgraduate training in all the dental specialties with the opportunity to combine their specialty training with a Master of Science in Oral Biology or a Doctor of Science in Dentistry (DScD). Students Program for Advanced Standing Students Internationally-trained dentists earn a DMD in two years, preparing to practice in the United States. Advanced Graduate Degree Programs Master of Oral Health Science programs for both DMD-track students and non-U.S.-trained dentists. Bio-Dental Consortial Programs for High School Students Qualified students earn both their BS and DMD degrees in seven years. Financial Aid and Scholarships Academic Calendar Accreditation Status A statement on the Penn Dental Medicine programs accredited by the Commission on Dental Accreditation. Careers Calendar Library Inside PDM Maps Support Penn Dental The Robert Schattner Center, University of Pennsylvania, School of Dental Medicine 240 South 40th Street, Philadelphia, PA 19104-6030 © Copyright 2024 Penn Home Disclaimer Privacy Policy Report Accessibility Issues Emergency Services Report Copyright Infringement Facebook Twitter Instagram Youtube LinkedIn"
}