{
  "id": 10,
  "date": "2024-05-18T18:09:23.061513",
  "url": "https://www.law.upenn.edu/admissions/",
  "university_name": "University of Pensylvania",
  "title": "A dynamic, cross-disciplinary legal education",
  "content": "Skip to main content For Alumni For Students For Faculty For Staff Library Support the Law School Search Consumer Information (ABA Required Disclosures) Search Penn Carey Law Academics A dynamic, cross-disciplinary legal education Academics Degree Requirements Joint Degrees & Certificates Legal Practice Skills Registrar Clinics & Externships Journals Academic Support Program International Affairs Future of the Profession Initiative Legal Education Programs Executive Education Academic Calendar Learning Outcomes Advocacy Competitions Admissions Begin your journey Admissions JD Admissions LLM & Graduate Programs Master in Law Financial Aid Visiting Penn Carey Law ABA Careers Fostering the professional success of students and alumni Careers For Current Students For Employers For Alumni Employment Statistics Calendar Equity & Inclusion Cultivating a diverse and inclusive intellectual community Equity and Inclusion Access Anti-Bias Support & Reporting Toolkit Anti-Bias Programs Dialogue Initiatives Sadie Scholars Program Resources Community Voices Events Our Team Faculty & Research Transformative work from renowned interdisciplinary scholars Faculty & Research Faculty Directory Research & Scholarship Centers & Institutes Academic Fellowships Faculty In the News Public Interest A community anchored in service Public Interest Toll Public Interest Center Pro Bono Public Interest Events Government Support for Public Interest Seeking Pro Bono Services? Clinics & Externships News The intellectual vitality of our community News Recently Featured In the News Calendar Faculty Perspectives Pathways to the Profession Academics Degree Requirements Joint Degrees & Certificates Legal Practice Skills Registrar Clinics & Externships Journals Academic Support Program International Affairs Future of the Profession Initiative Legal Education Programs Executive Education Academic Calendar Learning Outcomes Advocacy Competitions Admissions JD Admissions LLM & Graduate Programs Master in Law Financial Aid Visiting Penn Carey Law ABA Careers For Current Students For Employers For Alumni Employment Statistics Calendar Equity and Inclusion Access Anti-Bias Support & Reporting Toolkit Anti-Bias Programs Dialogue Initiatives Sadie Scholars Program Resources Community Voices Events Our Team Faculty & Research Faculty Directory Research & Scholarship Centers & Institutes Academic Fellowships Faculty In the News Public Interest Toll Public Interest Center Pro Bono Public Interest Events Government Support for Public Interest Seeking Pro Bono Services? Clinics & Externships News Recently Featured In the News Calendar Faculty Perspectives Pathways to the Profession For Alumni For Students For Faculty For Staff Library Support the Law School Consumer Information (ABA Required Disclosures) Home Admissions Your Future Begins Here Admissions JD Our JD program offers a unique, highly experiential education that is well-respected across the globe, with graduates that go on to lead their fields in private, public, government, and academic work. JD Admissions How to Apply Entering Class Profile Financial Aid Master in Law For emerging and established professionals and graduate students who want a world-class, cross-disciplinary education around their area of interest and the law. ML Admissions How to Apply FAQs Financial Aid LLM & Grad Programs Our world-renowned LLM Program educates leading lawyers, judges, diplomats and scholars from across the globe. LLM SJD LLCM Financial Aid Connect with Us Our Penn Carey Law Admissions team looks forward to speaking with prospective applicants virtually this Fall. While we are unable to welcome visitors in the building at this time, we are pleased to offer a variety of online resources that delve into the admissions process and the Penn Carey Law community. Most events require registration to attend so please take the time to register where appropriate. All times are ET unless otherwise indicated. JD LLM & Grad Program Master in Law Committed to Equity & Inclusion The Law School is committed to an inclusive, impactful, and innovative legal education where unique perspectives and backgrounds together make our community prepared to tackle the most pressing legal issues. Learn more our Office of Equity & Inclusion Explore the University Take a stroll down Locust Walk, sit and chat with Ben on the Bench, cheer on the Quakers, and become a part of Penn’s many unique and historic traditions. Explore Penn Reach Out to Us Master in Law (ML) Executive Director, Master in Law Program master@law.upenn.edu JD Admissions contactadmissions@law.upenn.edu LLM & Graduate Programs gradadms@law.upenn.edu University of Pennsylvania Carey Law School 3501 Sansom Street Philadelphia, PA 19104 215.898.7483 Centers & Institutes Library Academic Calendar Event Calendar Administration Penn Contact Support Us Jobs Copyright 2024 University of Pennsylvania Carey Law School. All Rights Reserved. Report Accessibility Issues and Get Help | The Fine Print Site Login"
}