{
  "id": 10,
  "date": "2024-05-20T13:15:16.204094",
  "url": "https://diversity.upenn.edu/",
  "university_name": "University of Pensylvania",
  "title": "Diversity and Inclusion",
  "content": "Skip to main content Go to site search Go to primary navigation Go to resources navigation Toggle Site Navigation Toggle Site Search Diversity at Penn More Diversity at Penn Facts and Figures Policies Reporting Forms More Reporting Forms Bias Incident Reporting Form Inclusive Best Practice Form Reports Stories Timeline Programs More Programs Academic Programs Administrative and Co-Curricular Diversity Offices, School Specific Initiatives and Student Organizations Resources More Resources Affiliated With Resource Centers Arts Organizations Religious Organizations School-Affiliated Organizations Student Affairs Student Government, Consultation Councils and Advisory Boards News & Events More News & Events Events News Videos Toggle Site Search Resources Current Students Faculty & Staff Parents Alumni Visitors A-Z Directory Webmail Services Penn Home Search Search Close Diversity and Inclusion University of Pennsylvania Across 12 Schools, more than 25,000 students, and more than 4,000 faculty members, we become one university: a wide-ranging, ever-changing community that draws its strength from a multitude of races, ethnicities, genders, sexual orientations, historical traditions, ages, religions, disabilities, veteran status, interests, perspectives, and socioeconomic backgrounds. Featured Programs & Resources Supplier Diversity and Inclusion Program Fueling Business Growth is tied to a multi-faceted action plan aimed at strengthening relationships, and expanding access to resources, with local, diverse and minority-owned businesses. Projects for Progress - Office of Social Equity and Community Penn’s Projects for Progress was launched in 2020 and has awarded funding of up to $100,000 to support the efforts of teams of students, faculty, and staff designed to promote equity and inclusion and to make a direct impact in Philadelphia. iCommunicate Intercultural Training ISSS (International Student & Scholar Services) offers 3 tracks of iCommunicate trainings. Request a training for your group, office or department. Open to all Penn students, scholars, faculty and staff. Greenfield Intercultural Center (GIC) For 35 years, GIC has served as Penn’s resource for enhancing student’s intercultural knowledge, competency, and leadership. The center offers experiential courses for credit, signature intercultural programs, and other services related to diversity and intercultural education. A Brief Overview of Antisemitism Read the report Penn Medicine Service in Action - Community Impact Report Annual report News & Events President’s Engagement  and President’s Innovation Prizes Communities for Childbirth, founded by Seungwon (Lucy) Lee C’23, was among the 2023 President’s Engagement and President’s Innovation Prize winners. The international organization empowers maternal and child health in Jinja, Uganda. Penn & Slavery Augmented Reality App The student-developed app takes users on a tour of slavery's legacy at Penn in six stops, each telling a story through an augmented reality (AR) experience. The tour relates to specific locations on Penn's University City Campus. Dinners Across Differences The University launched a new initiative - Dinners Across Differences - which strives to encourage dialogue and bring people together in informal conversations over shared meals. The dinners will be organized within one School to discuss issues of importance and interest to that School’s community. More information will be forthcoming. School of Arts and Sciences 60-Second Lectures In 2023 topics ranged from antisemitism to genetic ancestry tests and race. Disclaimer Emergency Services Privacy Policy Report Accessibility Issues and Get Help Report Copyright Infringement Philadelphia, PA 19104 Telephone: (215) 898-5000"
}