{
  "id": 10,
  "date": "2024-05-18T18:09:15.751632",
  "url": "https://www.publicsafety.upenn.edu/contact/",
  "university_name": "University of Pensylvania",
  "title": "Large Demonstration",
  "content": "UPennAlert Large Demonstration UPennAlert: Large demonstration in the area of 30th and Market Streets. The group is continuing to travel west on Market Street. Increased police activity in the area. Police on scene, use caution, avoid the immediate area. ————————- Know that it is never the fault of the person impacted (victim/survivor) by crime. Please call 215-573-3333 in any emergency. The Division of Public Safety has developed a few helpful risk reduction strategies outlined below. Stay out of immediate area. Stay alert and reduce distractions; using cellphones, ear buds, etc. may limit your awareness. Orient yourself to your surroundings. (Identify your location, nearby exits, etc.) Utilize 24/7/365 Walking Escort services (215-898-WALK/9255). Only carry necessary documents. Keep your valuables out of sight. Read More The Division of Public Safety will continue to ensure the highest level of safety and security for our community. See something concerning? Connect with Penn Public Safety 24/7 at 215-573-3333. Worried about a friend or colleague’s mental or physical health? Get 24/7 connection to appropriate resources at 215-898-HELP (4357). Seeking support after experiencing a crime? Call Special Services – Support and Advocacy resources at 215-898-4481 or email an advocate at *protected email* Use the Walking Escort and Riding services available to you free of charge. Take a moment to update your cellphone information for the UPennAlert Emergency Notification System Download the Penn Guardian App which can help Police better find your location when you call in an emergency. Access free self-empowerment and defense courses through Penn DPS. Emergencies 215-573-3333 / 511 (campus phone) General Information 215-898-7297 Special Services 215-898-4481 (215-898-6600 off-hours) HELP Line 215-898-HELP (4357) DPS Headquarters 4040 Chestnut Street,\n                                            Philadelphia, PA 19104 Update UPennAlert Info PennGuardian Registration Walking Escort 215-898-WALK (9255) Penn Transit Ride 215-898-RIDE (7433) Menu Back Close Site Navigation SubMenu Title About DPS About Our Division DPS Leadership Our Mission Diversity, Equity, & Inclusion UPPD Information and Statistics News and Events Departments Office of the Vice President Finance & Administration Fire & Emergency Services Information & Security Technology PennComm Emergency Communications Center Penn Police (UPPD) Security Services Special Services Emergency Preparedness UPennAlert Emergency Notification System About PennReady Emergency Procedures Emergency Procedures Bulletins Clery Act Clery Act & Crime Reporting Crime Log Public Safety Services DPS Top 10 List 24/7 Walking Escort Service Penn Alternative Response Unit (AR-1) Penn Guardian The HELP Line Self-Defense & Empowerment Courses Learn DPS Top 10 List Safety Strategies Videos Contact DPS Location & Contact Information DPS Forms Search Division of Public Safety Headquarters 4040 Chestnut Street, Philadelphia, PA 19104 Emergencies: 215-573-3333 511 (campus phone) General Information 215-898-7297 More Contact Info Update Your UPennAlert Info Register for PennGuardian Opens in a new window Opens an external site Opens an external site in a new window Opens a file in a new window Contact Public Safety Emergencies: 215-573-3333 Send us a message! Call 215-573-3333 if you need immediate assistance. We encourage you to share your contact information so we may follow up with you about your question or concern. This form is reviewed during business hours; we will respond within 2 business days. What type of comment would you like to leave? Question Comment Concern What about us would you like to comment on? Enter your comments in the space below: Tell us how to get in touch with you (optional): Name First Last Email Phone Hidden D0 N0t F1ll In Check Me CAPTCHA Emergencies 215-573-3333 511 (campus phone) General Information 215-898-7297 Special Services 215-898-4481 (215-898-6600 off-hours) HELP Line 215-898-HELP (4357) DPS Headquarters 4040 Chestnut Street, Philadelphia, PA 19104 Walking Escort 215-898-WALK (9255) Penn Transit Ride 215-898-RIDE (7433) UPennAlert PennGuardian Contact Us Another Way Send Us Feedback Special Event Security Request Form Records Requests Self-defense and Empowerment Courses Request a Special Property Check Presentation Request Form Student Project Request Form Silent Witness Form Police Complaint Form Report a Crime Commend a Member of DPS Annual CSA Clery Crime Form for 2023 Statistics Foreign Language The Division of Public Safety’s PennComm operations center supports non-English speakers with the use of AT&T’s Language Line, which permits ESL speakers to contact the emergency number (215/573.3333) and communicate with an emergency dispatcher in over 120 different languages. Additionally, the Language Line can be employed by any UPPD officer in a face-to-face interaction, where the ESL speaker can request to communicate to the Penn Police in his/her own native language via a phone call. Administrative Directory Office of the Vice President 215-898-7515 Anderson, Kathleen Shields Vice President for Public Safety 215-898-7515 Greenberg, Nora Nienhagen Chief of Staff 215-898-7517 Ritchey, Stacy Lutner Director, Communications 215-746-3811 Fleming, Brandi Falco Executive Assistant 215-898-7515 Finance & Administration 215-898-6696 Melleby, William Director, Finance and Administration 215-898-6696 Doyle, Michael Business Administrator 215-898-4606 Pringle, Tracy HR Coordinator (215) 898-8855 Tokarczyk, Gregory Building Administrator 215-898-0429 Tyler, Leslie Finance Administrative Coordinator 215-898-6445 Fire & Emergency Services 215-573-7857 Janda, Eugene Chief, Fire & Emergency Services 215-898-6922 Baldini, Christopher Safety Specialist 215-898-2389 Bickel, Stephen Safety Specialist 215-573-7858 Chris Abate Safety Specialist 215-573-5662 Comas, Joseph Deputy Chief 215-898-6921 Farrington, Laura Project Coordinator 215-746-7472 Gonzalez, Daniel Safety Specialist 215-573-7810 Nieves, Michelle Administrative Coordinator 215-573-7857 Poissant, Matthew Safety Specialist 215-573-6686 Seeger, Joseph Safety Specialist 215-573-8259 Penn Police Department 215-573-3333 Williams, Gary Chief of Police 215-898-9935 Belisairo, Michael Captain, Commanding Officer of Staff and Administrative Services 215-898-4607 Bittner, William Lieutenant 215-573-6684 Busch, CaseyAnn Lieutenant, Commanding Officer of Logistics and Special Events 215-573-6684 Detective Department 215-898-4485 Dougherty, Michael Lieutenant 215-573-6684 Farrell, Theodore Detective Supervisor 215-573-9220 Ferdman, Joseph Lieutenant 215-573-6684 Guercio, Paul Detective Supervisor 215-573-9292 Malloy, Andrew Lieutenant, Administrative Commander 215-573-6684 Marano, Joseph Records Management System Administrator 215-573-1355 Marcial, Jennifer Senior Records Administrator 215-898-4482 Morrin, Michael Deputy Chief of Investigations 215-898-9010 Morrison, Diedre Administrative Coordinator 215-898-9935 Mosley, Dennis Sergeant, Court Liaison & Fleet Management 215-898-9002 Quigley, Patrick Detective, JNET CLEAN/TAC Officer 215-898-7252 Records Department 215-898-4482 Vandervort, Christian Captain, Patrol Operations 215-898-0292 Visco, Nicole Sergeant, Professional Standards and Training Supervisor 215-573-5681 Walker, Dinorah Detective, UPPD Training Coordinator 215-898-7856 Watson, Jovanne Records Administrator 215-898-4482 Wood, Derrick Deputy Chief, Police Operations 215-746-0127 PennComm 215-898-9441 Corcoran, Matthew Director, PennComm Emergency Communications Center 215-573-8515 Boyd, Sandy Training Supervisor 215-898-6527 Special Services 215-898-4481 (215-898-6600 off-hours) Wigginton, Paige Director, Special Services 215-898-4481 Cardella, Tracy Victim Advocate 215-898-9001 Dever, Susan Support Specialist 215-898-8762 Watson, Perdetha Detective / Safety & Education 215-573-3253 Zebley, Kyhisha Sergeant / Outreach & Case Management Officer 215-898-2762 Security Services 215-573-6670 Forman, Josh Director of Security Services 215-573-0644 Duch, Chanda Administrative Coordinator 215-573-6670 Toombs, Sidney General Manager / Allied Universal Security Services 215-573-9225 Security Technology 215-573-6670 Fox, George V. Executive Director, Information and Security Technology 215-898-4484 Duch, Chanda Administrative Coordinator 215-573-6670 Fleming, Ian Systems Administrator 215-573-9784 Kern, David Associate Director 215-898-9528 Leddy, John Sr. Security Systems Administrator 215-573-3847 Nguyen, Kiem Systems Administrator (215) 573-8258 Wenzel, John Security Tech Proj. Manager (215) 573-7801 Williams, Mark Project Manager 215-898-6269 Zharko, Stas IT Support Specialist 215-573-8038 Stay in Touch with DPS! Sign up for special announcements, traffic advisories and more. Subscribe 4040 Chestnut Street Philadelphia, PA 19104 Emergencies 215-573-3333 | 511 (campus phone) General Information 215-898-7297 UPennAlert PennGuardian Visit Our Twitter Page Visit Our Instagram Page Explore About DPS Emergency Preparedness Safety Resources News and Events Contact Search Report Accessibility Issues and Get Accessibility Help Departments Office of the Vice President Finance & Administration Fire & Emergency Services Penn Police Department PennComm Emergency Communications Center Security Services Information & Security Technology Special Services"
}