{
  "id": 10,
  "date": "2024-05-20T13:15:19.765484",
  "url": "https://penntoday.upenn.edu/news/talking-admissions-whitney-soule",
  "university_name": "University of Pensylvania",
  "title": "",
  "content": "Skip to main content Open Search Bar Close Search Penn Today Logo Open Navigation Menu Arts, Humanities,\n            & Social Sciences Sports Campus & Community Education, Business, &\n            Law Health Sciences Science & Technology Search Search Icon Topics Arts,\n                Humanities, & Social Sciences Sports Campus &\n                Community Education,\n                Business, & Law Health Sciences Science &\n                Technology News News Archive Penn in the News Newsletters Announcements University Communications Staff University Communications website Penn Home A-Z Directory Calendar Maps Offices and\n                Services Webmail Events See all → 5/18 Hands on History The Center for the Analysis of Archaeological Materials welcomes 11th and 12th grade students to examine the materials and techniques used in ancient mold making. This event is free to high school students; lunch is provided. 10:00 a.m. - 2:30 p.m. Penn Museum, 3260 South St. 5/20 268th Commencement The 268th Commencement at the University of Pennsylvania will feature the conferral of degrees, the awarding of honorary degrees, greetings by University officials, and remarks by Commencement speaker Siddhartha Mukherjee, a renowned physician, researcher, and best-selling author. All Day Franklin Field 5/23 Vahe Sarkissian Vahe Sarkissian, who plays Armenian music and electric guitar, performs inside The Lounge. 8:00 p.m. World Cafe Live, 3025 Walnut St. 6/28 Wawa Welcome America Day As part of Wawa Welcome America, the largest July 4th celebration in the U.S., Penn Museum offers free admission to its galleries. Online reservations are required. 10:00 a.m. - 5:00 p.m. Penn Museum, 3260 South St. Close Open Search Bar Close Search Penn Today Logo Talking admissions with Whitney Soule Penn Today Logo Open Navigation Menu Search Search Icon Campus & Community Talking admissions with Whitney Soule As vice provost and dean of admissions, Soule is challenged daily with thinking strategically about undergraduate enrollment at Penn—from recruitment to application processes and all that goes into admitting a class, to how financial aid and retention fits into the mix. Whitney Soule, vice provost and dean of admissions. (Image: Lisa Godfrey) More than three decades ago, Whitney Soule started working in admissions at Bates College, her alma mater. She didn’t know it at the time but it would become her lifelong passion, a career that has led her to Connecticut College and Bowdoin College, and now to Penn . As Penn’s vice provost and dean of admissions, a role she took on last July, she is challenged daily with thinking strategically about undergraduate enrollment at the University—from recruitment to application processes and all that goes into admitting a class, to how financial aid and retention fits into the mix. It is a complex job she doesn’t take lightly, but it’s still one she appreciates every day. “I hope everybody loves their job, but I really do think my job is the best,” Soule says. At the end of March, Soule announced the regular decision admits for the Class of 2026 , which help build, ultimately, a class of 2,400 students across Penn’s four undergraduate schools. Soule said the University’s 270th class is a standout because of the students’ “intellect, character, integrity, and persistence.” “We read through nearly 55,000 applications—55,000 individual stories—to get to this point,” Soule says. “The 2,400 who will come here are creating a new chapter for Penn.” Soule sat down with Penn Today to talk more about the University’s newest class, how the admissions office works, what pressing challenges exist in the field today, and much, much more. Talk to me a bit about yourself and how you got into admissions work. Right when I graduated from undergrad, I worked for the American Red Cross for about a year in Maine, and then took a job with Bates College, my alma mater, in the admissions office. When I was a student at Bates, I did all the things—I was an overnight host for visiting students, I was a tour guide, and I was on hand for different admissions events where they needed student points of view or student support. I really enjoyed it. The first position that I had in admissions at Bates was meant to be a nine-month role, because somebody was leaving unexpectedly in August, and they needed to hire somebody to get through that academic year. I immediately loved everything about it. I also had a dean who was great with staff development and introducing us to the different aspects he had to think about as a dean. I got exposure as a new staff person to the idea of not just how we recruit, but also where we recruit, how to read, how we choose, and how all those things influenced getting a class that Bates was looking for. I found all of that intricacy to be really stimulating and 30 years later, here I am. What specifically led you to Penn? I had spent my whole career working for small, residential liberal arts colleges. That was my undergraduate education and I really endorse that environment and that kind of education delivery. Yet Penn was really attractive as an opportunity because of its scale. My work and my leadership development has evolved over time around thinking about inclusive practices and determining better ways of building out a pathway to higher education. In particular, considering how selective institutions can be adaptable and mindful as we are thinking more broadly about the potential. Coming to Penn with its history, reputation, and resources represented an opportunity for impact greater than anything I could have imagined. It’s a really enticing and stimulating opportunity. When speaking with then-President Amy Gutmann and then-Provost Wendell Pritchett about this role, and their emphasis on impact, innovation, and inclusion, I was like, ‘That’s my heart.’ Those three pillars mean so much to me and if that’s the pulse of Penn, then I want in on that. When it comes to college admissions at Penn or in general, what are the biggest challenges being faced today? There are so many. I think one of the longstanding challenges that requires our full attention is the cost of attending and completing a four-year degree, whether that is at Penn or an entirely different kind of institution. Cost is so tied to opportunity and completion, and so the more resourced an institution is in being able to support students financially—to attract them, enroll them, and then help them financially sustain their experience—is really, really critical. We have to be able to get the financial piece right to be behind our ideas for access. There are incredibly motivated, curious, and intellectual young minds all over the world, and if they don’t see higher ed or don’t see Penn as a place they can communicate with, we can’t show them how affordable it can be. Recruitment is a big part of admissions, right? Yes, and recruitment has so many components to it. Some aspects are very straightforward where we are connecting directly with students. We are doing programming with high schools, we are going to college fairs, we are getting ourselves to where the students are and bringing the information and the resources and the conversation to them. With COVID, a lot of that has been done virtually, too, which has added a degree of accessibility, which we will keep even post-pandemic. We are also working closely with organizations that are connected to students. We have relationships with organizations like QuestBridge , which does recruitment and outreach to students who are primarily low income and likely to be first generation to college. We connect with them as a partner school and they connect us to students. We also work with College Horizons, an organization that supports Native American students on the path to college. We purchase names through a number of different sources and do what you might think of cold calling outreach, where we send electronic or paper materials. Plus so many more outreach efforts. What are some ways you’ve seen college admissions change over your career? There have been a lot of things that are responding to the opportunity of technology. Back in the early ’80s the Common Application began to be used—at the time it was a paper application—which allowed students to use one application to apply to a number of schools, to cut down on some of the repetitive work for students. This made it more comfortable for students to apply to more schools, but at that point students were still more likely to only be applying to schools that they knew either because they knew somebody who went there or somebody that they trusted had told them about it, or they had heard about it in the news. Other than that, there were guidebooks to search for institutions. When things became available on the web, it was easier for students to start to learn about places they’d never heard of before. It also became easier when applications went online to apply to more places. More and more schools accepted the Common Application, which meant that students could then apply to more schools than they had before. This has a benefit of accessibility, which is critical. It also has made application pools larger, which diminishes the admit rate, which makes people feel anxious, so students apply to more places, and so on. The anxiety about whether it’s possible to get in is mostly wrapped around a small proportion of schools, those that are the most selective. In reality, the majority of higher education institutions admit a great proportion of students. Getting into an institution of higher education is not as complicated as it might sound, but it does come with a whole bunch of other complications such as cost, as I was saying earlier. So there is plenty of anxiety to spread around. A benefit of the applicant growth, though, is that we have been reaching more students who are first generation in their families to go to college, or who are low income, and those who have been underrepresented in our applicant pool. Talk a bit about the process for admissions, in sifting through applications and ultimately choosing a class? On the one hand it’s very straightforward and on the other hand, it’s very complicated. There are about 55,000 undergraduate applications, and we have an undergraduate class of 2,400. So, the most direct answer is we need to read them all and select applicants that we think are a great match for Penn. When I say ‘match’ I mean the students have a good understanding of Penn and what they might want to do when they get here, and that we understand those interests and how they might align with the Penn community. Our applicants have really interesting perspectives, ideas, and skillsets, and our goal is to learn more about them as we bring together the next incoming class. These interesting characteristics, however, represent most of the applicant pool, so that’s not easily getting us down to a class of 2,400, so we must consider more pieces. The 2,400 fill out the four undergraduate schools, each with their own enrollment size and each one of those schools has particular programs and interests that they’re developing. When we are reading, we are thinking critically about each of the school’s goals, spaces available, how they want to see this particular class this year come together, and so on. How many people at Penn are reading for a typical admissions cycle? There are 28, but it’s important to understand that our admissions office has about 60 people in it. To make what we’ve already talked about work, from recruitment to reviewing applications, it includes a highly skilled operations team that is managing finance, project and event management, client care, applicant care, technology, and more. We have a very skilled team to support recruitment and selection. We also have a marketing and communications team that is essential for us to have cogent, representative messaging and materials that are connected and helps students who are really trying to understand not just what Penn is, but how it’s different from other schools. I know financial aid is closely tied to admissions. Talk to me a bit about that. We’re not in the same reporting stream, but financial aid is so central to how we recruit, what we can say, and how students understand the opportunity of Penn. We have to communicate closely with financial aid around what our policies are and how we’re messaging them so that we are being articulate and thorough in how we are explaining the resources that are available. Having an intimate understanding of the financial aid policies and benefits is a responsibility of any admissions office. What sets Penn apart is that we are able to admit students knowing we can meet their full need entirely with grants and without assigning any loans. At the same time, we are able to help support students financially with what they might need outside of their financial aid package, too. What are some of your goals, in the short term and long term? The system by which students are applying to college was created and built decades and decades ago. The substance of what is required hasn’t really changed very much over time, even though our applicant pool has changed dramatically in important ways, representing backgrounds and points of view and opportunity areas that were not part of the original design of how to apply to college. It’s really important for us to be looking critically at how these processes serve both what we need to understand about applicants when we’re reviewing them to make sure we’re making a great selection for Penn, but also that they are serving the needs of how students can best present themselves to us for that evaluation. There is no easy answer there. For instance, nearly 1,000 schools are part of the Common Application, and hundreds share the Coalition Application, so we agree to some shared process around what an application includes. If you want to change something really significant, it is not as simple as just doing it on your own as an institution. Penn has made some slight changes, though, correct? Something Penn was able to do this year that I am proud of—and that had immediate impact—was changing our recommendation letter requirements. We used to require students to submit a school counselor recommendation and two teacher recommendations. This year, in place of the second teacher recommendation, we invited a recommendation from any adult—so while it could be from another teacher, it could be from a job supervisor or a coach or a friend’s parent. We realized during COVID, but even prior to COVID, not all students know their teachers very well, in a way that can generate the kind of specificity we’re looking for. We thought this would offer an additional avenue for students to choose people who they trusted outside of their high school teachers. This is just a small example of how there are opportunities to change, and we are open to them. I know Penn also announced this year’s newest class a bit differently than usual. At the time of releasing the admissions decisions on March 31, we did not publish or refer to our admit rate and we also did not publish or refer to some of the demographic proportions of the students that we admitted in the way that we had before. It is not that those things aren’t important—the admit rate, for example, holds a source of pride for students who’ve been admitted and it feels really special to have gotten a spot—but we also know that the admit rate decline among schools like ours is also part of this anxiety churn. It was an opportunity for us not to contribute to that at the time that we were admitting students. Instead, we took the opportunity to talk about who—really who the students are—we admitted. We referenced their commitments to research, service, jobs, and so forth rather than what they represented or how few of them were admitted. We understand that our choices have influence, and this was a way that we wanted to talk about our admitted students that was really important to us. It is also important that when students are looking at Penn, that they understand that it is a diverse place, so we know the demographic information is important. When we have our class settled, which represents who’s actually enrolling, we will be able to put that up on our website and people will be able to see what our class looks like. Are you still working on settling the class? May 2 was the deposit deadline so we usually have the majority of the class settled in at this point. Then, we’ll have some students who will ask to take a gap year, so then they’re not in this class, they will be in the next class. We have some students who might be offered an opportunity to enroll elsewhere off that school’s waitlist, and so those students leave our class. We bring some students into our class off the waitlist, if we have the room. Those last little pieces will settle over the summer. Thinking about the class as it is right now, what comes to mind? I am really excited about this class. Thinking about how we are measured externally for diversity—around our international population, our students who come from underrepresented racial and ethnic backgrounds, and our first generation to college students—this class is really going to demonstrate progress for Penn in those areas. But beyond those categories, I’m truly in awe of the applicants to Penn. I mean, just the exceptional minds of young people who have found Penn, who have connected to Penn through recruitment with us, have gone through the effort of applying, and are there for us to think about and review is truly remarkable. Thinking about the group that is becoming the class at Penn and knowing how they spend their time, what they chose to highlight in their applications, what they’re excited about when they get here, it is so human, and individual, and personal. It is one of the things I love most about the work. It’s truly thrilling, and I can’t wait to welcome these remarkable students at Convocation. Credits Lauren Hertzler Writer Date May 23, 2022 Subtopics Faculty , Admissions , Q&A Share Twitter Facebook LinkedIn Twitter Facebook Read Next Class of 2025 relishes time together at Hey Day Arts, Humanities, & Social Sciences Picturing artistic pursuits Hundreds of undergraduates take classes in the fine arts each semester, among them painting and drawing, ceramics and sculpture, printmaking and animation, photography and videography. The courses, through the School of Arts & Sciences and the Stuart Weitzman School of Design, give students the opportunity to immerse themselves in an art form in a collaborative way. Campus & Community Penn celebrates operation and benefits of largest solar power project in Pennsylvania Solar production has begun at the Great Cove I and II facilities in central Pennsylvania, the equivalent of powering 70% of the electricity demand from Penn’s academic campus and health system in the Philadelphia area. Education, Business, & Law Investing in future teachers and educational leaders The Empowerment Through Education Scholarship Program at Penn’s Graduate School of Education is helping to prepare and retain teachers and educational leaders. Arts, Humanities, & Social Sciences ‘The Illuminated Body’ fuses color, light, and sound A new Arthur Ross Gallery exhibition of work by artist Barbara Earl Thomas features cut-paper portraits reminiscent of stained glass and an immersive installation constructed with intricately cut material lit from behind. Penn Today Logo logo-new-2 If there’s news at Penn, you’ll find it here. We strive to bring you faculty, staff,\n          and student profiles, research updates, and the latest happenings on campus. Office of University Communications Suite 200 3901 Walnut Street Philadelphia, PA 19104-3608 215.898.8721 upnews@pobox.upenn.edu Facebook Instagram Twitter LinkedIn Flickr YouTube © 2024 Penn Today, University of Pennsylvania Penn Homepage Disclaimer Emergency Services Privacy Policy Report Accessibility Issues and Get Help Report Copyright Infringement"
}