{
  "id": 10,
  "date": "2024-05-20T13:15:15.611596",
  "url": "https://oaaeop.upenn.edu/resources/policies-handbooks-procedures",
  "university_name": "University of Pensylvania",
  "title": "Breadcrumb",
  "content": "Skip to main content Go to site search Go to primary navigation Go to resources navigation Toggle Site Navigation Toggle Site Search Resources More Resources Complaint Resolution Policies, Handbooks & Procedures Questions, Concerns & Complaints Self ID Laws & Regulations Accessibility More Accessibility Accommodation Services Committee for an Accessible University (CAU) Penn Accessible Transit Penn Buildings Forms Programming More Programming Training Events Recruitment More Recruitment Compliance Guidelines Hiring Officers Faculty Search Information Staff Compliance Officers Diversity Search Advisors for Faculty Community Posters About More About Contacts Toggle Site Search Resources Current Students Faculty & Staff Parents Alumni Visitors A-Z Directory Webmail Services Penn Home Search Search Close Breadcrumb Home / Resources / Policies, Handbooks & Procedures Policies, Handbooks & Procedures Office of Affirmative Action and Equal Opportunity Programs Equal Opportunity And Affirmative Action Policy The University has a number of policies and procedures that provide guidance to assure the fair and equitable treatment of members of the Penn community. The policies and handbooks listed below provide useful information in understanding the rights and responsibilities of members of our community. Equal Opportunity And Affirmative Action Policy (PDF). University of Pennsylvania Nondiscrimination Statement The University of Pennsylvania values diversity and seeks talented students, faculty and staff with diverse backgrounds, experiences and perspectives. The University of Pennsylvania does not discriminate on the basis of race, color, sex, sexual orientation, gender identity, religion, creed, national or ethnic origin, citizenship status, age, disability, veteran status or any other legally protected class status in the administration of its admissions, financial aid, educational or athletic programs, or other University-administered programs or in its employment practices. Questions or complaints regarding this policy should be directed to the Executive Director of the Office of Affirmative Action and Equal Opportunity Programs, Franklin Building, 3451 Walnut Street, Suite 421, Philadelphia, PA 19104-6106; or (215) 898-6993. Trustees Resolution Adopting a Diversity Statement RESOLVED, that the Trustees of the University of Pennsylvania adopt in principal and practice the following statement on diversity: Penn rejoices in the rich diversity of persons, groups, views, and academic disciplines and programs that grace the campus of the nation's first university. Tapping our diversity to strengthen ties across all boundaries enriches the intellectual climate and creates a more vibrant community. Fostering and nourishing this diversity, especially among students, faculty, staff, and trustees must remain central to the core missions of the University. Penn's Procedures, Policies and Handbooks provide guidance for fair and consistent treatment of everyone within the Penn community. The listing provides useful information in understanding the core mission that we strive to maintain here at Penn. University-wide Policies, Procedures and Protocols Administrative Guidelines Related to Immunodeficiency Virus Code of Student Conduct Employment Advertising Exemption from Posting Family Friendly Policies for Faculty Family Friendly Policies for Graduate Students Faculty Grievance Procedure Family and Medical Leave Act -- Penn / US Dept. of Labor Guidelines on Open Expression Long Term Disability Policy Against Retaliation -- Almanac / Human Resources Policy on Consensual Sexual Relations Between Faculty and Students Posting of Position Openings Pregnancy and Related Acts -- Pregnant Workers Fairness Act / Pump Act Principles of Responsible Conduct Search Committee Short Term Disability Sick leave / STD for positions above 29 in grades E, F, G, H Staff Grievance Procedure Student Grievance Procedure Disclaimer The University reserves the right to amend, modify, or rescind any policy and to create new policies and procedures at its sole discretion. Selected Handbooks, Manuals and Guides Expand All Collapse All OAA•EOP Hiring and Recruitment A resource for hiring officials that guides them through the recruitment and selection process. Please note that your Pennkey is needed to access this manual. Staff Affirmative Action Compliance Officers Handbook (PDF) As Staff Affirmative Action Compliance Officers, you play an important role in monitoring compliance with and disseminating information about Penn's affirmative action policies and procedures. Together, we can help ensure that search, selection and other employment activities fulfill the letter and spirit of the University's commitment to equal employment opportunity and affirmative action. This manual is designed to provide guidance regarding your responsibilities, compliance procedures, search and selection processes, affirmative action and equal opportunity regulations and related areas. Staff Affirmative Action Compliance Officers Listing (PDF) Faculty Affirmative Action Guidelines and Procedures For Faculty Appointments, Promotions and Terminations Faculty Handbook The University of Pennsylvania Faculty Handbook has been prepared in order to provide essential information concerning the philosophy, objectives and organization of the University of Pennsylvania, and the details of responsibility and procedure which are expected of members of the University Faulty. Faculty members are expected to comply with the policies and procedures contained herein. Staff Human Resources Policy Manual This is the link to the benefits and policies for University of Pennsylvania employees. Hiring Officer Staff Affirmative Action Compliance Checklist (PDF) Hiring Officer Handbook (PDF) This handbook is intended to assist Hiring Officers through the recruitment and hiring process. Each section reflects the various stages of this process. Please click on the “Online Hiring Handbook” link within the paragraph for access. Please note that your Pennkey is needed to access this manual. Students Pennbook Handbook for students regarding most of the University policies, procedures, and University resources. Graduate Student Center Resource Guide Provides descriptions of all the resources available to graduate and professional students on Penn's campus. Disclaimer Emergency Services Privacy Policy Report Accessibility Issues and Get Help Report Copyright Infringement Philadelphia, PA 19104 Telephone: (215) 898-5000"
}