{
  "id": 10,
  "date": "2024-05-18T18:09:20.480489",
  "url": "https://cms.business-services.upenn.edu/transportation/",
  "university_name": "University of Pensylvania",
  "title": "Penn Transportation & Parking is dedicated to providing",
  "content": "COMMUTER INFORMATION AND RESOURCES :University Increases discount for Employee Commuter Program to 50%. Learn more about the new discount and other commuting resources. Skip Navigation Skip to Footer Penn Home Business Services Home Campus Maps Group 15 Created with Sketch. s Search About Overview Test Item Our Initiatives AVI Transponders Green Parking Lot offers commuting alternatives Facilities Improvements Fleet Rebranding Electric Charging Stations Our Network Sustainable Transportation Policies Commuter Transit Reimbursement Exception Policy Commuter Transit Reimbursement Exception Policy Form Meet Our Team Penn Transit Services Information Overview of Penn Transit Options Advertising on Penn Transit Riders' Rights  & Responsibilities Navigating Penn Transit Commuter Services Information Parking Services Information General Information - Parking Pay or Appeal a Ticket Low Emission Vehicles Alerts and Updates Signup for Transportation or Parking Notifications News and Announcements Share a Ride Van Pooling Discounts and Benefits Car-Sharing Discounts and Benefits Emergency Ride Home Walking & Biking Walking Escort Service Resources for Cyclists Bike Commuter Reimbursement Program Bike Sharing on Campus Campus Bike Policies Bike Safety Services for Penn Departments Maintenance Services Charter Services Overview Policies and Cancellation Charter Vehicle Rates Charter Vehicle Options Request Charter Vehicle Charter Vehicle Reservation Form VIP and Event Parking Requests Pay for Parking Violations Pay and Appeal a Ticket Contact Us Penn Transit Commuter Services Penn Parking Provide Feedback FAQs Commuter FAQs Transit FAQs Parking FAQs Group 15 Created with Sketch. s Menu Search Live Maps Penn Transit Live Map Transportation Map Transit Stop Descriptions Transit Route and Area Descriptions Parking Map Parking Lot Descriptions Biking Map Permits & Passes Information on Commuter Benefits Health Equity Commuter Card Commuter Discounts for New Jersey Travel Student PennPass Cost of a PennPass New Jersey Transit Student Discount WageWorks VISA Debit Card Replaces Transit Checks Update/Apply for Commuter Discounts Update/Apply for Commuter Card Benefit Information on Parking Permits Event and VIP Parking Requests Event and VIP Parking Form Cancel a Permit Suspended Permit Lost or Stolen Parking Credentials Lost or Damaged Parking Credentials Hangtag Information Snow Emergencies Parking Safety Faculty & Staff Monthly Parking Permits Evening & Weekend Permits Student Parking Rates Student Parking Permits Occasional Parking Occasional Parking Application Form Motorcycle Parking Health Equity Commuter Parking Card 24 Hour Parking 2023-2024 Parking Rates Update/Apply for Parking Schedules & Options PennTransit Mobile Penn Bus West Penn Bus East Penn Bus North Penn Accessible Transit On-Request Evening Shuttles Penn FMC Shuttle Pennovation Works LUCY Bus Penn-Drexel Bus Share PennTransit Mobile, our new app, allows you to find your quickest mode of travel right from your phone. Download it today. Learn More Penn Transportation & Parking is dedicated to providing safe, convenient, sustainable and accessible transit, commuter, and parking services to the Penn community. See our Initiatives Penn Transportation & Parking is committed to promoting sustainable commuting practices through a variety of initiatives within Penn’s Climate and Sustainability Action Plan. See our sustainable transportation Initiatives Penn Transportation & Parking values the collaborative relationships it has with outside organizations that contribute to the creation of a robust, integrated transit system for the campus community. See our network PennTransit Mobile, our new app, makes choosing travel to, from and around campus easier than ever! Download it today. Learn More Group 15 Created with Sketch. s Alerts & Updates For more information See transportation options See parking options News & Announcements Announcing Penn Bus North & Other Service Enhancements Penn Transit has a new fixed-route pilot service called Penn Bus North as well as other service enhancements. Read more ... PennTransit Mobile is now live Riders of Penn Transit’s on-request shuttle services will need to begin using our new app – PennTransit Mobile . Read more ... See all News & Announcements Group 14 Created with Sketch. Trending FAQs What is Penn Accessible Transit? See all FAQs Quick Links PennTransit Mobile Find Visitor Parking Pay a Parking Violation Penn Transit #520 3401 Grays Ferry Avenue Philadelphia, PA 19146-2701 transit@upenn.edu 215-898-7433 (RIDE) Commuting Services/Parking Suite 447A 3401 Walnut Street Philadelphia, PA 19104 parking@upenn.edu 215-898-8667 News & Announcements Alerts and Updates FAQs Give us Feedback Privacy Report accessibility issues and get help"
}