{
  "id": 10,
  "date": "2024-05-18T18:09:32.297044",
  "url": "https://www.gse.upenn.edu/admissions",
  "university_name": "University of Pensylvania",
  "title": "Search form",
  "content": "Skip to main content Toggle navigation University of Pennsylvania Graduate School of Education About Penn GSE & Our Impact Penn GSE Environmental Justice Statement Philadelphia Impact Global Initiatives Diversity & Inclusion Catalyst @ Penn GSE Penn GSE Leadership Contact Us Academics & Research Program Finder Academic Divisions & Programs Professional Development & Continuing Education Teacher Programs & Certifications Undergraduates Dual and Joint Degrees Faculty Directory Research Centers, Projects & Initiatives Lectures & Colloquia Books & Publications Academic Journals Admissions & Financial Aid Application Requirements & Deadlines Tuition & Financial Aid Campus Visits & Events International Students Options for Undergraduates Non-Degree Studies Contact Admissions / Request Information Student Experience Life at Penn GSE Penn GSE Career Paths Living in Philadelphia DE&I Resources for Students Student Organizations Career & Professional Development News & Events News Archive Events Calendar The Educator's Playbook Find an Expert Explore by Topic Philadelphia Impact Global Initiatives Race, Equity & Inclusion Counseling & Psychology Education Innovation & Entrepreneurship Education Policy & Analysis Higher Education Language, Literacy & Culture Leadership Teaching & Learning Alumni & Supporters Support Penn GSE Connect Contact Development & Alumni Relations IES Fellows Find a Program Request Info Apply Make a Gift Info For Alumni Current Students Staff & Faculty Donors Employers Search form Search Admissions & Financial Aid You are here Home > Admissions & Financial Aid Take Your Next Steps Consistently ranked in the top 10 by U.S. News & World Report , the Graduate School of Education at the University of Pennsylvania is a national leader in education research and preparing educators to be leaders and innovators—locally, nationally, and worldwide. Program Finder Request Information Apply Online How to Apply Start your application today. Review the requirements needed to complete a successful application. Learn More Tuition & Financial Assistance Penn GSE is committed to making your graduate education affordable, and we offer generous scholarships, fellowships, and assistantships. Scholarships and Fellowships Admissions Events May 22 Global Higher Education Management (Online) Virtual Information Session Wednesday, May 22, 2024 - 11:00am to 12:00pm ET Virtual Join us to learn more about Penn GSE's Online program in Global Higher Education Management. This program develops and connects university leaders from around the world who are committed to improving and enhancing higher education institutions. May 23 Penn Chief Learning Officer Virtual Information Session May 30 SALT Professional Development Fair Jun 1 Chester County Veterans Fair View all Admissions Events International Applicants > In addition to our standard application requirements, students with international coursework are required to submit supplemental requirements that may include course-by-course evaluations and/or test scores from the TOEFL or IELTS. Discover resources regarding student visa applications, scholarship opportunities, and more. Penn Undergrads > Get a head start on your graduate education while completing your undergraduate degree, or begin to explore your interest with a minor in urban education—at no additional cost. Non-Degree Studies > Explore graduate-level courses at Penn GSE for personal or professional development—no GRE required. Class Profile Data reflects all students enrolled in our degree (Ed.D., Master's, and Ph.D.) and certification-only programs as of the Fall 2023 term. Total Students Ph.D. 105 Ed.D. 275 Master's 1,231 Enrollment Status Full-time students 78% Part-time students 22% Age Range Ph.D. students 23-48 Ed.D. students 26-70 Master's students 21-62 Program Format Traditional 72% Executive 25% Online 3% International Students International students 38% Countries represented 49 Languages Spoken 67 Domestic Students Domestic students 62% African-American 20% Asian-American 14% Hispanic or Latino/a 11% More than one Race/Ethnicity 3% Unknown 1% Contact Information Office of Admissions & Financial Aid University of Pennsylvania Graduate School of Education 3700 Walnut Street Philadelphia, PA 19104 (215) 898-6415 admissions@gse.upenn.edu finaid@gse.upenn.edu Request Info Online Application University of Pennsylvania Graduate School of Education 3700 Walnut Street Philadelphia, PA 19104 (215) 898-6415 admissions@gse.upenn.edu About Admissions & Financial Aid Find a Program Visiting Campus Alumni Diversity & Inclusion Faculty Directory Open Faculty Positions Support Penn GSE Academic Calendar Events Calendar Career & Professional Development Canvas Access PennInTouch Libraries Registrar/Student Records Office Webmail One Penn GSE Business Office Facility Services Human Resources Information Technology Staff Directory U@Penn Store Report accessibility issues and request help © 2024 Penn Graduate School of Education Facebook Twitter Vimeo LinkedIn Instagram Disclaimer | Privacy Policy | Penn GSE Equal Opportunity & Harassment Policies"
}