{
  "id": 10,
  "date": "2024-05-18T18:09:30.052954",
  "url": "https://www.med.upenn.edu/admissions/",
  "university_name": "University of Pensylvania",
  "title": "MD Admissions",
  "content": "Navigate MD Admissions Home Innovations Dynamic Learning Environment Dual Degrees & Areas of Concentration Special Study & Research Curriculum Core 1 Core 2 Core 3 Evaluation and Degree Requirements The Penn Med Experience Teaching Facilities 2023-24 Total Enrollment and Entering Class Profile Post-Graduate Outcomes Admissions General Academic Competencies Application Procedure Application Timeline Inclusion, Diversity, and Equity Technical Standards for Admission Prospective Student Resources Special Programs FAQs COVID-19 Policies Financial Aid Overview Tuition & Fees AAMC/FIRST How To Apply For Aid Student Resources Innovations Dynamic Learning Environment Dual Degrees & Areas of Concentration Special Study & Research Curriculum Core 1 Core 2 Core 3 Evaluation and Degree Requirements The Penn Med Experience Teaching Facilities 2023-24 Total Enrollment and Entering Class Profile Post-Graduate Outcomes Admissions General Academic Competencies Application Procedure Application Timeline Inclusion, Diversity, and Equity Technical Standards for Admission Prospective Student Resources Special Programs FAQs COVID-19 Policies Financial Aid Overview Tuition & Fees AAMC/FIRST How To Apply For Aid Student Resources MD Admissions Dear Prospective Applicants, Thank you for your interest in the Perelman School of Medicine! Your decision to pursue a career in healthcare is an incredibly important one, and we welcome the opportunity to be part of your medical training. Caring for patients is a privilege, and aspiring physicians like you provide us with tremendous hope and inspiration for the future. There has never been a more exciting time to practice medicine, with a steady stream of game-changing discoveries and technological breakthroughs improving patient outcomes and clinical care delivery. Innovation in medicine is a defining characteristic of PSOM, as is our commitment to prepare our students to become tomorrow's leaders in whatever career path they choose. Dr. Neha Vapiwala, Associate Dean of Admissions, Perelman School of Medicine Important Dates 2024 Applicants Admissions decisions have been releases via the applicant portal. Accepted applicants have until April 30 to make their PTE decision. 2025 Applicants and Beyond Are you interested in applying to Perelman and want to learn more? Check out our May 2024 Summer Information Session . We will host another virtual session in July, registration will open June 15. Campus Information Campus Map Life at Penn Follow us on social media! Perelman School of Medicine (Facebook) Penn Medicine (Facebook) Penn Medicine (IG) Quick Links AAMC AAMC Medical School Admissions Requirements Guide IDEAL MEd Inclusion, Diversity, Equity, and Learner Experience Program in Medical Education Liberal and Professional Studies — Post Bac Program Global Health Penn Medicine Penn Medicine Facts & Figures Blue Ridge Institute for Medical Research FIRST (Financial Information, Resources, Services, and Tools) IMP a CT Integrating Medicine Patient Care Transitions IMPaCT The Perelman School of Medicine enjoys an international reputation for innovation in areas ranging from leadership training to global health. Our groundbreaking curriculum sets a new standard for medical education nationwide. The three core blocks of the MD curriculum integrate basic sciences and clinical experience from day one. It teaches students self-directed lifelong learning skills, interdisciplinary teamwork and technological proficiency in the practice of evidence-based medicine and patient-centered care. Integrated Integration of basic, translational, social, clinical, and health systems sciences throughout the continuum of medical education, led by outstanding faculty committed to the privilege of teaching tomorrow's healthcare leaders. Innovative Our training is designed to enable students to learn and work in teams throughout medical school. Our university campus provides unparalleled proximity and access to opportunities for educational enrichment at any of our leading graduate schools, innovative research centers, and renowned clinical facilities. Individualized Numerous and diverse opportunities allow for customization of the medical education journey and pursuit of unique professional experiences so that all specific interests and career goals can be attained. A Unique Opportunity in Medical Education Medical students can customize their education to suit their interests. More than 50 percent of each class remains at Penn beyond four years to take advantage of resources for dual degrees, certificates, global health experiences, and research. Admissions Vision Statement Perelman School of Medicine at the University of Pennsylvania will select students who will become future physician leaders in health care, advancing science and discovery and furthering the clinical, educational, research, health policy and medical entrepreneurial missions for our society. Graduates of the Perelman School of Medicine will be leading advocates for these endeavors within their local environment as well as for the health of national and international communities. We strive to recruit a diverse and inclusive class that reflects these goals. Principles of Selection at PSOM: Student selection is a multifactorial process that emphasizes holistic review. Aspects considered include academic performance, breadth and depth of life experiences and personal attributes. Diversity, equity and inclusion are core missions of our institution. We strive for representation in our class from a variety of demographic, educational and socioeconomic backgrounds. Successful candidates demonstrate academic excellence, commitment to community service, scholarly achievement and leadership ability. MD Admissions News Colonoscopy and At-Home Tests Doubled Colorectal Cancer Screening Thursday, May 16, 2024 In a trial analyzing how messages were framed in an underserved population, offering colorectal cancer… Axons in female mammal brains may be more prone to concussions Monday, May 13, 2024 The structural differences in male and female brains might explain why females are more prone to concussions… Penn Medicine and Union partner for community fridge Monday, May  6, 2024 Located at Boys & Girls Club of Chester, the community refrigerator and accompanying pantry contributes… Subscribe Our Mission Our mission is to advance knowledge and improve health through research, patient care, and the education of trainees in an inclusive culture that embraces diversity, fosters innovation, stimulates critical thinking, supports lifelong learning, and sustains our legacy of excellence. Perelman School of Medicine University of Pennsylvania Diversity & Community Search this Site Connect With Us on Facebook Penn Medicine MD Admissions Perelman School of Medicine at the University of Pennsylvania Jordan Medical Education Center, 6th Floor 3400 Civic Center Blvd. Building 421 Philadelphia, PA 19104-5162 215-898-8001 admiss@pennmedicine.upenn.edu Campus Map © The Trustees of the University of Pennsylvania | Site best viewed in a supported browser . | Report Accessibility Issues and Get Help | Privacy Policy | \nSite Design: PMACS Web Team."
}