{
  "id": 10,
  "date": "2024-05-18T18:09:33.196689",
  "url": "https://admissions.upenn.edu/how-to-apply/transfer-admission",
  "university_name": "University of Pensylvania",
  "title": "Site Navigation",
  "content": "Skip to main content Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Search Close Menu Close Search keywords Search Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Transfer Admission This is a community of people from all around the world, each with their own background and their own story. We're really interested in seeing all you love, everything that challenges you, and what you have learned, which together make you a distinct, singular person. Navigate Section Apply for Admission International Applicants Transfer Admission Transfer Admission sub-navigation Curricular Requirements Eligibility Guidelines Transfer Admission: Checklist and Deadlines Transfer Credit Transferring to the College of Arts and Sciences Transferring to the School of Engineering Transferring to the School of Nursing Transferring to the Wharton School Transferring to the College of Liberal and Professional Studies What Penn Looks For As a transfer student, you bring a unique perspective to our application process and our community. As you begin your transfer application process, please refer to the resources below. Penn accepts Common App and the Coalition Application . We have no preference for either format and treat both applications equally in our process. We encourage you to review the features of each application format and use the platform that suits you best. You should submit only one application per admissions cycle and not mix-and-match across platforms. Apply Via Common App Apply Via The Coalition Application Penn Admissions welcomes applications from members of the United States Armed Forces. For more information, please refer to the resources below and our frequently asked questions . Transfer Admission: Checklist and Deadlines Learn More Curricular Requirements Learn More Eligibility Guidelines Learn More Transfer Credit Learn More 1 College Hall, Room 1, Philadelphia, PA 19104-6376 Footer Menu Join the mailing list Contact Us Accessibility Privacy Policy NACAC Partnership Agreement"
}