{
  "id": 10,
  "date": "2024-05-20T13:15:24.864795",
  "url": "https://www.asc.upenn.edu/graduate/apply-phd-program",
  "university_name": "University of Pensylvania",
  "title": "Apply to the Ph.D. Program",
  "content": "Skip to main site navigation Skip to main content Return to Anneberg School for Communication Homepage Open the main menu People Faculty, Lecturers & Researchers Graduate Students Staff Graduate Ph.D. Program How to Apply Financial Support Curriculum and Milestones Courses Graduate Faculty Joint Degrees & Certificates Student Life Careers & Outcomes Undergraduate Major in Communication Declaring the Major Major Requirements Courses Academic Opportunities Advising Appointments Careers & Outcomes Research Research Areas Topics Centers & Groups Annenberg School Library Executive Education Multimedia Lab News & Events News Events In the Media About Message from the Dean Mission & History Leadership & Governance Location & Facilities Careers at Annenberg Contact Us Open the search panel Search Site Graduation Alumni Policies & Resources Doctorate in Communication Apply to the Ph.D. Program Apply to the Ph.D. Program Thank you for your interest in the Annenberg School's doctoral program! Read on for all the details on how to apply. Applications to the Ph.D. program are now open. Request More Information Getting Started Applications for the following calendar year open October 2 . The Annenberg School for Communication does not accept paper applications. Elements of the application include: Three Letters of Recommendation Statement of Purpose CV or Resume Transcripts $90 Application Fee GRE Scores (optional) TOEFL/IELTS Scores (for non-native speakers of English) Writing Sample (optional) Read on for more details about each of these application elements. An application is considered complete and ready for review when we have received all of the above required items. Incomplete applications will not be reviewed. Please note that all application materials become property of the University of Pennsylvania and will not be returned. Remember to retain a personal copy of your application. Key Dates October 2 The Annenberg School begins accepting applications for the fall term that begins the following calendar year. November 1 TOEFL exams (if needed) should be complete to ensure they are received by December 1. December 1 Statement of Purpose, CV, test scores, transcripts, and online application must be submitted and application fee paid (unless the applicant qualifies for a fee waiver ). December 15 All letters of recommendation must be received. April 1 Annenberg will complete notifying applicants about all admission decisions. Application Details Three Letters of Recommendation Please submit no more than three letters from individuals who are familiar with your academic abilities and scholarly work. Annenberg’s online application system will generate a request for a recommendation letter. It will be sent from your email address to your recommender. Please have each recommender's contact information (including email address and phone number) ready when you log on to begin your application. Interfolio users should email the dossier to joanne.murray@asc.upenn.edu . Please ask each recommender to submit your letter as a Microsoft Word or Adobe PDF document. However, if any of your recommenders prefers to provide a hard copy letter instead of using email, please request that the document be mailed to our admissions office before the December 15 deadline. Our mailing address is: The Annenberg School for Communication Admissions Office University of Pennsylvania 3620 Walnut Street Philadelphia, PA, 19104-6220 Statement of Purpose and Research Advisor Selection Your statement of purpose should discuss your potential research area or topic and its relationship to an Annenberg School for Communication graduate faculty member , research center, or lab . Please describe in detail how your academic and professional background, interests, and preparation in the social sciences, the humanities, and other studies support your research topic. The statement should also address the question of what career objectives an Annenberg degree would help you realize. The statement should be double spaced and must not exceed 1,000 words. On the application you will be asked to identify potential Research Advisors.  Please select (in order) the three Annenberg faculty you are most interested in working with.  Note: only faculty who are accepting new students are on this application drop down.  The indicated faculty will be asked to review your application.  However, you do not need their permission to apply. CV or Resume A CV or resume should include references to major research projects, a thesis, and other scholarly papers and accomplishments. The file should be attached to the online application as a Word or Adobe PDF file. Graduate Record Examination (GRE) — Optional The GRE will be optional for the coming application cycle. Your file will be reviewed with or without GRE scores. GRE scores are valid and reportable only for five years from the test date. The test may be taken internationally. Please see the GRE website for testing locations in your area. The ETS code for the Annenberg School at the University of Pennsylvania is (2926) on the request form. W e do not use department codes, but anything you choose will get to us . Applicants should allow at least six weeks for GRE scores to be processed and received. Information about the GRE may be obtained from the Educational Testing Service, P.O. Box 6000, Princeton, NJ 08541-6000. If you are submitting scores, please arrange for us to receive an official report of your general GRE test scores before the application deadline of December 1. Test for Non-Native Speakers of English (TOEFL/IELTS) Applicants from non-English speaking countries must submit the results of their TOEFL/IELTS exam unless they have obtained a degree from a university or college in an English speaking nation or was taught entirely in English. TOEFL/IELTS exam results can be sent electronically to the University of Pennsylvania Annenberg School OR mailed to: The Annenberg School for Communication Admissions Office University of Pennsylvania 3620 Walnut Street Philadelphia, PA, 19104-6220 Transcripts Applicants may scan and attach student copies of academic transcripts to the application. If you are currently taking classes you will not need to send us an updated transcript once your grades are submitted. One official transcript of all undergraduate and graduate work will be required if you are offered admission to the program. An offer of admission will be contingent upon verification of student records with official transcripts from your institutions. Only graduates of a college or university will be admitted to the Annenberg School graduate program. $90 Application Fee Payment may be made by credit card online or by mailing a check or money order payable to the Trustees of the University of Pennsylvania. International applicants applying from abroad who are not using credit cards should provide a $90 check drawn on a U.S. bank or international postal money order. Fee waivers are available for McNair Fellows, participants in the National Name Exchange, or those with demonstrated financial need. Please be advised that applicants must demonstrate a clear and compelling case of financial hardship and fee waivers may be considered for U.S. citizens or permanent residents only. Email Joanne Murray a brief letter stating the reason for your request. Writing Sample — Optional You may submit whatever you feel best displays your scholarly writing ability. The sample must not exceed 10 pages, double-spaced, and may be an excerpt from a larger work (not including references). Please upload the writing sample using the online application. Frequently Asked Questions Our Graduate Studies team answers applicants' mostly commonly asked questions. Read the FAQ Apply Applications to the Ph.D. program will open in October. Contact Us John B. Jemmott III, Ph.D. Associate Dean for Graduate Studies Kenneth B. Clark Professor of Communication and Psychiatry john.jemmott@asc.upenn.edu Joanne Murray, M.S.Ed. Assistant Dean for Graduate Studies (215) 573-6349 joanne.murray@asc.upenn.edu University of Pennsylvania Homepage Annenberg School for Communication 3620 Walnut Street Philadelphia, PA 19104 Contact Us Building Hours: Monday to Friday - 8:00AM to 11:00PM Saturday to Sunday - 10:00AM to 5:00PM No Pets - Service Animals Only Library Hours: Monday to Friday - 9:00AM to 5:00PM Saturday & Sunday - Closed Engage With Us on social media Facebook Twitter YouTube Instagram Support Annenberg Privacy Copyright Information Disclaimer Report Accessibility Issues & Get Help Contact Us Copyright © 2024 Annenberg School for Communication at the University of\n        Pennsylvania"
}