{
  "id": 10,
  "date": "2024-05-18T18:09:41.675707",
  "url": "https://in-principle-and-practice.upenn.edu/",
  "university_name": "University of Pensylvania",
  "title": "Penn’s Focus on Tomorrow",
  "content": "Link to UPenn Homepage Penn’s Focus on Tomorrow Introducing a New Strategic Framework for the University of Pennsylvania. Read Our Principles We asked: “What does the world need from Penn?” The resulting principles are the essence of who we are. They are Penn’s enduring values and distinctive strengths. They are where we as a campus community stand. Scroll to section 1 Scroll to section 2 Scroll to section 3 Scroll to section 4 The Anchored University Our exceptional and diverse people, communities, and campus are our anchor, the foundation of all we do, and they guide and propel Penn. Being an excellent Philadelphia neighbor and global citizen is essential to Penn’s mission. The Interwoven University The more ideas and people from all backgrounds we bring to the table—and the more interconnected and less siloed our community—the more rigorous, more resourceful, and more effective Penn is. Leadership in interdisciplinary excellence distinguishes Penn. The Inventive University Penn is a powerhouse for breakthroughs in all fields. Penn addresses great challenges and opportunities. The Engaged University Penn cultivates leaders who serve. Penn seeks dialogue and collaboration across differences and divides. Our Practices Our areas of practice directly support and strengthen Penn’s core educational mission. They will help us channel Penn’s excellence and its boundless creative energy to meet the needs of our time. These practices are meant to guide, not decide, our future course. Accelerate interdisciplinary pursuits A cross-cutting University approach that spans boundaries to forge novel connections in teaching, research, and clinical practice to advance knowledge and improve lives. Expand our commitment to the power of curiosity-driven exploration across all fields of knowledge, from the arts and humanities to the sciences to the professions. Seek exponential growth in Penn’s interdisciplinary faculty support; even more inter-School teaching, projects, and programs; and rich opportunities for students and staff to pursue novel collaborations across a wide range of domains. Champion the essential role of the arts and humanities at the core of the human endeavor.  They bring people together through deeper understanding of history, culture, social conditions, and empathy for others, and they foster problem-solving. We will seek new ways to strengthen and integrate them in all fields and amplify opportunities to explore Penn’s extraordinary repositories of culture and beauty on campus and beyond. Continue to fuel Penn as a premier inventive powerhouse. From entrepreneurship to commercialization and tech transfer, Penn has established significant infrastructure to make this campus and city a destination for innovators. We will accelerate Penn as a premier powerhouse for translating knowledge into action and solutions. Lead on great challenges of our time Climate: Every person at Penn and all that we do has some nexus to the existential challenge of climate change. We must, in an all-in University effort, do more. From leading energy science and policy across disciplines to designing and caring for the built environment, Penn will seek additional ways to support and recruit the best minds; fuel initiatives that advance understanding and promise solutions; and adopt institutional best practices for the sake of our future and our planet. Health: The pandemic cast in sharp relief the urgency of Penn’s groundbreaking work in life sciences and health across schools and disciplines. To help ensure a healthier, safer global future, Penn will do even more to advance our health efforts. We will further cement both Penn and the region as an epicenter for groundbreaking research and teaching, translational discovery, and policy expertise in life sciences and public health. Data: From big data to large language model-powered AI, technological advances offer the chance to unlock new understanding across a dizzying number of domains and at the same time may dramatically outpace society’s ability to assess and plan for the promises and consequences. Penn is poised to lead in data-driven research, teaching, and applications. We will also cultivate leading expertise on how society can develop and deploy powerful technologies beneficially and justly. Democracy, trust, and truth: Position Penn as a global leader in driving conversations about and promoting democratic values and institutions. Build on signature homegrown strengths and exceptionally broad-ranging expertise to seek and defend truth. Grow opportunity and strengthen affinity Recruit and support diverse and exceptional students, faculty, and staff with the widest range of backgrounds, experiences, and perspectives. Undertake our campus planning to ensure design and function that serves its community for generations to come. Our physical plant should be state-of-the-art, sustainable, and thoughtfully improved to foster the interactions, experiences, and relationships that knit communities together. Deepen connection with neighbors and the world Excellent neighbor to West Philadelphia, our city, and region. Penn will pursue all that a collaborative urban institution and caring neighbor can do in this new era for cities everywhere. As one University, we will more centrally convene and coordinate all the work we do in meaningful partnership with our West Philadelphia neighbors, the city, and the region. We will leverage our academic expertise to shed light on, and seek solutions to, pressing urban challenges. Model global citizen. At a time when the tectonic plates of the international community are shifting rapidly, what is a leading American university’s role in the world? By building on existing partnerships around the world and further investing in global research, teaching, and learning on campus, Penn will help define what the next decade requires of a leading global university. Foster leadership and service Cultivate leaders who serve. The world needs leaders now more than ever—discerning leaders who have knowledge, vision, creativity, and, above all, a commitment to making a difference for others and for the planet. Penn has long prepared students to be leaders. For the future, we will build on existing resources and initiate new ways of cultivating service-minded leadership among our students, and also our faculty and staff. Best-in-class instruction. Producing knowledge and transmitting that knowledge to the next generation is the very core of the Penn experience. We will continually seek to advance state-of-the-art and innovative instruction to best deliver on our mission of preparing future generations to think critically and lead effectively. Convene, communicate, and collaborate across divisions and divides. Link to UPenn Homepage © 2024, University of Pennsylvania"
}