{
  "id": 10,
  "date": "2024-05-18T18:09:31.780244",
  "url": "https://admissions.upenn.edu/",
  "university_name": "University of Pensylvania",
  "title": "Site Navigation",
  "content": "Skip to main content Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Search Close Menu Close Search keywords Search Site Navigation Academics Academics sub-navigation Academics Experience Faculty Exploring Academics Research After Penn Student Life Student Life sub-navigation Campus Life Resources & Opportunities Exploring Community Affording Penn Affording Penn sub-navigation How it Works Domestic Aid International Aid Understanding Your Cost How to Apply How to Apply sub-navigation Apply for Admission International Applicants Transfer Admission What Penn Looks For Visit and Connect Visit and Connect sub-navigation Contact Us Visit Penn Penn Perspectives Ask Four Schools, One University There’s no one path to success here. Penn has four undergraduate schools that each offer unique opportunities, all on one campus. And our students have access to all of them. You’ll choose a school or program to serve as your home base, but you’ll never be limited to just one thing. Take classes that interest you, regardless of the school they're in. Pursue an Interschool Minor. Or even a second degree. And if you don’t see the path you want to take? We’ll help you make one. About Penn First things first: We’re the University of Pennsylvania (aka Penn), an Ivy League research university founded by Ben Franklin in the heart of Philadelphia. Did that sound stuffy? It felt stuffy. Here’s what we’re really about: Penn is a place for people who want to do something big. But it’s also for people for who want to try a bunch of little things first. It’s a place for sparking revolutionary ideas. For pioneering thinkers. And it’s a place that will help you figure out what inspires and excites you. Where you won’t just gain knowledge, you’ll make it. You’ll research solutions, invent ideas, engineer art – all in a culture that’s not about perfection, but about perfecting the pursuit. The people who love it here? People who are drawn to other people and who are curious about everything. This is the time to figure things out. Try everything that seems worthwhile. You’ll find what truly is. Sound like the place for you? Then we can’t wait to meet you. This is Penn STATS AND FACTS 8:1 Student-Faculty Ratio 9,960 Undergraduate Students 4,200+ Course Offerings 96% 6-year graduation rate for undergraduates I want information for First-Year Applicants International Applicants Counselors Supporting my Student Transfer Applicants Not sure where to start? Learn About Our Four Schools How to Apply Living in Philly Penn Meets 100% of Demonstrated Need with Grants! Affordability & Aid Here at Penn, we believe the hard part about college shouldn’t be paying for it. That’s why all undergraduate financial aid is awarded on the basis of financial need (aka, need-based aid). We are committed to making a Penn education accessible and affordable by meeting 100% of demonstrated need with grants and work-study funding. Those are funds you don’t have to pay back, meaning its possible to graduate debt-free! Ready to Learn More? Frequently Asked Questions What does Penn look for in its first-year applicants? We look for students who aspire to develop and refine their talents and abilities within Penn’s liberal arts-based, practical, and interdisciplinary learning environment. Our ideal candidates are inspired to emulate our founder Benjamin Franklin by applying their knowledge in “service to society” to our community, the city of Philadelphia, and the wider world. To best understand prospective students’ paths through Penn, we approach applications holistically and with great care. Do domestic and international students fill out the same application? Yes, Penn accepts the Common App, the Coalition Application, and the QuestBridge Application. All applicants, regardless of citizenship, must submit one of these applications. How do I apply for financial aid? Student Registration and Financial Services posts financial aid application checklists for prospective students. Most students will need to submit the Free Application for Federal Student Aid (FAFSA), CSS Profile, and Penn Financial Aid Supplement. Make sure to follow the instructions on your relevant checklist and turn in forms by their listed deadlines. What are the different ways that I can make Penn and Philadelphia feel like home? There are a wide range of clubs, organizations, and activities on campus . Take our word for it that there are enough academic, cultural, environmental, performing arts, religious, media, and social opportunities for you to get involved in and to find community with! You will also live and learn in the vibrant city of Philadelphia where diverse people and a saturation of experiences come together. Rich in history, culture, art, recreation, and famous (and delicious) food, Philly offers countless things to do and something for everyone. See all Frequently Asked Questions 1 College Hall, Room 1, Philadelphia, PA 19104-6376 Footer Menu Join the mailing list Contact Us Accessibility Privacy Policy NACAC Partnership Agreement"
}