{
  "id": 10,
  "date": "2024-05-18T18:09:33.996529",
  "url": "https://provost.upenn.edu/for-students/graduate-and-professional-education/graduate-admissions/",
  "university_name": "University of Pensylvania",
  "title": "Graduate Admissions",
  "content": "Skip to main content Admissions Athletics Libraries Penn President Penn Deans Penn Website Who We Are Who We Are About the Provost Deputy Provost Vice Provosts Staff Directory Accreditation Provost’s Councils More Resources Centers and Institutes News and Announcements Campaign for Community For Students For Students Graduate and Professional Students Undergraduate Students University Life at Penn Wellbeing Initiatives Student Health and Counseling International Student and Scholar Services Center for Community Standards and Accountability More Resources Pennbook Graduate Catalog Undergraduate Catalog Graduate Student Center Family Resource Center For Staff For Staff Provost Administrative Affairs Penn Human Resources Resources for Academic Program Administrators More Resources Staff Directory Central Pool Classrooms Campaign for Community For Faculty For Faculty Faculty Website Faculty Senate Faculty Handbook Teaching at Penn CETLI More Resources PASEF Central Pool Classrooms For Postdocs Contact Search Admissions Athletics Libraries Penn President Penn Deans Penn Website Who We Are About the Provost Deputy Provost Vice Provosts Staff Directory Accreditation Provost’s Councils More Resources Centers and Institutes News and Announcements Campaign for Community For Students Graduate and Professional Students Undergraduate Students University Life at Penn Wellbeing Initiatives Student Health and Counseling International Student and Scholar Services Center for Community Standards and Accountability More Resources Pennbook Graduate Catalog Undergraduate Catalog Graduate Student Center Family Resource Center For Staff Provost Administrative Affairs Penn Human Resources Resources for Academic Program Administrators More Resources Staff Directory Central Pool Classrooms Campaign for Community For Faculty Faculty Website Faculty Senate Faculty Handbook Teaching at Penn CETLI More Resources PASEF Central Pool Classrooms For Postdocs Contact Home For Students Graduate and Professional Education Graduate Admissions Graduate Admissions Graduate Admissions Guide to Applying for Graduate School Graduate Degrees Graduate Degrees-Contact Us Graduation Information Dissertation and Thesis Deposit Resources for PhD Students Graduate and professional programs at Penn emphasize the integration of knowledge across boundaries and disciplines. More than 16,000 graduate and professional students study at Penn, pursuing more than 300 degree and certificate offerings, from Accounting to Women’s Health. Explore our graduate programs and click on the programs that interest you to learn more about admissions and academic requirements. Spotlight on Research Penn is a nationally-ranked research university, one of the top recipients of competitive research grants in the U.S. More than 170 research centers and institutes play a major role in advancing the university’s intellectual agenda. Learn more about research activity in Penn’s graduate and professional schools through Research at Penn . Explore Graduate Admissions Contacts Below How to Apply Penn’s graduate and professional programs are housed in 12 schools on one campus. Each graduate program has a separate admissions process. Applicants apply directly to the program of interest . All questions about the admissions process should be directed to the program of interest . Spring 2020 Recognizing the challenges of teaching, learning, and assessing academic performance during the global COVID-19 pandemic, Penn’s admissions committees for graduate and professional programs will take the significant disruptions of the COVID-19 outbreak in 2020 into account when reviewing students’ transcripts and other admissions materials as part of their regular practice of performing individualized, holistic reviews of each applicant. In particular, as we review applications now and in the future, we will respect decisions regarding the adoption of Pass/Fail and other grading options during the period of COVID-19 disruptions. An applicant will not be adversely affected in the admissions process if their academic institution implemented a mandatory pass/fail (or similar) system for the term or if the applicant chose to participate in an optional pass/fail (or similar) system for the term. Penn’s longstanding commitment remains to admit graduate and professional student cohorts composed of outstanding individuals who demonstrate the resilience and aptitude to succeed in their academic pursuits. Required Tests For PhD applicants: Most, but not all, PhD programs at Penn require the Graduate Record Examination (GRE). The University’s institution code is 2926, you only need to send your scores to one Penn code and it will be matched to your application. Each graduate program has a different GRE requirement; please refer to your program of interest for more information. For information about the administration of the GRE, see the Educational Testing Service website . For professional program applicants: Some, but not all, professional programs at Penn require standardized test scores, such as the GRE, LSAT, MCAT, GMAT, etc. Each program has a different requirement and a different institution code. Please refer to your program of interest for more information. International Applicants Applicants who are non-native English speakers may also be required to report scores from the Test of English as a Foreign Language (TOEFL), Pearson’s PTE Academic , or International English Language Testing System (IELTS). Please refer to your program of interest for detailed requirements. Penn is a leader among its peers in welcoming students from every part of the world. The division of International Student and Scholar Services offers help, advice, and information on all matters connected to immigration, employment, adjustment to a new culture, and living in Philadelphia. Application Materials Please note that all application materials become property of the University of Pennsylvania and will not be returned. Remember to retain a personal copy of your application. Offline Recommendation Penn strongly prefers that recommenders submit letters of recommendation online through the admissions system. If, however, your recommender is unable to submit an online recommendation, please follow these instructions: 1) Select the “Recommendation Form PDF Download” and download the form . 2) Complete the first section. Be sure to include the address of the appropriate admissions office — refer to the “Contact Graduate Admissions” list below. 3) Print out the form and provide it to your recommender. Please note: If you are applying to a program in Nursing, print out and provide your recommender with these special instructions for completing your letter of recommendation. If you are applying to a program in the School of Social Policy & Practice, print out and provide your recommender with these special instructions for completing your letter of recommendation. 4) Your recommender should send the form directly to the admissions office you designate, along with the letter of recommendation. Visiting Penn You are welcome to visit the campus. Interviews are generally by invitation only. Applicants may contact their prospective program to inquire about the availability of tours, open houses, and information sessions. If you plan to visit campus, make sure to visit other attractions in Philadelphia too. Privacy Policy Prospective students and applicants should review Penn’s Privacy Policy. Cost & Financial Aid Penn’s graduate tuition and other fees vary by school. Consult the individual schools and programs for details. Penn awards some loans based on financial need. These awarded loans are only made by Penn as part of a student’s financial aid package. The loans are repayable by the student after completion of his/her education or withdrawal from school and are not subsidized. Students in Ph.D. programs generally receive multi-year financial packages to cover tuition, fees, health insurance and a living allowance or stipend. The terms of the award may vary according to field of study. Contact individual programs for details. Most programs require that PhD students teach or conduct research for two or more years during their course of study, as part of their academic preparation. Penn’s professional schools provide limited assistance in the form of grants based on financial need. Some schools award merit-based scholarships or provide support in return for service. Contact your school for information on its policies and application procedures for grants and scholarship funding. Penn’s Student Financial Services provides up-to-date information the cost of attendance , as well as loans and other resources for support . U.S. citizens and permanent residents may be eligible for federal loans (i.e., Direct Loan, Grad PLUS). In addition, private alternative loan programs are available for credit-worthy borrowers. Generally, international students must have a qualified co-signer who is a U.S. citizen or permanent resident. Grad Student Life A stimulating intellectual and social community of students and scholars from across Penn’s 12 schools form a vibrant graduate network. The campus offers extensive resources for academic support and personal enrichment. Penn is a leader among its peers in welcoming students from every part of the world. The division of International Student and Scholar Services offers help, advice, and information on all matters connected to immigration, employment, adjustment to a new culture, and living in Philadelphia. Graduate Student Center Penn’s Graduate Student Center provides a home base for graduate and professional students.  Located in the heart of campus on Locust Walk, the Center hosts a variety of activities including recreational outings, dissertation support workshops, game nights, and more. Graduate Student Organizations As the University-wide graduate student government, GAPSA — the Graduate and Professional Student Assembly – advocates for students, funds initiatives, and plans events. A wide variety of other graduate and professional student organizations flourish at Penn, including school governments, as well as professional, social, athletic, and cultural groups. Campus Resources The Grad Student’s Guide to Thriving at Penn , published by the Grad Center, comprehensively outlines all of the many resources serving graduate and professional students at Penn. Of special importance to many students are these resources: Family Resource Center for students with children Campus Cultural Resource Centers LGBT Center Student Disabilities Services Health & Wellness Resources Recreation & Gyms Career Services Diversity Across 12 Schools, more than 16,000 graduate and professional students, and more than 5,000 faculty members, we become one university: a wide-ranging, ever-changing community that draws its strength from a multitude of races, ethnicities, nationalities, genders, sexual orientations, historical traditions, ages, religions, disabilities, veteran status, interests, perspectives, and socioeconomic backgrounds. Penn has a number of policies and initiatives that support its efforts to foster inclusive excellence. Diversity and inclusion related data, progress reports on initiatives, a timeline of selected milestones, and stories about members of the Penn community are available here . Additional Resources Request Program Information New Grad Student Orientation Graduate Student Center Off Campus Services to help you find housing About Philadelphia Campus Safety- Clery Act and Crime Reporting Living in Philadelphia Famous as the birthplace of life, liberty and the pursuit of happiness, Philadelphia is a vibrant city offering countless things to do: fascinating museums, vibrant parks, national historic sites and famous (and delicious) food. Learn more about the great City of Philadelphia. Philadelphia neighborhoods each have a distinctive personality. The University of Pennsylvania is located in the University City section of Philadelphia. While most students live in University City and the adjacent Center City neighborhoods, there are many other areas to explore . Penn’s Office of Off Campus Services assists students with finding housing in Philadelphia, as well as assistance with leases, landlords, utilities and more. New graduate and professional students are encouraged to start looking for housing 3-4 months before arriving at Penn. Each spring, the University offers online sessions about housing so that incoming graduate students can get this critical information before arriving on campus. The Graduate Student Center’s Resources for New Grad Students includes a section on Moving to Philadelphia, which includes more information on transportation, parking, dining, and more. Contact Graduate Admissions There is no one central Office of Graduate Admissions. All questions about the admissions process should be directed to the academic program of interest. Carefully research the admissions information available online through the Penn Catalog for your prospective program. If you are unable to find the information you require, contact the appropriate School Admissions Office: Annenberg School for Communication 3620 Walnut Street Philadelphia, PA 19104-6220 215-573-6349 Contact Arts & Sciences PhD Programs Graduate Division 3401 Walnut Street, Suite 322A Philadelphia, PA 19104-6228 215-898-8101 Contact Arts and Sciences The College of Liberal & Professional Studies 3440 Market Street, Suite 100 Philadelphia, PA 19104-3335 215-898-7326 Contact Dental Medicine Robert Schattner Center 240 South 40th Street Philadelphia, PA 19104-6030 215-898-8943 Contact Education GSE Admissions Office 3700 Walnut Street Philadelphia, PA 19104-6216, 215-898-6415 Contact Engineering Engineering Admissions 109 Towne Building 220 South 33rd Street, Philadelphia, PA 19104-6391 215-898-4542 Contact Law Law Admissions 3501 Sansom Street, Philadelphia, PA 19104-6204, Contact Perelman School of Medicine Admissions Contact Nursing Claire M. Fagin Hall 418 Curie Blvd., Suite M-5 Philadelphia, PA 19104 215-898-4271 Contact Social Policy and Practice 3701 Locust Walk Philadelphia, PA 19104-6214 215-898-5539 Contact Veterinary Medicine 3800 Spruce Street, Suite 106 Philadelphia, PA 19104-6008 215-898-5434 Contact Weitzman School of Design 110 Meyerson Hall, 210 South 34th Street Philadelphia, PA 19104-6311 215-898-6520 Contact Wharton Graduate Admissions Contact 122 College Hall University of Pennsylvania Philadelphia, PA 19104 215.898.5000 provost@upenn.edu Contact Us © 2024 University of Pennsylvania, Philadelphia, PA 19104 University of Pennsylvania Penn Directory Accessibility"
}