{
  "id": 1,
  "date": "2024-05-18T18:17:41.048767",
  "url": "https://cs.uchicago.edu/academics/masters/masters-program-in-computer-science-mpcs/about-mpcs/",
  "university_name": "University of Chicago",
  "title": "About MPCS",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Masters Program in Computer Science (MPCS) About MPCS MPCS Programs of Study MPCS 9-Course Program MPCS 12-Course Program Joint MBA / MPCS Program MPCS Pre-Doctoral Program Intro to Programming and Math for CS MPCS Admissions Overview MPCS Application Deadlines MPCS Application Requirements MPCS GRE/GMAT Requirement MPCS Visits & Appointments MPCS Tuition & Fees MPCS Faculty MPCS Career Outcomes MPCS Alumni Spotlight Ankit Jaini, Joint MBA/MPCS Class of 2020 Junhao Wang, MPCS Class of 2019 Andrew Eckart, MPCS Class of 2021 Anna Simmons, Joint MBA/MPCS Class of 2021 Dheeraj Bandaru, MPCS Student MPCS Intranet for Current Students MPCS FAQs Contact Us! Academics / Masters Programs About MPCS Our mission is to provide students a deep foundation in computer science and the essentials skills required for a successful career in technology. Our rigorous curriculum covers theory, programming, and applications. Graduates of the MPCS are in demand by top companies for their ability to contribute immediately in technically challenging roles as well as to adapt quickly to rapidly evolving technologies. Our coursework represents a realistic balance between the foundation courses (e.g. programming languages, algorithms, databases, computer systems, etc.) and the applied courses (e.g. application development, machine learning, data analytics, etc.). We challenge our students to think creatively by enhancing the learning experience with technical projects.As a graduate student at one of the world’s premier universities, you will be a member of a unique and distinguished intellectual community and enjoy the many benefits of academic life that the University of Chicago offers. General Information about the Masters Program in Computer Science Collapse All Expand All Fast Facts about the MPCS General Details All MPCS classes meet on the University of Chicago’s main campus in Hyde Park . Core classes are offered during the day for full-time students and in the evening for part-time students. All elective classes meet once a week @ 5:30-8:30 p.m. Small class size:  Core Courses 40+ students; electives 20 students 310 active MPCS students Student Body Demographics 75% Full-time (taking 3 classes/quarter); 25% Part-time (taking 1-2 classes/quarter); 35% Female students 55% International students 40% have undergraduate CS major or minor degrees 30% have no previous CS background Average of 5+ years of work experience; 25% straight from undergrad 15% have other graduate degrees (MBA, MS/PhD in Fin Math, Chemistry, Physics, etc) Average Student Age: 26 Program Retention Rate: 95% Full time students can complete the 9-course degree in 1 year; Part-time students usually finish within 18 months to 2 years. Average GRE scores for admitted students: upper 20th percentile in the quantitative section and upper 50th percentile in the verbal section 60% of graduates are employed in software development/engineering; other areas with significant alumni are technology product management, FinTech, data analysis and research. Over 60% of our alumni work in technology companies, 25% are in finance/trading companies, with others mainly in research organizations/universities, healthcare and technology consulting. 50% of our Full-Time Program graduates are employed on the West Coast, 15% on the East Coast, 30% stay in Chicago, and the rest take jobs outside of the United States. 70% of our Part-Time Program graduates stay in Chicago, with 20% of our students heading to the West Coast or the East Coast, and the rest  take jobs outside of the United States. Teaching Opportunities We seek a diverse pool of applicants who wish to join an academic community that places the highest value on rigorous inquiry and encourages diverse perspectives, experiences, groups of individuals, and ideas to inform and stimulate intellectual challenge, engagement, and exchange. The University’s Statements on Diversity are at https://provost.uchicago.edu/statements-diversity . The University of Chicago is an Affirmative Action/Equal Opportunity/Disabled/Veterans Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, status as an individual with a disability, protected veteran status, genetic information, or other protected classes under the law. For additional information please see the University’s Notice of Nondiscrimination . Job seekers in need of a reasonable accommodation to complete the application process should call 773-702-1032 or email equalopportunity@uchicago.edu with their request. Clinical Appointments No positions available at this time. Please check back for future job announcements. Adjunct Faculty Appointments Adjunct Professor of Computer Science (Open-Rank) Directions & Parking The Masters Program in Computer Science is located at the University of Chicago Hyde Park Campus. Administrative Offices: John Crerar Library (3rd Floor) 5730 South Ellis Avenue Chicago, IL 60637 Crerar Building Directory: Sneha Alagappan – 360A Josh Blackwood – 360A Pauline Condiff – 300 Karin Czaplewski – 328 Miranda Peterson – 360A Lamont Samuels – 398D Borja Sotomayor – 209 Molly Stoner – 348 John Crerar Library Map Campus Map Parking: The University’s Campus North Parking Lot on S Ellis Ave and 55th is the closest parking structure to Crerar. Parking rates John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Email This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}