{
  "id": 1,
  "date": "2024-05-18T18:17:28.918565",
  "url": "https://cs.uchicago.edu/academics/masters/masters-program-in-computer-science-mpcs/mpcs-faqs/",
  "university_name": "University of Chicago",
  "title": "MPCS FAQs",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Masters Program in Computer Science (MPCS) About MPCS MPCS Programs of Study MPCS 9-Course Program MPCS 12-Course Program Joint MBA / MPCS Program MPCS Pre-Doctoral Program Intro to Programming and Math for CS MPCS Admissions Overview MPCS Application Deadlines MPCS Application Requirements MPCS GRE/GMAT Requirement MPCS Visits & Appointments MPCS Tuition & Fees MPCS Faculty MPCS Career Outcomes MPCS Alumni Spotlight Ankit Jaini, Joint MBA/MPCS Class of 2020 Junhao Wang, MPCS Class of 2019 Andrew Eckart, MPCS Class of 2021 Anna Simmons, Joint MBA/MPCS Class of 2021 Dheeraj Bandaru, MPCS Student MPCS Intranet for Current Students MPCS FAQs Contact Us! Academics / Masters Programs MPCS FAQs Please review the below MPCS frequently asked questions. Still have questions? Email us at mpcs-admissions@lists.uchicago.edu MPCS Application Related Questions Collapse All Expand All I don't have a background in Computer Science, but I'm interested in applying to the program. Will that affect my chances of admission? The MPCS is unique among top CS programs in that we do not require an undergraduate background in computer science. Students join our program with a wide variety of backgrounds. The MPCS is highly competitive and highly quantitative in nature, and as such, during the application review process, we look for evidence of strong quantitative abilities in the form of previous coursework and GRE/GMAT quantitative scores. While we do not have a minimum GPA requirement or minimum GRE/GMAT test score requirement, successful applicants to the MPCS have demonstrated strong quantitative ability with scores on the quantitative section of the exam above the 80th percentile. Can I make changes to my online application after it has been submitted? If you wish to add new material, such as grades from a recent semester or quarter, you may do so by uploading them through the “Other Miscellaneous Documents” section of your online account. If you have submitted erroneous information, or if you believe there has been a technical or formatting error that occurred during your application’s submission, please contact us directly. I've sent my official test scores to the Univeristy of Chicago, but my scores are still listed as missing on my application summary. Why have my test scores not been verified on my online application? Test scores can take up to 7-10 business days (and sometimes longer) to reach us after you submit them. Please be patient. If you believe your test scores have already been received by the university and should have been verified, please contact UChicago GRAD at gradadmissions@uchicago.edu Please include in the email: your reference number and any information you have regarding how/when the official score was sent. For the GRE and TOEFL, the batch number from ETS is usually helpful, as is information on any possible mismatches in how your name, email address, or other data may appear between your application account and your test scores. For the IELTS, we will need the TRF code. Can I use a letter service for subitting letters of reccommendation, such as Interfolio? If you are using a letter service to submit letters of recommendation, such as Interfolio, that should work fine so long as you are using a verified service. Please note that they must be able to be verified as coming directly from the recommender, and you must rescind your right to view the letters before they are sent. Is there a minimum GPA requirement to apply to the MPCS? The MPCS does not have a minimum GPA requirement — stronger emphasis is placed on the quantitative GRE/GMAT score and individual grades in quantitative classes, rather than a cumulative GPA. Can I apply to both the Pre-Doctoral Program and the 9-Course or 12-Course Specialization MS Program? No. You can only apply to one MPCS Program of Study at a time. Applications to the Pre-Doctoral program WILL NOT be reviewed for the MS in Computer Science program. If you apply to both programs, only the Pre-Doc application will be reviewed. If you apply to the Pre-Doc program in Round 1 and are not admitted, you can apply to the MS in Computer Science Full-Time program in Round 2. How and when will I be notified of the admissions committee decision? You will receive your admissions decision by the Notification date listed on the Application Deadlines page. You may also check your application status via the online application system . How do I appeal an admissions decision? Decisions made by the admissions committee are final and not subject to appeal or revision . If I am denied in Round 1, can I re-apply to Round 2? If you are denied during the Round 1 application deadline, you may not re-apply for the Round 2 application deadline. If you are denied during any application deadline, you must wait until the next application year to submit a new application. MPCS Program Related Questions Collapse All Expand All How long will it take to complete my degree? The key to getting the most out of your time commitment is to choose between full-time and part-time options depending on your other obligations. The full-time program allows a student to complete the program within one year, while the part-time program gives more flexibility for working students. Full-time students are able to complete the 9-course MS in 9 months and the 12-course MS in 15 months. The part-time program can be completed at your own pace, with most students completing the program within 18 months to 2 years. Can I pursue my degree part-time or full-time? Students can choose to apply to the MPCS as a full-time or a part-time student. A full-time course load is three (3) classes per quarter. Part-time is one-two (1-2) classes per quarter. Changes to enrollment status need to be approved by the MPCS administration. Please note: Students who will require a student visa to study at any point during thier time in the MPCS must apply to the full-time program and must maintain a full-time course load of at least three (3) classes per quarter. Part-time students are not eligible for a student visa. Are masters students eligible for teaching/research assistantships? All TA/RA positions are reserved for students in the PhD program. What is the cost of tuition? Tuition for the Masters Program in Computer Science is $6,593 USD per course for the 2023-24 academic year. Please consult The University of Chicago’s Bursars Office for complete tuition information. Where are classes held and how often do classes meet? MPCS courses are held on the main campus of the University of Chicago located in Hyde Park, approximately eight (8) miles south of downtown Chicago. Unless specifically noted on the course schedule, most classes meet once per week from 5:30 PM – 8:30 PM. Can I transfer credits from another institution? The MPCS does not allow the transfer of credits from any other graduate program. Do you offer financial support to MS students? The MPCS offers very a limited number of merit-based, partial-tuition scholarships, and no full-tuition scholarships. Students are automatically considered for scholarships at the time of admission and there is not a separate application to be considered. The majority of funds in the CS Department are reserved for CS PhD Students. Any students interested in need based financial aid can contact the UChicago Grad Financial Aid Office . The Student Loan Administration has some helpful information regarding the cost of attendance and living in Chicago during your graduate study. We encourage all international students to investigate outside sources of aid, including programs within their home nation, as well as organizations such as EducationUSA the Institute of International Education and International Education Financial Aid . Further information about educational funding can be found here . What degree will I receive on my diploma? Students completing the program earn a Master of Science in Computer Science . The degree is awarded by the University of Chicago through the Division of Physical Sciences, Department of Computer Science. What is the difference between the 9-course program and the 12-course program? The 12-course program is designed for students who are interested in seeking further specialization beyond our regular 9-course program . Students in the 12-course program can take additional classes in one of the following five specializations: Application Development Data Analytics High Performance Computing Software Engineering The additional specialization will offer a stronger professional skill set and the opportunity for an internship or research project. Can I take classes in other departments in the University and have them count toward my degree? As part of the MPCS degree, students may request to take the following types of classes outside of the MPCS: Coursework in the CS department, such as upper undergraduate level (20000) and PhD level (30000) classes. Up to two (2) courses from non-CS PSD graduate level courses or courses from other graduate divisions and schools (e.g., Booth School of Business). No previous coursework prior to entering the program will be considered towards your degree. Please refer to the Courses outside the MPCS policy. What is the difference between a research-based and applied curriculum? Graduate programs in computer science can either be theory-focused or skills-focused. Theory is meant for students interested in research. Skills-focused is designed for students interested in a professional career in the field. University of Chicago’s Masters Program in Computer Science is highly skills-focused. For a person interested in a computer science career it is important to select a program that focuses on a wide range of applied skills. The MPCS curriculum represents a realistic balance between the foundation courses and the applied courses. We are always adding new and innovative courses to keep up with the fast-paced world of IT, including courses in Software Engineering, Big Data, Data Analytics, High Performance Computing, Information Security, Application Development, Web Development and Cloud Computing. The courses, projects, tech talks and student organizations are all designed to truly develop what is needed to succeed in the workplace. Employers are interested in demonstrated knowledge and skills. Our program helps you meet the needs of the workforce, no matter your background, by developing hard computer science skills with an advanced education degree. Does this program qualify for the OPT STEM extension? Yes, the MPCS MS in Computer Science degree does qualify for the OPT STEM extension . GRE/GMAT and TOEFL/IELTS Related Questions Collapse All Expand All Am I required to submit a GRE/GMAT score? Please see our GRE/GMAT Requirement page . Am I required to submit a TOEFL/IELTS score? In order to waive the English language requirement, you must satisfy the criteria listed here . If you do not meet the criteria for a TOEFL/IELTS waiver, official scores will be required for you application to the MPCS. If the academic background included in the Education section of your application fulfills the requirements for a waiver, your TOEFL/IELTS score will automatically be waived on the online application. If your background qualifies for a waiver and you are unable to submit your application, please contact admin-mpcs@lists.uchicago.edu . What are the minimum GRE/GMAT scores required to apply to the MPCS? The program does not have minimum GRE requirements, however, successful applicants have earned the following scores in the General GRE test: Verbal: 50th percentile and above Quantitative: 80th percentile and above What are the minimum TOEFL/IELTS scores required to apply to the MPCS? ​The MPCS requires TOEFL scores to be 100 or above (or IELTS overall score of 7) in order to be eligible for admission to the University of Chicago. How recent must my GRE/GMAT and TOEFL/IELTS scores be? GRE/GMAT is valid for five (5) years. TOEFL/IELTS is valid for two (2) years. How can I send my scores? GRE: If you are taking the GRE, request the scores to be sent to the University of Chicago; the University of Chicago institutional code for ETS is 1832. GMAT: The GMAT code for University of Chicago – Masters Program in Computer Science is H9x-WG-56. TOEFL: If you are taking the TOEFL, request the scores to be sent to the University of Chicago; the University of Chicago institutional code for ETS is 1832. IELTS: University of Chicago downloads IELTS scores that have been transmitted to our e-download account. Please contact your test center and request that your scores be sent to the following IELTS e-download account: University of Chicago – Graduate Enrollment 970 East 58th Street, Third Floor Chicago, IL 60637 We will not accept paper IELTS test report forms. John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}