{
  "id": 1,
  "date": "2024-05-18T18:18:59.331435",
  "url": "https://cs.uchicago.edu/academics/undergraduate/career-resources/",
  "university_name": "University of Chicago",
  "title": "Jobs & Career Resources",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Undergraduate Program Overview Admission CS Major FAQ Joint Bx/MS Programs Courses Master’s Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs Program Overview Qualifying Phase Admission to Candidacy Dissertation & Defense Advisors & Committees Oral Exam Procedures Admission Course Requirements Annual Review Joint Math/CS PhD FAQ on PhD Requirements Graduate Fellowship Opportunities 2023-24 Academic Year Graduate Student Leadership Courses Admission Course Highlights Jobs & Career Resources Summer Research Student Organizations Jobs & Career Resources The department and the university provide a number of resources to help students connect with career opportunities: CS Job Board : The department runs a job board where employers can advertise full-time opportunities and internships. The job board also includes sections for part-time opportunities (typically on-campus), as well as entrepreneurial opportunities. Career Advancement : This is the university’s central office for undergraduate career advancement services, including a campus-wide job board for undergraduates, and career advisors. UChicagoGRAD : This is the university’s central office for graduate student resources, including career advancement services. Tech Talks: The department hosts tech talks from employers interested in recruiting CS students. Past speakers include Google, Facebook, Uber, and many others, including small/medium companies based in Chicago. While these tech talks happen throughout the year, most of them happen in the Autumn, the peak recruitment season for industry positions. Career Advice Sessions: The department and Career Advancement host joint events throughout the year to provide students with useful pointers and resources for their job search. The main sessions take place at the start of the quarter: one for 1st/2nd/3rd year students to provide advice on how to search for internships, and one for 4th years focused on full-time jobs. Graduate School resources: The Physical Sciences Division holds a day-long “Graduate School Exploration” workshop in the Fall. The department also holds joint events with Career Advancement that are intended specifically for Computer Science undergrads interested in pursuing a Masters or PhD degree. Career-oriented events are added to the Student Activities Calendar , and are also announced on the ACM mailing list . Make sure to subscribe to this mailing list if you’d like to receive e-mail reminders of these events. John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}