{
  "id": 1,
  "date": "2024-05-18T18:19:14.958520",
  "url": "https://cs.uchicago.edu/academics/undergraduate/joint-bx-ms-programs/",
  "university_name": "University of Chicago",
  "title": "Joint Bx/MS Programs",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Undergraduate Program Overview Admission CS Major FAQ Joint Bx/MS Programs Courses Master’s Programs PhD Programs Admission Course Highlights Jobs & Career Resources Summer Research Student Organizations Joint Bx/MS Programs The Computer Science Department offers three BA/MS and BS/MS degree options (simply Bx/MS, hereafter): a research-oriented option for Computer Science majors, a professionally-oriented option for Computer Science majors, a professionally-oriented option for non-CS majors. Students in Option 1 complete PhD-level coursework and a research-oriented MS paper as part of their degree, while students in Options 2 and 3 complete professionally-oriented coursework, mostly drawn from the department’s Masters Program in Computer Science . In this program, students complete all or nearly all their undergraduate requirements in their first three years of study, and their graduate requirements in a fourth year of study. As such, this program is only open to outstanding undergraduates who are on track to complete their BA/BS requirements by the end of their third year (with, at most, 2-3 undergraduate courses left to complete during their fourth year). Detailed degree requirements can be found in the College Catalog . Students interested in applying should review the slides from the Bx/MS info session. Students apply to start the Bx/MS program in: Autumn Quarter of their fourth year, graduating in the following Spring Quarter Winter Quarter of their fourth year, graduating in the following Summer Quarter or Autumn Quarter This program has two admission cycles: one in January/February to apply to the Autumn Quarter start, and one in June to apply to the Winter Quarter start. Students interested in a Winter Quarter start should not apply in the first admissions cycle. Applications are to be submitted through the PSD graduate application site (in the Application tab, select Master’s Degree as the Degree Type, and then Masters Program in Computer Science as the Program Name and Bx/MS in Computer Science as the Field of Interest). Application Deadlines: Autumn 2024: Monday, January 29th, 2024, at 5pm Winter 2025: Monday, June 10th, 2024, at 5pm John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Name This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}