{
  "id": 1,
  "date": "2024-05-18T18:19:19.148451",
  "url": "https://cs.uchicago.edu/academics/phd/phd-program-overview/",
  "university_name": "University of Chicago",
  "title": "PhD Program Overview",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Undergraduate Master’s Programs PhD Programs Program Overview Qualifying Phase Admission to Candidacy Dissertation & Defense Advisors & Committees Oral Exam Procedures Admission Course Requirements Annual Review Joint Math/CS PhD FAQ on PhD Requirements Graduate Fellowship Opportunities 2023-24 Academic Year Graduate Student Leadership Courses Admission Course Highlights Jobs & Career Resources Summer Research Student Organizations PhD Program Overview The aim of the program is for students to acquire the skills to produce successful research in Computer Science. A central component of the program is the interaction of the student with their research advisor, and with the research community. We expect that throughout the program advisors and students will determine the best course of action within the program, within the general rules below. The PhD program proceeds in three phases: Qualifying Phase : acquire a basis of knowledge, techniques and skills in Computer Science Candidacy Phase : gain admission to candidacy Dissertation Phase : write and defend a dissertation During the first phase, the Qualifying Phase, the students demonstrate knowledge in several fundamental subareas of Computer Science, start doing research, and refine their research interests, including identifying a research advisor. They will also show competence in writing, producing a technical document (a research or survey paper) that indicates that the student is qualified to pursue their studies eventually leading to a doctorate. The Qualifying Phase ends with a public exam, in which the student presents their paper, and answers questions. Success in this Qualifying Exam leads to the next phase where the student is expected to identify a research topic, and start doing research. This phase concludes with a Candidacy Exam, where the student demonstrates to their committee that they have a viable plan for their PhD. After successful completion of the Candidacy Exam the student will continue to do research, obtaining results that constitutes their PhD dissertation. The last phase concludes with a successful thesis defense. Throughout the process, students document successful research in appropriate publications. Exceptions Exceptions to the PhD program requirements will be made only in very extenuating circumstances. Students planning to petition for an exception should first consult their advisor and the Director of Graduate Studies. Minor exceptions require approval of the Graduate Committee. Major exceptions require approval of the entire faculty. No exceptions can be made to University requirements. Maintaining Good Standing To continue to advance through the PhD program, students must maintain good academic standing. In general, good standing means that the student is working actively in the Department’s research community under the guidance of an advisor, and making progress towards completing their dissertation within the allotted time frame. Normally, students conform to the timeline below: Have a research advisor by the end of Summer Quarter, but preferably by the end of Spring Quarter of their first year Complete the coursework for the Qualifying Phase by the end of Spring Quarter of their second year Pass their Qualifying Exam by the end of Autumn Quarter of their third year Pass their Candidacy Exam by the end of the Autumn Quarter of their fifth year Have their Thesis Defense by Spring Quarter of their sixth year. These timeline requirements are automatically extended during approved leaves of absence. Note: Meeting these requirements is the student’s responsibility. Alternative Timelines and Exceptional Circumstances There may be reasons for which students are not best served by the timeline above. In this case, the student and Advisor should submit an alternate plan to the Graduate Committee. The plan should include a new timeline and its justification. A student who has joined the program under special circumstances and a timeline that explicitly differs from the standard 6-year one, will be subject to the timeline specified at their admission. Students with questions may contact Megan Woodward (Student Affairs Administrator), Ben Zhao (Director of Graduate Studies), Bahareh Lampert (Dean of Students in the Physical Sciences Division), or Amanda Young (Associate Director, Graduate Student Affairs) in UChicagoGRAD. John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Name This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}