{
  "id": 1,
  "date": "2024-05-18T18:06:20.400517",
  "url": "https://cs.uchicago.edu/mpcs",
  "university_name": "University of Chicago",
  "title": "",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet Academics / Masters Programs Masters Program in Computer Science The mission of the Masters Program in Computer Science (MPCS) is to provide students a deep foundation in computer science and the essentials skills required for a successful career in technology. Our rigorous curriculum covers theory, programming, and applications. MPCS Admissions Overview The application for the MPCS 2024 - 2025 academic year is open! Find all admission information here. Learn More MPCS Visits & Appointments Discover your future in computer science with the MPCS Admissions Team. Whether you're seeking insight into our academic program, application... Learn More MPCS Intranet for Current Students Information for current MPCS students including degree requirements, program policies, and request forms. Learn More Questions? Email us at: mpcs-admissions@lists.uchicago.edu Contact Us! Programs of Study The Masters Program in Computer Science offers the following Programs of Study to accommodate students with a wide range of backgrounds and interests. All of our programs (with the exception of the Pre-Doctoral MS in Computer Science) can be completed either Full-Time or Part-Time. 9-Course Program 12-Course Program Joint MBA / MPCS Program Pre-Doctoral Program Intro to Programming and Math for CS MPCS Faculty Experienced instructors who offer a comprehensive and professionally-oriented CS education combining the foundations of computer science with the applied and in-demand skills necessary for careers in technology. Meet the MPCS Faculty Career Outcomes MPCS graduates are in demand by top companies for their ability to contribute immediately in technically challenging roles as well as to adapt quickly to rapidly evolving technologies. Career Outcomes Alumni Profiles Ankit Jaini, Joint MBA/MPCS Class of 2020 Ankit Jaini graduated from the Joint MBA/MPCS Program in 2020. He is currently a Product Manager at WhatsApp (Meta). In... Learn More Anna Simmons, Joint MBA/MPCS Class of 2021 The University of Chicago Masters Program in Computer Science students push boundaries and innovate across many facets of industry. Whether... Learn More Dheeraj Bandaru, MPCS Student MPCS Student Competes in Social New Venture Challenge Learn More Admissions Overview Admission to the MPCS is highly-selective and is based upon careful review of all sections of an applicant's application. Find deadlines, application requirements, and more for the 2023 - 2024 academic year below. Admissions Overview Application Requirements Application Deadlines GRE/GMAT Requirement Webinars Tuition & Fees Apply The application for the AY 2024-2025 is now open! Apply Now About MPCS Our mission is to provide students a deep foundation in computer science and the essentials skills required for a successful... Learn More MPCS FAQs Please review the below MPCS frequently asked questions. Still have questions? Email us at mpcs-admissions@lists.uchicago.edu Learn More Job Openings Join us in building the future of computer science at the University of Chicago. Learn More John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Phone This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}