{
  "id": 1,
  "date": "2024-05-18T18:20:15.217192",
  "url": "https://cs.uchicago.edu/about/",
  "university_name": "University of Chicago",
  "title": "",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet About CS at UChicago Defining and building the future of computer science, from theory to applications and from science to society. Message From The Chair The University of Chicago is a unique environment for computer science. Here, students and faculty can explore all corners of the field, from theory to applications. They can work at the intersection of computer science and other disciplines, including the social and physical sciences, policy, business, and biomedicine, benefit from the world-class city of Chicago, and make an immediate impact, both locally and globally. UChicago CS: Computing on the Edges The New Era of CS at UChicago Watch a video featuring our new research space in the John Crerar Library Building. A Modern, Collaborative Research Hub With plenty of collaboration and meeting spaces, flexible lab space, expanded instructional labs and with new neighbors such as the Media Arts, Data and Design Center, the Data Science Institute, and campus visualization and GIS facilities, the John Crerar Library building is a hub of activity for advanced computing and data. Explore Diversity at UChicago CS At the University of Chicago Department of Computer Science, we welcome students of all backgrounds and identities. In order to achieve our educational and research missions, it is essential to establish and maintain a community of diverse voices. UChicago CS manages and participates in a number of programs and initiatives that support students from groups underrepresented in the field. Learn More An Expanding, Award-Winning CS Faculty Since 2017, we have added 37 faculty members, with specialties in rising research areas such as data science, security, machine learning and artificial intelligence, visual computing, and human-computer interaction. UChicago CS News • Jun 26, 2023 UChicago CS To Welcome Nine New Faculty Members Over the Next Two Academic Years UChicago CS News • Aug 11, 2022 New 2022-23 Faculty Add Expertise in Linguistics, Visualization, Economics, and Data Science Education UChicago CS News • Sep 16, 2021 Trio of New UChicago CS Faculty Join for 2021-22 Academic Year A Rapidly Growing Department The University of Chicago has seen tremendous growth in computer science in the last ten years, more than doubling our faculty, increasing the number of undergraduate CS majors tenfold, and tripling the size of our PhD student population. 0 Tenure-Track Faculty 0 BA/BS Degrees Awarded/Year 0 PhD Students Interdisciplinary and Experiential CS Education Computer science is one of the fastest growing undergraduate majors in the College, and we added a new major in data science in 2021. We provide a growing set of options for Masters degrees, including the Masters Program in Computer Science (MPCS), the Computational Analytics and Public Policy (CAPP) with Harris Public Policy, and a joint program with the Booth School of Business. Our PhD and Masters programs produce highly qualified graduates for careers in academia, industry, and government. Undergraduate BA and BS degrees that prepare students for graduate study or careers in computing, technology, and related fields. Learn More Master's Programs Degree-granting programs that prepare students for careers in technology, government, and other computing-based fields. Learn More PhD Programs Our PhD program helps students acquire the skills to produce successful research in computer science. Learn More A Rich Computer Science Community UChicago CS benefits from and contributes to the University of Chicago’s excellence across the spectrum of sciences, policy, business, and medicine, and emphasizes the importance of collaboration and cross-fertilization across these domains. Slide to Previous Slide Slide to Next Slide Slide to Previous Slide Slide to Next Slide Chicago: A Tech Hub on the Rise The University of Chicago campus benefits from its location in the world-class city of Chicago, a vibrant, diverse city of industry and culture where translational research can have an immediate impact, both locally and globally. Chicago named one of the fastest growing US tech hubs Chicago voted \"Best Big City\" six years running Illinois Science & Technology Coalition P33: Catalyzing the Chicago Tech Sector Join Us at UChicago Computer Science We are currently hiring tenure-track faculty in data science, teaching faculty, and research, technical, and administrative staff positions. Apply John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}