{
  "id": 1,
  "date": "2024-05-18T18:17:36.111493",
  "url": "https://cs.uchicago.edu/academics/masters/masters-program-in-computer-science-mpcs/mpcs-alumni-spotlight/dheeraj-bandaru-mpcs-student/",
  "university_name": "University of Chicago",
  "title": "Dheeraj Bandaru, MPCS Student",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Masters Program in Computer Science (MPCS) About MPCS MPCS Programs of Study MPCS Admissions Overview MPCS Faculty MPCS Career Outcomes MPCS Alumni Spotlight Ankit Jaini, Joint MBA/MPCS Class of 2020 Junhao Wang, MPCS Class of 2019 Andrew Eckart, MPCS Class of 2021 Anna Simmons, Joint MBA/MPCS Class of 2021 Dheeraj Bandaru, MPCS Student MPCS Intranet for Current Students MPCS FAQs Contact Us! Academics / Masters Programs / MPCS Spotlight Dheeraj Bandaru, MPCS Student MPCS Student Competes in Social New Venture Challenge For University of Chicago graduate student Dheeraj Bandaru, resourcefulness is a natural route to innovative success. Blending his passions for computer science and paying it forward, Bandaru created a business model to sell major cities’ food supply surplus via food trucks to underserved populations. After extensive networking, discussions, and conceptualizing, a team composed of UChicago graduate students (MPCS Students: Dheeraj Bandaru & Andy Rodriguez; and UChicago Grad Student Katie O’Brien) and their close associates founded the enterprising Social New Venture Challenge business plan, Stoked . Starting in undergraduate studies at Georgia Tech, Bandaru’s initial linking of computer science and sustainable business paved a foundation for his inventive ideas while interning for Atlanta’s City Planning Department. A major issue in Atlanta, and other major cities across the United States, is wasted food supply surplus; yet, there is an alarming amount of the US population going hungry. Bandaru understood the fundamental issue at hand: the supply chain isn’t built to move food waste to people who need food. In order to create a business plan to feed underserved Atlanta populations using farmers’ gleaning crops, Bandaru initially reflected on his experience as a member of Georgia Tech’s chapter of the Food Recovery Network . Bandaru considered a similar non-profit approach to feeding underserved communities, however, to organize a more expansive and profitable approach to the gleaning crop, food insecure blunder, a for profit business was the more realistic and achievable choice. Implementing a for profit plan allows for reinvestment, expansion, and ultimately, a more timely solution to gleaning crop expiration. Brainstorming efficient and practical business ideas, Bandaru and former co-founder of Common Moon , Sanjeeth Rajaram found a solution: food trucks. According to Bandaru, Stoked is a “restaurant group of food trucks that is a social mission minded for profit company.” Though for profit may not be deemed the socially conscious approach to feeding underserved populations, the Stoked team found that competing against non-profits for grants and donations would not provide immediate support for their rapidly growing goals. As a for profit organization, Bandaru explains, “[Stoked] is socially focused, in that we’re trying to serve underserved communities.” When considering their target market, the Stoked team wanted to focus on a population often overlooked; those considered above the federal poverty line, but earning less than the cost of living. Bandaru continues, “they have to be served differently than the way food banks or other nonprofits are attempting to do it.” For the Stoked team, Bandaru in particular, the passions for CS, learning, and social change intersect, fueling inspiration for this SNVC business model with a social mission. Stoked partnered with Aztec Dave’s, a familiar food truck that is often stationed at University of Chicago, to run a pilot of their business plan. Plan on visiting the Stoked team on May 12th between 11:00 a.m. and 1:30 p.m. on 58th Street & Ellis Ave. Follow the Stoked team as they compete on May 23, 2023 for up to $150,000 toward their venture in the final round of the Social New Venture Challenge. For more information about the SNVC, visit the Polsky Center for Entrepreneurship and Innovation . John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Email This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}