{
  "id": 1,
  "date": "2024-05-18T18:17:36.948071",
  "url": "https://apply-psd.uchicago.edu/apply/",
  "university_name": "University of Chicago",
  "title": "The University of Chicago: Graduate Studies",
  "content": "This website uses scripting to enhance your browsing experience. Enable JavaScript in your browser and then reload this website. This website uses resources that are being blocked by your network. Contact your network administrator for more information. The University of Chicago: Graduate Studies Application Management Welcome! Thank you for your interest in applying to a graduate program in the Physical Sciences Division of the University of Chicago. Through this site, you can apply to the following degree programs: Astronomy and Astrophysics (PhD) Biophysical Sciences (PhD) Chemistry (PhD) Computational and Applied Mathematics (MS) Computational and Applied Mathematics (PhD) Computer Science (PhD) Data Science (MS) Data Science (PhD) Financial Mathematics (MS) Geophysical Sciences (PhD) Masters Program in Computer Science (MS) Master of Science in Applied Data Science (Full-Time) Master of Science in Applied Data Science (Part-Time) Mathematics (PhD) Physics (PhD) Statistics (MS) Statistics (PhD) You may begin your application using the “Start New Application” link below . Please note that if you plan to apply to more than one program, you should begin a new application for each program. If you have any questions about your application, please contact the program to which you are applying. Contact information can be found under the listings of graduate programs on the Graduate Admissions website . Non-Degree Visiting Student Status (NDVS) : NDVS is available to advanced graduate and undergraduate students pursuing a degree at another institution who have been invited by a University of Chicago faculty member to temporarily work on their research project. This status also applies to undergraduate students participating in summer research opportunities such as the PKU-CCME exchange program or other research experiences for undergraduates (REUs).  Questions about NDVS status may be directed to Sierra Sterling at ssterlin@uchicago.edu Toyota Technological Institute at Chicago (TTIC): TTIC students participating in research or University of Chicago courses should complete a non-degree application on this site to establish a student record with the University of Chicago. Returning users: Log in to continue an application. First-time users: Create an account to start a new application. The University of Chicago Graduate Admissions Privacy Notice | Contact Us | Technical Support Non-discrimination Statement © 2018, The University of Chicago"
}