{
  "id": 1,
  "date": "2024-05-18T18:19:59.963458",
  "url": "https://cs.uchicago.edu/research/quantum-computing/",
  "university_name": "University of Chicago",
  "title": "Quantum Computing",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet Research Highlight Quantum Computing In This Section Research Highlights Quantum Computing Data Science Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Partners Postdoctoral Researchers Quantum computing promises to be the next paradigm of computing, harnessing the principles of quantum physics to perform computations and conduct tasks impossible for classical architectures. Today, researchers in academia and industry rapidly advance the field by designing new hardware, software, and algorithms that bring quantum computers closer to their great potential for unlocking new knowledge in physics, chemistry, cryptography, and other fields. UChicago CS boasts many faculty, research groups, and students engaged at the frontier of this groundbreaking technology, exploring new ways of programming, designing, and teaching about quantum computers. The Enabling Practical-Scale Quantum Computing (EPiQC) collaboration, funded by an NSF Expedition in Computing grant and led by UChicago CS Professor Fred Chong, advances the abilities of near-term quantum computers. The department also benefits from deep connections with the Chicago Quantum Exchange, the National Quantum Information Science Research Centers at Argonne and Fermilab, and companies such as IBM and Intel. Quantum Computing Research and Education UChicago CS faculty research and teach about quantum computing hardware, software, programming, algorithms, and theory, building the future of this innovative technology. Enabling Practical-scale Quantum Computing (EPiQC) Launched in 2018 with a $10 million “Expeditions in Computing” grant from the National Science Foundation, the multi-institutional EPiQC collaboration seeks to narrow the gap to quantum computers capable of unprecedented feats. Quantum machines may soon be capable of performing calculations in chemistry, physics, and other fields that are extremely difficult or even impossible for today’s computers. The EPiQC mission is to develop new algorithms, software, and machine designs tailored to key properties of quantum device technologies with 100 to 1000 quantum bits — the scale researchers expect to reach over the next decade. EPiQC is led by Fred Chong, Seymour Goodman Professor of Computer Science at UChicago, and includes collaborators from Duke, MIT, UCSB, Princeton, Argonne, Carnegie Mellon, and Georgia Tech. Faculty and student researchers in EPiQc have received numerous conference best paper and IEEE Top Picks awards, fellowships in industry, and started businesses in the emerging quantum sector. The collaboration also lays the foundation for tomorrow’s quantum computing experts, with innovative curricula, online courses, and museum exhibits reaching students from kindergarten through graduate school. UChicago CS News • Apr 28, 2022 First-Year PhD Student Co-Authors Outstanding Paper Award Winner at TQC 2022 Apr 28, 2022 UChicago CS News • May 27, 2021 Three EPiQC Papers Chosen By IEEE Micro for Annual Top Picks Awards May 27, 2021 UChicago CS News • Aug 05, 2020 University of Chicago and UIUC Lead New Quantum Education Program Aug 05, 2020 The UChicago Quantum Community Quantum technology is about more than just computing, stretching into communication, sensing, imaging, and other scientific fields. The University of Chicago and its affiliated laboratories are global leaders in exploring this new frontier and its groundbreaking applications. linkout Chicago Quantum Exchange linkout STAQ: Software-Tailored Architectures for Quantum Co-Design linkout Polsky Center for Entrepreneurship and Innovation Designing the Future of Quantum Computing Fred Chong Seymour Goodman Professor of Computer Science Lead Principal Investigator, EPiQC Chief Scientist for Quantum Software, ColdQuanta Fred Chong is the Seymour Goodman Professor in the Department of Computer Science at the University of Chicago and the Chief Scientist for Quantum Software at ColdQuanta. He is also Lead Principal Investigator for the EPiQC Project (Enabling Practical-scale Quantum Computing), an NSF Expedition in Computing. Chong is a member of the National Quantum Advisory Committee (NQIAC) which provides advice to the President and Secretary of Energy on the National Quantum Initiative Program. In 2020, he co-founded Super.tech, a quantum software company, which was acquired by ColdQuanta in 2022. Chong received his Ph.D. from MIT in 1996 and was a faculty member and Chancellor’s fellow at UC Davis from 1997-2005. He was also a Professor of Computer Science, Director of Computer Engineering, and Director of the Greenscale Center for Energy-Efficient Computing at UCSB from 2005-2015. He is a recipient of the NSF CAREER award, the Intel Outstanding Researcher Award , and 13 best paper awards. His research interests include emerging technologies for computing, quantum computing, multicore and embedded architectures, computer security, and sustainable computing. Prof. Chong has been funded by NSF, DOE, Intel, Google, AFOSR, IARPA, DARPA, Mitsubishi, Altera and Xilinx. He has led or co-led over $40M in awarded research, and been co-PI on an additional $41M. Learn More William Fefferman Assistant Professor of Computer Science I am an Assistant Professor in the computer science department at the University of Chicago. Previously, I held research positions at the University of California at Berkeley, advised by Umesh Vazirani, and in QuICS, at the University of Maryland/NIST. I received my Ph.D. in computer science in the Department of Computer and Mathematical Sciences and the Institute for Quantum Information and Matter at Caltech, co-advised by Alexei Kitaev and Chris Umans. Learn More Diana Franklin Associate Professor of Computer Science Diana Franklin is a Research Associate Professor in Computer Science and Director of Computer Science Education at UChicago STEM Education. She leads the CANON (Computing for ANyONe) research labs, currently consisting of four projects involving computer science education involving students ranging from preK through university. She is the lead PI for quantum computing education for EPiQC, an NSF expedition in computing. Her research agenda explores how to create curriculum and computing environments in ways that reach broad audiences. Learn More Robert Rand Assistant Professor of Computer Science I am an Assistant Professor of Computer Science, part of the Programming Languages Research Group and the Chicago Quantum Exchange . My main interest is in applying techniques from programming languages and formal verification to the domain of quantum computation. Learn More Slide to Previous Slide Slide to Next Slide EPiQC Zine Project A team of EPiQC staff, undergraduate and graduate students, and freelance artists have produced zines to educate the public about the history of quantum computing and topics such as superposition, entanglement, and reversibility. EPiQC Zine Project A team of EPiQC staff, undergraduate and graduate students, and freelance artists have produced zines to educate the public about the history of quantum computing and topics such as superposition, entanglement, and reversibility. EPiQC Zine Project A team of EPiQC staff, undergraduate and graduate students, and freelance artists have produced zines to educate the public about the history of quantum computing and topics such as superposition, entanglement, and reversibility. EPiQC Zine Project A team of EPiQC staff, undergraduate and graduate students, and freelance artists have produced zines to educate the public about the history of quantum computing and topics such as superposition, entanglement, and reversibility. Quantum Computing News & Events Slide to Previous Slide Slide to Next Slide UChicago CS News Fred Chong Receives Quantrell Award for Excellence in Teaching May 16, 2024 UChicago CS News Non-Unital Noise Adds a New Wrinkle to the Quantum Supremacy Debate Apr 05, 2024 UChicago CS News Argonne scientists use AI to identify new materials for carbon capture Feb 19, 2024 In the News New research unites quantum engineering and artificial intelligence Jan 29, 2024 UChicago CS News Group From UChicago CS To Present Four Papers at Most Prestigious International Quantum Conference Jan 09, 2024 UChicago CS News UChicago Scientists Make New Discovery Proving Entanglement Is Responsible for Computational Hardness In Quantum Systems Jul 25, 2023 UChicago CS News Virtual Bakery Game Serves Up Both Cupcakes and Quantum Concepts For K-12 Students Mar 27, 2023 UChicago CS News Assistant Professor Robert Rand Receives Air Force Young Investigator Grant Dec 19, 2022 UChicago CS News Prof. Fred Chong Reappointed to National Quantum Initiative Advisory Committee Dec 13, 2022 UChicago CS News Professor Fred Chong Named IEEE Fellow Dec 09, 2022 UChicago CS News Associate Professor Diana Franklin Named ACM Distinguished Member Dec 07, 2022 In the News Alumnus Pranav Gokhale Named to Crain’s 40 Under 40 Nov 07, 2022 Slide to Previous Slide Slide to Next Slide John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}