{
  "id": 1,
  "date": "2024-05-18T18:18:00.410309",
  "url": "https://cs.uchicago.edu/mpcs-career-outcomes/",
  "university_name": "University of Chicago",
  "title": "MPCS Career Outcomes 2022-23",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Masters Program in Computer Science (MPCS) About MPCS MPCS Programs of Study MPCS 9-Course Program MPCS 12-Course Program Joint MBA / MPCS Program MPCS Pre-Doctoral Program Intro to Programming and Math for CS MPCS Admissions Overview MPCS Application Deadlines MPCS Application Requirements MPCS GRE/GMAT Requirement MPCS Visits & Appointments MPCS Tuition & Fees MPCS Faculty MPCS Career Outcomes MPCS Alumni Spotlight Ankit Jaini, Joint MBA/MPCS Class of 2020 Junhao Wang, MPCS Class of 2019 Andrew Eckart, MPCS Class of 2021 Anna Simmons, Joint MBA/MPCS Class of 2021 Dheeraj Bandaru, MPCS Student MPCS Intranet for Current Students MPCS FAQs Contact Us! Academics / Masters Programs MPCS Career Outcomes 2022-23 The MPCS gathers our Alumni Career Outcomes information by sending graduate student surveys to our students after they graduate from their program. MPCS By the Numbers 22-23 “MPCS gives me in-depth CS knowledge. Originally from Civil Engineering background, I became well-equipped with programming skills and CS background knowledge needed to transfer to my new career after graduating from MPCS program.” —Siqi Li, 2023 MPCS Graduate Putting MPCS Alumni on the Map MPCS AY 22-23 Average Graduate Salary by Position MPCS AY 22-23 Graduate Positions & Industries The MPCS is good at balancing sufficiently deep dives into theory with application. I received ample teaching into theory and got to develop plenty of larger scale applications.”—Austin Clark, 2023 MPCS Graduate MPCS Alumni Employers TECHNOLOGY CONSULTING FINANCE/TRADING Ab Initio Accenture Akuna Capital Adobe Bain & Company American Express Alibaba Group Boston Consulting Group Bank of America Amazon (AWS) Cognizant Barclays Investment Bank Anixter Deloitte Consulting Belvedere Trading AppFolio IGPI (Industrial Growth Platform Inc) BlackEdge Capital Apple KPMG Bloomberg Audible McKinsey & Company Boerboel Trading Beats Health Pariveda Solutions Capital One Blend360 PWC Chicago Trading Bose Corporation SapientRazorfish Company Braintree Slalom Citadel Investment Bytedance ST Engineering iDirect Group Carevoyance Software Teragonia Citi Bank Cimon VestHQ Credit Suisse Cisco DRW Trading Citrix Systems GOVERNMENT Federal Reserve Bank Code.org Department of Defense GCM Grosvenor Coforma.io Northrop Grumman Global Atlantic Collective Health Goldman Sachs ConnectSx RETAIL Harvest Investments CrowdStrike CVS Hughes & Company DoorDash General Motors Huobi Exelon Mitsubshi IMC Financial Markets Expedia New York Yankees Interactive Brokers Foursquare Nike JPMorgan Chase GitHub Red Bull Jump Trading Google The Field Museum of Natural History LaSalle Trading Group GroundTruth Toyota Motor Meta Trading Groupon Corporation Morgan Stanley Hunt Club Verizon Morningstar, Inc. IBM Walmart Labs Northern Trust IBM Research Center Peak6 Investments Indeed.com SUPPLY CHAIN & LOGISTICS Qatalyst Partners Intel Flexport Quantlab Intuit McMaster-Carr Supply Radix Trading Komodo Health Company Sompo Holdings Kuaishou Pactiv Sumitomo Mitsui Banking Corporation LiveRamp Tower Research Capital Mastery Logistics UNIVERSITY/HOSPITAL/RESEARCH TradeLink Holdings Systems Ann & Robert H. Lurie Children’s Hospital Trading Technologies Mathworks Anthem Blue Cross Blue Shield TransMarket Group Mediaocean (4C Insights) Argonne National Laboratory Truist Bank Microsoft Boston University USAA NVIDIA Clinical Biosafety Services Volant Trading Ocient Columbia University Wolverine Trading Okta Coursera XR Trading Optiver DePaul University Oracle Duke University Palo Alto Networks Lawrence Berkeley PathAI Los Alamos National   Laboratory PayPal Loyola University Chicago Pinterest New York University Qualcomm NORC at the University of   Chicago QwickRate Northwestern Memorial   Hospital Reazon Holdings, Inc. Northwestern University Relativity Princeton University Riskspan Inc SUPER Group – University   of Chicago Salesforce TMW Centre Scratch.fi TTIC Shure Inc. University of Chicago Sony PlayStation University of Chicago Hospitals Splunk University of Illinois at Chicago Spotify Tesla TikTok Twilio Uber Veriown   Global Verkada Vistaprint XSELL  Technologies John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Name This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}