{
  "id": 1,
  "date": "2024-05-18T18:17:49.343983",
  "url": "https://cs.uchicago.edu/academics/masters/masters-program-in-computer-science-mpcs/mpcs-alumni-spotlight/anna-simmons-joint-mba-mpcs-class-of-2021/",
  "university_name": "University of Chicago",
  "title": "Anna Simmons, Joint MBA/MPCS Class of 2021",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Masters Program in Computer Science (MPCS) About MPCS MPCS Programs of Study MPCS Admissions Overview MPCS Faculty MPCS Career Outcomes MPCS Alumni Spotlight Ankit Jaini, Joint MBA/MPCS Class of 2020 Junhao Wang, MPCS Class of 2019 Andrew Eckart, MPCS Class of 2021 Anna Simmons, Joint MBA/MPCS Class of 2021 Dheeraj Bandaru, MPCS Student MPCS Intranet for Current Students MPCS FAQs Contact Us! Academics / Masters Programs / MPCS Spotlight Anna Simmons, Joint MBA/MPCS Class of 2021 The University of Chicago Masters Program in Computer Science students push boundaries and innovate across many facets of industry. Whether it’s developing seamless UX interfaces, engineering software at Fortune 500 companies, working in big data or keeping networks secure, our students use their applied-skills education from the MPCS to problem-solve, create, and elevate the computer science field. Learn from their stories and discover how a CS background can prepare you for cutting-edge internships. Anna Simmons graduated from the Joint MBA/MPCS Program in 2021. She speaks with us about her experience participating in the New Venture Challenge, her role as a product manager at Okta, and her advice for those considering the Joint Program. What interested you in applying to the Joint Program after being admitted to the Booth MBA Program? Did you have previous CS experience? My career before joining the Booth MBA program had been catered around exploring the intersection of business and technology. From my previous roles, I found I really enjoyed how technology and business met in enterprise software, but wanted to change functions to work on building products myself as a product manager. I enrolled in the Booth MBA program to help me hone skills like strategy, finance, sales, marketing, growth, and stakeholder management that would be important to being a good product manager. However, product management sits in between business and technical stakeholders, which is why I wanted to improve my technical skills to be able to collaborate more effectively with technical teams, as well as really think about how I can leverage new technology to create innovative products. I had some computer science background through introductory courses in undergrad, and some exposure working in software implementation, but the MPCS was a great opportunity to really deepen this knowledge. What was one of your favorite experiences as a Joint Student? It is hard to narrow to just one because I really enjoyed the program end-to-end, but I’d have to say Cloud Computing was my favorite course and most directly applicable to my current role as a product manager at a cloud-based software-as-a-service company like Okta. In the course, we were able to build our own cloud web application on Amazon Web Services while learning so much about the applications and theoretical underpinnings of cloud technologies to inform the architectural, design, and implementation decisions for my application. This really gave me a strong foundational understanding of the technology powering the products I work on today, and helps me understand and communicate with the engineers that I work with. It was also genuinely really fun and satisfying too as each part of the application came together. During your time in the Joint Program, you participated in the New Venture Challenge through Polksy – and you and your team won fourth place! Can you tell us a bit about that experience? The New Venture Challenge was such a rewarding experience! The challenge itself allows students to turn ideas into businesses. I was a part of a team of five fellow Booth MBA classmates working on a new company, Resette, that my classmate, Whitney had been ideating and starting working on earlier that year. We built Resette, a direct-to-consumer combination skincare/makeup company designed to help customers wear less products and benefit more through our customized matching process to find their ideal 4-in-1 skincare serum, moisturizer, foundation, and SPF formulation. As part of the challenge, I was in Steve Kaplan’s “Developing a New Venture” course as well where we had in-depth sessions on presentation skills, financial modeling, and legal considerations in a new venture that we leveraged to start the business, build a business plan and refine a product pitch. Throughout the course, we were able to meet with venture capitalists, private investors, and entrepreneurs who helped critique and improve the ideas and businesses during the presentations, as well as connect us with others in the industry who helped us get started and find a co-manufacturer for our product. I was specifically brought onto the team because of my computer science background to support the technology and product side of the business which included building our matching algorithm, website and setting up all technology tools. As a direct-to-consumer product, we are able to reach our customers directly, which gives us a lot of control over the experience we provide our customers, but also means the website and digital experience is extremely important to the brand. We focused on providing a customized yet simple experience for finding the right formula, and I had to evaluate what this means from both a business and technical perspective– evaluating different website hosting and building options as well as designing our matching algorithm, evaluating the inputs we should be gathering, such as photos and skincare needs, with the algorithm to process and provide a match. We were able to win 4th place, which included $96,000 in investment, that Whitney and Veena have now used to turn Resette into daybird.co as they continued the business post-MBA on their own as co-founders. I may be biased, but I definitely recommend checking them out– I use Daybird every morning and am so excited for them to continue to grow. How has your MPCS education helped you achieve your professional goals? I have been a product manager since graduating from the program, working on a fairly technical product at Okta. The skills I gained through the MPCS coursework have really helped me to be successful in this role. I’m able to collaborate with the engineers on my team, better understand technical users of my products, and really understand the solutions we are building. Additionally, from my experience in the New Venture Challenge and the broader Joint MBA/MPCS program, I have a better understanding of early technology companies and the ecosystem around them and how I can contribute. At Okta, I’ve had the opportunity to work on a brand new offering which has been like a startup within a larger company and I’ve definitely leaned on my background to help us launch our product successfully. Would you recommend the Joint Program to recently admitted Booth MBA students? If so, why? For prospective MBA students considering the joint program, I’d definitely recommend thinking about your future career goals and what you’re trying to get out of the program to assess if it’s worth the additional time commitment. During an MBA, there’s so many different ways you can spend your time, and it’s important to really think about how you can best use your time in school. If you’re interested in working in a technical or technical adjacent role, I think it’s a phenomenal program that you can really cater to the skills and topics that will be most interesting and useful for you. I know other MPCS/MBA classmates with little computer science background, and those with several years of professional software development experience alike, were able to cater their studies and take away valuable skills from the program. For me personally, without hesitation, I would definitely choose to do the program again– I got everything I was hoping for, and more! John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}