{
  "id": 1,
  "date": "2024-05-18T18:18:15.748488",
  "url": "https://cs.uchicago.edu/news/unveiling-attention-receipts-tangible-reflections-on-digital-consumption/",
  "university_name": "University of Chicago",
  "title": "Unveiling Attention Receipts: Tangible Reflections on Digital Consumption",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section News Events Video UChicago CS News • May 15, 2024 Unveiling Attention Receipts: Tangible Reflections on Digital Consumption PhD student Anup Sathya and Assistant Professor Ken Nakagaki introduce Attention Receipts, a tangible solution aimed at increasing awareness of digital consumption habits and navigating the complexities of technology's impact on human agency. Through this innovation, they seek to foster a culture of introspection in the digital age. In the age of digital dominance, where every click, swipe, and scroll vies for our attention, navigating the vast landscape of online content can feel like traversing an ever-shifting labyrinth. Among the myriad platforms seeking our attention, YouTube stands as a titan, its algorithms adeptly tailoring an endless stream of videos to captivate and enthrall. But what happens when our engagement becomes involuntary, when our attention is commodified and monetized without our full awareness? Enter Anup Sathya , a second-year PhD student whose interdisciplinary journey through electronics, human-computer interaction, and computer science has led him to confront the intricate dance between technology and human agency. Advised by Assistant Professor Ken Nakagaki from AxLab , Anup embarked on a quest to demystify our digital consumption habits, ultimately birthing a tangible artifact that aims to disrupt the insidious cycles of attention manipulation: the Attention Receipts. In their recent paper, “ Attention Receipts ,” Anup and his team explore a novel concept. At its core, Attention Receipts serve as material manifestations of our digital indulgences, aiming to make users more aware of the time they spend on the platform by turning their screen time into tangible receipts. Anup hopes that this shift from abstract to concrete will encourage people to reflect on how much attention they invest in digital content and its true value. “The Internet is very useful, and at times invaluable,” said Sathya. “But at the same time, there are a lot of mechanisms that are meant to hold your attention so that it can be monetized. We wanted to figure out a way to make it obvious to consumers that they were actually paying with their attention.” Platforms like YouTube, with their autoplay features and algorithmic recommendations, showcase this dilemma, trapping users in a cycle of endless consumption. Anup’s insight into the limitations of existing digital well-being tools inspired him to chart a new course. While conventional interventions often resort to restrictive measures that limit users’ freedom, Attention Receipts adopt a different approach—one grounded in reflection rather than restriction. By giving users control over their introspective process, Attention Receipts strive to promote a deeper awareness of digital habits without imposing overly harsh restrictions. The methodology behind Attention Receipts involves two main parts: a browser plugin and a stylish printer. The browser plugin quietly keeps track of the YouTube videos users watch and how long they spend on them. This information is then turned into physical receipts by the printer, adding a touch of style to serve as a reminder of one’s online activities. In a field deployment involving six participants over three weeks, Anup and his team explored the efficacy of Attention Receipts in fostering mindful engagement with online content. The results yielded intriguing insights into the interplay between materiality, agency, and reflection. Participants exhibited varied responses based on their degree of control over the receipt generation process, shedding light on a form of cognitive dissonance when faced with their own digital habits and the nuanced dynamics of digital self-regulation. “Essentially, when users had agency over printing the receipt, they liked the printer more, but they tended to reflect less on their YouTube usage,” said Sathya. “Conversely, when people didn’t have control over when the receipt was printed, they were able to reflect a little bit more and adjust their usage a little bit.” While quantitative assessments of behavioral change were not within the scope of this study, Anup emphasizes the qualitative significance of fostering a culture of introspection and accountability. By reframing digital consumption as a tangible transaction, Attention Receipts pave the way for nuanced conversations surrounding digital well-being—an imperative in an era marked by escalating concerns over technology’s encroachment upon human autonomy. In the future, Anup sees Attention Receipts expanding beyond their initial stages to become more integrated into various aspects of digital life. This could include personalized features in everyday items and smooth integration across different platforms. However, amidst these possibilities, Anup emphasizes the importance of safeguarding user privacy and autonomy. He is dedicated to maintaining a careful balance between advancing technology and upholding ethical standards. “Building and evaluating systems that act as interventions for technology overuse often requires the collection of deeply private data. So being deliberate about what we collect, how we use it, and how the user feels about it is really important.” Related News More UChicago CS stories from this research area. Slide to Previous Slide Slide to Next Slide UChicago CS News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs May 17, 2024 UChicago CS News Fred Chong Receives Quantrell Award for Excellence in Teaching May 16, 2024 UChicago CS News NASA to Launch UChicago Undergraduates’ Satellite May 14, 2024 UChicago CS News University of Chicago Computer Science Researchers To Present Ten Papers at CHI 2024 May 06, 2024 UChicago CS News Two UChicago MPCS Students Win the Apple Swift Student Challenge May 01, 2024 In the News How Artificial Intelligence Can Transform U.S. Energy Infrastructure Apr 29, 2024 In the News Community Data Fellow Stephania Tello Zamudio helps broaden internet access for Illinois residents Apr 29, 2024 UChicago CS News Two UChicago CS Students Awarded NSF Graduate Research Fellowship Apr 24, 2024 UChicago CS News Non-Unital Noise Adds a New Wrinkle to the Quantum Supremacy Debate Apr 05, 2024 In the News The Science of Computer Security: An Interview with Grant Ho, Assistant Professor in Computer Science Apr 02, 2024 UChicago CS News Four Students Receive Honorable Mention in CRA Undergraduate Research Awards Mar 25, 2024 UChicago CS News Navigating the Intersection of Technology and Public Policy: The Journey of Ranya Sharma at UChicago Mar 21, 2024 Slide to Previous Slide Slide to Next Slide John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Phone This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}