{
  "id": 1,
  "date": "2024-05-18T18:19:01.229735",
  "url": "https://cs.uchicago.edu/academics/courses/",
  "university_name": "University of Chicago",
  "title": "Course Highlights",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Undergraduate Program Overview Admission CS Major FAQ Joint Bx/MS Programs Courses Master’s Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs Program Overview Qualifying Phase Admission to Candidacy Dissertation & Defense Advisors & Committees Oral Exam Procedures Admission Course Requirements Annual Review Joint Math/CS PhD FAQ on PhD Requirements Graduate Fellowship Opportunities 2023-24 Academic Year Graduate Student Leadership Courses Admission Course Highlights Jobs & Career Resources Summer Research Student Organizations Academics Course Highlights A selection of courses offered by UChicago CS and its programs for undergraduates, master's students, and PhD students. For a complete list of courses and details, please refer to the Full CS Course Catalog . Search Filter Undergraduate CMSC 11111: Creative Coding Ravi Chugh This course is an introduction to programming, using exercises in graphic design and digital art to motivate and employ basic tools of computation (such as variables, conditional logic, and procedural... This course is an introduction to programming, using exercises in graphic design and digital art to motivate and employ basic tools of computation (such as variables, conditional logic, and procedural abstraction). We will write code in JavaScript and related technologies, and we will work with a variety of digital media, including vector graphics, raster images, animations, and web applications. Read More Show Less Research Areas: Programming Languages Undergraduate CMSC 25910: Engineering for Ethics, Privacy, and Fairness in Computer Systems Blase Ur This course takes a technical approach to understanding ethical issues in the design and implementation of computer systems. Tensions often arise between a computer system's utility and its privacy-invasiveness, between... This course takes a technical approach to understanding ethical issues in the design and implementation of computer systems. Tensions often arise between a computer system’s utility and its privacy-invasiveness, between its robustness and its flexibility, and between its ability to leverage existing data and existing data’s tendency to encode biases. The course will demonstrate how computer systems can violate individuals’ privacy and agency, impact sub-populations in disparate ways, and harm both society and the environment. It will also introduce algorithmic approaches to fairness, privacy, transparency, and explainability in machine learning systems. Through hands-on programming assignments and projects, students will design and implement computer systems that reflect both ethics and privacy by design. They will also wrestle with fundamental questions about who bears responsibility for a system’s shortcomings, how to balance different stakeholders’ goals, and what societal values computer systems should embed. Read More Show Less Research Areas: Human Computer Interaction, Security & Privacy, Systems, Architecture & Networking Undergraduate, PhD CMSC 20370: Inclusive Technology: Designing for Underserved and Marginalized Populations Marshini Chetty Creating technologies that are inclusive of people in marginalized communities involves more than having technically sophisticated algorithms, systems, and infrastructure. It involves deeply understanding various community needs and using this... Creating technologies that are inclusive of people in marginalized communities involves more than having technically sophisticated algorithms, systems, and infrastructure. It involves deeply understanding various community needs and using this understanding coupled with our knowledge of how people think and behave to design user-facing interfaces that can enhance and augment human capabilities. When dealing with under-served and marginalized communities, achieving these goals requires us to think through how different constraints such as costs, access to resources, and various cognitive and physical capabilities shape what socio-technical systems can best address a particular issue. This course leverages human-computer interaction and the tools, techniques, and principles that guide research on people to introduce you to the concepts of inclusive technology design. You will learn about different underserved and marginalized communities such as children, the elderly, those needing assistive technology, and users in developing countries, and their particular needs. In addition, you will learn how to be mindful of working with populations that can easily be exploited and how to think creatively of inclusive technology solutions. You will also put your skills into practice in a quarter long group project involving the creation of an interactive system for one of the user populations we study. Read More Show Less Research Areas: Human Computer Interaction Undergraduate CMSC 25040: Introduction to Computer Vision Michael Maire This course provides an introduction to computer vision, covering a range of topics from image formation through object recognition systems. We study feature and edge detection, model fitting, stereo, optical... This course provides an introduction to computer vision, covering a range of topics from image formation through object recognition systems. We study feature and edge detection, model fitting, stereo, optical flow, structure from motion, segmentation, and object detection. For these tasks, mathematical tools and associated algorithms are developed. We review classic algorithms and present modern neural network approaches. Read More Show Less Research Areas: Visual Computing Undergraduate CMSC 11900: Introduction to Data Science II Michael Franklin, Dan Nicolae This course is the second quarter of a two-quarter systematic introduction to the foundations of data science, as well as to practical considerations in data analysis. A broad background on... This course is the second quarter of a two-quarter systematic introduction to the foundations of data science, as well as to practical considerations in data analysis. A broad background on probability and statistical methodology as well as a basic proficiency in RStudio will be provided. More advanced topics on data privacy and ethics, reproducibility in science, data encryption, and basic machine learning will be introduced. We will explore these concepts with real-world problems from different domains. Read More Show Less Research Areas: AI & Machine Learning, Data & Databases Undergraduate CMSC 22880: Introduction to Quantum Computing Diana Franklin This introduction to quantum computing will cover the key principles of quantum information science and how they relate to quantum computing as well as the notation and operations used in... This introduction to quantum computing will cover the key principles of quantum information science and how they relate to quantum computing as well as the notation and operations used in QIS. We will then take these building blocks and linear algebra principles to build up to several quantum algorithms and complete several quantum programs using a mainstream quantum programming language. Read More Show Less Research Areas: Systems, Architecture & Networking John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Email This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}