{
  "id": 1,
  "date": "2024-05-18T18:18:55.495765",
  "url": "https://howto.cs.uchicago.edu/",
  "university_name": "University of Chicago",
  "title": "Techstaff Virtual Help Desk",
  "content": "skip to content How do I? User Tools Log In Site Tools Search Tools Show pagesource Old revisions Export to PDF Backlinks Recent Changes Media Manager Sitemap Log In > Recent Changes Media Manager Sitemap You are here: start Sidebar Techstaff Core Howtos Introduction Getting Started Request a CS Account Email Email Clients Instant Message Passwords Personal Homepage Printing Quota Time Machine Edit Your Website Directory Entry WiFi Job Submissions (Slurm) Policies Data storage Crerar (JCL) Networking Phones Height Adjustable Desks Conference Rooms Hallway Monitors Remote Access linux.cs.uchicago.edu UChicago VPN MacOS Virtual Desktop VSCode Distance Education Zoom Licensed Software KB Links CS Overleaf Professional Matlab Adobe CC Microsoft Office Linux Desktop $HOME/.cache Directory Windows Sub-system for Linux Unix Help General Unix Permissions Path Variables Environment Modules Job Control SSH Fingerprints Proxying Ubuntu Programming Help Python - Virtual Environments Python - PIP Python - Anaconda GCC Swift Language Version Control Git Git repos for courses SVN for Homework Virtual Machine UChicago CS VM Installing and Running FAQ Canvas Private Cloud Introduction Recipes FAQ edit the sidebar start Table of Contents Techstaff Virtual Help Desk CSIL Lab Access Virtual Hangouts This is a wiki Techstaff Virtual Help Desk Support Email: techstaff@cs.uchicago.edu We are on Discord! Invite Link Sign up for an account (optional) and find the Helpdesk channel on the left hand-side. An introduction to Techstaff . CSIL Lab Access CSIL hours of operation are:\nMonday - Friday 10am - 10pm CST | \nSaturday - Sunday 12pm - 10pm CST Please email us with any questions: csil@cs.uchicago.edu Or call: 773-702-1082 You can also keep up-to-date with CSIL updates through our social media pages: - Facebook - Instagram - Twitter Virtual Hangouts CS Slack Workspace CS Discuss Forum Gather Town This is a wiki Anyone in our department can modify the pages found on this site . Don't worry about getting the formatting right. The documents found here will help you navigate the computing environment of CS. Some of them are of a technical nature and others are just collections of helpful tips and policies . If you are not sure where to start have a look at the FAQ , the Unanswered_Questions or the answered_questions . Login is waiting for you, or you can keep reading. Email us techstaff@cs.uchicago.edu /var/lib/dokuwiki/data/pages/start.txt · Last modified: 2022/02/14 18:05 by kozmos Page Tools Show pagesource Old revisions Backlinks Export to PDF Back to top"
}