{
  "id": 1,
  "date": "2024-05-18T18:18:57.649996",
  "url": "https://cs.uchicago.edu/academics/undergraduate/summer-research/",
  "university_name": "University of Chicago",
  "title": "Summer Research",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Undergraduate Program Overview Admission CS Major FAQ Joint Bx/MS Programs Courses Master’s Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs Program Overview Qualifying Phase Admission to Candidacy Dissertation & Defense Advisors & Committees Oral Exam Procedures Admission Course Requirements Annual Review Joint Math/CS PhD FAQ on PhD Requirements Graduate Fellowship Opportunities 2023-24 Academic Year Graduate Student Leadership Courses Admission Course Highlights Jobs & Career Resources Summer Research Student Organizations Summer Research Student Summer Research Fellowship Program The Student Summer Research Fellowship Program administered under the Computer Science Department aims at recruiting a group of highly motivated undergraduate students from our partner universities* to join the faculty-led research groups and conduct research at UChicago in the summer (July and August). * At this moment, the program opens to only a few partner universities. Please check with your institution to see if your university is among the partner list. During the 8-week program period, each student will spend their work time with one faculty member and their research team to conduct research. In addition, the program will organize group-based team building activities, workshops, group projects etc. that will expose students to the larger UChicago academic community. Learn More Data Science Institute Summer Lab The Data Science Institute Summer Lab program (launched in 2018 as the Data & Computing Summer Lab) is an immersive 10-week paid summer research program at the University of Chicago. In the program, high school, undergraduate, and UChicago Masters students are paired with a data science mentor in various domains, including: computer science, data science, social science, climate and energy policy, public policy, materials science, and biomedical research. Through this pairing the research assistant will engage with and hone their skills in research methodologies, practices, and teamwork. UChicago Masters students specifically, as well as eligible high school and undergraduate students, are paired with projects in the Social Impact Track (more details below). We encourage participation from a broad range of students, and require no prior research experience to apply. Learn More John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}