{
  "id": 1,
  "date": "2024-05-18T18:18:53.924389",
  "url": "https://cs.uchicago.edu/people/uchicago-faculty/all-faculty/",
  "university_name": "University of Chicago",
  "title": "All Faculty",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam On The Job Market People All Faculty A full list of faculty based in or affiliated with UChicago CS. Search Filter Sort by: Ishan Agarwal Assistant Clinical Professor, Masters Program in Computer Science Yuri Alexeev Senior Scientist, CASE Affiliate Rafi Almhana Assistant Clinical Professor, Masters Program in Computer Science Trevor Austin Lecturer, Masters Program in Computer Science László Babai Bruce V. and Diana M. Rauner Distinguished Service Professor of Computer Science, Mathematics Lionel Barrow Lecturer, Masters Program in Computer Science Marty Billingsley Lecturer, Masters Program in Computer Science T. Andrew Binkowski Associate Clinical Professor, Masters Program in Computer Science Gerry Brady Clinical Professor, Masters Program in Computer Science David Cash Professor of Computer Science Raul Castro Fernandez Assistant Professor of Computer Science Kyle Chard Research Associate Professor of Computer Science Amitabh Chaudhary Clinical Professor, Masters Program in Computer Science Yuxin Chen Assistant Professor of Computer Science Marshini Chetty Associate Professor of Computer Science Andrew A. Chien William Eckhardt Distinguished Service Professor of Computer Science Fred Chong Seymour Goodman Professor of Computer Science Ravi Chugh Associate Professor of Computer Science Julia Chuzhoy Professor, Toyota Technological Institute Jeffrey L. Cohen Adjunct Associate Professor, Masters Program in Computer Science Aloni Cohen Assistant Professor of Computer Science, Data Science Anshu Dubey Senior Scientist, CASE Affiliate Todd Dupont Professor Emeritus of Computer Science, Mathematics, and the James Franck Institute Aaron Elmore Associate Professor of Computer Science Nick Feamster Neubauer Professor of Computer Science William Fefferman Assistant Professor of Computer Science Ian Foster Arthur Holly Compton Distinguished Service Professor of Computer Science Diana Franklin Associate Professor of Computer Science Michael Franklin Morton D. Hull Distinguished Service Professor Adam Gerber Adjunct Associate Professor, Masters Program in Computer Science John Goldsmith Edward Carson Waller Distinguished Service Professor Emeritus, Departments of Computer Science and Linguistics Greg Green Associate Senior Instructional Professor of Computer Science Robert Grossman Frederick H. Rawson Distinguished Service Professor in Medicine, Computer Science Haryadi Gunawi Associate Professor of Computer Science Dylan Hall Lecturer, Masters Program in Computer Science Rana Hanocka Assistant Professor of Computer Science Grant Ho Assistant Professor of Computer Science Henry Hoffmann Liew Family Chair of Computer Science Ari Holtzman Assistant Professor of Computer Science, Data Science (Starting July 2024) William Hoza Assistant Professor of Computer Science Jan Hückelheim Adjunct Assistant Professor, Masters Program in Computer Science Eliu Huerta Senior Scientist, CASE Affiliate Junchen Jiang Assistant Professor of Computer Science Haotian Jiang Assistant Professor of Computer Science (Starting July 2024) Alex Kale Assistant Professor of Computer Science, Data Science Kate Keahey Senior Scientist, CASE Affiliate Ahmed Khaled Visiting Associate Professor, Masters Program in Computer Science Dries Kimpe Lecturer, Masters Program in Computer Science Gordon Kindlmann Associate Professor of Computer Science Risi Kondor Associate Professor of Computer Science, Statistics Sanjay Krishnan Assistant Professor of Computer Science Stuart Kurtz George and Elizabeth Yovovich Professor of Computer Science and the College Mina Lee Assistant Professor of Computer Science, Data Science (Starting July 2024) Bo Li Neubauer Associate Professor of Computer Science, Data Science Tian Li Assistant Professor of Computer Science, Data Science (starting July 2024) Yanjing Li Assistant Professor of Computer Science Karen Livescu Associate Professor, Toyota Technological Institute Pedro Lopes Associate Professor of Computer Science Shan Lu Professor of Computer Science Dave MacQueen Professor Emeritus, Department of Computer Science Michael Maire Associate Professor of Computer Science Yury Makarychev Associate Professor, Toyota Technological Institute André Marques Lecturer, Masters Program in Computer Science David McAllester Professor, Toyota Technological Institute Hannah Morgan Assistant Instructional Professor of Computer Science Ketan Mulmuley Professor of Computer Science Ken Nakagaki Assistant Professor of Computer Science Timothy Ng Assistant Instructional Professor of Computer Science Anthony Nicholson Adjunct Associate Professor, Masters Program in Computer Science Michael J. O'Donnell Professor Emeritus, Department of Computer Science Drew Olson Adjunct Assistant Professor, Masters Program in Computer Science Lorenzo Orecchia Assistant Professor of Computer Science Kexin Pei Neubauer Family Assistant Professor of Computer Science (Starting July 2024) Aaron Potechin Assistant Professor of Computer Science Robert Rand Assistant Professor of Computer Science Alexander A. Razborov Andrew MacLeish Distinguished Service Professor of Computer Science, Mathematics Mohammed Suhail Rehman Assistant Instructional Professor of Computer Science John H. Reppy Professor of Computer Science Anne Rogers Associate Professor of Computer Science Shelley Rossell Adjunct Associate Professor, Masters Program in Computer Science Dave Sahota Lecturer, Masters Program in Computer Science Lamont Kenneth Samuels Assistant Clinical Professor, Masters Program in Computer Science L. Ridgway Scott Louis Block Professor Emeritus, Departments of Computer Science and Mathematics Sarah Sebo Assistant Professor of Computer Science Mark Shacklette Adjunct Professor, Masters Program in Computer Science Gregory Shakhnarovich Professor, Toyota Technological Institute Adam Shaw Associate Senior Instructional Professor of Computer Science Andrew Siegel Adjunct Professor, Masters Program in Computer Science Janos Simon Professor of Computer Science Robert Soare Paul Snowden Russell Distinguished Service Professor Emeritus, Departments of Mathematics and Computer Science Borja Sotomayor Senior Instructional Professor of Computer Science Michael Spertus Adjunct Professor, Masters Program in Computer Science Nathan Srebro Professor, Toyota Technological Institute Rick Stevens Professor of Computer Science Chenhao Tan Assistant Professor of Computer Science, Data Science Matt Teichman Lecturer, Masters Program in Computer Science Chelsea Troy Lecturer, Masters Program in Computer Science Madhur Tulsiani Assistant Professor, Director of Graduate Studies, Toyota Technological Institute James Turk Assistant Clinical Professor, Masters Program in Computer Science David Uminsky Senior Research Associate of Computer Science Blase Ur Associate Professor of Computer Science Vas Vasiliadis Adjunct Associate Professor, Masters Program in Computer Science Peter Vassilatos Lecturer, Masters Program in Computer Science Matthew Wachs Associate Instructional Professor of Computer Science Matthew Walter Assistant Professor, Toyota Technological Institute Rebecca Willett Professor of Computer Science, Statistics Kathryn Wozniak Adjunct Associate Professor, Masters Program in Computer Science Haifeng Xu Assistant Professor of Computer Science, Data Science Ce Zhang Neubauer Associate Professor of Computer Science, Data Science (Starting July 2024) Ben Y. Zhao Neubauer Professor of Computer Science Heather Zheng Neubauer Professor of Computer Science John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Phone This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}