{
  "id": 1,
  "date": "2024-05-18T18:19:07.488082",
  "url": "https://cs.uchicago.edu/academics/phd/graduate-student-leadership/",
  "university_name": "University of Chicago",
  "title": "Graduate Student Leadership",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Undergraduate Master’s Programs PhD Programs Program Overview Qualifying Phase Admission to Candidacy Dissertation & Defense Advisors & Committees Oral Exam Procedures Admission Course Requirements Annual Review Joint Math/CS PhD FAQ on PhD Requirements Graduate Fellowship Opportunities 2023-24 Academic Year Graduate Student Leadership Courses Admission Course Highlights Jobs & Career Resources Summer Research Student Organizations Graduate Student Leadership The CS department has volunteer roles ( ministers ) to represent PhD students’ interests, provide feedback to the department, and get students more directly involved in the department’s activities. Contact the Prime Minister for more info about these roles or if you would like to volunteer. Graduate Student Ministry (CS Student Representatives) Prime Minister Responsible for handling most of the faculty-grad interactions and concerns. Acts as the primary interface between faculty and graduate students and is also the person to reach out to for miscellaneous concerns not represented by other roles below. Konstantinos Ameranis ( kameranis ) Graduate Matters Ministers These are the people to reach out to if students have specific concerns covered by these roles. Curriculum Responsible for raising PhD student curriculum interests with the graduate committee and the department chair. Chris Kang ( ctkang ) Faculty Hiring Responsible for structured grad student involvement in faculty hiring, including feedback on candidates. Jibang Wu ( wujibang ) First-Year Liaison Aggregates the issues of first years and works with other ministers to address them and funnel the institutional knowledge to the newest members of our community. Chris Kang ( ctkang ) Inclusion Responsible for advocating for students in the department who identify as female/gender-nonconforming, underrepresented minority, LGBTQ+ or have a disability, both within the department & outside the department, and for connecting students to identity-affirming communities or affinity groups on campus. Geoffrey (Jake) Chanenson ( jchanen1 ) Infrastructure Represent graduate students in the department’s facilities (Space and Computing) committees, which deal with allocating budget for office furniture, ergonomic hardware, and determining the specifications of new machines, monitors, etc. Maximilian Seifert ( lmseifert ) International Affairs Represent and advocate for international graduate students in the department. Responsible for providing information for international students, identifying problems that international students face, and raising things to the department if needed. Maximilian Seifert ( lmseifert ) Wellness Responsible for promoting awareness and support of mental, physical, and professional (e.g., relationships with peers/advisors, remote communication) forms of well-being for PhD students. Responsibilities include informing about UChicago Student Wellness services and relevant well-being events on campus, decreasing the stigma around using counseling services and advocating for physical health accommodations, and sharing other appropriate resources to mental and physical health. Emma Peterson ( eicp ) Research and Social Interaction Ministers These roles help increase both social and research interaction within the department. Caffeine Responsible for organizing weekly tea, coffee, and snack time when grad students can easily hang out with each other. Kunal Marwaha ( kmarw ) James Sud ( jsud ) Richard Liu ( guanzhi ) Fun Responsible for keeping a sense of community in the department by organizing social events. Kevin Bryson ( kbryson ) Andrew Hands ( hands ) Student Seminar Responsible for organizing the student seminar . Pouya Mahdi Gholami ( pouya ) The following independent bodies also represent student voices in varying capacities. The ministry includes them in communications and decision-making. PSD DSAC Representatives The Deans’ Student Advisory Committee (DSAC) brings together representatives from all departments in the Physical Sciences Division twice a quarter to discuss division-wide and university-wide issues. We get two reps for Computer Science: Pouya Mahdi Gholami ( pouya ) Geoffrey (Jake) Chanenson ( jchanen1 ) GWiCS Graduate Women in Computer Science (GWiCS) is an organization that builds a community of support for female-identifying graduate students in the Computer Science department. Our activities include monthly Sounding Board Socials, recruitment, and advocacy. GWiCS is also part of the Women in Graduate Science organization within the Physical Sciences Division. Current chairs are: Yitian Hao ( yhao ) Mansi Sakrvadia ( skarvadia ) Visit The Ministry webpage for more information. John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Email This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}