{
  "id": 1,
  "date": "2024-05-18T18:19:05.590478",
  "url": "https://cs.uchicago.edu/academics/phd/joint-math-cs-phd/",
  "university_name": "University of Chicago",
  "title": "Joint Math/CS PhD",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Undergraduate Master’s Programs PhD Programs Program Overview Qualifying Phase Admission to Candidacy Dissertation & Defense Advisors & Committees Oral Exam Procedures Admission Course Requirements Annual Review Joint Math/CS PhD FAQ on PhD Requirements Graduate Fellowship Opportunities 2023-24 Academic Year Graduate Student Leadership Courses Admission Course Highlights Jobs & Career Resources Summer Research Student Organizations Joint Math/CS PhD In Winter 2018, the Department of Mathematics and the Department of Computer Science launched a joint program through which participating students can earn the degree “Ph. D. in Mathematics and Computer Science.” The basic structure is that students must gain admission to both PhD programs and satisfy both sets of course requirements. They write a single dissertation that satisfies both programs. While the program is open to all eligible students, we expect that at least initially it will be most popular among students working in CS Theory, Discrete Mathematics, and Mathematical Logic. Each student in this program will have a primary program (either Mathematics or Computer Science). Throughout the course of studies, the primary program will provide administrative support to the student, including in matters regarding financial support. Admission To be admitted to the joint program, students will have to be admitted by both departments as follows. Application after entering the PhD program Students enrolled in either the Mathematics or the Computer Science PhD program may apply to the joint program during the first four years in their current program. If admitted to the joint program, their current program will be primary. Such an applicant must submit the following material to the Director of Graduate Studies/Graduate Committee Chair of the intended secondary program, while notifying the Director of Graduate Studies/Graduate Committee Chair of the primary program: current CV statement of purpose, explaining why the joint program is the right program for the applicant statement of coursework and research done so far statement of a schedule how the applicant proposes to satisfy the secondary program’s requirements advisor’s recommendation, including endorsement of the applicant’s statements (items 2, 3, 4 above) if the application occurs during the first year of the primary program, the applicant needs to provide two additional letters of recommendation and their undergraduate transcript. It is permitted to reuse material from the application to the primary program. Requirements, monitoring Course requirements Students enrolling in the joint program will need to satisfy the course requirements of both departments. They will have to satisfy the course requirements of their primary program on the schedule of that program, and satisfy the course requirements of their secondary program by the end of their fifth year in the primary program. According to current rules, two of the CS electives can be courses offered by the Mathematics department. These courses are permitted to overlap with the Mathematics course requirements. Exam Requirements Students in the joint program shall fulfill the examination requirements of the primary program; the current list of requirements can be found at Computer Science Requirements Mathematics Requirements For students participating in the joint program, the deadlines for these exams can be relaxed by petitioning the Director of Graduate Studies/Graduate Committee Chair of the primary program. Monitoring student progress Students’ annual progress reports go to both departments’ Director of Graduate Studies/Graduate Committee Chair in accordance with each department’s format. PhD dissertation and defense Subject of the dissertation The dissertation is expected to be in an area relevant to both fields. PhD thesis defense The scheduling of the PhD Thesis defense follows the Mathematics Department’s custom as follows. A nearly final draft of the thesis is made accessible to faculty at least two weeks prior to the defense, either in hard copy in the departmental office or, preferably, by posting on the internet. The dissertation is reviewed in writing by two readers, one of whom is typically the thesis advisor. The reports by the first and the second readers are circulated among faculty of both departments, along with the Thesis abstract and the following information: the location (physical or virtual) where the thesis can be viewed, the planned time and location of the defense, and the names and affiliations of the thesis committee members. There is a two-week period for comments by faculty before the admission of the thesis for defense. The thesis defense itself consist of a 50-minute public presentation of the main results and methods of the dissertation, followed by a public question-answer period, followed by a closed-session question-answer period. Oversight, committees Oversight The program proceeds under joint Math-CS oversight, exercised by the Director of Graduate Studies/Graduate Committee Chair of each department. Examination committees The following rules apply to all examination committees (Qualifying/Topic Exam, Master’s, Candidacy, and PhD). The committee will consist of at least three members, including the student’s advisor(s). It will include at least one member of each department, and will either be chaired by a joint appointee of the two departments or co-chaired by a member of each department. Each department shall publicize these exams in accordance with its established customs. John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}