{
  "id": 1,
  "date": "2024-05-18T18:18:20.067088",
  "url": "https://cs.uchicago.edu/news/fred-chong-receives-quantrell-award-for-excellence-in-teaching/",
  "university_name": "University of Chicago",
  "title": "Fred Chong Receives Quantrell Award for Excellence in Teaching",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section News Events Video UChicago CS News • May 16, 2024 Fred Chong Receives Quantrell Award for Excellence in Teaching ​​Fred Chong, a distinguished figure in computer science at the University of Chicago, receives the nation’s oldest prize for undergraduate teaching and advising, illuminating the path towards quantum computing's transformative potential. Professor Fred Chong, April 3, 2019 at Crerar. (Photo by Jean Lachat) Professor Fred Chong, known for his groundbreaking contributions to quantum computing and computer architecture, has been honored with the prestigious Quantrell Award . Established in 1938, the Quantrell Award is a testament to exceptional teaching, recognizing faculty members who exhibit unparalleled dedication and excellence in educating undergraduate students. Fred Chong , currently serving as the Seymour Goodman Professor in the Department of Computer Science at the University of Chicago, has been an instrumental figure in shaping the minds of future computer scientists. His commitment to teaching, coupled with his profound insights into emerging technologies, has left a defined mark on the academic community. Chong’s journey into the realm of computer science began at an early age, fueled by his fascination with the power of coding to create and innovate. His academic pursuits led him to the Massachusetts Institute of Technology (MIT), where he delved deeper into the intricacies of computer architecture. It was there that he realized the impact of designing the underlying machinery that breathes life into lines of code. Reflecting on his teaching philosophy, Chong emphasizes the importance of distilling complex technical concepts into core intuitions. Drawing upon his own experiences as a student and researcher, he seeks to provide his students with a deeper understanding of the fundamental principles that govern computer science and technology. This commitment to nurturing intuitive understanding has resonated deeply with his students, fostering an environment of intellectual curiosity and exploration. Throughout his illustrious career, Chong has held teaching positions at several esteemed institutions, each offering unique opportunities for intellectual growth and discovery. “I have taught at three universities and loved them all, but the environment at the University of Chicago is truly unique,” said Chong. “The exceptional and curious students, coupled with small class sizes, allow me to go deeper into very advanced topics. Perhaps my favorite part comes from student questions. After 28 years of teaching, I can still get questions that surprise me and make me rethink some of the fundamentals of my field.” In addition to his exemplary teaching, Chong has made significant contributions to research, particularly in the fields of quantum computing, computer architecture, and emerging technologies. As the Lead Principal Investigator for the EPiQC Project (Enabling Practical-scale Quantum Computing), an NSF Expedition in Computing, he is at the forefront of efforts to bridge the gap between theoretical algorithms and practical quantum computing architectures. Quantum computing, in particular, holds the promise of revolutionizing computation, enabling solutions to problems that are currently beyond the reach of classical computers. Chong’s visionary approach to teaching and research underscores the importance of thinking outside the box and embracing the seemingly impossible. Receiving the Quantrell Award is a testament to Chong’s unwavering dedication to teaching and his profound impact on the academic community. In the words of Nobel Laureate James Cronin, “To obtain this product, a good faculty is essential, and constitutes the most important part of a university.” Related News More UChicago CS stories from this research area. Slide to Previous Slide Slide to Next Slide UChicago CS News Non-Unital Noise Adds a New Wrinkle to the Quantum Supremacy Debate Apr 05, 2024 UChicago CS News Argonne scientists use AI to identify new materials for carbon capture Feb 19, 2024 In the News New research unites quantum engineering and artificial intelligence Jan 29, 2024 UChicago CS News Group From UChicago CS To Present Four Papers at Most Prestigious International Quantum Conference Jan 09, 2024 UChicago CS News UChicago Scientists Make New Discovery Proving Entanglement Is Responsible for Computational Hardness In Quantum Systems Jul 25, 2023 UChicago CS News Virtual Bakery Game Serves Up Both Cupcakes and Quantum Concepts For K-12 Students Mar 27, 2023 UChicago CS News Assistant Professor Robert Rand Receives Air Force Young Investigator Grant Dec 19, 2022 UChicago CS News Prof. Fred Chong Reappointed to National Quantum Initiative Advisory Committee Dec 13, 2022 UChicago CS News Professor Fred Chong Named IEEE Fellow Dec 09, 2022 UChicago CS News Associate Professor Diana Franklin Named ACM Distinguished Member Dec 07, 2022 In the News Alumnus Pranav Gokhale Named to Crain’s 40 Under 40 Nov 07, 2022 UChicago CS News Prof. Diana Franklin Discusses Quantum Computing Education on Entangled Things Podcast Nov 03, 2022 Slide to Previous Slide Slide to Next Slide John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}