{
  "id": 1,
  "date": "2024-05-18T18:19:50.950232",
  "url": "https://cs.uchicago.edu/research/ai-machine-learning/",
  "university_name": "University of Chicago",
  "title": "Upcoming Events",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Research Highlights Quantum Computing Data Science Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Partners Postdoctoral Researchers Modern machine learning techniques have ushered in a new era of computing. Instead of following an explicitly provided set of instructions, computers can now learn from data and subsequently make predictions. Recent approaches have unlocked new capabilities across an expanse of applications, including computer graphics, computer vision, natural language processing, recommendation engines, speech recognition, and models for understanding complex biological, physical, and computational systems. UChicago CS studies all levels of machine learning and artificial intelligence, from theoretical foundations to applications in climate, data analysis, graphics, healthcare, networks, security, social sciences, and interdisciplinary scientific discovery. Researchers explore the next generation of learning methods, including machine teaching, human-centered AI, and applications in language, image processing, and scientific discovery. With colleagues across the UChicago campus, the department also examines the considerable societal impacts and ethical questions of AI and machine learning, to ensure that the potential benefits of these approaches are not outweighed by their risks. Labs & Groups Machine Learning Group Researchers at the University of Chicago and partner institutions studying the foundations and applications of machine learning and AI. SAND (Security, Algorithms, Networking and Data) Lab Ben Y. Zhao, Heather Zheng SAND Lab spans research topics in security, machine learning, networked systems, HCI, data mining and modeling. 3DL Rana Hanocka A computer graphics collective at UChicago pursuing innovation at the intersection of 3D and Deep Learning. Network Operations and Internet Security (NOISE) Lab Nick Feamster Develops data-driven systems that derive insights from network traffic and explores how network traffic can reveal insights into human behavior. Chicago Human + AI (CHAI) Lab Chenhao Tan Developing synergy between humans and artificial intelligence through a better understanding of human behavior and human interaction with AI. Strategic IntelliGence for Machine Agents (SIGMA) Lab Haifeng Xu Develops cutting-edge machine learning and decision making techniques that can excel in uncertain and complex strategic environments, ranging from national... Related Faculty Yuxin Chen Assistant Professor of Computer Science Nick Feamster Neubauer Professor of Computer Science Michael Franklin Morton D. Hull Distinguished Service Professor John Goldsmith Edward Carson Waller Distinguished Service Professor Emeritus, Departments of Computer Science and Linguistics Robert Grossman Frederick H. Rawson Distinguished Service Professor in Medicine, Computer Science Rana Hanocka Assistant Professor of Computer Science Grant Ho Assistant Professor of Computer Science Henry Hoffmann Liew Family Chair of Computer Science Junchen Jiang Assistant Professor of Computer Science Risi Kondor Associate Professor of Computer Science, Statistics Karen Livescu Associate Professor, Toyota Technological Institute Michael Maire Associate Professor of Computer Science David McAllester Professor, Toyota Technological Institute Lorenzo Orecchia Assistant Professor of Computer Science Gregory Shakhnarovich Professor, Toyota Technological Institute Nathan Srebro Professor, Toyota Technological Institute Chenhao Tan Assistant Professor of Computer Science, Data Science Matthew Walter Assistant Professor, Toyota Technological Institute Rebecca Willett Professor of Computer Science, Statistics Haifeng Xu Assistant Professor of Computer Science, Data Science Ben Y. Zhao Neubauer Professor of Computer Science Heather Zheng Neubauer Professor of Computer Science Upcoming Events Join us in-person and online for seminars, panels, hack nights, and other gatherings on the frontier of computer science. Slide to Previous Slide Slide to Next Slide May 23 Upcoming Event Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications May 23, 2024 Slide to Previous Slide Slide to Next Slide News & Events UChicago CS News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs May 17, 2024 UChicago CS News Fred Chong Receives Quantrell Award for Excellence in Teaching May 16, 2024 UChicago CS News Unveiling Attention Receipts: Tangible Reflections on Digital Consumption May 15, 2024 UChicago CS News NASA to Launch UChicago Undergraduates’ Satellite May 14, 2024 UChicago CS News University of Chicago Computer Science Researchers To Present Ten Papers at CHI 2024 May 06, 2024 UChicago CS News Two UChicago MPCS Students Win the Apple Swift Student Challenge May 01, 2024 In the News How Artificial Intelligence Can Transform U.S. Energy Infrastructure Apr 29, 2024 In the News Community Data Fellow Stephania Tello Zamudio helps broaden internet access for Illinois residents Apr 29, 2024 UChicago CS News Two UChicago CS Students Awarded NSF Graduate Research Fellowship Apr 24, 2024 UChicago CS News Non-Unital Noise Adds a New Wrinkle to the Quantum Supremacy Debate Apr 05, 2024 In the News The Science of Computer Security: An Interview with Grant Ho, Assistant Professor in Computer Science Apr 02, 2024 UChicago CS News Four Students Receive Honorable Mention in CRA Undergraduate Research Awards Mar 25, 2024 UChicago CS News Navigating the Intersection of Technology and Public Policy: The Journey of Ranya Sharma at UChicago Mar 21, 2024 UChicago CS News Assistant Professor Aloni Cohen Receives Prestigious Award for Groundbreaking Research in Machine Learning Complexity Mar 20, 2024 John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Email This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}