{
  "id": 1,
  "date": "2024-05-18T18:20:13.072424",
  "url": "https://cs.uchicago.edu",
  "university_name": "University of Chicago",
  "title": "",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet Computer Science @UChicago play pause Join Us We are currently hiring tenure-track faculty, teaching faculty, and research, technical, and administrative staff positions. Opportunities Welcome to UChicago CS The University of Chicago is a unique environment for computer science. Here, students and faculty can explore all corners of the field, from theory to applications. They can work at the intersection of computer science and other disciplines, including the social and physical sciences, policy, business, and biomedicine, benefit from the world-class city of Chicago, and make an immediate impact, both locally and globally. An Expanding, Award-Winning CS Faculty Interdisciplinary and Experiential CS Education Groundbreaking, Collaborative, and Interdisciplinary Research Our Building: A Modern, Collaborative Research Hub Featured News Discoveries, honors, and media appearances by members of the UChicago CS research community. Slide to Previous Slide Slide to Next Slide UChicago CS News University of Chicago Computer Science Researchers To Present Ten Papers at CHI 2024 May 06, 2024 UChicago CS News Three UChicago PhD Students From The Department of Computer Science Named To Forbes 30 Under 30 List Nov 28, 2023 UChicago CS News Two UChicago CS Students Awarded NSF Graduate Research Fellowship Apr 29, 2019 UChicago CS News Non-Unital Noise Adds a New Wrinkle to the Quantum Supremacy Debate Apr 05, 2024 UChicago CS News Assistant Professor Aloni Cohen Receives Prestigious Award for Groundbreaking Research in Machine Learning Complexity Mar 20, 2024 UChicago CS News NeurIPS 2023 Award-winning paper by DSI Faculty Bo Li, DecodingTrust, provides a comprehensive framework for assessing trustworthiness of GPT models Feb 01, 2024 UChicago CS News NetMicroscope Uses AI to Improve Network Monitoring for a Better Internet Experience Feb 01, 2024 UChicago CS News Prof. Rebecca Willett awarded the SIAG DATA Career prize Feb 21, 2024 UChicago CS News Assistant Professor Yanjing Li Awarded NSF CAREER Grant for Innovative Computer Architecture and Deep Learning Research Feb 26, 2024 UChicago CS News UChicago Researchers Win Internet Defense Prize and Distinguished Paper Awards at USENIX Security Sep 05, 2023 UChicago CS News Hank Hoffmann Named New Chair For The University of Chicago’s Department of Computer Science Aug 28, 2023 Slide to Previous Slide Slide to Next Slide Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Programming Languages Scientific & High Performance Computing Security & Privacy Systems, Architecture & Networking Theory Visual Computing Research Highlights Interdisciplinary research at the intersection of computer science and other fields. Quantum Computing The new paradigm of computing, which harnesses the principles of quantum physics to perform computations impossible for classical architectures. Learn more Data Science The UChicago vision for data science defines this emerging field as a new discipline, advancing foundations and applications across fields. Learn more On The Job Market Meet the outgoing UChicago CS PhD students and postdoctoral researchers seeking jobs in the 2023 cycle. Read More Equity, Diversity, & Inclusion at UChicago CS At the University of Chicago Department of Computer Science, we welcome students of all backgrounds and identities. In order to achieve our educational and research missions, it is essential to establish and maintain a community of diverse voices. UChicago CS manages and participates in a number of programs and initiatives that support students from groups underrepresented in the field. Learn More News UChicago CS News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs May 17, 2024 UChicago CS News Fred Chong Receives Quantrell Award for Excellence in Teaching May 16, 2024 UChicago CS News Unveiling Attention Receipts: Tangible Reflections on Digital Consumption May 15, 2024 Events May 23 Upcoming Event Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications May 23, 2024 Video Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Jan 26, 2024 Video Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Jan 23, 2024 Video Ian Foster – Better Information Faster: Programming the Continuum Jan 06, 2023 Academics Undergraduate BA and BS degrees that prepare students for graduate study or careers in computing, technology, and related fields. Learn More Master's Programs Degree-granting programs that prepare students for careers in technology, government, and other computing-based fields. Learn More PhD Programs Our PhD program helps students acquire the skills to produce successful research in computer science. Learn More Get Updates Sign up to receive the UChicago CS Newsletter Enter email address Phone This field is for validation purposes and should be left unchanged. Submit John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Phone This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}