{
  "id": 1,
  "date": "2024-05-18T18:19:03.277509",
  "url": "https://cs.uchicago.edu/academics/admission/",
  "university_name": "University of Chicago",
  "title": "Admission",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Undergraduate Program Overview Admission CS Major FAQ Joint Bx/MS Programs Courses Master’s Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs Program Overview Qualifying Phase Admission to Candidacy Dissertation & Defense Advisors & Committees Oral Exam Procedures Admission Course Requirements Annual Review Joint Math/CS PhD FAQ on PhD Requirements Graduate Fellowship Opportunities 2023-24 Academic Year Graduate Student Leadership Courses Admission Course Highlights Jobs & Career Resources Summer Research Student Organizations Admission Apply to UChicago CS undergraduate, master's degree, and PhD programs. Undergraduate Admission The computer science program prepares students for careers in computer science by offering BA and BS degrees, as well as combined BA/MS and BS/MS degrees .  For more information about the program, please refer to our program overview section . Undergraduate admission is handled by the University. Please check out the University admission site for more information. Graduate Admissions Information on Ph.D Admission We are a highly selective program that welcomes and supports excellent applicants. To apply, you should use the online system (Deadline: December 18, 2023, a $90 application fee).  Applicants are required to submit three letters of recommendation. Note : UChicago CS will not require the GRE exam for the 2023-2024 PhD application cycle. It is optional. Please note that while you are free to email faculty to explore possible common research interests, admission decisions are made by the Department. While most of our graduate students have majored in Computer Science, Computer Engineering, or in the mathematical sciences as undergraduates, applicants with other backgrounds have also been successful in our department. Students will succeed in the program if they are motivated to do research and have a strong general intellectual preparation to study in a particular field of computer science. KEY DATES December 18, 2023 :  Deadline for all application materials Early-to-mid February, 2024 : Notification to admitted students March 1, 2024 : Visiting days for admitted students April 15, 2024 : Deadline for decision to accept admissions offer Information on Joint Math/CS PhD Admission To be admitted to the joint program, students will have to be admitted by both departments.  Applicants should refer to the detailed instructions. Information on Master Admission Please refer to each individual master program for the admission process. Combined Bachelors and Masters Programs (Bx/MS) Masters Program in Computer Science (MPCS) Combined M.B.A. from Booth School of Business and M.S. in Computer Science (MBA-MS) M.S. in Computational Analysis & Public Policy (MS-CAPP) Student Application Support Program We would like to make applicants to the Ph.D. program aware of the following student-run program. The Student Application Support Program (SASP) enables prospective applicants to the Ph.D. program in computer science (CS) to receive feedback on their statement of purpose from current CS Ph.D. students before submitting an application to the university. SASP is part of efforts to diversify and increase access to opportunities in the field. This program is open to all prospective applicants. Note that no faculty are involved in the program and that participation in the program will not be disclosed to faculty. The program is accepting submissions until November 25th at this link . John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Name This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}