{
  "id": 1,
  "date": "2024-05-18T18:20:10.762987",
  "url": "https://cs.uchicago.edu/about/our-building/",
  "university_name": "University of Chicago",
  "title": "Our Building",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Why UChicago CS Message From The Chair Our Building Visiting UChicago CS Giving & Collaboration Job Openings Our Building Our state-of-the-art research and teaching space in the John Crerar Library Building supports our mission of collaborative and innovative computer science. Slide to Previous Slide Slide to Next Slide A Modern, Collaborative Research Hub Our space in the John Crerar Library Building helps fulfill the University’s ambition of expanding and enhancing the Department of Computer Science and creating opportunities for new and creative ways to engage and foster collaboration across different fields of research. A Modern, Collaborative Research Hub Our space in the John Crerar Library Building helps fulfill the University’s ambition of expanding and enhancing the Department of Computer Science and creating opportunities for new and creative ways to engage and foster collaboration across different fields of research. A Modern, Collaborative Research Hub Our space in the John Crerar Library Building helps fulfill the University’s ambition of expanding and enhancing the Department of Computer Science and creating opportunities for new and creative ways to engage and foster collaboration across different fields of research. A Modern, Collaborative Research Hub Our space in the John Crerar Library Building helps fulfill the University’s ambition of expanding and enhancing the Department of Computer Science and creating opportunities for new and creative ways to engage and foster collaboration across different fields of research. A Modern, Collaborative Research Hub Our space in the John Crerar Library Building helps fulfill the University’s ambition of expanding and enhancing the Department of Computer Science and creating opportunities for new and creative ways to engage and foster collaboration across different fields of research. A Modern, Collaborative Research Hub Our space in the John Crerar Library Building helps fulfill the University’s ambition of expanding and enhancing the Department of Computer Science and creating opportunities for new and creative ways to engage and foster collaboration across different fields of research. A Modern, Collaborative Research Hub Our space in the John Crerar Library Building helps fulfill the University’s ambition of expanding and enhancing the Department of Computer Science and creating opportunities for new and creative ways to engage and foster collaboration across different fields of research. A Modern, Collaborative Research Hub Our space in the John Crerar Library Building helps fulfill the University’s ambition of expanding and enhancing the Department of Computer Science and creating opportunities for new and creative ways to engage and foster collaboration across different fields of research. A Modern, Collaborative Research Hub Our space in the John Crerar Library Building helps fulfill the University’s ambition of expanding and enhancing the Department of Computer Science and creating opportunities for new and creative ways to engage and foster collaboration across different fields of research. The Department of Computer Science moved into its new home on the second and third floors of the renovated John Crerar Library in August 2018. This state-of-the-art academic space includes closed and open offices, conference rooms, spaces for experimental research, graduate student offices and a large gathering area for departmental seminars, workshops and distinguished speaker lectures. In March 2019, the Crerar Library opened its Media Arts, Data and Design Center (MAAD) , located on the first floor of the building, to support design, GIS, gaming and media arts. The space is jointly operated by UChicago CS, the Humanities Division, UChicago Arts, and the UChicago Library. The first floor also houses the Computer Science Instructional Laboratory (CSIL) which recently expanded to accommodate growing student interest and demand for Computer Science course offerings, and the Data Science Institute , which partners with UChicago CS and the Department of Statistics in executing the University of Chicago’s bold, innovative vision of Data Science as a new discipline. Our space displays several art pieces loaned from the Smart Museum and UChicago Public Art . Read more about the art in Crerar here. John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}