{
  "id": 1,
  "date": "2024-05-18T18:18:02.346808",
  "url": "https://cs.uchicago.edu/events/event/yan-liu-u-of-southern-california-frontiers-of-foundation-models-for-time-series-in-science-applications/",
  "university_name": "University of Chicago",
  "title": "Yan Liu (U of Southern California) - Frontiers of Foundation Models for Time Series in Science Applications",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet May 23 In This Section News Events Video Upcoming Event • May 23, 2024 Yan Liu (U of Southern California) - Frontiers of Foundation Models for Time Series in Science Applications Date & Time: May 23, 2024 2:00 pm – 3:30 pm Location: JCL 390 Add to Calendar 05/23/2024 02:00 PM 05/23/2024 03:30 PM America/Chicago Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications JCL 390 Abstract: Recent development in deep learning has spurred research advances in time series modeling and analysis. Practical applications of time series raise a series of new challenges in science applications, such as multi-resolution, multimodal, missing value, distributeness, and interpretability. In this talk, I will discuss possible paths to foundation models for time series data and future directions for time series research. Speakers Yan Liu Director, USC Machine Learning Center Yan Liu is a Professor in the Computer Science Department and the Director of the Machine Learning Center at the University of Southern California. She received her Ph.D. degree from Carnegie Mellon University.  Her research interest is machine learning and its applications to climate science, health care, and sustainability. She has received several awards, including NSF CAREER Award, Okawa Foundation Research Award,  New Voices of Academies of Science, Engineering, and Medicine, Best Paper Award in SIAM Data Mining Conference. She serves as general chair for KDD 2020 and ICLR 2023, and program chairs for WSDM 2018, SDM 2020, KDD 2022 and ICLR 2022. Related News & Events Slide to Previous Slide Slide to Next Slide Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Jan 26, 2024 Video Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Jan 23, 2024 In the News In The News: U.N. Officials Urge Regulation of Artificial Intelligence \"Security Council members said they feared that a new technology might prove a major threat to world peace.\" Jul 27, 2023 UChicago CS News UChicago Computer Scientists Bring in Generative Neural Networks to Stop Real-Time Video From Lagging Jun 29, 2023 UChicago CS News Computer Science Displays Catch Attention at MSI’s Annual Robot Block Party Apr 07, 2023 UChicago CS News UChicago, Stanford Researchers Explore How Robots and Computers Can Help Strangers Have Meaningful In-Person Conversations Mar 29, 2023 UChicago CS News Postdoc Alum John Paparrizos Named ICDE Rising Star Mar 15, 2023 UChicago CS News New EAGER Grant to Asst. Prof. Eric Jonas Will Explore ML for Quantum Spectrometry Mar 03, 2023 UChicago CS News Assistant Professor Chenhao Tan Receives Sloan Research Fellowship Feb 15, 2023 UChicago CS News UChicago Scientists Develop New Tool to Protect Artists from AI Mimicry Feb 13, 2023 In the News Professors Rebecca Willett and Ben Zhao Discuss the Future of AI on Public Radio Jan 26, 2023 UChicago CS News UChicago Launches Transform Accelerator for Data Science & Emerging AI Startups Jan 19, 2023 Slide to Previous Slide Slide to Next Slide John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Email This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}