{
  "id": 1,
  "date": "2024-05-18T18:17:47.425973",
  "url": "https://cs.uchicago.edu/academics/masters/masters-program-in-computer-science-mpcs/mpcs-career-outcomes/ankit-jaini-joint-mba-mpcs-class-of-2020/",
  "university_name": "University of Chicago",
  "title": "Ankit Jaini, Joint MBA/MPCS Class of 2020",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Masters Program in Computer Science (MPCS) About MPCS MPCS Programs of Study MPCS Admissions Overview MPCS Faculty MPCS Career Outcomes MPCS Alumni Spotlight Ankit Jaini, Joint MBA/MPCS Class of 2020 Junhao Wang, MPCS Class of 2019 Andrew Eckart, MPCS Class of 2021 Anna Simmons, Joint MBA/MPCS Class of 2021 Dheeraj Bandaru, MPCS Student MPCS Intranet for Current Students MPCS FAQs Contact Us! Academics / Masters Programs / MPCS Spotlight Ankit Jaini, Joint MBA/MPCS Class of 2020 Ankit Jaini graduated from the Joint MBA/MPCS Program in 2020. He is currently a Product Manager at WhatsApp (Meta). In his alumni profile he reflects on his time in the Joint Program, shares his experience working as a PM, and what advice he would give to those considering the Joint Degree. Can you tell us about your career roles postgraduation?  What do you like about your role as a PM? I’m currently a product manager at WhatsApp in Meta – a messaging product used by billions every day to stay connected with family, friends and businesses! I work on business messaging at WhatsApp, specifically on how we scale our business monetization efforts while preventing spam on the platform. Before Meta I was leading product Twilio which is a SaaS (software as a service) company providing communication infrastructure for developers to build on top of, essentially helping biz communicate with their users. I worked on building machine-learning based products there to enable businesses to increase their customer engagement through various communication channels such as SMS/email/WhatsApp. As a product manager, seeing people using and loving the product I helped build gives me a lot of purpose. One can tangibly see the real world impact of the work and working at companies at Twilio and now WhatsApp – used by millions even billions around the world – the impact one has on people’s lives is remarkable! I love that about my job as a product manager. Post-graduation, you’ve worked at leading technology companies. Can you tell us a bit about what your job search was like as a Joint Student? Do you believe your Joint Degree has helped you in your career? Post-graduation, I have been fortunate enough to lead teams at Twilio (largest SMS/Email provider in the world) and WhatsApp (the largest messaging app in the world). My first role as a Product Manager at Twilio was fairly technical as Twilio is a developer-first company. A rounded understanding of how APIs work, how machine learning models such as neural networks work, and being able to think like a developer so I could build products they love helped me stand out during my application. I’d give a lot of credit to the Joint degree. I focused on both software engineering and machine learning courses during my program – which along with my business skills – gave me a massive leg up. The CS program gave me so much exposure to these technical concepts and a foundational grounding in software and machine learning skills, which helped me demonstrate my technical acumen during the application process but importantly actually be successful at my job! As a PM, your ability to understand technical architecture and know what’s under the hood so you can help your team make the right product decisions is invaluable. It also ensures you can collaborate with your engineering team at a much deeper level and gain their trust which is critical to execute well on product development What interested you in applying to the Joint Program after being admitted to the Booth MBA Program? Did you have previous CS experience? Before grad school, I was working on my own tech startup in India. That was really my first foray into product development and made me realize the importance of technical education and how much I could increase my leverage if I understood technology deeply. Uchicago’s joint program is one of the few programs where you are offered the flexibility to shape your MBA and CS program to your needs – barring foundational courses, I could choose what courses I wanted to pursue and when, design my workload to suit my ambitions and finish the joint program in the same time as a usual Full-time MBA program. Both these things combined made the joint program an ideal fit for me. I did not have formal CS education from undergrad but I taught myself how to code during my startup days. That background along with interest in software and motivation to pursue a career long term in technology was what drove me to choose the Joint program. What was one of your favorite experiences (class/project/etc.) as a Joint Student? One big reason I enjoyed the joint program so much was the range of diverse topics I was able to dive into – from history and business to entrepreneurship to technology and coding! It’s hard to choose just one so here is one from each program: I loved the cloud computing class from the MPCS program as it was a great combination of theory and hands-on project practice. We dug deep into web application architecture, cloud storage and computation and how to scale our web apps using relevant industry tools such as Amazon web services (AWS). We capped it off by building our own end-to-end web app as part of the capstone project! From the MBA program, my favorite course was ‘Business in Historical Perspective’ – where we explored how businesses have succeeded and failed in diverse contexts throughout history. I am always pleasantly surprised by historical patterns repeating over time and how much we can learn from that. Would you recommend the Joint Program to recently admitted Booth MBA students? If so, why? I derived outsized value from the Joint program and recommend strongly considering it as part of the MBA experience. If you are interested in pursuing a career in a technology-driven industry, or in a technical (or technical-adjacent) role such as a product manager, software engineering, data scientist, etc – then the joint program is a no-brainer. The program gives you the skills and knowledge necessary to navigate the rapidly changing landscape of technology and business, and prepares you to take on leadership roles in these industries. And there is really no previous coding experience required – just the motivation to learn. My class had a mix of both newbies with no previous coding experience as well as folks who had pursued CS in undergrad. However, it’s important to consider your own interests and career goals. If you are primarily interested in a career in business fields, such as consulting or finance, then the joint program may not be as beneficial. Additionally, it’s important to consider the time and effort required to complete the joint program – you do have to ruthlessly prioritize your time and the rigor required is real! But it can be so rewarding 🙂 John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Phone This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}