{
  "id": 1,
  "date": "2024-05-18T18:19:36.869835",
  "url": "https://cs.uchicago.edu/research/theory/",
  "university_name": "University of Chicago",
  "title": "News & Events",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Research Highlights Quantum Computing Data Science Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Partners Postdoctoral Researchers The mathematical perspective offered by theory plays a fundamental role in connecting computer science with the other pure sciences. Since the founding of UChicago CS in 1983, theory has been a core strength of the department, in alignment with the scientific vision and strengths of the broader university. CS theory faculty specialize in complexity, logic, uncertainty, combinatorics, randomness and other areas that bridge CS with physics, statistics, and other mathematical sciences. At UChicago CS, researchers develop theory to understand more abstract, fundamental questions, such as teasing out the inherent limits of computation and their connection with the physical nature of our universe. They also develop theory and build algorithms for applications such as quantum computing, machine learning, and cryptography, working in tandem with other research areas in charting the pathway for tomorrow’s technologies. A robust relationship with the Toyota Technological Institute at Chicago (TTIC), a privately-endowed academic institute located on the UChicago campus, expands and enriches the theory community. Labs & Groups EPiQC (Enabling Practical-Scale Quantum Computing) Fred Chong A multi-disciplinary, multi-institutional NSF Expedition in Computing, led by UChicago, that spans quantum algorithms, software, and physical machines. Theoretical Computer Science Group The Theory group plays a fundamental role in connecting CS with physics, statistics, and other mathematical sciences. Orecchia Group Lorenzo Orecchia Designing simple, efficient algorithms for foundational computational challenges arising in a variety of applications. Related Faculty László Babai Bruce V. and Diana M. Rauner Distinguished Service Professor of Computer Science, Mathematics David Cash Professor of Computer Science Julia Chuzhoy Professor, Toyota Technological Institute Aloni Cohen Assistant Professor of Computer Science, Data Science Todd Dupont Professor Emeritus of Computer Science, Mathematics, and the James Franck Institute William Fefferman Assistant Professor of Computer Science Risi Kondor Associate Professor of Computer Science, Statistics Stuart Kurtz George and Elizabeth Yovovich Professor of Computer Science and the College Yury Makarychev Associate Professor, Toyota Technological Institute Ketan Mulmuley Professor of Computer Science Lorenzo Orecchia Assistant Professor of Computer Science Aaron Potechin Assistant Professor of Computer Science Robert Rand Assistant Professor of Computer Science Alexander A. Razborov Andrew MacLeish Distinguished Service Professor of Computer Science, Mathematics Janos Simon Professor of Computer Science Madhur Tulsiani Assistant Professor, Director of Graduate Studies, Toyota Technological Institute Haifeng Xu Assistant Professor of Computer Science, Data Science News & Events UChicago CS News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs May 17, 2024 UChicago CS News Fred Chong Receives Quantrell Award for Excellence in Teaching May 16, 2024 UChicago CS News Unveiling Attention Receipts: Tangible Reflections on Digital Consumption May 15, 2024 UChicago CS News NASA to Launch UChicago Undergraduates’ Satellite May 14, 2024 UChicago CS News University of Chicago Computer Science Researchers To Present Ten Papers at CHI 2024 May 06, 2024 UChicago CS News Two UChicago MPCS Students Win the Apple Swift Student Challenge May 01, 2024 In the News How Artificial Intelligence Can Transform U.S. Energy Infrastructure Apr 29, 2024 In the News Community Data Fellow Stephania Tello Zamudio helps broaden internet access for Illinois residents Apr 29, 2024 UChicago CS News Two UChicago CS Students Awarded NSF Graduate Research Fellowship Apr 24, 2024 UChicago CS News Non-Unital Noise Adds a New Wrinkle to the Quantum Supremacy Debate Apr 05, 2024 In the News The Science of Computer Security: An Interview with Grant Ho, Assistant Professor in Computer Science Apr 02, 2024 UChicago CS News Four Students Receive Honorable Mention in CRA Undergraduate Research Awards Mar 25, 2024 UChicago CS News Navigating the Intersection of Technology and Public Policy: The Journey of Ranya Sharma at UChicago Mar 21, 2024 UChicago CS News Assistant Professor Aloni Cohen Receives Prestigious Award for Groundbreaking Research in Machine Learning Complexity Mar 20, 2024 John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Comments This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}