{
  "id": 1,
  "date": "2024-05-18T18:19:31.344881",
  "url": "https://cs.uchicago.edu/research/labs-groups/",
  "university_name": "University of Chicago",
  "title": "Labs & Groups",
  "content": "Skip to content About Why UChicago CS Defining and building the future of computer science, from theory to applications and from science to society. Our Building A state-of-the-art research and teaching facility. Giving & Collaboration Job Openings Visiting UChicago CS Research Highlights Quantum Computing The new paradigm of computing, harnessing quantum physics. Data Science Defining this emerging field by advancing foundations and applications. Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Partners Organizations from academia, industry, government, and the non-profit sector that collaborate with UChicago CS. Postdoctoral Researchers Opportunities for PhDs to work on world-class computer science research with faculty members. Academics Undergraduate Undergraduate Program Overview Joint Bx/MS Programs Master's Programs Masters Program in Computer Science (MPCS) Master’s in Computational Analysis and Public Policy (MSCAPP) PhD Programs PhD Program Overview Joint Math/CS PhD Resources Admission Course Highlights Course Catalog Student Resource Guide Jobs & Career Resources Summer Research Community Graduate Student Leadership Student Organizations People Faculty Full-Time Faculty MPCS Faculty Affiliated Faculty Emeritus Faculty All Faculty PhDs & Post-Docs Staff In Memoriam Diversity Diversity @ UChicago CS At UChicago CS, we welcome students of all backgrounds and identities. Equity, Diversity, and Inclusion (EDI) Committee Our BPC Plan Fostering an inclusive environment where students from all backgrounds can achieve their highest potential. Women in Computing Grace Hopper Celebration compileHer News & Events News Haifeng Xu Wins Best Paper Award at Leading AI Conference for Pioneering Research on Mechanism Design for LLMs Fred Chong Receives Quantrell Award for Excellence in Teaching Unveiling Attention Receipts: Tangible Reflections on Digital Consumption Events May 23 Yan Liu (U of Southern California) – Frontiers of Foundation Models for Time Series in Science Applications Video “Machine Learning Foundations Accelerate Innovation and Promote Trustworthiness” by Rebecca Willett Nightshade: Data Poisoning to Fight Generative AI with Ben Zhao Ian Foster – Better Information Faster: Programming the Continuum Search Site close Search To search this site, enter a search term arrow-right-large Submit Intranet Intranet In This Section Research Highlights Quantum Computing Data Science Research Areas AI & Machine Learning Computing Education Data & Databases Human Computer Interaction Scientific & High Performance Computing Security & Privacy Programming Languages Systems, Architecture & Networking Theory Visual Computing Labs & Groups Partners Postdoctoral Researchers Research Labs & Groups Faculty-led research groups exploring research areas within computer science and its interdisciplinary applications. Search Sort by: linkout Lab & Group 3DL Rana Hanocka A computer graphics collective at UChicago pursuing innovation at the intersection of 3D and Deep Learning. linkout Lab & Group Amyoli Internet Research (AIR) Lab Marshini Chetty Working to make the Internet more trustworthy and inclusive, drawing on human-computer interaction, usable privacy and security, ubiquitous computing, and... linkout Lab & Group AxLab - Actuated Experience Lab Ken Nakagaki Designing shape-changing and reconfigurable technologies that invite people to actively engage and interact with a computationally-enhanced physical world. linkout Lab & Group CANON (Computing for Anyone) Lab Diana Franklin Researching innovations in computational thinking education with an emphasis on equity and inclusion for all underrepresented populations. linkout Lab & Group Center for Translational Data Science Robert Grossman A research center developing the discipline of translational data science and applying to advance biology, medicine, healthcare and environmental research. linkout Lab & Group CERES Center for Unstoppable Computing Andrew A. Chien A dynamic community focused on reducing the fragility and complexity of computing systems, while also increasing their efficiency and lifetime. linkout Lab & Group Chameleon Kate Keahey, Haryadi Gunawi A configurable experimental environment for large-scale edge to cloud research. linkout Lab & Group Chicago Human + AI (CHAI) Lab Chenhao Tan Developing synergy between humans and artificial intelligence through a better understanding of human behavior and human interaction with AI. linkout Lab & Group ChiDATA Michael Franklin, Aaron Elmore, Sanjay Krishnan, Raul Castro Fernandez Conducting research on all things data, including large-scale video analysis, efficient data processing systems, and the economics of data. linkout Lab & Group EPiQC (Enabling Practical-Scale Quantum Computing) Fred Chong A multi-disciplinary, multi-institutional NSF Expedition in Computing, led by UChicago, that spans quantum algorithms, software, and physical machines. linkout Lab & Group Globus Labs Ian Foster, Kyle Chard Realizing a world in which all research data are reliably, rapidly, and securely accessible, discoverable, and usable. linkout Lab & Group Human-Computer Integration Lab Pedro Lopes Engineering interactive devices that integrate directly with the user’s body as the natural succession to wearable interfaces. linkout Lab & Group Human-Robot Interaction (HRI) Lab Sarah Sebo Developing robots that help people by engaging them in intelligent, intuitive, and purposeful social interactions. linkout Lab & Group Large-Scale Systems Group (LSSG) Andrew A. Chien Exploring critical systems research questions underlying sustainable, scalable large-scale systems, including cloud, high performance, edge, and mobile/IoT computing. linkout Lab & Group Machine Learning Group Researchers at the University of Chicago and partner institutions studying the foundations and applications of machine learning and AI. linkout Lab & Group Network Operations and Internet Security (NOISE) Lab Nick Feamster Develops data-driven systems that derive insights from network traffic and explores how network traffic can reveal insights into human behavior. linkout Lab & Group Orecchia Group Lorenzo Orecchia Designing simple, efficient algorithms for foundational computational challenges arising in a variety of applications. linkout Lab & Group Programming Languages Group Interested in all aspects of programming language design and implementation, ranging from theoretical foundations to practical applications. linkout Lab & Group SAND (Security, Algorithms, Networking and Data) Lab Ben Y. Zhao, Heather Zheng SAND Lab spans research topics in security, machine learning, networked systems, HCI, data mining and modeling. linkout Lab & Group Strategic IntelliGence for Machine Agents (SIGMA) Lab Haifeng Xu Develops cutting-edge machine learning and decision making techniques that can excel in uncertain and complex strategic environments, ranging from national... linkout Lab & Group SUPER (Security, Usability, & Privacy Education & Research) Group Blase Ur Focused on data-driven methods to improve online security and privacy and improving interaction for IoT and machine learning systems. linkout Lab & Group Systems Group A vibrant, collaborative research community with diverse, synergistic research interests spanning systems, programming languages and software engineering, software and hardware... linkout Lab & Group Theoretical Computer Science Group The Theory group plays a fundamental role in connecting CS with physics, statistics, and other mathematical sciences. linkout Lab & Group UCARE (UChicago systems research on Availability, Reliability and Efficiency) Haryadi Gunawi Improving the dependability of storage and cloud-scale distributed systems in the context of performance stability, reliability, and scalability. linkout Lab & Group YLab Yanjing Li Exploring efficient, intelligent, secure, and robust computer architectures and systems. Explore Labs & Groups // Partners // Postdoctoral Researchers John Crerar Library Building 5730 South Ellis Avenue Chicago IL 60637 Main: 773.702.6614 cswebmaster@cs.uchicago.edu © 2024 Copyright University of Chicago About Research Academics People News & Events Admission Student Organizations Contact Non-Discrimination Statement Accessibility Get Updates Enter email address Phone This field is for validation purposes and should be left unchanged. Submit Follow twitter Link to Twitter linkedin Link to Linkedin youtube Link to Youtube arrow-down-large arrow-left-large arrow-right-large-grey arrow-right-large-yellow arrow-right-large arrow-right-small button-arrow close document facebook facet-arrow-down-white facet-arrow-down Page 1 Checked Checked icon-apple-t5 background Layer 1 icon-google-t5 icon-office365-t5 icon-outlook-t5 background Layer 1 icon-outlookcom-t5 background Layer 1 icon-yahoo-t5 background Layer 1 internal-yellow internal intranet linkedin linkout pause play presentation search-blue search share slider-arrow-next slider-arrow-prev twitter video youtube"
}