{
  "id": 8,
  "date": "2024-05-18T18:24:03.617117",
  "url": "https://accessibility.harvard.edu/",
  "university_name": "Harvard University",
  "title": "",
  "content": "Skip to main content arrow_circle_down University Disability Resources menu close Menu Search Search search About Accommodation Statement FAQs LDC Portal Newsletter Commencement '24 University Disability Resources General Inquiries expand_more Overview Student Accommodations Workplace Accommodations Ergonomics Housing Service and Assistance Animals Filing a Complaint Communication & Assistive Tech expand_more Overview Captioning Academic Alternative Format Assistive Tech Lending Effective Communication Inclusive Content Creation and Delivery Visual Interpretation Getting Around expand_more Overview Construction and Renovation Parking, Transportation, and Getting Around Event Planning expand_more Overview Publicity Materials Space Selection At the Event Event Emergency Planning Vendors/Service Providers Effective Communication for Individuals with Hearing Loss Hosting Accessible Hybrid Meetings Tools & Resources expand_more Overview Student Accommodation Coordinators Vendors & Service Providers Harvard Ombuds Office Professional Organizations and Local Resources Frequently Asked Questions Harvard Celebrates 504! Financial Assistance and Personal Services Video Resources Home Harvard University Disability Resources (UDR) values disability as integral to our rich diversity Welcome Our office provides leadership to University efforts to ensure an accessible, inclusive welcoming learning and working environment for individuals with disabilities while complying with federal and state regulations. UDR serves as a central resource for students, faculty, staff, and visitors on disability-related information, procedures and services for our community. We also provide expertise in the development, implementation, and acquisition for best and promising disability-related University practices. About UDR arrow_circle_right UDR offers the following services Consultation UDR is available to consult with community members related to best practices for accessibility and inclusion of persons with disabilities. Consultation may be initiated by a phone call (617.495.1859 or TTY 617.496.0466), or email to disabilityresources@harvard.edu . Examples of topics community members may wish to consult on: Resources available to students and employees with disabilities Accommodations statements for programs, events, and applications Responding to student, employee, and/or visitor reasonable accommodation requests Best practices for running inclusive and accessible programs When and how to provide captioning and/or audio descriptions for video or online content How to run accessible in-person, remote, or hybrid events Assessing physical accessibility of spaces used for programs and activities Access for service animals in campus spaces Effective communication with community members who are deaf or hard of hearing Training UDR is happy to provide education in support of increasing accessibility and inclusion of persons with disabilities in our community. UDR will tailor trainings or topical discussions for departments if a group of ten or more persons agree to participate. UDR also offers a general Disability Inclusion class through Harvard’s Center for Workplace Development. Technology and Equipment UDR’s Assistive Technology Library and Lab (ATLL) offers people the ability to try out technology to see if it is helpful to them. The ATLL also loans assistive technology and equipment such as wheelchairs or assistive listening devices, to any member of our community. Accommodations Harvard community members with questions about reasonable accommodations for themselves or others may contact UDR at disabilityresources@harvard.edu for consultation. *Community members may wish to review UDR’s website for general guidance related to accessibility and our Frequently Asked Questions page to learn answers to common questions News & Events Harvard Offers Site-wide Access to Visual Interpreting Service Aira April 01, 2024 Harvard is pleased to announce its new engagement with visual interpreting service Aira. Free unlimited access is now available for anyone on Harvard’s Cambridge or Boston campuses who have Aira downloaded to their phone. This visual interpreting service... description Disability Rights Activist Brooke Ellison Remembered as a Friend and Leader February 21, 2024 Brooke Ellison, Harvard College class of 2000 and Harvard Kennedy School MPP class of 2004, passed away on February 4, 2024. Brooke's life and work impacted many in the Harvard community. To learn more visit the Crimson's obituary: https://www.thecrimson ... description Comedians with Disabilities Act February 08, 2024 UDR and Common Spaces hosted a February 8, 2024 comedy show featuring the Comedians with Disabilities Act. All community members were welcome. description Crip Camp: A Disability Revolution viewing November 27, 2023 Date: Thursday, October 19th at 5:30pm Location: Countway Cinema in the Countway Library located at 10 Shattuck St., Boston, MA 02115 Join us for an abbreviated screening of Crip Camp: A Disability Revolution. A film discussion and Q&A session will... description Digital Accessibility at Harvard and Around the Globe: A Celebration of Global Accessibility Awareness Day (GAAD) November 27, 2023 Date: Thursday, May 18, 2023, 1:00pm to 2:30pm Location: Askwith Hall, Longfellow Building, 13 Appian Way, Cambridge, MA 02138 and Zoom Join Digital Accessibility Services (DAS) as we celebrate Global Accessibility Awareness Day (GAAD) with Jennison... description Black Mental Health Experiences: Storytelling & Music November 27, 2023 The Longwood Campus Black Staff Caucus, the MIND Project, and Countway Library proudly present Black Mental Health Experiences: Storytelling & Music. This event aims to raise awareness and foster dialogue about the mental health experiences of Black... description Authentic Inclusion Drives Innovation November 27, 2023 Presentation by Frances West, video now available! ( Harvard Affiliates Only) - Link to Authentic Inclusion Drives Innovation Presented by the Institute for Human Centered Design, this documentary film and research project reexamines the experience of... description Harvard University Disability Resources location_on Richard A. and Susan F. Smith Campus Center, Suite 662 smartphone (617) 495-1859 email disabilityresources@harvard.edu Admin login Copyright © 2024 The President and Fellows of Harvard College Accessibility Digital Accessibility Report Copyright Infringement Info Practices"
}