{
  "id": 8,
  "date": "2024-05-18T18:24:17.875339",
  "url": "https://college.harvard.edu/resources/faq",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Harvard College Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Frequently Asked Questions Search Frequently Asked Questions Begin typing to search the all FAQs on this page. As you type, the content of the page will be searched.\n                  The first match found will be set as the current result. The “Next” and “Previous” buttons will allow you to navigate to other results. The “Jump to current result” button will scroll to and focus the current result. Search FAQs Search No results found Search result controls Previous (Result 0 ) Next (Result 2 ) Jump to current result (Result 1 ) Questions Questions by Topic Questions about Harvard Applying to Harvard Financial Aid: General Financial Aid Application Study Abroad Financial Aid International Students Transfer Admissions Veterans Admissions Visiting Undergraduate Students Questions Questions about Harvard General What is the difference between Harvard College and Harvard University? Harvard College founded in 1636, is the oldest institution of higher education in the United States. Harvard College offers a four-year undergraduate, liberal arts program for students seeking their first degree. There are about 6,600 undergraduates at the College, with nearly equal numbers of men and women. In addition to Harvard College, Harvard University includes 12 graduate and professional schools , all of which offer programs for students who already hold their first degrees and seek advanced training in their fields through master's or doctoral programs. All 12 graduate and professional schools maintain their own admissions offices and teaching faculties, and they are run independently of Harvard College. For information about Harvard's graduate programs, please contact these schools' admissions offices directly. What is a \"liberal arts & sciences\" education? Commitment to liberal arts & sciences is at the core of Harvard College’s mission: before students can help change the world, they need to understand it. The liberal arts & sciences offer a broad intellectual foundation for the tools to think critically, reason analytically and write clearly. These proficiencies will prepare students to navigate the world’s most complex issues, and address future innovations with unforeseen challenges. Shaped by ideas encountered and created, these new modes of thinking will prepare students for leading meaningful lives, with conscientious global citizenship, to enhance the greater good. Harvard offers General Education courses that show the liberal arts and sciences in action. They pose enduring questions, they frame urgent problems, and they help students see that no one discipline can answer those questions or grapple with those problems on its own. Students are challenged to ask difficult questions, explore unfamiliar concepts, and indulge in their passion for inquiry and discovery across disciplines. Courses Can I fulfill academic requirements with previous coursework? Harvard does not accept credit for coursework completed before matriculation. Credentials such as the International Baccalaureate (IB) diploma, Advanced Placement (AP) examinations, and other international credentials earned in secondary school can serve as valuable placement tools, and in some cases may be used to fulfill the language requirement . Harvard College does not grant degree credit for these kinds of pre-matriculation credentials. Can I concentrate in business, journalism, law, or medicine? While you can take courses related to these fields, Harvard's academic programs are not pre-professional, in that they do not provide vocational training. Many Harvard graduates plan to continue their education in professional or graduate schools, often in these fields. Please note that both medicine and law are postgraduate programs in the United States. If you are not a U.S. citizen but wish to continue your education in a professional program, particularly in an American medical school, we advise you to consult specific graduate and professional programs in advance to understand those schools' admissions and financial aid policies concerning international students. What should I know about Harvard's science and engineering programs? Science and engineering have long been priorities at Harvard. There are more than two dozen state-of-the-art facilities for science research at Harvard, and new computer science and chemistry laboratories opened in 2008. Moreover, forty-one of our former and current science faculty members have won Nobel Prizes. About half of recent entering students intend to major in the natural sciences, engineering, computer science or mathematics. Read more about engineering and applied science at www.seas.harvard.edu . How easy is it to change my concentration? About a third of undergraduates change fields after declaring their concentrations, which students do midway through their sophomore year. You would simply change concentrations in consultation with your departmental advisers. Learn more about the breadth of Harvard's academic programs . Are there required first-year classes? Harvard requires all first-year students to fulfill the expository writing requirement, a one- or two-semester course depending on placement . Otherwise, you may enroll in any Harvard College courses in which you are interested and for which you are prepared. How many courses does Harvard offer? Harvard offers more than 3,700 courses. For a complete copy of the course catalog, please visit registrar.fas.harvard.edu . Are there exchange programs with other Greater Boston colleges? You may cross-register in courses offered at MIT, which is a 10-minute trip from Harvard Yard. You may also enroll in graduate-level courses at the Graduate School of Arts and Sciences as well as at many of Harvard's professional schools . Faculty What percentage of faculty members teach undergraduates? Virtually 100 percent. Is it possible to get to know my professors? Yes. In addition to weekly office hours, students often spend time with their professors before and after class. There are also many occasions when professors take meals in Harvard's 12 residential dining halls; attend gatherings in the residences of Faculty Deans, who are themselves Harvard faculty members; and participate in other programs and special events. How large are classes? Some introductory courses as well as several other popular courses have large enrollments. Yet, the median class size at Harvard is 12. Of the nearly 1,300 courses offered last fall, for example, more than 1,000 of them enrolled 20 or fewer students. Campus Life What will my room look like? Most first-year dorms have suites for three to six students. Suites contain from two to four bedrooms and a common room. A few have their own baths, though most share a bathroom with other suites. The First-Year Experience Office assigns students to suites rather than to particular bedrooms, and in almost any suite students should expect to share a bedroom for at least part of the first year. Some dorms contain doubles, usually one fairly large room with a shared bath. Where will I take my meals? First-year students all eat together in Annenberg Hall. During sophomore through senior year, students typically eat in the dining hall located within their Houses, although students can choose to eat at other House dining halls as well. See more about dining . What extracurricular opportunities are available? There are more than 450 student-run organizations at Harvard, among them dozens of publications, five orchestras, an extensive community service program, more than 40 intercollegiate athletic teams, and a broad assortment of other activities—artistic, musical, political, and social. We encourage and support extracurricular opportunities as these provide important settings for personal growth and friendships. Visit the Dean of Students website for more information about extracurriculars. What security measures are in place at Harvard? Harvard has a comprehensive public safety program that includes a full campus police force, a walking escort service, a campus-wide shuttle service, emergency phones, lighted pathways and a computer-card key system operating in all residential buildings. Read Harvard's Annual Security Report on the Harvard University Police Department website . Is on-campus housing guaranteed? Harvard guarantees housing for all four years. First-year students live in one of the 17 dormitories in or adjacent to historic Harvard Yard. Self-selected groups of students are assigned to one of 12 residential Houses for the final three years of undergraduate study. About 350 to 500 students live in a House, each of which includes its own dining hall, library, advising staff, and many other resources. Read more about residential life . Must I live on campus? You must live in Harvard housing your first-year at the College. A very small percentage of students choose to live off-campus their following years. Most students and alumni consider the House system one of the hallmarks of their Harvard experiences. Considering the diversity of student backgrounds, interests, and talents, Harvard's residential program enhances the degree to which students learn from one another. Resources What advising and support services are available? Woven into Harvard's residences are a variety of academic and other advising resources that make the residential experience at Harvard distinctive. First-year students benefit from the guidance that resident proctors provide about living in Cambridge and studying at the College. Each House also has its own staff of advisers called resident tutors who are similar to first-year proctors but with expertise in particular academic and professional fields. Harvard offers extensive advising resources of other kinds. If you need extra help in coursework, you can turn to the Academic Resource Center . The Mignone Center for Career Success (MCS) offers career counseling. The University maintains its own outstanding health services . The Undergraduate Financial Aid Office will help you with financial aid issues, and the Student Employment Office will help place you in jobs on and off campus. Finally, if you are an international student, the International Office is there for your special needs. Does Harvard provide services if I have a disability? Yes. The Disability Access Office (DAO)—formerly the Accessible Education Office (AEO)—assists students with any impairment limiting their ability to walk, see, hear, speak, learn, or write. Based on each student's successful strategies, the Center collaborates with faculty and staff to ensure individualized accommodation. Accessible housing and transportation are also available. Read more about the DAO . Are there research opportunities for undergraduates? Yes - available to students as early as their freshman year. You may find research projects through individual inquiries with departments and professors, through the Harvard College Research Program (HCRP), or through the Mellon Mays Undergraduate Fellowship Program (MMUF). The Faculty Aide Program , run by the Student Employment Office, links professors to undergraduates interested in becoming research assistants. Read more about HCRP and MMUF on the Office of Undergraduate Research and Fellowships website , and find additional opportunities on the Student Employment Office website . What sort of study abroad programs are available? Harvard students study abroad in classroom, laboratory, and field-based immersion programs throughout the world. In addition to greatly expanded study abroad opportunities, other international experiences such as public service internships and employment are offered. Generous funding is available for all students both during the school year and the summer. For more information about study abroad, visit the Office of International Programs website . Does Harvard provide specific resources for undocumented students? Harvard supports all of its students. The Office of Diversity Education & Support can help direct undergraduate undocumented students to advisers and counselors in the Bureau of Study Counsel , Mignone Center for Career Success , Harvard International Office , Student Employment Office , and University Health Services who can assist them. For legal questions, Harvard students can contact the Harvard Immigration & Refugee Clinic . Assistance is also available through Act on a Dream , a student organization that serves as a resource for undocumented undergraduates at the College. Life After Harvard Will attending Harvard College affect my chances of admission to Harvard University's graduate programs in business, medicine, or law? Harvard University's graduate programs are separate from and independent of Harvard College. Each Harvard graduate school makes its own admissions decisions. When reported, Harvard College undergraduates often make up the largest cohort of any incoming school to our various graduate programs. What is Harvard's graduation rate? The College's graduation rate is normally 98 percent, among the highest at American colleges and universities. Everyone admitted to Harvard has the ability to complete all academic requirements successfully. How successful are Harvard students in gaining admission to graduate schools or finding employment after graduation? Our graduates enjoy an extraordinarily high rate of success receiving job offers and admission to graduate and professional schools. Resident tutors in each of the twelve residential Houses assist students applying to graduate schools and fellowship programs. The Mignone Center for Career Success (MCS) offers all undergraduates a range of job and internship counseling and placement. Foreign citizens should be aware that some special policies pertain should they seek employment in the U.S. after graduation. Applying to Harvard Application Fee Paying the admissions application fee is a hardship for my family. Can I get a waiver? We are committed to making the application process accessible for all students. If the admissions application fee presents a hardship for you or your family and you plan on applying for financial aid, the fee will be waived. Please follow the steps below to request a fee waiver: Common Application Confirm that you meet at least one of the indicators of economic need and then select “Yes” to the prompt “ You are eligible for application fee waivers if you meet one or more of the following criteria.\" Complete the fee waiver signature. Coalition Application, Powered by Scoir Confirm that you meet at least one of the indicators of economic need listed in the Fee Waiver section of your Profile. If you do not meet one of the indicators of economic need, you may enter the Harvard-specific fee waiver code on the payment page: JH3S5Q2LX9 Transfer Applicants Please see the Transfer Application Requirements for information about requesting a transfer application fee waiver. How do I pay my admissions application fee? The $85 admissions application processing fee can be paid online through the online application system (either the Common Application or the Coalition Application, Powered by Scoir). Please note that the Common Application and Coalition Application, Powered by Scoir, websites are operated independently, and their respective offices are better able to assist you with specific logistical issues you may encounter while submitting the application forms or your fee through their sites. You may also send a check drawn on a US bank in US dollars to: Harvard College Admissions 86 Brattle Street Cambridge, MA 02138.  Please be sure to write the name and date of birth of the applicant on the check. We are committed to making the application process accessible for all students. If the admissions application fee presents a hardship for you or your family, the fee will be waived. You can request a fee waiver. Please follow these instructions to learn how to get your fee waived . Is it possible to get a receipt for my application fee? If you paid the fee online, your e-mail confirmation is your receipt. If you paid by check, your cancelled check (or image sent by your bank) is your receipt. We do not send any other acknowledgment of payment. If payment is missing, we will contact you. Important note: Payments are tracked only by Harvard's database. Please disregard any notification of payment status posted on the Common Application or Coalition Application website. Can transfer students receive an application fee waiver? We are committed to making the application process accessible for all students. If the admissions application fee presents a hardship for you or your family, the fee will be waived. You can request a fee waiver directly through the Common Application or the Coalition application if you meet their respective indicators of economic need. If you do not meet these indicators, please email adm-tran@fas.harvard.edu to request a fee waiver. Early Action I was deferred. Is there really any chance that I still can be admitted? It is impossible to predict individual admission decisions. Past students whose applications were deferred have been admitted at various rates, often approximating the rate for Regular Decision candidates. Over the next few months, your application will be reviewed again, supplying another opportunity for eventual admission. I was deferred. What can I do to improve my chances of admission? In most cases, the essential details are already on file with the Admissions Committee. Additional information (sent via the Applicant Portal ) should be limited to significant developments in your high school career. We will also expect to receive your Midyear School Report no later than February 1. Do I need to communicate directly with the admissions staff member who read my file about my deferral? Despite what you may hear or read elsewhere, no; this is wholly unnecessary. Our decisions are made by a committee of admission officers, including faculty members, no single one of whom is responsible for shaping the outcome of deliberations. Can I apply via rolling admission to another university if I want to apply Restrictive Early Action to Harvard? If you intend on applying REA to Harvard, you may not apply rolling admission to a private university until after REA decisions are released, but you may apply rolling admission to a public or international university if the decision is non-binding. If I apply restrictive early action to Harvard, may I apply to another private college's early action program (restrictive or not)? No. However, you may apply Early Action to any public college/university or to universities outside the U.S. If I apply restrictive early action to Harvard, may I apply to another college's early decision program? You cannot apply to another college’s binding early decision program until we have released Restrictive Early Action (REA) decisions in mid-December. After students receive Harvard's REA notifications, including a deferral, they are free to apply to any institution under any plan, including binding programs such as Early Decision II. You may apply for scholarships or special academic programs with an early deadline at another institution, public or private, if the timing is proven to be a necessary aspect for consideration, and the outcome is non-binding. I am applying to colleges outside of the U.S. May I apply to them at the same time as I apply Restrictive Early Action to Harvard? Yes. May I apply to another college under its Regular Decision plan before I receive Harvard's decision on my Restrictive Early Action application? In the case of a Regular Decision program with no early consideration of any kind, you may apply at any point before their deadline. In the case of early deadlines for special considerations, you may apply for scholarships or special academic programs with an early deadline at another institution, public or private, if the timing is proven to be a necessary aspect for consideration, and the outcome is non-binding. Why was my application deferred? Competition for early admission to Harvard College has, in recent years, been especially rigorous. Given that more than 60,000 candidates apply from around the world, and the relatively modest size of each entering class (about 1,650 students), the Admissions Committee must act with great care in making Restrictive Early Action Decisions. As a result, many strong applicants are deferred to the Regular Decision round for review. Testing How should I prepare for standardized tests? Our admissions committee understands that opportunities to prepare for standardized tests vary greatly for students of different socioeconomic backgrounds. You may find it helpful to utilize free-test prep from Khan Academy or join a free SAT bootcamp on Schoolhouse.world. The ACT and College Board provide sample tests to practice.  Such free programs could help students from under-resourced schools by providing the academic tools that will serve them well on standardized tests and also in college. Students can also do well by studying widely and deeply  on their own with the help of family, school, or community organizations. Khan Academy Schoolhouse.world What if I do not have access to SAT or ACT testing in my hometown or home country? What if it would be a financial hardship for me to access a SAT or ACT test site elsewhere? The Admissions Committee does not expect applicants to go to extraordinary measures to access SAT or ACT test sites. If students attend schools that offer SAT or ACT testing onsite, or live or attend schools close to accessible test sites, we will expect them to take the tests and submit scores with their Harvard application. However, if students do not have access to nearby test sites, the Admissions Committee still welcomes applications from these students. We encourage students in that situation to submit results from other standardized tests to which they have greater access. For instance, students lacking access to the SAT or ACT may submit AP results/IB/GCSE/A-level/other national leaving exam predictions or results. What if it would be a financial hardship to register for the test? If the cost of taking the SAT or ACT is of concern, keep in mind that both the College Board and ACT provide fee waivers to some domestic students from low-income families. Students who are non-US citizens attending secondary schools outside the US are not typically eligible for SAT or ACT fee waivers. If applicants are ineligible for fee waivers, but still face financial hardship in paying for a SAT or ACT, the Admissions Committee still encourages these students to apply. We encourage students in this situation to take and submit results from other standardized tests to which they have greater access. For instance, students lacking access to the SAT or ACT may submit AP results or IB/GCSE/A-level/other national leaving exam predictions or results. Why did Harvard decide to require standardized testing again? The decision to return to requiring testing was motivated by a number of important new insights, including research led by Harvard faculty members that confirms the role of standardized testing to help predict college and post-college success for students, including those from less-resourced backgrounds, particularly when considered together with other academic credentials. We also know that, when given the choice, many applicants choose not to submit scores. This can disadvantage some students, including low-income and minority applicants, who also may be disadvantaged in other aspects of their application because of lack of academic opportunity. More information about an applicant, especially such strongly predictive information, can be valuable. Reinstating a testing requirement will bring important and consistent information back into the admissions process. In Harvard’s whole-person review process, testing is just one data point among many considered carefully with the expertise of the admissions committee. We recognize that this requirement brings certain challenges. Access to testing should never prevent a student from applying to Harvard. In addition to providing alternative test options for those who cannot access the SAT or ACT, Harvard College Admissions provides information on sources for no-cost tutoring and test preparation . Which standardized tests does Harvard require? Harvard will accept the SAT or ACT to meet the standardized testing requirement. In exceptional cases, when those are not accessible for a student, one of the following can meet the requirement: AP exam results IB Actual or Predicted Scores GCSE/A-Level Actual or Predicted Results National Leaving Exams Results or Predictions English language proficiency examinations such as the TOEFL, IELTS and Duolingo cannot be used to meet the standardized testing requirement, though students are welcome to submit them for review as part of their application materials. Students may self report their standardized test scores. If the cost of taking the SAT or ACT is of concern, keep in mind that both the College Board and ACT provide fee waivers to some domestic students from low-income families. Students who are non-US citizens attending secondary schools outside the US are not typically eligible for SAT or ACT fee waivers. If applicants are ineligible for fee waivers, but still face financial hardship in paying for a SAT or ACT, the Admissions Committee still encourages these students to apply. We encourage students in this situation to take and submit results from other standardized tests to which they have greater access. For instance, students lacking access to the SAT or ACT may submit AP or GCSE results, IB/A-level/other national leaving exam predictions or results. How will the Admissions Committee evaluate my test scores? When reading an application, the Admissions Committee reviews test scores, along with all other aspects of the application, to get to know the person behind the numbers. Harvard has found that SAT and ACT scores are  the best predictors of Harvard grades. The Committee also understands that SAT and ACT tests are one aspect of a student’s application. Admissions officers take into consideration that not all students attend well-resourced schools throughout their lives, and that those who come from modest economic backgrounds or first-generation college families may have had fewer opportunities to prepare for standardized tests. Each application to Harvard is read with great care, keeping in mind the context of a student’s high school and community and in recognition that talent is everywhere, but opportunity and access are not. What if English is not my first language? A strong knowledge of English is essential for successful study at Harvard, including the ability to understand and express thoughts quickly and clearly. Throughout the application, we will look for evidence that an applicant has the necessary English language proficiency. We do not require the TOEFL or other English language exams, but students may choose to submit their results. What if I am a military veteran and never took the SAT or ACT? The Admissions Committee does not expect applicants to go to extraordinary measures to access the SAT or ACT test. The Committee welcomes applications from military veterans who may not have taken the SAT or ACT while they were in high school. We encourage students in this situation to submit results from other standardized tests to which they may have had access. For instance, students may submit AP results or results from other standardized tests taken in school. Does Harvard consider scores from previous administrations of the SAT or ACT? Yes. Do I need a minimum required SAT or ACT score? The Admissions Committee does not have testing cutoffs for applicants. All completed applications are read and carefully considered by the committee. Testing is one academic factor among many that the committee considers in relation to the norms of a student’s high school. In the last year that Harvard required testing, the range (10th percentile to 90th percentile) of SAT scores for enrolling students was 670 to 790 for Evidence-Based Reading and Writing and 680 to 800 for Math.  The range (10th percentile to 90th percentile) of ACT Composite scores was 31 to 36. If I take the ACT and/or SAT more than once, which results does Harvard consider? We consider your best test scores, but it is the general experience that taking tests more than twice offers diminishing returns. Does Harvard superscore test results? We do not create superscores for applicants. We will evaluate your application noting the highest test scores in each section across test dates for the SAT and your strongest sitting for the ACT.  We take into account your educational background when reviewing your scores. You may choose to send your ACT superscores to Harvard. When you do so, we will also receive the full results from your best sitting, including highest composite from a single test date. Can I self-report my test scores? Yes. Applicants may provide self-reported test scores. Admitted students who self-report SAT and ACT scores and decide to enroll at Harvard College will be required to submit official SAT and ACT test scores upon enrolling. Other test scores will be reviewed through the final transcript review process. View our application tips for specific information on how to self-report your scores. If you were eligible for a fee waiver from the SAT or ACT, you are eligible for unlimited free score reports to be sent to institutions to which you are applying.  We recommend you use your free score reports to share your scores with Harvard. How will Harvard evaluate the new digital SAT? The College Board's shift to a digital delivery of the SAT will not impact the way in which Harvard reviews test scores within applications. Please visit the College Board FAQs for more information. Process What should students know about visas? Admitted international students will be provided with information about applying for a student visa. Are my chances of admission enhanced by submitting application materials before other applicants? No. The deadlines are November 1 for Restrictive Early Action and January 1 for Regular Decision. I have a bachelor's degree. May I apply to Harvard College? No student with a bachelor's degree or other first university degree from any other university, whether American or foreign, is eligible for admission to Harvard College. Students interested in continuing their studies beyond the bachelor's degree might wish to consider one of the 12 Harvard University graduate schools . The Harvard College Admissions Office is independent of these schools and their admissions policies. May I defer my admission once admitted? Yes. Students admitted in the Early Action and Regular Decision rounds can choose to defer their admission by selecting the \"I defer\" option in their admitted student reply form. We want to do everything possible to help the students we enroll make the most of their opportunities, avoiding the much reported \"burnout\" phenomenon that can keep them from reaching their full potential. Our overall graduation rate of 98%, among the highest in the nation, is perhaps due in part to the fact that so many students take time off, before or during college. The admissions committee encourages admitted students to defer enrollment for one year to travel, pursue a special project or activity, work, or spend time in another meaningful way - provided they do not enroll in a degree-granting program at another college. Deferrals for two years are also considered for such purposes as military or religious service or under other unique circumstances, and subject to the approval of the admissions committee. Each year, between 90 and 130 students defer their matriculation to the College, and they report their experiences to be uniformly positive. After graduation, large numbers of Harvard students take time off before beginning work or graduate school. Read more about taking time off . If a student has already replied as enrolling, but has since changed their mind and would like to defer, they may contact the Admissions Office or submit the Request to Defer form on the Admitted Students Website explaining the request for a deferral as soon as possible and in any event by the end of June. What admissions criteria do you use? There is no formula for gaining admission to Harvard. Academic accomplishment in high school is important, but the Admissions Committee also considers many other criteria, such as community involvement, leadership and distinction in extracurricular activities, and personal qualities and character. We rely on teachers, counselors, and alumni to share information with us about an applicant's strength of character, their ability to overcome adversity, and other personal qualities. May I apply to Harvard if I am admitted under a binding Early Decision program at another college? No. If you are admitted under an Early Decision program at another college, you must withdraw any pending application to Harvard and you are not eligible for admission. How familiar is the Admissions Committee with secondary schools? Their rigor? What marks mean in a particular school or educational system? We have worked hard for many years to learn about schools around the world. Our careful study of different schools, curricula and educational systems is augmented by information we receive directly from schools, extensive personal communication with school personnel, and the interview reports we receive from our alumni, who meet thousands of applicants to Harvard each year. We can always learn more, so we welcome information students think might be helpful to the Admissions Committee in understanding their accomplishments in their school communities. Does Harvard consider legal immigration status in the admissions process? All students are considered in the same pool for admission to the incoming class regardless of citizenship status. While being undocumented may present challenges for students wishing to travel or work on campus, immigration status is not considered by the admissions committee. Does Harvard rank secondary schools in the U.S. and abroad? No. While we understand there are differences in the overall strengths of secondary schools, we are most interested in how well applicants have taken advantage of available resources. In the end, we admit the student not the secondary school they attend. Can I (as an applicant) write about my race/ethnicity in my application materials? Can I (as a counselor or teacher) write about a student’s race/ethnicity in my letter of recommendation? Just as in previous admissions cycles, applicants and those writing on behalf of applicants should feel welcome to write about any aspect of the applicant’s identity or background, including race and/or ethnicity. You do not have to withhold any information in any part of the application (e.g. extracurricular list, personal essay, Harvard’s supplemental questions , letters of recommendation, etc.) because of the Supreme Court’s decision regarding affirmative action. As the applicant, you are welcome to check the race/ethnicity boxes when completing the application, though that information will not be shared in the transmission of application data for review. As our admissions committee members review applications, it is incumbent on our staff to comply with the ruling of the Supreme Court in which we cannot consider race/ethnicity in our review of applications. Who should write my recommendations? Teachers who know you well and who have taught you in academic subjects (preferably in the final two years of secondary school) typically will provide us with the most valuable testimony. Whenever possible, teachers should tell us about your non-academic interests and personal qualities as well as academic potential. Who reads applications? Applications are read by members of the forty-person Admissions Committee, and are considered very carefully in a series of committee meetings where a majority vote is required for admission. The entire process requires several months. Is there a wait list? Yes. Our wait list includes the applicants whom the Committee might still wish to consider for admission if spots in the entering class open later. The wait list is not ranked. In some years, we have admitted no one from the wait list; in others, we have admitted more than 200 candidates. Does Harvard admit students to enter in the spring semester? No. All students begin study in September to benefit from special programs designed for freshmen. Are there quotas for certain kinds of applicants? The Admissions Committee does not use quotas of any kind. Is there a separate admissions process for prospective athletes? No. We encourage students with athletic talent to contact our Athletic Department for information about any of Harvard's 42 varsity athletic teams. Criteria What is included in the Harvard supplement? The supplement includes five required short-answer questions, each with a 200 word limit. We want to ensure that every student has the same opportunity to reflect on and share how their life experiences and academic and extracurricular activities shaped them, how they will engage with others at Harvard, and their aspirations for the future. Our continued focus is on considering the whole student in the admissions process and how they have interacted with the world. Harvard has long recognized the importance of enrolling a diverse student body. How will the life experiences that shape who you are today enable you to contribute to Harvard? Briefly describe an intellectual experience that was important to you. Briefly describe any of your extracurricular activities, employment experience, travel, or family responsibilities that have shaped who you are. How do you hope to use your Harvard education in the future? Top 3 things your roommates might like to know about you. If my curriculum requires more than the 12-year U.S. curriculum, may I apply after my twelfth year? We strongly recommend you complete whichever curriculum you have been following. Applicants who have completed only a year of GCE A-levels or International Baccalaureate study, for instance, are at a tremendous disadvantage in our applicant pool. Can I fulfill academic requirements with previous coursework? Harvard does not accept credit for coursework completed before matriculation. Credentials such as the International Baccalaureate (IB) diploma, Advanced Placement (AP) examinations, and other international credentials earned in secondary school can serve as valuable placement tools, and in some cases may be used to fulfill the language requirement . Harvard College does not grant degree credit for these kinds of pre-matriculation credentials. How important are extracurricular activities in admissions decisions? Each case is different. Some students distinguish themselves for admission with their unusual academic promise through experience or achievements in study or research. Other students present compelling cases because they are more \"well-rounded,\" having contributed in many different ways to their schools or communities. Still other successful applicants are \"well-lopsided\" with demonstrated excellence in one particular endeavor. Some students bring perspectives formed by unusual personal circumstances or experiences. Like many colleges, we seek to admit dynamic, talented, and diverse students who will contribute significantly to the education of their classmates. Are there secondary school course requirements for admission? There is no single academic path we expect all students to follow, but the strongest applicants take the most rigorous secondary school curricula available to them. An ideal four-year preparatory program includes four years of English, with extensive practice in writing; four years of math*; four years of science: biology, chemistry, physics, and an advanced course in one of these subjects; three years of history, including American and European history; and four years of one foreign language. *​​Applicants to Harvard should excel in a challenging high school math sequence corresponding to their educational interests and aspirations. We recommend that applicants take four years of math courses in high school. Ideally, these math courses will focus on conceptual understanding, promote higher-order thinking, and encourage students to use mathematical reasoning to critically examine the world. Examples include rigorous and relevant courses in computer science, statistics and its subfields, mathematical modeling, calculus, and other advanced math subjects. Students’ math records are viewed holistically, and no specific course is required. Specifically, calculus is not a requirement for admission to Harvard. We understand that applicants do not have the same opportunities and course offerings in their high schools. Moreover, many programs of study at Harvard do not require knowledge of calculus. We encourage applicants to take the courses that are available to them and aligned with their interests and goals. Students intending to study engineering, computer science, physics, mathematics, statistics or other fields where calculus is needed may benefit from taking calculus in high school. However, students at Harvard can still pursue such fields by starting with one of our introductory calculus classes that has no high school calculus prerequisite. On balance, we encourage all students to master foundational mathematical material instead of rushing through any of the more advanced courses. Will it help me to take advanced, accelerated or honors courses? Yes. Although schools provide different opportunities, students should pursue the most demanding college-preparatory program available, consistent with each student's readiness for particular fields of study. Counselors can offer helpful advice as students choose their courses. Do I need certain grades or marks to be considered for admission? We recognize that schools vary by size, academic program, and grading policies, so we do not have rigid grade requirements. There is no single academic path we expect all students to follow, but the strongest applicants take the most rigorous secondary school curricula available to them. We do seek students who achieve at a high level, and most admitted students rank in the top 10-15% of their graduating classes. Are my chances of admission enhanced if a relative has attended Harvard? The application process is the same for all candidates. Among a group of similarly distinguished applicants, the children of Harvard College alumni/ae may receive an additional look. Is there an age requirement for applying to Harvard? There is not an age requirement for applying to Harvard, though applicants are expected to have some secondary school experience. What if I have completed most or all of my secondary school coursework through self-study? Harvard College's academic program emphasizes in-person peer engagement and student-faculty interactions. For the Admissions Committee to make the best assessment of an applicant's ability to succeed at Harvard, we encourage self-study applicants to submit third-party confirmation of their knowledge and learning behaviors. These documents can include course certificates, publications, patent registrations, and/or letters of recommendation from academic mentors or teachers. Submitted Applications I submitted something by mistake. Can you remove it from my file? Unfortunately, we are not able to remove materials from your file after they have been submitted. However, you may write an explanation of the materials that have been submitted by mistake and/or why you’d like them to be removed, and we will add this new information to your file. I submitted the application, but I no longer want to be considered for admission. Can I withdraw my application? You may withdraw your application using the withdrawal form in the Applicant Portal . You may also send an email to fileroom@fas.harvard.edu with the subject line: Withdraw Application. Please be sure to write from the email address you used on the Common Application. We are not able to withdraw an application based on a request from someone other than the applicant. What if my supplement wasn't submitted? If you discover that your supplement was not submitted with your application, please log into your applicant portal and use the material uploader tool to upload your supplement (in a word doc or PDF). Have my application materials been received? (Including Common Application forms, or supplemental materials) Upon receipt of your application, we will send you a confirmation email with instructions on how to access the Applicant Portal . This portal allows you to view your record in our applicant database, to see which pieces of your application we've received and processed, and to make other changes to your application. The data is updated nightly from the main admissions database and has the most up-to-date information available from our office. If you have sent us required materials that are shown in your status as not received, it is possible that those documents are being processed (along with thousands of others) in our office and simply have not yet made it to your file. Though we can not track each individual's materials upon request, we will conduct a thorough scrutiny of all files prior to committee evaluations. You will be contacted if you are missing required documents, and you will be given the opportunity to re-submit them without penalty. Can I add to or change something I wrote on my Common Application forms? Unfortunately, you are not able to add to or change the Common Application forms after they have been submitted. However, you may upload additional information and materials using the Applicant Portal. My contact information has changed since I submitted my application. How can I correct it? You can update your contact information on the Applicant Status Portal . If you need to update information that is not available on the Portal, please contact fileroom@fas.harvard.edu . How can I add new accomplishments/awards/accolades to my submitted application? We understand that you might receive new recognitions or awards after you’ve submitted your application. We welcome the submission of this additional notable information. You may upload information about notable accomplishments and awards using the Applicant Portal . I submitted my application, but did not receive a confirmation email from Harvard. How do I know if you received it? We begin processing applications in September, and we confirm the receipt of each application to each applicant via email. Most applicants receive their application acknowledgement email the day after they submit their application (if it was submitted online). If you have submitted your application more than 2 weeks ago, and still have not received a confirmation email from us, it is likely that our email was undeliverable for some reason. Please check to make sure that your email account settings allow emails from college@fas.harvard.edu and fileroom@fas.harvard.edu . Also, please check any filtered mailboxes for spam/junk email to see if your confirmation was filtered there. If you are still unable to locate your confirmation, it is possible that we have not received your application. If you submitted your application through the Common Application or Coalition Application, Powered by Scoir, please make sure that you have clicked the button to \"Submit\" and not just \"Save.\" Once you have made sure that you have actually submitted your application and still have no confirmation, please send us an email with your full name, date of birth, and school. Let us know when you submitted your application and how, so that we may consult our records accordingly. I applied under Restrictive Early Action, but I would like to be considered under Regular Decision. Can I change my application? (Or, I applied under Regular Decision and would like to be considered under Restrictive Early Action.) To change your application program, use the form in your Applicant Portal . You do not need to submit a new application; your submitted materials will simply be reviewed on a different time-table. I reported my SAT scores to Harvard, but my status page says they haven’t been received. Why? Though you may have ordered your scores, it can sometimes take a couple of weeks for your scores to be officially sent and processed in our office. If your official scores do not show in your status page after a couple of weeks, please double check with the testing agency to make sure they were sent. Once you have confirmed the delivery, please check the name and personal information used on your scores. If this varies, even slightly, from what you have listed on your application, your scores will be automatically stored in a separate entry in our database. If this is the case, you can send an email to scores@fas.harvard.edu listing the discrepancy in your name/info, and your scores will be merged with your application file. I did not receive a PIN to access the applicant portal. Can I get a new one? When you submitted your application, we sent a confirmation email to the email address you listed on your application that included a PIN to access the applicant portal and create your own password. However, these e-mails are sent out in bulk from fileroom@fas.harvard.edu or college@fas.harvard.edu , so please check your spam/junk folder. We begin sending application acknowledgement emails in mid-September, so if you applied before then, please wait to receive this email from us before contacting our office. If you have checked your email inbox and your spam folder, and you are still unable to find your application acknowledgement email, please contact the Admissions Office so that we can re-send it to you. Financial Aid: General Challenging Circumstances What if my family's financial situation changes while I am attending Harvard? You may request a review of your financial aid decision at any time to accommodate significant changes in your family's financial situation. You must apply for financial aid each year. We will meet your demonstrated need for all four years. Can I apply for Harvard's financial aid independently of my parents? No, in 99% of the cases. We feel strongly that your parents have an obligation to help finance your college education. Our aid is available only to students whose families would not otherwise be able to send them to Harvard. What if my parents refuse to pay for my college education? To be fair to all our students, we can base our financial aid decisions only on ability and not willingness to pay, and a decision to attend Harvard must be made by you and your parents. Please contact the Financial Aid Office to discuss this further if you have questions or concerns. Cost of Attendance Why is my personal expenses estimate lower this year? The cost of attendance used in calculating financial aid packages has, for many years, included a standard personal expenses allowance, meant to represent what you will spend on out-of-pocket costs like books and supplies, toiletries, laundry, entertainment etc. Starting in the 23-24 school year, we have split this expense into a “books and supplies” category, and a “personal expenses” category, in order to be clearer about what students may spend on books, course materials, supplies, and equipment. There has been no change to how these items work in your financial aid package – this is simply a language change. What’s the difference between “room and board” and “housing and food”? For many years we have used the term “room” to represent the cost of housing at Harvard, and “board” to represent the cost of the meal plan. Students were charged “room” and “board” fees as part of their student term bill, and received aid towards “room and board” costs. The Department of Education has asked that schools change this language to “housing” and “food” costs. This is simply a language change meant to make costs clearer and easier to understand; there has been no change to how housing or meals work at Harvard, or to the amounts charged and used in financial aid calculations. What is the “books and supplies” portion of my financial aid package? The cost of attendance used in calculating financial aid packages includes a standard estimate of what you will spend on books, course materials, supplies, and equipment. This is an ‘unbilled’ or ‘out-of-pocket’ expense, meaning that you will purchase your own books and supplies – you will not see a charge for books and supplies on your term bill. Jobs What is the Federal Work-Study Program (FWSP)? When you apply for aid, your financial aid package will indicate your eligibility for the Federal Work-Study Program (FWSP). The Federal Work-Study Program subsidizes the wages of eligible students, making them particularly attractive to employers. If you are eligible, you will be able to work in FWSP-designated jobs at the University (and sometimes off campus as well). FWSP funds are available for both term-time and summer employment. Browse the Student Employment Office jobs database for FWSP eligible jobs. What is a Term-Time Work Expectation? The term-time work expectation listed on your award letter is the amount of earnings during the academic year that we expect you to contribute toward your college costs. All earnings are paid directly to you, and it will be your responsibility to determine what portion of your earnings will be used towards billed (tuition, fees, housing and food, etc.) and/or non-billed (transportation and personal expenses, etc.) expenses. Students can work while at Harvard, but only some students are eligible for the Federal Work-Study Program (FWSP). Your financial aid letter will designate whether you can work in a job funded by FWSP or need to focus your job search on positions not funded by the program. Please note: You may request a student loan to replace or supplement part or all of a job expectation (term-time or FWSP). To request a loan, use the Loan Request Form . Am I required to work if I am an international student and I qualify for financial aid? There is no requirement to work. However, all students, international or American, who demonstrate financial need will have a student term-time work expectation as part of their financial aid package, which they can typically meet with a job requiring about 10-12 hours per week. U.S. immigration regulations allow foreign nationals to work on-campus only, and they restrict the amount of time a foreign student can spend working while attending college (10-12 hours per week is well under their limit). Jobs are plentiful and are often interesting and relevant to academic interests. Is it easy to find a student job on or near campus? Jobs are plentiful at Harvard. Employment opportunities range from dining hall duties to work in the University's libraries, laboratories, and offices. Students have also earned money on campus as bartenders, teaching assistants, sportswriters, computer programmers, lifeguards and research assistants, to cite a few examples. Working eight to twelve hours on average per week, most students find that they can work, excel academically, and participate in a range of extracurricular activities. Read more at our Student Employment Office website. Loans Where can I find parent financing information? Many of our families find parent loans to be a useful tool for spreading the cost of education over a number of years. Parents may borrow up to the full cost of education, less any other financial aid. Parent loans are not based on financial need, and there are no income restrictions or penalties for early repayment. Harvard processes PLUS loans directly with the U.S. Department of Education through the Federal Direct Lending Program, without the need for banks and for-profit lenders. However, your financing options are not limited to the parent PLUS loan; you and your family may borrow from any lender you choose. Are loans available if I choose not to work? Most students do choose to work. If you will have heavy extracurricular demands on your time (such as playing football in the fall or acting in a spring drama production), you could choose to meet the job expectation partially or completely through student loans. Outside Awards What is considered an outside award? In assessing your financial need, we first look at your family’s particular income and assets in order to come up with a student and parent contribution based on your individual financial need. Any funds that you receive from an organization outside your family that are intended for your educational expenses would be considered outside awards. Since outside awards are additional resources that reduce your financial need, they cannot be used to replace your parent contribution (which was calculated based on your parents’ income and assets). Here are some examples of outside awards: Funds from your secondary school Funds from city, state, or national organizations Funds from nonprofit organizations and businesses Funds from your parents’ employers Funds from government scholarships like ROTC If the funds are meant to pay for your educational expenses, they are outside awards and will be incorporated into your financial aid package according to our outside award policy . You Harvard scholarship funding is not an outside award. Student wages, thesis grants, summer research grants, and other similar grants are not outside awards, since they are not directly meant to pay your standard cost of attendance. If you are receiving funding from an outside organization and are unclear of how to report it, please contact us and we’ll let you know. What happens to my financial aid award if I receive additional outside assistance? A large percentage of each entering first-year class receives one or more outside awards from national or local organizations. When adjusting the Harvard financial aid package, 100% of the total outside award amount is first deducted from your work expectation. If the total of outside awards exceeds your work expectation, that excess amount is deducted from the Harvard Scholarship. Since outside awards are additional resources that help to meet need, they may not be used to replace your parents' contribution or other expected family resource. For example, if you were originally offered a financial aid package with a $3,500 job, and a $15,000 Harvard Scholarship and subsequently receive a $2,000 National Merit award and $1,000 from the Elks Club, then we will reduce your term-time job expectation to $500. Only if outside awards exceeded $3,500 would they have any impact upon the amount of Harvard Scholarship. What do I need to do to report outside award(s)? If you expect to receive an outside scholarship that is not reflected on your award letter, including tuition benefits from parents’ employers, you should report it to the Financial Aid Office by visiting the Outside Award Reporting System (OARS) . This is found under the Financial Aid tab of your My.Harvard student portal. We will adjust the financial aid package to reflect the receipt of additional resources. Where should I send outside award checks? Checks are processed by the Student Accounts Office (not the Financial Aid Office). Please send your checks to: Student Accounts Office Attn: Outside Awards 801 Smith Campus Center 1350 Massachusetts Ave. Cambridge, MA 02138 617-495-2739 Where should I send Cost of Attendance or Verification of Enrollment forms? If an outside organization is requiring you to have a Cost of Attendance or Verification of Enrollment form signed by an official at Harvard, please use the following: Cost of Attendance Forms: Harvard College Griffin Financial Aid Office Attn: Outside Award Coordinator 86 Brattle Street Cambridge, MA 02138 Verification of Enrollment: Please visit the website of the Office of the Registrar . How are funds I receive from my parents' employers (such as faculty tuition benefits or employer paid tuition assistance) factored into my financial aid package? Tuition benefits that you receive from your parents' employers meant for your educational costs would be considered outside awards and would be factored into your financial aid package following our outside award policy . Funds from outside awards are incorporated into your financial aid package in two steps: First to replace the term-time job expectation. If you have outside awards that exceed your term-time work expectation the remaining amount would replace an equal amount of Harvard scholarship. Since outside awards are additional resources that reduce your financial need, they cannot be used to replace your parent contribution. How are funds I receive from organizations like National Merit, the Gates Scholars Program, and Jack Kent Cooke factored into my financial aid package? Funds from outside organizations meant for your educational costs would be considered outside awards and would be factored into your financial aid package following our outside award policy . Funds from outside awards are incorporated into your financial aid package in two steps: First to replace the term-time job expectation. If you have outside awards that exceed your term-time work expectation the remaining amount would replace an equal amount of Harvard scholarship. Since outside awards are additional resources that reduce your financial need, they cannot be used to replace your parent contribution. How are funds I receive from programs like ROTC factored into my financial aid package? Funds from outside organizations meant for your educational costs would be considered outside awards and would be factored into your financial aid package following our outside award policy . Funds from outside awards are incorporated into your financial aid package in two steps: First to replace the term-time job expectation. If you have outside awards that exceed your term-time work expectation the remaining amount would replace an equal amount of Harvard scholarship. Since outside awards are additional resources that reduce your financial need, they cannot be used to replace your parent contribution. Refunds Where do I request a refund from my term bill account? You may request a refund here . Financial Aid Application FAFSA Simplification What is FAFSA Simplification? The federal government has passed legislation to significantly change the FAFSA with the goal of making the FAFSA easier and faster to complete. You can read more about FAFSA Simplification on the Federal Student Aid website . How will FAFSA Simplification affect financial aid deadlines? The FAFSA is usually available starting October 1, and we usually ask Early Action applicants to submit the FAFSA by November 1. Based on significant changes to the 24-25 FAFSA made by the Department of Education, the 24-25 FAFSA did not open until late December 2023. For this reason, we have not asked Early Action applicants to submit the 24-25 FAFSA until February 1, 2024. There are no changes to Regular Action or Transfer application deadlines, nor to the deadlines for current Harvard students. Will FAFSA Simplification change my aid eligibility? The FAFSA determines your eligibility for federal and state financial aid, including the Pell Grant, Federal Work-Study funds, and subsidized federal student loans. While the new methodology may change your eligibility for federal financial aid, it does not determine your eligibility for aid from Harvard. At Harvard, we will continue to use our own methodology to determine your eligibility for our need-based financial aid (read more about this in our How Aid Works section ). We first determine a family contribution, based on your family’s financial circumstances, and then meet your full financial need using Harvard’s funds as well as any federal or state funds for which you are eligible. What will change about my Early Action financial aid estimate after I submit my FAFSA? If you are admitted to Harvard during Early Action and have met your financial aid deadlines, you will receive an estimated financial aid decision around the time you receive your admissions decision. This will include a parent and student contribution, an estimated cost of attendance (which will be updated in the Spring when tuition and fees have been set for 24-25), and your total eligibility for grant aid. When we have received and processed your FAFSA, we will update this grant eligibility to break out funding from Harvard, federal, and state sources. Since we use our own methodology to determine your parent and student contribution, this will in most cases not change these parts of your financial aid package. If the information on your FAFSA conflicts with information submitted on the rest of your application materials (for example, if you report an investment account that you forgot to include on the CSS Profile), we will reach out to resolve these differences and may update your financial aid decision if the updated information changes your eligibility for financial aid. Since the FAFSA determines your eligibility for Federal Work-Study funding and subsidized federal student loans, we will also update you on your eligibility for these programs after your FAFSA has been submitted and reviewed. We expect to send out finalized financial aid decisions around April 1 to students who meet the listed financial aid deadlines. Late applications will be reviewed as soon as possible after this point. CSS Profile How will I know that the CSS Profile has been submitted correctly? You will receive an email confirmation from the College Board after the CSS Profile has been submitted. What do I do if I have already filed my CSS Profile, but other documents are missing from my financial aid application? You should have received an email from the College Board’s Institutional Documentation Service ( IDOC ) providing you with instructions on how to submit your tax forms and any other supplemental forms that may be required. All requested documents, should be uploaded to IDOC . What if I am a foreign citizen who is unable to submit a CSS Profile online? The CSS Profile is available to students from nearly every country and nationality. The College Board is unable to process payments from a small number of countries, and so students from these countries may not be able to submit the CSS Profile. If this is the case for you, please follow this alternate set of instructions to apply for financial aid. Can foreign students use the CSS Profile? Yes! That is actually the best form to use. Do I need to do both the CSS Profile AND the Financial Statement for Students from Foreign Countries? No. Those two forms are interchangeable. If you are able do the CSS Profile, it is the preferred form. What is Harvard’s School Code for the CSS Profile? Our CSS Profile code is 3434. What should I do if I make a mistake on the CSS Profile? We understand that the tax numbers on the Profile may be estimates and will update them with your actual taxes when those arrive through IDOC. If you have major changes or corrections to make beyond those that will be automatically updated by your tax returns, you can update your Profile application once by clicking “Correct Your CSS Profile” on your CSS Profile Dashboard. Should I complete the CSS Profile even if my family has not yet filed our current year tax returns? Yes. You and your parents should use the income information on your W-2 forms or paycheck stubs to estimate the figures that will appear on your tax returns. Such estimates are perfectly acceptable for all students. Divorced/Separated What should I do if the CSS Profile from Noncustodial Household is missing? If your parents are divorced or separated, each household must fill out their own CSS Profile. You should direct your second parent to complete the CSS Profile online. If you are an international student and chose to file the paper Financial Statement for Students from Foreign Countries, please have your noncustodial parent to complete and submit a separate form along with their most recent tax return or wage statement. What if I cannot ask one of my parents to send in their financial information? If you are unable to ask a parent to send in their financial information, please fill out a Parent Information Sheet including a letter from a third party and any additional documentation as appropriate. Given that every family situation is unique, we review parent and household information on a case-by-case basis to determine what documentation and paperwork is appropriate for that student to provide to us in an effort to be as generous as possible with our financial aid assessment. Since we do not review financial information until a positive admissions decision has been made, we cannot make a judgment call on the documentation required until that point in the process. Please rest assured that our financial aid application deadlines are flexible and that we will be in direct touch with the student, should a positive admissions decision be made and the financial aid application is incomplete. FAFSA What should I do if I make a mistake on the FAFSA? You may log back in to the FAFSA website, change the erroneous information, and resubmit the FAFSA. Should I complete the FAFSA even if my family has not yet filed our current tax returns? We would prefer that you wait to file your FAFSA until your taxes are complete. If at all possible, please use the IRS Data Retrieval Tool to complete the FAFSA. However, if the application deadline is near, you should file the FAFSA using estimates. How will I know that the FAFSA has been submitted correctly? You can check the status of your FAFSA here . Please allow one week for processing an online signature, and three weeks for processing a paper signature page. I'm a Canadian citizen; do I have to file a FAFSA? No, only US Citizens and Eligible Permanent Residents should file the FAFSA. (If you are a citizen of both the US and Canada, you should file a FAFSA.) What is Harvard’s Federal School Code for the FAFSA? Our Federal School Code for the FAFSA is E00468. Who can help me troubleshoot technical difficulties with the FAFSA? The Department of Education maintains and supports the FAFSA. You can find their help page at https://studentaid.gov/apply-for-aid/fafsa/filling-out/help , and you can find a list of contact centers at https://studentaid.gov/help-center/contact . You can contact the Federal Student Aid Information Center by phone at 1-800-433-3243. IDOC What is the College Board Institutional Documentation Service (IDOC)? IDOC is a service provided by the College Board which families use to securely submit financial aid application documentation. Applicants who fill out the CSS Profile form are able to submit taxes and other relevant forms to IDOC. You can learn more here . How will I know that my IDOC materials have been submitted correctly? Sign in here. Please allow five or more business days for processing. Remember that the staff at IDOC are only trained to identify basic US tax documents and these are the only ones that will show up on IDOC's tracking. If you have read through our application instructions and submitted what we ask for, then you should not worry about whether IDOC has been able to correctly identify and track your documents. Our staff will review the IDOC materials for all admitted students and current undergraduates to make sure your submissions fulfill our requirements and will reach out if there is anything more we need. Fee Waiver How can I get a financial aid fee waiver? Harvard does not charge a financial aid application fee. However, the financial aid application does include submission of the CSS Profile, an application independent of Harvard but that will normally require the payment of a fee. For CSS Profile fee waiver requests: If you are a US Citizen or Permanent Resident you will automatically be evaluated for a waiver of the CSS Profile application fee at the point that you submit your CSS Profile data to the College Board. The College Board is wholly responsible for these fee waivers and will grant a waiver using their guidelines.  You can learn more on their website here: https://cssprofile.collegeboard.org/fee-waivers . International students for whom the cost of the CSS Profile is prohibitive or who live in countries from which the College Board cannot process payments can follow these instructions to apply through our alternate application process . Admission application fee waiver requests are explained here: ( https://college.harvard.edu/resources/faq/paying-admissions-application-fee-hardship-my-family-can-i-get-waiver ) I can't afford the Profile fee and I'm foreign, so I can't get a College Board waiver. Please follow our alternate instructions for applying through our paper process. I can't pay the Profile fee because the US won't accept credit card payments from my country. Please follow these alternate instructions for applying through our paper process. Missing Documents What should I do if my CSS Profile is missing? Please complete your CSS Profile online. The Harvard College CSS code number is 3434. Once your CSS Profile has been completed, you will be able to use the College Board’s Institutional Documentation Service (IDOC) to submit your tax forms and any other supplemental forms that may be required. Remember, it is important to provide your Social Security Number, if you have one, when you register for CSS Profile; Harvard will use this unique number to identify your data before loading any electronic records. NOTE: If you are a returning student and do not have a Social Security Number, please provide your Harvard ID number in the SSN field when you register for the CSS Profile. If you are a prospective/entering student and do not have a Social Security Number, please be sure to provide the same first, last and middle name, as well as birth date on the CSS Profile that you provided on your Harvard admissions application. What if tax documents are missing and I have already sent my materials to IDOC? Your parents and/or non-custodial parents should upload signed copies of their most recent federal tax return(s) with attending schedules to IDOC. Note that we will not be able to finalize your financial aid award until we receive your actual  federal tax returns with all schedules - these should also be sent to IDOC as soon as they become available.) If you are an international student and a national tax return is not filed, your parents should ask each employer to submit a wage statement detailing their annual compensation. What should I do if the Business/Farm Supplement is missing? You can find the form on our website under Financial Aid Forms . Please fill out a Business/Farm Supplement for each business and/or farm in which your family has an interest or ownership. What should I do if a Cash Flow Statement is missing? You can download the form here . It should be submitted through your IDOC portal. What if my student tax return is missing but I didn't file a return? If you are not required to file a federal or national tax return, you should complete and submit a tax non-filer statement. You can find a tax non-filer statement either on our website (US students would use the federal tax non-filer statement; international students would use the international tax non-filer statement) or through your IDOC Portal. How can I see what is missing/received and when? We are not able to track financial aid application materials for prospective students until they have been admitted. If a student is admitted and indicated they wished to apply for aid, we will let them know at that point what has been received or is missing. For current students, you can see what is missing and/or received by logging into my.harvard. We will not begin tracking documents for the next academic year until mid-February before that year starts, at which time we will post which documents are received/missing on your my.harvard.edu portal. Until that point, the documents showing on your my.harvard portal will be those from this current school year. Taxes Can I send my tax returns directly to you? IDOC is the best method for sending us documents, and is required for all US tax returns. IDOC is available to all students who submit a CSS Profile, whether residing in the US or abroad. Those students were unable to file a CSS Profile and who requested alternate instructions may send their foreign tax returns directly to us by mail or fax as directed by our alternate instructions. Please be sure that anything you send directly to us includes your full applicant name, applicant year, and some other unique identifier (school, birth date, etc.) What if my country doesn't have a tax return? You should send any documentation they do have. Many families will send a year-end wage statement, or a letter from each employer stating annual compensation. What if my parents are unemployed or did not file a tax return? If your parents are not required to file a federal or national tax return, they should send a signed statement listing all sources and annual amounts of income for their household. Each non-filer must print and complete a tax non-filer statement and submit it to IDOC with the rest of your application materials. IDOC also has a built-in tax non-filer statement that you are welcome to use to indicate that you or a parent did not file a tax return. What should I do if my parents or I will be requesting an extension for filing their federal taxes? For prospective students, we will be happy to accept your completed application for financial aid whenever it arrives. We do ask, however, that you send your 2022 tax returns to IDOC as soon as possible after they become available. You should not submit 2021 documents unless you are specifically asked for them. If you receive a positive admissions decision and still have not been able to send your 2022 tax returns, please be in touch with us after you receive your admissions decision. For current students, please send a copy of the IRS extension application to IDOC with the rest of your application materials. Please note that we will be unable to calculate your financial aid award until we receive the actual 2022 tax return. Other What are travel and personal expense allowances? Travel: An allowance toward the cost of traveling to and from Harvard has been included in your budget on your award letter and used in calculating your eligibility for financial aid. You are responsible for booking and paying for your own travel. Many students will use the money they earn over the summer to meet the costs of travel to and from Harvard. Personal Expenses: The estimated cost for books, supplies, clothing, laundry, telephone, entertainment, local transportation, and other incidentals has been included in the personal expenses portion of your budget. Students generally spend between $600-$800 on books over the course of both semesters. You are responsible for paying your own personal expenses. Many of the students will use money earned at their term-time jobs to cover personal expenses. Do my financial aid documents have to be in English? We require English translation for all financial aid documents. Documents do not, however, need to be translated by an official translator. Most students will save the cost of paying a translator and simply write the translation directly on the documents themselves. What should I do if my permanent address changes? Please email us and inform us of your new address. You will also need to file a change of address with the Student Data Office in the Office of the Registrar. I am undocumented. Am I still eligible for financial aid? Yes. If you are undocumented you are eligible for financial aid from Harvard. Harvard makes no distinction based on citizenship in the financial aid process or in the amount of aid for which students are eligible. Undocumented students do not need to file a FAFSA since they are not eligible to apply for federal aid. Financial aid application instructions for all students, regardless of citizenship status, can be found here . What should I do if I am returning from a leave of absence? Please notify our office if you are returning from a leave of absence. The same instructions and deadlines apply, regardless of whether you intend to return in the fall or spring semester. Make sure that you are current with loan repayments and that you file the necessary deferment or forbearance forms when you register. You may want to check the status of your student loans by calling the Student Loan Office at (617) 495-3782. In addition, your term bill from previous semesters must be paid in full. What happens if my financial aid application is late? Prospective students: Our deadlines are in place in order to ensure that we can send an aid award with our admissions decisions. We do not stop accepting applications, and a late application has no effect on your eligibility or the amount of your award. If we receive application materials late, you may simply receive your aid letter at a later date than your admission letter. Current students: Our deadlines are in place in order to ensure we have time to process your financial aid application in time for aid to be reflected on your term bill. If we receive application materials late, you may have to wait longer to receive your financial aid decision and may need to make plans to cover your first term bill payment. While a late application has no effect on the amount of your award, we typically expect all applications to be submitted no later than August 1. Do I need to apply for a state scholarship? Yes, if you are a resident of CT, VT, or DC, you must submit the supplemental state grant application to the appropriate agency. Students who are eligible for state grant funds but fail to follow the procedures and deadlines set by their state grant programs will not receive additional Harvard financial aid to cover lost funding. Are deferred students still eligible for financial aid? Yes. You are considered for financial aid no matter when you are admitted. Is there financial aid available for foreign students? Yes, on exactly the same basis as for American students. Although foreign students are not eligible for any federal funding, the College has its own job and scholarship money available to foreign students. How will I know if my financial aid application is incomplete? For prospective students, we cannot verify receipt of any information until after a student is admitted, and materials will not show up on your Admissions Applicant Status Portal (this portal tracks only required admissions documents). If you are missing financial aid materials at the time of admission, we will notify you immediately. Current students can check their my.harvard.edu account where information is updated daily. Does Harvard participate in the Yellow Ribbon Program and/or ROTC? Harvard University is proud to help veterans continue their education by participating in the Yellow Ribbon Program . As a part of the University, the Harvard College Griffin Financial Aid Office administers Yellow Ribbon Funds for its eligible undergraduate students, who will receive a matching amount from the College. Eligibility for the Yellow Ribbon Program is determined by the Veterans Affairs Administration and not by Harvard College. Students interested in ROTC opportunities, please visit the following service websites: Army ROTC Air Force ROTC website. Navy ROTC When will I find out about my financial aid award? If you are a prospective student and completed your application by the deadline, then you will receive an award decision in your acceptance mailing. If you missed the application deadline, an award decision will be completed as soon as possible and in the order it is received. If you are a current student, award decisions will be posted to your my.harvard account around July 1st. If you missed the application deadline, an award decision will be completed during the remainder of the summer and in the order it is received. Does applying for financial aid affect my chances for admission? No. Your financial circumstances are never an impediment to admission. Foreign students have the same access to financial aid funding as do U.S. citizens. What is the deadline for applying for financial aid? Prospective Students: November 1st, for Restrictive Early Action candidates. February 1st, for Regular Decision candidates. March 1st, for Transfer candidates. Current Students: May 1st. Is it easy to qualify for financial aid at Harvard? Once you are admitted to Harvard, we work closely with your family to ensure you can afford to come here. Because we seek the best students regardless of their ability to pay, we are committed to meeting 100% of demonstrated financial need for all four years.  See how affordable Harvard can be with our Net Price Calculator . What can I do if my family's financial situation is complicated? Submit a letter of special circumstance to IDOC along with the rest of your financial aid application materials. Will Harvard provide travel expenses for international students who receive financial aid? All students, American and international, who are on financial aid have a travel allowance included in their financial aid award to help cover the cost of travel to and from Cambridge. Overseas students are advised to seek information from the nearest U.S. Cultural Affairs Office about travel grants and other financial assistance available to qualified students from various foundations and from the U.S. government. What if I am interested only in applying for federal loans (Stafford and PLUS)? If you do not intend to apply for need-based grant aid from Harvard but do want to apply for a Federal student or parent loan, please notify us of your intentions and submit only the FAFSA. Once we receive your FAFSA information electronically from the Department of Education, our office will notify you of your loan eligibility. How do you determine eligibility for Harvard Scholarships? We determine your financial aid award based solely on your family's demonstrated financial need. Our program is designed to help families across the economic spectrum, from low to upper-middle incomes. Aid is completely need-based and considers many factors, such as your family's income, assets, size, and unusual expenses. There are no merit-based awards, and we have no preferential packaging policies that give some students more attractive awards than others. Can I email you my documents? No. The Griffin Financial Aid Office cannot accept any documents over email. Please submit all documents as described on our application instructions . Are there any merit-based financial aid awards at Harvard? No, we admit students based on their strengths and talents, but all Harvard-administered aid is based only on financial need, and we treat all admitted students equally in terms of their eligibility for that aid. How can I track material that I’ve sent your office? For prospective students, given the tremendous volume of material sent to our office , we are unable to confirm receipt. Rest assured that if we discover we are missing necessary financial aid application materials or have any questions we will be in contact with you (by email or phone) after the student is admitted. Current and admitted students can always check the status of their application on my.harvard . Study Abroad Financial Aid Preparing To Go Abroad What happens if my program’s estimates differ from the standard amounts? You can provide that information on your Study Abroad Supplement for review by the Financial Aid Office. Is it more expensive to study abroad? Since we use the same expected family contribution whether you are studying at Harvard or abroad, the cost to your family should be the same in both cases. However, if a budget is more than $5,000 above your Harvard standard budget, the costs in excess of that $5,000 threshold will not be eligible for additional scholarship funding. A subsidized loan will usually be available to meet these additional expenses. If while abroad you find that your necessary living expenses are substantially higher than anticipated, please contact your financial aid officer. You may be eligible for additional scholarship or a subsidized loan to help meet these expenses. It is to your benefit to contact your financial aid officer before using credit cards to meet unanticipated expenses. If you are worried that you do not have resources to fall back upon in the case of urgent expenses while abroad, or to allow you to take advantage of discretionary travel or cultural opportunities that may come up, we may be able to offer you an “unexpected expenses loan” in advance of your departure. This is a subsidized loan that you can take out for your time abroad. If you don’t end up using the loan funds while abroad, you can simply return them when you return. Interest on these funds does not begin to accrue until 6 months after graduation/withdrawal, so they may be a much better option than credit cards to help you manage expenses. How do you determine my study abroad personal expenses allowance? The personal expenses allowance of your budget is meant to help toward your daily living expenses (separate from your housing and food charges) while enrolled in your study abroad program. As expenses can vary greatly based on each student’s discretion, we are not able to meet every student’s individual expenses. Rather, we build an allowance toward them in your budget, but leave the daily choices to you. For instance, in regard to local travel expenses, we might be able to offer you financial aid toward commuting from your apartment to your school campus, but we wouldn’t be able to offer you scholarship toward a traveling tour that is separate from your program. However, we recognize that you may want to take advantage of your time away from Cambridge, and we encourage you to make your time abroad enriching and educational in the broadest sense. We may be able to offer you subsidized loan to help you expand the scope of your experience abroad, and allow you a wider range of choices. Do I have to pay for health insurance when I’m abroad? Is that the same thing as the Health Services Fee? Please be aware that it is your responsibility to make sure that you have the appropriate health insurance coverage, whether you are studying on campus or abroad. All students are required to have health insurance, and the Harvard Blue Cross/ Blue Shield health insurance is automatically charged to each student’s termbill at the beginning of each semester. If you are covered under your family’s health insurance policy, you may be eligible to waive the Harvard health insurance. It is your responsibility to pursue the health insurance waiver, and University Health Services can help you with that decision. The Health Fee and the Student Services Fee are the two mandatory Harvard fees, and are automatically charged to each student’s termbill at the beginning of each semester. You continue to be responsible for the Student Services Fee while abroad, and we include it in your budget. However, students who are studying abroad are usually eligible to waive the Health Fee. It is your responsibility to pursue the Health Fee waiver, and you should contact University Health Services about the Health Fee waiver. When will I find out how much aid I will receive for my study abroad? If you are applying for the fall semester or the full year, you will be notified at the same time you get your award letter for academic year provided you turned in your Study Abroad Supplement by the deadline. If you are applying for the spring semester, you will be notified in early December. How do I know if I need to submit a Consortium Agreement? You will need to get a Consortium Agreement completed if you are attending a program affiliated with a U.S. college or university. Please have this form completed as soon as possible before you go abroad. You do not need this form if you are going on a Harvard program or direct enrolling abroad. What should I do if I am planning to Study Abroad for academic credit for part or all of next year? Please contact our office to determine your budget. Instructions and deadlines are here . What happens with the monthly Harvard Student Billing Statement? All your financial aid will be disbursed to your Harvard termbill, and we will release your financial aid from your termbill directly to you. Your Harvard statement may take a few months to reconcile. Normally, you will not need to make any payments to Harvard while you are studying abroad unless you are being billed for a Harvard-sponsored program, or if your financial aid does not cover your Harvard Student Services Fee. What if I have questions about budgeting? The Office of International Education holds drop-in hours and meetings with staff or a student adviser to help students explore their study abroad options and will be able to help you in thinking about your budget. For more information, please contact the OIE ( oie@fas.harvard.edu ). For additional assistance with budgeting questions, please email or call the Financial Aid Office and a financial aid officer will be happy to assist you or help you schedule an appointment. Who receives the bill from the study abroad program? The programs will send the bill to you or your family. Am I eligible to use financial aid for study abroad? If you are receiving financial aid and are approved for academic credit during the academic year at another institution, your aid should be available to help cover your costs. The Office of International Education (OIE) determines your program is eligible for academic credit, and the Financial Aid Office (FAO) will work with you to determine the amount of aid you are eligible to receive for your study. What should I do if my program requires that I make a deposit prior to when my financial aid would ordinarily be disbursed? Does financial aid cover my air travel? Usually, the family will pay the deposit and purchase the plane ticket as a part of the family contribution towards educational costs. If you have high financial need or if most of your educational costs are being met with financial aid, then you should contact your financial aid officer. We will work with you either to waive or reduce the deposit, or possibly pay it as necessary. We also may release funds to help you purchase your plane ticket. How do I notify the Financial Aid Office about my plans to study abroad? Complete the Study Abroad Supplement and return it, along with all supporting documents substantiating your budget, to the FAO. If you are planning to study abroad in the fall semester or for the full academic year, the form is due May 1st. If you are planning to study in the spring semester, the form is due October 30th. Be sure to attach documentation of your program budget to the Supplement. Please submit the Supplement by these deadlines, even if you do not know all the answers to the questions, as you can always update it later. Can I use financial aid to study abroad during the summer? Harvard’s financial aid program is only available for term-time for-credit study. Funding for summer experiences is available from a wide variety of offices and programs at Harvard. Good places to start include the Mignone Center for Career Success , the CARAT funding sources database , and the Office of Undergraduate Research and Fellowships . How does the Financial Aid Office determine my study abroad budget? As with your Harvard budget, your study abroad budget will include a combination of billed and non-billed costs. We construct the budget from the program information that you submit on your Supplement, and these costs will include tuition and fees, room and board, and a standard allowance for personal expenses and books. In addition, we will include a standard allowance for air travel to the area of the world in which you will be studying and will include any additional non-discretionary expenses (e.g. visa/passport costs, medical expenses for required shots) that are specific to your program. Lastly, you will continue to be billed for the Harvard Student Services Fee during the semester(s) that you are abroad, so this will be built into your budget. While You Are Abroad What happens if I have questions or problems while I am abroad? We want you to have an enjoyable and enriching study abroad experience. Although you may be very far away from Cambridge, the Financial Aid Office is still here as a resource to you, and we hope that you will be in touch with our office if we can be of any help to you. What happens to my loans while I study abroad? While studying full-time and working towards your degree, your loans should not go into repayment. If they do, you need to provide written enrollment verification directly from your program either to the Federal Government (for your Direct Loan) or to Harvard (for your Perkins and/or Harvard Loans). You can download the deferment forms from the Student Loan Office . Do not ignore these notices or your loans may go into default. How much financial aid will be sent to the program and how much to me? The Financial Aid Office takes the anticipated financial aid for the semester(s) and subtracts any balance due to your Harvard term bill, including any back balance from the previous semester. The remaining amount will be refunded to you and you will be expected to make payments to the study abroad program as required. What if I feel like my living expenses are higher than were anticipated? We encourage you to email your financial aid officer. While we do our best to construct an appropriate budget for you in advance based on the information provided by your program, we recognize that you may encounter higher costs during your time abroad. It is definitely to your benefit to contact your financial aid officer before relying on credit cards to help meet the difference in your expenses. We may be able to offer you additional scholarship or a subsidized loan to help with these unanticipated costs. International Students Testing Do I have to take the TOEFL? A strong knowledge of English is essential for successful study at Harvard, including the ability to understand and express thoughts quickly and clearly. First-year and transfer applicants are not required to take an English proficiency exam, but you may submit scores if you wish to do so. Visiting Undergraduate Students program applicants are required to take the TOEFL. Process Are there quotas for international applicants? There are no quotas or limits of any kind at any point in the admissions process. All students are considered in the same pool for all places in the incoming class, regardless of citizenship or the secondary school they attend. A student's chances for admission and financial aid are not affected by citizenship or by the location of the school that the student attends. Does Harvard offer admission application fee waivers to international students? We are committed to making the application process accessible for all students. If the admissions application fee presents a hardship for you or your family, the fee will be waived. You can request a fee waiver directly through the Common Application or the Coalition Application, Powered by Scoir, if you meet their respective indicators of economic need. If you do not meet these indicators, please follow these instructions to learn how to get your fee waived . Requesting a fee waiver will not disadvantage your application in any way. Is there an interview for international applicants? When possible, we try to arrange for you to meet with alumni/ae in or near your school communities. You will not be at a disadvantage if an interview cannot be arranged. In the U.S., Canada and the U.K., an alumnus/a will contact an applicant directly by phone, e-mail, or letter if such an interview is possible. If you live outside these areas, we aim to hold an admission interview when and where possible. Our interviewers abroad are graduates of Harvard who offer their assistance on a volunteer basis. While we try to make interviewers as widely available as possible, it will not always be possible for a student to have an interview. The absence of an interview will not adversely affect your candidacy. See more about international interviews . How do international students apply? The application requirements are the same for all applicants whether a student attends high school inside or outside the U.S. All first-year candidates must complete the Common Application or the Coalition Application along with the required supplements. We have no preference and each application is treated equally by the Admissions Committee. View our detailed application requirements here . Transfer Admissions Criteria How do I know if I am competitive/ How hard is it to get in as a transfer student? The Harvard College Transfer Admissions Committee evaluates the whole person throughout the application process. There is not a required minimum grade point average (GPA) or test score to apply. The transfer admissions pool is very competitive. In recent years, we have admitted 12-16 students from a pool of over 1,500 applicants. The committee looks for a clearly defined academic need to transfer, a proven record of high achievement, and strong faculty recommendations. Testing I am a non-traditional student. Am I still required to submit a standardized test? What about my high school transcript? The SAT or ACT is required of all transfer applicants. In exceptional cases, when those are not accessible for a student, one of the following can meet the requirement: AP exam results IB Actual or Predicted Scores GCSE/A-Level Actual or Predicted Results National Leaving Exams Results or Predictions If you have applied to Harvard in the past, we will have access to your previous application in our review process including any scores that you submitted with earlier applications. Test scores can be particularly helpful for non-traditional students. We encourage non-traditional students to submit an exam taken within three years of applying for transfer to reflect current academic ability. Self-reported scores are acceptable during the application process; official scores are required of enrolling students. High school transcripts are a required component of the transfer application. If you are unable to obtain your high school transcript, please submit a letter from your high school explaining why the transcript is not available. I applied to Harvard in the past and submitted test scores with my previous application. Do I need to submit test scores again? If I don't report my scores on my current transfer application, will you consider my application without testing? To streamline your application review, we request that students who have taken the SAT or ACT report their scores with each new application, even if you have applied to us previously. Self-reported scores are acceptable during the application process; official scores are required of enrolling students. Please bear in mind that we will consider prior scores, and any other information that we have previously received on your behalf, in our whole-person review process. If you have applied to Harvard in the past with test scores and choose not to report them on your current application, we will have access to your previous application in our review process including any scores that you submitted with earlier applications. Are international transfer applicants required to take the SAT or ACT exam? The SAT or ACT is required of all transfer applicants. In exceptional cases, when those are not accessible for a student, one of the following can meet the requirement: AP exam results IB Actual or Predicted Scores GCSE/A-Level Actual or Predicted Results National Leaving Exams Results or Predictions If you have applied to Harvard in the past, we will have access to your previous application in our review process, including any scores that you submitted with earlier applications. Is the TOEFL still required for VUS even if I have taken classes at a college or university in the United States? No, if you are applying for transfer or first-year admission, you will not be expected to submit a TOEFL exam in order to be eligible for admission. However, Visiting Undergraduate Student applicants must submit the TOEFL. A strong knowledge of English is essential for successful study at Harvard, including the ability to understand and express thoughts quickly and clearly. What are the standardized testing requirements for transfer applicants? The SAT or ACT is required of all transfer applicants. In exceptional cases, when those are not accessible for a student, one of the following can meet the requirement: AP exam results IB Actual or Predicted Scores GCSE/A-Level Actual or Predicted Results National Leaving Exams Results or Predictions If you have applied to Harvard in the past, we will have access to your previous application in our review process, including any scores that you submitted with earlier applications. Housing Is there housing for transfer students on campus? Yes. Admitted transfer students who indicate in their application that they wish to live on campus are eligible for housing in the undergraduate Houses. Students are not required to live on campus, though nearly all undergraduate students do. The undergraduate Houses do not have appropriate accommodations for students who will be living with a spouse, partner, or other family members; students in these situations should plan to live off campus and will be given information about housing resources if admitted. How are transfer students supported on campus? Enrolling students take part in a fall orientation program and are connected with a dedicated transfer adviser who helps with academic planning and the transition to Harvard life. Transfer students who live on-campus will find strong community in their undergraduate Houses, and students who live off campus will benefit from the Dudley Community. Transfer students are also supported by peer advisers , who were themselves transfer students from prior years. Process How long does it take for application materials I have submitted to appear as received in my transfer application status? Application material processing can take up to three weeks if submitted by mail. This does not affect the March 1st deadline, so long as your materials were submitted (or postmarked) by March 1st. May I apply for both Transfer Admission and for the Visiting Undergraduate Students (VUS) Program at the same time? No. Applicants may apply to only one program per admissions cycle. When can I apply as a transfer student? Students may apply to enter as a sophomore (2nd year) or junior (3rd year) student. Harvard College does not admit students for the spring semester. All transfer applications each year are due by March 1st to enter the fall term of the same calendar year. Transfer applicants who are admitted are not permitted to defer their admission. What courses transfer to Harvard College? Is there a list of transferrable courses? The Harvard College Registrar's Office grants credit for work done at another college or university to each admitted transfer student on an individual basis after careful evaluation. The admissions office does not keep a list of transferrable courses and cannot advise on this matter during the application process. Harvard College typically accepts courses taken while enrolled as a full-time student in an undergraduate program similar to our liberal arts curriculum. The Committee also looks for strong preparation in the student's expected field of specialization. I am an international prospective transfer student. What is the transfer application process for me? The application process and requirements are exactly the same for international students. Our financial aid program also applies to all applicants regardless of nationality or citizenship. For more information, you can view all of the transfer application requirements here . Are there interviews for transfer applicants? Generally, we do not conduct interviews for transfer applicants. Should the Admissions Committee need more information regarding your application, our office will contact you. Transfer students may not schedule or request their own interviews. How do I know if you received my transfer application materials? Once your application has been received and processed, our office will send a confirmation email with a link to the Applicant Portal . The application status portal will allow you to track your required materials as they are merged with your application. Our office is unable to confirm receipt of materials via phone or by email. Our office is also unable to return any application materials submitted. Financial Aid Do transfer students qualify for financial aid? Yes. All transfer applicants, including international students, are eligible to apply for need-based financial aid. Transfer applicants should follow the prospective student financial aid application instructions. Veterans Admissions US Military Veterans Is there a separate or different admissions process for military veterans? There is no separate or different admissions process for applicants who are or will be veterans. Applicants with less than one year of college credit may apply as first-year students and those with between one and two years of college credit may apply as transfer students. Please visit the U.S. Military Veterans page to learn more about admissions and financial aid. I am a US military veteran. Should I apply as a first-year or transfer student? To be eligible to transfer to Harvard College, you must have satisfactorily completed at least one continuous academic year in a full-time degree program at one college by your anticipated date of matriculation at Harvard, and not have completed more than two years total in college. Please note that once a student has completed more than two years of college coursework at another institution, regardless of the courses taken, that student is no longer eligible for transfer admission or freshman admission. Our office cannot make exceptions to this policy as it is set by the Harvard faculty. If you do not meet the above requirements and have not yet completed one continuous academic year in a full-time degree program at one college, then you may apply for freshman admission to Harvard College. Please note that if you are eligible to apply as a freshman that any college coursework you have completed would not transfer to Harvard College. My high school files no longer exist because the school closed or was destroyed by a fire/storm/war. What are my options? In order to process your application, we will need to be able to verify your graduation. Therefore, you may want to reach out to the district or state level agency that manages educational records. They may be able to provide proof of graduation or other documents. In addition, since the armed forces require a high school diploma or GED to enlist, they may be able to assist you in confirming your graduation status. Does Harvard accept credit earned from classes taken during my time in the military? Military-specific coursework or credits earned via military training and service, including courses appearing on Joint Services Transcripts, are not generally accepted for transfer credit at Harvard. Online courses are also not generally eligible for transfer credit. Only courses that are liberal arts in nature (in fields comparable to those offered at Harvard College), and that were taken in person while enrolled as a full-time college student, can be considered for transfer credit. The Faculty of Arts and Sciences Registrar Office evaluates transcripts for all admitted transfer students to determine course transferability once a student has been admitted. As a military veteran, my high school grades do not reflect my current work ethic and commitment to my studies. How does this impact my application? We consider an applicant’s full range of experiences and growth from those experiences, especially for veterans. A weak high school transcript does not necessarily mean you will not be a compelling candidate for Harvard. Look at your high school transcript with a critical eye, identify what your weaknesses in the classroom might have been and think about what you have done since that time to address those weaknesses. Be prepared to explain any steps you have taken to improve. I took college or community college courses before/during my time in the military. Am I eligible to apply as a transfer student? To be eligible to transfer to Harvard College, you must have satisfactorily completed at least one continuous academic year in a full-time degree program at one college by your anticipated date of matriculation at Harvard, and not have completed more than two years total in college. Once a student has completed more than two years of college coursework at another institution, regardless of the courses taken, that student is no longer eligible for transfer admission to Harvard. Our office cannot make exceptions to this policy as it is set by the Harvard faculty. We recognize that military service may impact a student’s access to classes. Please contact us at adm-tran@fas.harvard.edu if you have specific questions about your situation. I have been away from school for a while during my military service. Do I still need to submit letters of recommendation? We fully understand that high school teachers may not remember you or still be at your school. We normally suggest that you get a similar set of letters from people who know you well in your current phase of life, such as commanding officers or other professors/instructors (if you have pursued any coursework since high school). Helpful letters might address how you dealt with adversity, stress, or other challenges, how you got along with your peers and how you have maximized opportunities available to you – all critical components to success at Harvard and beyond. How can I interview if I am unable to leave my military base or am deployed at sea? Interviews are not required for admission. If you are contacted for an interview and are not able to leave base, please call our office (617-495-1551) so that we may assist. If you are applying as a transfer student, please know that interviews are not routinely offered to transfer applicants. In cases where it is difficult to reach an applicant we may request a phone or Skype interview. Is it possible to enroll at Harvard College and complete my coursework remotely while remaining on active duty? Harvard College does not presently offer an option to work toward a degree remotely. Harvard Extension School offers more flexible options for students seeking opportunities to study remotely. Learn more about the Extension School's undergraduate degrees . I have never taken the SAT or ACT, or I have not taken the SAT or ACT in recent years and cannot because I’ve been on active duty, what do I do? Harvard will accept the SAT or ACT to meet the standardized testing requirement. In exceptional cases, when those are not accessible for a student, one of the following can meet the requirement: AP exam results IB Actual or Predicted Scores GCSE/A-Level Actual or Predicted Results National Leaving Exams Results or Predictions Veterans Financial Aid Is the financial aid application process the same for a veteran as it is for a non-veteran student? Yes. All aid applicants should follow the same set of application instructions . Harvard College acknowledges the unique contributions each admitted student brings to our learning community. We are therefore committed to equitable treatment through one comprehensive need-based financial aid program. When a veteran completes the FAFSA, the Federal Government may categorize that student as an “independent student.”  Why is Harvard College requesting financial information for parent(s) if the Federal Government considers the student \"independent?\" A student may be deemed \"independent\" for federal purposes for a variety of reasons, including having veteran status. Harvard College maintains its own financial aid program and policies, and it is our institutional philosophy that every student’s parents have a responsibility to contribute to their child’s educational expenses. We therefore begin by asking all aid applicants to provide information for both parents. However, we are committed to working with any student on an individual basis to learn more about complex, unusual, or challenging circumstances that are not easily described in the standard aid application. If any aid applicant cannot ask one or both of their parents to participate in the financial aid process, the applicant should complete the Parent Information Sheet and submit it as part of their financial aid application. How can a veteran report unusual circumstances as a part of their financial aid application (such as unusual debts, liabilities, or anything else that may not be captured by the application)? There are many avenues to provide more information on your specific financial circumstances. When completing the CSS Profile, there is a dedicated section that allows any applicant to expand upon their specific situation. Applicants may also upload a brief “special circumstances” letter through IDOC when they are submitting their tax documents. In addition, all applicants are encouraged to contact the Griffin Financial Aid Office and work with one of our Financial Aid Officers, both during the application process and throughout their time at Harvard, to discuss their circumstances. Would a veteran be eligible for additional financial aid if they have unusually high expenses due to living off-campus? While the Griffin Financial Aid Office is limited to providing aid for education-related expenses, we want to be sure to understand each student’s circumstances as fully as possible. Students who have non-traditional housing needs, such as dependent minors in the family, may submit a detailed monthly budget outlining their off-campus costs for the Financial Aid Committee to review. If a student has VA Benefits that they will use while attending Harvard College, what does that process look like? The Griffin Financial Aid Office works in conjunction with Harvard University Student Financial Services (SFS) to complete the certification process for any student who elects to use VA benefits.  An outline of the process can be found here , and there is also a helpful “VA and Military FAQs” page on the SFS website here . Once a student has obtained their Certificate of Eligibility, we would ask them to contact our office at faoinfo@fas.harvard.edu for information on next steps. In general, we encourage students to contact our office directly if they have specific questions about how their VA benefits might interact with financial aid. Is Harvard College a Yellow Ribbon Institution?  Does Harvard put a cap on the number of students who can receive the Yellow Ribbon funds? Harvard College is proud to be a Yellow Ribbon institution. We do not place a cap on the number of students who receive Yellow Ribbon funds. Student Life and Support Does Harvard have any student groups or alumni groups for veterans? Yes, Harvard College offers both student and alumni groups for veterans. Please visit the Harvard Undergraduate Veterans Organization for information about our student group and Harvard Veterans for information about our alumni group. Do students who are veterans have to live on campus? No, while Harvard College is predominantly residential, some students do not live in College housing. Undergraduates living off campus may elect to be members of Dudley Community. This option has appealed to a number of students, including married students and students who wish to be part of a fully non-residential community. Students who are part of Dudley Community are eligible for meal contracts in Dudley Community and are included in all social and cultural activities sponsored by the Community. They are \"deaned\" by the Allston Burr Resident Dean of Dudley Community and are advised for purposes of fellowship and professional school application by Dudley Community tutors. Visiting Undergraduate Students VUS Admissions What is a Visiting Undergraduate Student (VUS)? Students currently enrolled full-time at an accredited college or university may apply to spend one or two semesters studying at Harvard College. After completing their time at Harvard, the students return to their home school, where Harvard credits are generally accepted, to complete their degree. Am I eligible to become a Visiting Undergraduate Student (VUS)? If you are currently enrolled full-time at an accredited college or university you may apply to spend one or two semesters studying at Harvard College. This program is not for high school graduates who wish to study at Harvard for a gap year. Additionally, since the VUS Program is for full-time undergraduate students only, if you have already achieved the equivalent of a bachelor's degree, you would not be eligible. However, you might be eligible to be a \"Special Student\" at the Graduate School of Arts & Sciences. For more information on this program, please visit their website . Are standardized tests required as part of the Visiting Undergraduate Student (VUS) Application? Students whose native language is not English are REQUIRED to submit a TOEFL score not more than two years old. The results of this test are very useful to the Committee as it considers international applicants. Official tests results must be submitted electronically to the Admissions Office from the ETS (code#3434). We do not require SAT, ACT or AP scores to be submitted in order to apply to the Visiting Undergraduate Student Program. However, we encourage students who have taken them to submit their scores, because all information about a candidate is helpful in the admissions process. I am from another country but I speak English proficiently. Do I still need to take the TOEFL? Only applicants to the Visiting Undergraduate Students program are required to submit the TOEFL. It is not a requirement for first-year and transfer applicants. Without all of the information about a VUS candidate, we cannot make exceptions to this requirement and time constraints do not allow us to pre-screen all applicants to determine if they are exempt from taking the TOEFL. Therefore, we advise all VUS applicants whose native language is not English to take the TOEFL and submit the results. Is there a minimum TOEFL score required for the VUS program? While there is no absolute test score cut-off, the Committee would be concerned that an internet based TOEFL score below 100 might indicate that the candidate does not have sufficient fluency in English to do well in classes here. A strong knowledge of English is essential for successful study at Harvard, including the ability to understand and express thoughts quickly and clearly. Are visiting undergraduate students eligible for Harvard housing? Visiting undergraduate students are not offered University housing. Accepted students must find their own housing before they arrive in Cambridge. Is there financial aid for visiting undergraduate students? As a Visiting Undergraduate Student, you will not be eligible for Harvard financial aid and you must secure your own funding. When should I apply for the VUS program? Fall Term of Full academic year Application opens: February 1 Application deadline: April 1 Spring Term 2024 Application opens: July 1 Application deadline: September 1 It is advised that you apply for the appropriate term. Additionally, we are not able to make early admission decisions for students who wish to apply for a later term. Do Visiting Undergraduate Students (VUS) have the same privileges as Harvard Degree Candidates? While VUS are not degree candidates and do not receive a diploma from Harvard College, they have access to all libraries, academic, and athletic facilities just like Harvard degree candidates. VUS are affiliated with the Dudley Community, the Harvard Community for students who live off campus. If you would like to learn more about life as a Visiting Undergraduate Students and the affiliation with the Dudley Community visit: https://dudley.harvard.edu/homepage Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification."
}