{
  "id": 8,
  "date": "2024-05-18T18:24:12.473578",
  "url": "https://dso.college.harvard.edu",
  "university_name": "Harvard University",
  "title": "Welcome",
  "content": "Skip to main content Main Menu Utility Menu Search HARVARD.EDU GA4 tracking code Staff Directory Residential Portal About Calendar Search Incoming Students Timeline Incoming Student Communications Transitioning to Harvard Gap Year Students Transfer Students Living at Harvard On-Campus Housing Living Off-Campus Dates and Deadlines Recess Housing Extended Stay and Summer Housing Rising Sophomore Lottery Gender Inclusive Housing Transferring Houses Leaving and Returning Move-In/Move-Out Proctors and Tutors Get Involved Student Activities Student Organizations Hosting Events Harvard Traditions Talk with Us Get Support Residential Staff Academics Mental and Physical Health and Wellbeing Social Support Finances Career and Graduate School Off-Campus, Transfer, Military, International Additional Inclusion & Belonging Site Search Welcome The Dean of Students Office is dedicated to building a campus residential and social community that is welcoming, open and accessible to all students. About us Class of 2028 Trending Questions When is move-in? How do I apply for a Pre-Orientation program? When is Family Weekend? More FAQs Get Support Connect with support for academics, health and wellness, social and community connection, career advising, or help in an emergency. View resources Fostering a Community of Learning Through intellectual vitality, the Harvard College community seeks to establish a culture in which all members speak, listen, and ask questions of each other – and ourselves – with curiosity and respect. This is critical to achieve the mission of Harvard College and what we as a community believe in. Intellectual Vitality at Harvard College Upcoming Dates and Events View the Harvard College Calendar Meet the Staff Candice Belluscio Student Support Coordinator I want students to be able to utilize me as a safe space to be able to meet with me in times of need and when they need support. If students need support... Read more about Candice Belluscio 6 Prescott Street Cambridge, MA 02138 cbelluscio@fas.harvard.edu Habiba Braimah Senior Director, Harvard Foundation for Intercultural and Race Relations In my role as the Senior Director of the Harvard Foundation for Intercultural and Race Relations, my responsibilities will include developing, executing,... Read more about Habiba Braimah Reisha Williams PROGRAM OFFICER FOR TITLE IX AND SEXUAL MISCONDUCT As the Program Officer for Title IX and Sexual Misconduct, students can contact me for support and questions related to sexual misconduct and Title IX... Read more about Reisha Williams collegetitleix@fas.harvard.edu Find a staff member BLACK LIVES MATTER Anti-Racism: Learning, Healing, and Taking Action We offer the following resources for all DSO staff or Harvard College community members who want to educate themselves about this complex and painful reality and how you can take action. These resources are sourced from Harvard College students, student organizations, DSO staff, and offices within the DSO. View anti-racism resources Take Action: Fighting Anti-Blackness The Harvard College Women's Center has a list of resources dedicated to fighting anti-Black racism. There is also a Google form for you to submit additional resources that the Women's Center will then post to their website for all community members to access. View the resource bank GA4 tracking code About Our Teams Stay Connected Policies Professional Positions Contact Us Assessment Incoming Students Timeline Transitioning to Harvard Gap Year Students Transfer Students Living at Harvard Isolation Policies On-Campus Housing Living Off-Campus Dates and Deadlines Extended Stay and Summer Housing Rising Sophomore Lottery Recess Housing Gender Inclusive Housing Transferring Houses Leaving and Returning Move In/Move Out Proctors and Tutors Get Involved Student Activities Student Organizations Hosting Events Harvard Traditions Talk with Us Work with Us Inclusion & Belonging BGLTQ Student Life Harvard Foundation Harvard College Women's Center dso@fas.harvard.edu 617-496-7700 google font css styles fdf6669e1e08e793115def92d8ee698e Search in Menu Script Admin Login Copyright © 2024 The President and Fellows of Harvard College | Privacy | Accessibility | Digital Accessibility | Report Copyright Infringement"
}