{
  "id": 8,
  "date": "2024-05-18T18:23:56.396223",
  "url": "https://college.harvard.edu/financial-aid",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public Video description: Widener interior, student reads book in library Financial Aid Breadcrumb Home - Financial Aid On This Page: Overview How Financial Aid Works Net Price Calculator Apply for Financial Aid Additional Funding & Procedures History of Financial Aid Federal Disclosures Contacting the Griffin Financial Aid Office Overview The Griffin Financial Aid Office provides need-based aid that allows us to bring the best students to Harvard, regardless of their ability to pay. Thanks in large part to Ken Griffin ’s transformative generosity, along with that of many other donors who support our groundbreaking financial aid program, twenty-four percent of students pay nothing to attend, and more than half receive need-based scholarships. So, yes—you can afford Harvard. Frequently Asked Questions How will the delayed FAFSA processing impact admissions or financial aid decisions? Do not worry! Delayed FAFSA submissions will not impact the timing of admissions or financial aid decisions at Harvard. If you are admitted and if you have submitted the CSS Profile and all necessary tax returns to IDOC by our financial aid application deadline, your financial aid decision will be available at the time of admission. As always, if you complete those parts of your financial aid application after the deadline, there is no penalty or reduction in the amount of aid you can receive, but you may experience a delay in receiving your aid decision. Is there financial aid available for foreign students? Yes, financial aid is available for foreign students on exactly the same basis as for American students. Although foreign students are not eligible for any federal funding, the College has its own job and scholarship money available to foreign students. What happens if I miss the financial aid deadline? Prospective students who complete the financial aid application by the financial aid deadline will receive their financial aid decisions at the time that admissions decisions are released. If you complete your application after the deadline, there is no penalty or reduction in the amount of aid you can receive, you just may experience a delay in receiving your financial aid decision. How can I see what is missing/received and when? We are not able to track financial aid application materials for prospective students until they have been admitted. If a student is admitted and indicated they wished to apply for aid, we will let them know at that point what has been received or is missing. For current students, you can see what is missing and/or received by logging into my.harvard. We will not begin tracking documents for the next academic year until mid-February before that year starts, at which time we will post which documents are received/missing on your my.harvard.edu portal. Until that point, the documents showing on your my.harvard portal will be those from this current school year. How do I apply for aid? You can find our financial aid application instructions (which apply to all students, regardless of country of residence or citizenship status) here . How Financial Aid Works How Financial Aid Works We make a promise to every admitted student: your financial circumstances will not keep you from Harvard. With our generous financial aid program, a commitment to economic diversity, and a breadth of tools and resources, our office helps make sure nothing stands in the way of your Harvard education. Quick Links How Aid Works Apply for Financial Aid Additional Funding & Procedures Cost of Attendance FAFSA Guide History of Financial Aid By The Numbers Statistics 24 24 % of Harvard families pay nothing 55 55 % receive Harvard scholarship aid $ 13 13 K average parent contribution 100 100 % of students can graduate debt-free Net Price Calculator How affordable will Harvard be for your family? See for yourself. Try Our Net Price Calculator Applying for Financial Aid - Prospective and Current Students Apply for Financial Aid From generous need-based aid to supplemental funding, you have access to a wide range of options to help you take advantage of everything Harvard has to offer. Quick Links Prospective Students: Apply for Aid Current Students: Reapply for Aid Additional Funding & Procedures Harvard Financial Aid Initiative How to Complete the FAFSA Traveling on Harvard Funding: My Spring Break Trip to Cairo, Egypt! Author: Farah Class of '22\n Alumni Watch \"Financial Aid Student Stories\" This preview video does not contain audio. Video description: Four students talk about their experiences receiving financial aid from Harvard Watch \"Students Share Financial Aid Stories\" ℹ︎ Video End of embedded content Additional Funding & Procedures Additional Funding & Procedures Our dedicated and caring team of financial aid officers works with your family to make sure your education is affordable. Quick Links Additional Funding & Procedures Request a Reconsideration Computer Loans Emergency Expenses Managing Your Outside Awards Supplemental funding for research, service, and more Did You Know? In addition to aid for tuition, Harvard offers millions of dollars in student funding for public service, research and learning, international travel, and career opportunities. View our guide to finding funding History of Financial Aid From the first bequest to aid students in 1643 to Ken Griffin's landmark gift of $125 million in 2014 - and beyond, we've maintained a strong commitment to affordability and access. Read more about our history of financial aid Federal Disclosures As required by the Department of Education, we are providing information on the federal Consumer Information disclosures . These disclosures entail: basic financial aid information, descriptions of Harvard’s academic programs, procedures, and costs, as well as Harvard’s policies and required reporting. In this notice we provide a brief description of the various disclosures and how to obtain the full disclosures. Read all federal disclosures Learn More About Harvard Join our email list to download our brochure and stay in touch. Sign Up Contacting the Griffin Financial Aid Office At this time, the Griffin Financial Aid Office will be conducting business in a hybrid remote and on-campus model. We are dedicated to answering your questions and will be available by email to assist. If you are a current student, please email faoinfo@fas.harvard.edu . For prospective students, please email faoweb@fas.harvard.edu . If you need to contact the Student Employment Office, please email seoweb@fas.harvard.edu . Contact Us Related Topics Apply For Financial Aid We strive to make our financial aid application as streamlined as possible. How to complete the FAFSA Tips on how to complete the FAFSA, the Free Application for Federal Student Aid. How Aid Works Harvard offers generous need-based financial aid for all students, regardless of nationality or citizenship. Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification. Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Skip to site header Skip to main content"
}