{
  "id": 8,
  "date": "2024-05-18T18:06:30.422610",
  "url": "https://dmca.harvard.edu/",
  "university_name": "Harvard University",
  "title": "",
  "content": "Skip to main content Main Menu Utility Menu Search HARVARD.EDU FAQs Contact Digital Millennium Copyright Act Overview University Advisory Contact Copyright Policy Enforcement Annual Disclosure Legal Alternatives Related Policies DMCA Compliance Policy for Staff Search University Advisory on Compliance with Copyright Law and DMCA Harvard is committed to maintaining the integrity and availability of its network for the vital educational and research purposes for which it was designed. Learn more Overview The Digital Millennium Copyright Act (\"DMCA\") of 1998 endeavors to balance the interests of internet service providers and copyright owners when copyright infringement occurs in the digital environment. The DMCA protects internet service providers from liability for copyright infringement by their users, if the internet service provider meets certain statutory requirements. Read more Copyright Policy All Harvard users must respect the copyrights in works that are accessible through computers connected to the Harvard network. View the policy Annual Copyright Disclosure: Key Takeaways Do not use peer-to-peer file-sharing programs to share copyrighted works without permission. If you share copyrighted material without permission, you may subject yourself to significant costs and possible criminal penalties. If you are associated with repeat infringements, Harvard University may terminate your network access and refer you for disciplinary action Read the full disclosure More about the DMCA and legal sources of online content Complete Text of DMCA HR 2281 What is a DMCA \"safe harbor\"? Legal Media Alternatives FAQs Is it legal to download copyrighted materials on my computer? What is “fair use”, and how does it apply to copyright law? Is it legal to store copyrighted materials on my computer? I have been notified that my computer is sharing copyrighted materials, but I am not aware that I had them on my system or that I was sharing them with others. How can this be? See all FAQs Copyright and Fair Use: A Guide for the Harvard Community Learn more Digital Millennium Copyright Act Questions or concerns? Please contact: dmca@harvard.edu Overview University Advisory Contact Copyright Policy Policy Enforcement Annual Copyright Disclosure Legal Alternatives Related Policies DMCA Compliance Policy for Staff Frequently Asked Questions 7903ca7a0ccd9f7395062ed32397b6f3 df8d55c536f5a623666bae38c95b1ebc Admin Login Copyright © 2024 The President and Fellows of Harvard College | Privacy | Accessibility | Digital Accessibility | Report Copyright Infringement"
}