{
  "id": 8,
  "date": "2024-05-18T18:24:05.792160",
  "url": "https://apply.college.harvard.edu/portal/online-info-sessions",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "This website uses scripting to enhance your browsing experience. Enable JavaScript in your browser and then reload this website. This website uses resources that are being blocked by your network. Contact your network administrator for more information. Skip to main content Harvard College Primary Navigation About Admissions Financial Aid Academics Life at Harvard Online Information Sessions In these hour-long sessions, an admission officer and an undergraduate student will present information and answer questions about academics, student life, admissions and financial aid at Harvard College. Registration Instructions To sign up, please select an available date from the calendar below. Click on the event labeled \"Information Session\" at the time that works for you, and then complete the registration form on a new page. In your confirmation email, you'll receive a link to join the event. Remember to log in a few minutes in advance of the start time. All times listed below are in Eastern Time. We welcome participants with disabilities and are happy to make our online information sessions accessible for you. If you require a disability-related accommodation, please contact us at college@fas.harvard.edu or call 617-495-1551. Registration information will be used for planning purposes only. It will have no bearing on the admissions process should you decide to apply to Harvard College. Online Information Sessions Calendar and Registration Legend: Available Unavailable / Filled Not Scheduled Site Footer Social Links Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you."
}