{
  "id": 8,
  "date": "2024-05-18T18:06:39.226349",
  "url": "https://internationaldataprivacy.harvard.edu",
  "university_name": "Harvard University",
  "title": "",
  "content": "Skip to content HARVARD.EDU Menu Toggle extended navigation Additional Privacy Disclosures under Non-US Law for Individuals Located Outside the United States Last Updated: September 15, 2023 Introduction These privacy disclosures (these “Disclosures”) provide information on collection and use of data about individuals located in a Relevant Country (as defined below). In these Disclosures, “ Personal Data ” means information relating to an identified or identifiable individual; an identifiable individual is one who can be identified, directly or indirectly, by use of any identifier or characteristic specific to that individual. “ Relevant Law ” means any non-U.S. jurisdiction’s personal data protection law that applies to the processing of Personal Data by a Harvard Entity. “ Relevant Country ” means a country which has enacted a Relevant Law. “ In-scope Processing ” means the collection, use, handling, processing or sharing of Personal Data by a Harvard Entity when those activities are within the scope of any Relevant Law. “ Harvard Entity ” means a Harvard University school, center, or other Harvard unit or Harvard-controlled entity. These Disclosures apply only to In-scope Processing.  Please note that, depending on the situation, some of the Harvard activities described below may in the given case not constitute In-scope Processing as that term is used in these Disclosures. Further, these Disclosures apply only to the Harvard Entities that link to these Disclosures or expressly adopt them in writing. In these Disclosures the words “we,” “us” or “our” refer to any such Harvard Entities.  In some cases, a Harvard Entity or other Harvard unit may provide other information about its In-scope Processing in its own supplemental or separate disclosures. These Disclosures concern In-scope Processing by any means, including hardcopy (such as paper applications or forms) and electronic means (such as websites and mobile applications). A. How We Collect and Use Personal Data We use the Personal Data that we collect to carry on various institutional and educational activities as described in more detail below. The ways in which we collect and use your data vary depending on the relationship between you and us.  The following sections of these Disclosures describe in more detail how and why we collect and use Personal Data in various circumstances that may involve In-scope Processing. 1. Personal Data We Collect Websites and Mobile Applications As is true of most digital platforms, we obtain certain data automatically when you use one of our websites or mobile applications, such as your IP address, browser type and device type.  Certain web-forms also collect Personal Data you provide, for example when you enter data into form fields.  If we also process data through our websites or mobile applications for one of the activities described further below, those descriptions will provide additional information about how those data are collected and used.  We and our third-party vendors use this Personal Data for the primary purposes of conducting analytics, improving our websites, responding to your requests and providing you with relevant information including program offerings that we believe may be of interest. Read More What Personal Data Do We Collect? We and our third-party vendors collect Personal Data through websites and mobile applications, often as a result of users volunteering their data. We and our third-party vendors may collect: Contact Information : for example, your name, home address, email address, phone number and social media usernames; Log Files : Information collected automatically when you are interacting with websites or mobile applications, for example, IP address, browser type, internet service provider, pages visited (including referring/exit pages), operating system, date/time stamp and/or clickstream data; Cookies and Similar Technologies : Information collected automatically through cookies and similar technologies. For more information regarding our use of cookies and similar technologies, see the “Cookies and Similar Technologies” section below; Location Information : We may use your IP address to identify the general geographic area from which you are accessing our website. Our mobile applications may collect more precise location information about you to provide functions identified in the application, such as a map feature; and Mobile Device Sensor Information : Some of our mobile applications may use various sensors and components of your mobile device (for example, your camera or microphone) to collect information for the purposes of providing you with additional functions and features. What is the Purpose of Processing? We process your Personal Data collected on our websites and mobile applications: To facilitate our online interactions with you, for example, by responding to your requests; To operate, maintain and improve our websites and mobile applications, for example, by conducting analytics to improve and manage our websites and mobile applications, analyze user trends, and create custom audience lists; To collect data about you and your activities online over time and across different websites and social media channels for marketing purposes, including delivering relevant marketing communications to you; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to facilitate transactions requested by you and meet our contractual obligations (for example, registering you for events); to pursue our legitimate interests (for example, website analytics); as necessary for compliance with a legal obligation; or on the basis of your consent, where applicable. Admissions and Financial Aid We collect and use various kinds of Personal Data when you apply for admission to a Harvard School or to a program or course offered by us, and when you apply for financial aid, if available. The primary source of these data is your voluntary submissions. We may solicit additional data, for example, from interviewers as part of the admissions process, if applicable, or from other available sources when we are looking for potential candidates for admission in connection with recruiting activities. The Personal Data collected by us, or on our behalf, during the admissions process are used for the primary purposes of considering your candidacy for admission to the relevant School, program or course, evaluating your eligibility for financial aid, if applicable, and, if you are admitted and enroll, facilitating your education (such as by sharing Personal Data with registrars and others in order to enable your enrollment and participation in the School, program or course to which you have been admitted). Read More What Personal Data Do We Collect? We collect Personal Data as part of our admissions process and financial aid process. We also collect Personal Data in connection with registration for open enrollment programs.  We and our third-party vendors (including, but not limited to, application and admissions/financial aid data base vendors such as the Common Application, the College Board, Technolutions, the Law School Admissions Council and the American Medical College Application Service) may collect: Contact Information : for example, your name, home address, email address and phone number; Demographic Information : for example, gender, age, and other information you may volunteer, such as in your application or essay; Education History : for example, your prior schools, transcripts, school activities and disciplinary records; Testing History : for example, standardized testing and corresponding identity verification documentation; Personal Information and History : for example, personal interests, extracurricular activities, recommendations, other personal information you may choose to volunteer, including in your application or your essay, and other information we may learn about your background; Health and Dietary Information : for example, immunization records, plus medical information or dietary preferences volunteered by you that may indicate a need for accommodations; Employment History : for example, job title, location and work experience; Personal Financial Information : for example, government identification number, personal and business tax reports, wage reports and statements, bank statements, socioeconomic status, scholarships and grants, and family support; Family Information : including family member names, ages, education information, occupations, wages and savings; Payment Information : depending on your means of payment, your payment card number or your bank and bank account number; and Log Files, Cookies, Location Information, and Mobile Device Sensor Information : When you use our websites or mobile applications, we also may collect additional information about you and your device as described in the “Websites and Mobile Applications” section above. What is the Purpose of Processing? We process your Personal Data as part of our admissions and financial aid processes: To consider your candidacy for admission and eligibility for financial aid; To respond to your requests and communicate admissions and financial aid decisions; To facilitate our operations relating to the admissions and financial aid process; To conduct research and analytics (for example, relating to application and admissions trends); To provide you with services related to the course or program, including assistance with travel, residential lodging and dietary or medical needs. To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to pursue our legitimate interests (for example, providing educational offerings and conducting admissions research); to process transactions requested by you and meet our contractual obligations (for example, to process your application for admission); as necessary for compliance with a legal obligation (for example, financial aid reporting); or on the basis of your consent, where applicable. How is My Personal Data Used if I Am Admitted? If you are admitted to a School or program or course offered by us, your Personal Data will be shared as necessary for registration and enrollment, including, as applicable, with the registrar of the school admitting you.  Your Personal Data may also be shared as necessary to deliver and administer your education and related activities with other persons or entities, including Harvard departments, faculty and staff, financial aid sources, and governmental authorities.  For example, your name and other contact information may be shared with a professor in whose course you enroll, in order to administer financial aid, with Harvard University Health Services to enable you to obtain treatment, or for other reasons consistent with our efforts to provide educational services to you. Alumni and Donors We collect and use various kinds of Personal Data about alumni, donors and prospective donors from a number of sources, including data you provide to us, for example, when you update your alumni or donor profile, connect with us on social media, complete a donation form or register to attend Harvard events.  If you were a student or studied at Harvard University, some of your Personal Data are transferred from your student record into our alumni databases.  We may also collect Personal Data from publicly available sources or third-party sources that support our operations.  The Personal Data collected by us, or on our behalf, are used for the primary purpose of providing you opportunities to engage with Harvard, alumni, donors, prospective donors and students through interactions, events and your gifts or donations.  We may disclose your data to other Harvard affiliated entities and individuals such as alumni clubs and shared interest groups or volunteers in connection with the purposes described below. Read More What Personal Data Do We Collect? We and our third-party vendors may collect: Contact Information : for example, your name, home address, email address, phone number and social media usernames; Demographic Information : for example, gender, age, and other information you may volunteer; Personal Information and History : for example, personal interests, charitable activities, other personal information you may choose to volunteer and other information we may learn about your background; Education History : for example, prior and subsequent schools, awards, honors and student activities; Employment Information : for example, your title, employer, location and work experience; Harvard Affiliations : for example, your social network, group memberships and Harvard-related correspondence; Financial Information : for example, your contribution history, publicly available data on wealth and assets, and contributions to other organizations; Payment Information : for example, when you register for an event, make a donation or request a service, depending on your means of payment, your payment card number or your bank and bank account number, and government identification number where legally required; Contribution History : your contribution history to Harvard; Health and Dietary Information : for example, medical information or dietary preferences volunteered by you that may indicate a need for accommodations; Your Image : for example, when a photograph or other image is used in online networking or announcements, or when you participate in Harvard events that are recorded by photography or video; Family Information : for example, family member names, ages, occupations and relevant medical information (if volunteered in advance of events); and Log Files, Cookies, Location Information, and Mobile Device Sensor Information : When you use our websites or mobile applications, we also may collect additional information about you and your device as described in the “Websites and Mobile Applications” section above. What is the Purpose of Processing? We process your Personal Data as part of our alumni and donor outreach and services: To provide you and your family opportunities to engage with Harvard, alumni and students; To facilitate alumni and donor communications, events, fundraising (including identifying prospects) and operations; To request and process your contributions and subscriptions; To communicate with you about other opportunities for giving, and to understand better your interests and how you might help support Harvard through volunteerism and philanthropy; To improve our alumni and donor services, analyze engagement and contribution trends, and create custom experiences; To provide you with services, including assistance with travel, residential lodging and dietary or medical needs; To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to pursue our legitimate interests (for example, requesting gifts or donations); to process transactions requested by you and meet our contractual obligations (for example, registration for events or processing of donations); as necessary for compliance with a legal obligation (for example, to provide required tax information); or on the basis of your consent, where applicable. Online Education We collect your Personal Data when you apply or register for online education offerings. We and they also collect Personal Data when you participate in online courses, programs and activities.  In some cases, our collection of Personal Data from you in connection with online education activities takes place as part of a “hybrid” program in which you also may participate in person, or as part of remote learning occurring in a course or program that is ordinarily conducted in person. The Personal Data collected by us, or on our behalf, are used for the primary purposes of providing you with online education, and, if applicable, evaluating your qualification for related certificates or credit. Read More What Personal Data Do We Collect? We and our third-party vendors may collect: Contact Information : for example, your name, home address, email address and phone number; Payment Information : depending on your means of payment, your payment card number or your bank and bank account number, and government identification number where legally required; Demographic Information : for example, gender, age and date of birth; Personal Information and History : for example, personal interests, other information about yourself that you volunteer in profiles or otherwise on the online learning platform, and other information we may learn about your background; Education Information : for example, schools, transcripts, awards and honors; Employment Information : for example, your title and employer, history and work experience; Health and Dietary Information : for example, medical information or dietary preferences volunteered by you that may indicate a need for accommodations; Learner Interaction and Participation Data : for example, exchanges with other learners, forum contributions, community posts, and your participation in class sessions or other online events that are transmitted or recorded in audio and/or visual form; Course Engagement and Assessment Data : for example, assignment responses, test scores and course interactions (such as the ways in which you move through and interact with the course materials); Log Files : for example, IP address, browser type, internet service provider, pages visited (including referring/exit pages), operating system, date/time stamp and/or clickstream data; Cookies and Similar Technologies : information collected automatically through cookies and similar technologies when you are interacting with our online education offerings. For more information regarding our use of cookies and similar technologies, see the “Cookies and Similar Technologies” section; Location Information : for example, latitude, longitude, date and time (the precision of these data varies greatly and is determined by factors controlled by your device or mobile service provider); Mobile Device Sensor Information : some of our mobile applications may use various sensors and components of your mobile device (for example, your camera or microphone) to collect information for the purposes of providing you with additional functions and features; and Your Image : for example, where you voluntarily provide a photograph or other image for use in an online course or program (for example, in a profile), or where you have decided to use a remote proctoring third-party service software (such as Proctorio) for the purposes of remotely completing an examination or assessment for a Harvard Entity offering remote proctoring services, or where you appear in a video transmission or recording. What is the Purpose of Processing? We process your Personal Data for online education: To provide and administer the course, program or activity in which you are participating, including evaluating your success in and engagement with the online education offering; To respond to your requests and communicate with you regarding current or future courses, programs or activities; To provide you with services related to the course, program or activity, including assistance with travel, residential lodging and dietary or medical needs; To conduct research (for example, in the areas of education and cognitive science) and analytics related to our online education offerings; To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to pursue our legitimate interests (for example, providing educational offerings and evaluating your performance); to process transactions requested by you and meet our contractual obligations (for example, registering you for an online education course); as necessary for compliance with a legal obligation; or on the basis of your consent, where applicable. In-Person or Hybrid Educational Programs Conducted in Relevant Countries We conduct certain educational programs in Relevant Countries, including executive education offerings and summer school programs, among others, and collect Personal Data as part of our administration of these offerings. The Personal Data collected by us, or on our behalf, are used for the primary purposes of providing educational offerings and, if applicable, evaluating qualification for certificates and credit. Read More What Personal Data Do We Collect? We and our third-party vendors may collect : Contact Information : for example, your name, home address, email address and phone number; Payment Information : depending on your means of payment, your payment card number or your bank and bank account number, and government identification number where legally required; Demographic Information : for example, gender, age and date of birth; Personal Information and History : for example, personal interests, profession and other information about your background; Education Information : for example, your schools, transcripts, school activities and disciplinary records, awards and honors; Employment Information : for example, your title and employer, employment history and work experience; Health and Dietary Information : for example, medical information or dietary preferences volunteered by you that may indicate a need for accommodations; Course Assessment Data : for example, assignment responses, test scores and course evaluations; Learner Participation Data : for example, your participation in class sessions or other online events that are transmitted or recorded in audio and/or visual form; Residential Information : for example, local host information and personal preferences that you volunteer; Your Image : for example, for inclusion in a class roster to be distributed to classmates and faculty, where applicable; and Log Files, Cookies, Location Information, and Mobile Device Sensor Information : When you use our websites or mobile applications, we also may collect additional information about you and your device as described in the “Websites and Mobile Applications” section above. What is the Purpose of Processing? We process Personal Data relating to in-person or hybrid educational programs in Relevant Countries: To provide and administer the course or program in which you are participating, including sharing information about you with other participants, providing academic guidance and evaluating your success in the course or eligibility for a degree or certificate; To provide you with services related to the course or program, including assistance with travel, residential lodging and dietary or medical needs. To respond to your requests and communicate with you regarding current or future courses or programs; To conduct analytics to improve our educational offerings; To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance: to pursue our legitimate interests (for example, conducting analytics to improve program offerings); to process transactions requested by you and meet our contractual obligations (for example, providing educational programs); as necessary for compliance with a legal obligation; or on the basis of your consent, where applicable. Research Our researchers, research collaborators and service providers may collect, use and share your Personal Data as part of a research study in which you have agreed to participate as a research subject, or in which your existing data are used.  Most often, before any Personal Data are collected for research purposes, as a research subject you will be provided a consent and/or authorization form relating to the specific research project that explains the types of data collected and the purposes for which such data will be processed and shared.  In such a case, the description of the collection and use of your Personal Data provided in the consent and/or authorization form will replace the information provided here.  The Personal Data collected by our researchers, research collaborators and service providers, or on their behalf, are used for the primary purposes of furthering the particular research project and more generally for supporting research and understanding in fields of academic study. Examples of Personal Data that may be collected for research purposes are listed below.  Of course, a single research study will rarely collect all of these types of data.  If you have questions about the processing of your data in connection with a research study, you should contact the Harvard personnel who are conducting the research or the contact persons named in any consent form you signed when you joined the study. Read More What Personal Data Do We Collect? Examples of Personal Data that we and our third-party collaborators or service providers may collect for research purposes include the following.  Please note that in most cases these data, if identifiable, would initially be provided voluntarily by you: Contact Information : for example, your name, home address, email address and phone number; Payment Information : your bank and bank account number, and government identification number where legally required, for processing compensation if you are being paid in connection with the research; Demographic Information : for example, race, ethnicity, gender, age, education, profession, occupation, income level and marital status, photo or other image; Personal Information and History : for example, personal interests, profession, and other information about your background; Family Information : for example, family members, ages, occupations and health; Employment History : for example, employers, titles, wages, work experience, trade union membership and disciplinary record; Education History : for example, schools, transcripts, awards, honors and disciplinary records; Health and Dietary Information : for example, doctor’s records, surgical records, immunizations and medications, allergies and dietary preferences; Biometric Data : for example, facial measurements, finger prints and retinal scans; Genetic Data : for example, genetic information obtained from your biological samples; Course Engagement and Assessment Data : for example, assignment responses, test scores and course interactions (including, for example, the ways in which you move through and interact with the course materials); Log Files : for example, IP address, browser type, internet service provider, pages visited (including referring/exit pages), operating system, date/time stamp and/or clickstream data; Cookies and Similar Technologies : Information collected automatically through cookies and similar technologies. For more information regarding our use of cookies and similar technologies, see the “Cookies and Similar Technologies” section; and Location Information : for example, latitude, longitude, date and time (the precision of these data varies greatly and is determined by factors controlled by your device or mobile service provider); and Mobile Device Sensor Information : for example, health-related information that may be available through an application using a sensor or component of your mobile device. If you are a researcher, research collaborator or service provider, we may collect your contact, payment, employment and education information to administer the study, manage our relationship and compensate you for your work. What is the Purpose of Processing? We may process your Personal Data for research in accordance with the purposes of the particular research projects, and also: To further research and understanding in fields of academic study; To enroll you in a particular research study as a research subject; To administer the study; To make reports to project funders and other project participants; To satisfy legal compliance requirements; or To make required reports to tax authorities on payments to research subjects, researchers and service providers. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance:  to pursue our legitimate interests (for example, conducting research); to process transactions requested by you and meet our contractual obligations (e.g., paying faculty, employees, research collaborators and research subjects); as necessary for compliance with a legal obligation (for example, to report adverse events to regulatory authorities like the U.S. Food & Drug Administration that oversee the safety of medical products and research); as necessary for the performance of tasks we carry out in the public interest (for example, to further research and understanding in fields of academic study); where processing is necessary for scientific or historical research purposes and performed consistent with required data protection safeguards; or on the basis of your consent, where applicable. Employees, Job Applicants and Service Providers We collect your Personal Data when you apply to work for us in a Relevant Country.  Further Personal Data collection occurs at hiring and throughout your relationship with us. We may also collect Personal Data about personnel of vendors providing services to us in a Relevant Country. The Personal Data collected by us, or on our behalf, are used for the primary purposes of providing employment, engaging with service providers, legal compliance, and enabling employees and service providers to utilize our services and facilities. Read More What Personal Data Do We Collect? We and our third-party vendors may collect: Contact Information : for example, your name, home address, email address and phone number; Payment Information : your bank and bank account number for processing your compensation; Tax Information : for example, government identification number, wages and filing status; Personal Information and History : for example, marital status and other information about your background, and when relevant for your position or required by law, credit history, driving record, self-reported and publicly available criminal records, citizenship and work authorization status; Employment and Work History : for example, prior employers, titles, wages, work experience and disciplinary record; Education Information : for example, schools, transcripts, awards, honors and disciplinary records; Family Information : for inclusion in benefits plans; Demographic Information : for example, gender, age and date of birth; Health Information : for example, medical information volunteered by you that may indicate a need for accommodations; Your Image : for example, when a photograph or other image is used for Harvard identification cards or in announcements; and Log Files, Cookies, Location Information, and Mobile Device Sensor Information : When you use our websites or mobile applications, we also may collect additional information about you and your device as described in the “Websites and Mobile Applications” section above. What is the Purpose of Processing? We process your Personal Data for employment or other work relationship and job application purposes: To evaluate your application for employment or other work relationship and communicate hiring decisions; To engage with service providers; To administer and facilitate workforce-related processes and operations, including compensation processing and the provision of employee benefits; To provide you with support services, including assistance with travel and dietary or medical needs; To satisfy legal, regulatory and contractual obligations; or To engage in other activities described under “Additional Uses of Personal Data” below. What is Our Legal Basis of Processing? We process your Personal Data for the purposes described above consistent with the legal bases recognized by the Relevant Law in each Relevant Country, which may include, for instance:  to pursue our legitimate interests (for example, managing internal administrative tasks); to process transactions requested by you and meet our contractual obligations (for example, managing employment or other work relationships); as necessary for compliance with a legal obligation (for example, to provide required information to tax authorities); or on the basis of your consent, where applicable. 2. Personal Data We Obtain from Third Party Sources As part of our In-scope Processing, we may obtain certain Personal Data about you from third party sources, which we may use for the purposes and in the ways described in “How We Collect and Use Personal Data” above and in “Additional Uses of Personal Data” below.  In some cases, we may obtain your consent for additional uses. Partners and Service Providers We use partners and service providers, such as admissions application facilitators (for example, the Common Application and the College Board), payment processors (for example, CyberSource and UPay TouchNet), analytics providers (for example, Google and Qualtrics), and platform providers (for example, Salesforce and Instructure/Canvas) to provide services for us.  Some of these partners have access to Personal Data about you that we may not otherwise have (for example, when you sign up directly with that provider) and may share some or all these data with us. Single Sign-On Some of our online offerings or research activities may allow you to register and login through a third-party platform.  When you login to our offering or activity through a third-party platform, you allow us to access and collect any Personal Data from your third-party platform account permitted under the settings and privacy statement of that platform. Supplemental Personal Data We may receive Personal Data from third-party sources, such as public or private databases (for example, compilations of email or postal addresses) and publications (for example, news reports), or companies or institutions that may sponsor or facilitate your participation in one of our programs, which we may also add to existing Personal Data. 3. Additional Uses of Personal Data In addition to the uses described above, including under “How We Collect and Use Information” and “Personal Data We Obtain from Third Party Sources,” we may use your Personal Data for the following purposes.  These additional uses may under certain circumstances be based on your consent, or may be necessary to fulfill our contractual commitments to you, for legal compliance, or to pursue our legitimate interest in the following activities: Conducting our operations and administering and developing our educational offerings; Administering fellowships, grants and other programs in support of individual study and research projects; Responding to your requests for research assistance; Processing and responding to your requests or inquiries of any other kind; Providing you with newsletters, articles, service alerts or announcements, event invitations, volunteer opportunities, and other information that we believe may be of interest to you; Requesting gifts and donations; At your request, processing and fulfilling transactions for merchandise or other Harvard products; Providing travel-related services to you at your request; Alerting you about a safety or security announcement; Conducting research, surveys and similar inquiries to help us understand trends and needs of our applicants, students and others; Meeting the requirements of our accreditors; Disclosing directory information as described here ; Performing marketing, promotions and advertising, either directly or through third-parties.  These activities may include interest-based advertising, targeted advertising and online behavioral advertising in order to increase the likelihood that the content will be of interest to you; Ensuring the rights, safety and security of our students, faculty, fellows, employees and others; Preventing, investigating, taking action regarding or providing notice of fraud, unlawful or criminal activity, other misconduct, security or technical issues, or unauthorized access to or use of Personal Data, our website or data systems; or Responding to subpoenas, court orders, or other legal process; fulfilling and enforcing our agreements and legal rights; protecting the health, safety, rights or property of you, us or others; and meeting legal obligations. 4. Data Retention We will retain your Personal Data for as long as is necessary for the purposes set out in these Disclosures, in accordance with Relevant Law and the legal bases for acquiring the data. For example, we may generally retain Personal Data as follows: For as long as may be required under applicable law; As needed to resolve disputes or protect our legal rights; Where processing is based on your consent, for the period of time necessary to carry out the processing activities to which you consented; Where processing is based on contract, for the duration of the contract plus some additional limited period of time that is necessary to comply with law or that represents the statute of limitations for legal claims that could arise from the contractual relationship; Where processing is based on the public interest, for the period of time that continues to serve that underlying interest. Where processing is based on our legitimate interests, for a reasonable period of time based on the particular interest, taking into account the fundamental interests and the rights and freedoms of the data subjects.  In some cases, where Personal Data was primarily processed and retained on the basis of consent, contract, the public interest, or other bases described in these Disclosures, we may continue thereafter to retain the data based on a legitimate interest. Consistent with the foregoing guidance, some data may be retained indefinitely. B. How We Share and Disclose Personal Data We share your Personal Data with third parties in the ways described in these Disclosures, including the “How We Collect and Use Personal Data” section above, as well as between Harvard Entities.  Additionally, we may share information as described below: Service Providers We share your Personal Data with third-party service providers that complete transactions or perform services on our behalf or for your benefit, such as: Payment and contribution processing; Customer relationship management services; Marketing and analytics; Processing admissions applications and applications for financial aid; Alumni and donor outreach and engagement; Event registration and coordination; Providing course platforms or tools that enable or enhance our offerings; Course registration and administration; Course evaluations and assessments; Enrollment verification; Research insights and analytics; Research collaboration; Educational operations and collaborations; Performing workforce administration and operations; System maintenance and security; Facilitating other transactions with you; and Assisting with our legal compliance. Partners We may share your Personal Data with other institutions for the purposes of delivering programs and services, such as: Cross-registration for courses and events with other universities; Course registration and administration; Course evaluations and assessments; Study at other universities including study abroad at foreign universities; Online education offerings through online platforms; Research arrangements with other universities or partners; and Events and activities of Harvard-affiliated clubs and shared interest groups. Third-Party Mobile App Providers If you use certain of our mobile applications, your mobile device may gather and transfer your Personal Data, including location information, to other applications, functions and tools within your mobile device. Social Media Platforms We may also use services provided by third parties (such as social media platforms) to serve targeted ads or sponsored content on third-party platforms. Legal Process, Safety and Terms Enforcement We may disclose your Personal Data to legal or government regulatory authorities as required by law.  We may also disclose your Personal Data to third parties in connection with claims, disputes or litigation, when otherwise required by law, or if we determine that disclosure is necessary to protect the health, safety, rights or property of you, us or others, or to enforce our legal rights or contractual commitments that you have made. C. International Data Transfers Much of our Personal Data processing takes place in the United States, though sometimes we or third parties with whom we share data may process data in other countries.  The data protection laws in the United States and other countries may provide less protection than such laws in your Relevant Country.  In the event we transfer your Personal Data outside your Relevant Country as part of our In-scope Processing, we rely where required on appropriate or suitable safeguards or specific legal provisions permitting such transfers under the Relevant Law. When transferring Personal Data from a country in the European Economic Area (EEA) or from the United Kingdom (UK) to a country outside the EEA and the UK, we may base such transfers on contracts containing legally authorized data protection clauses referred to as Standard Contractual Clauses.  You may request a copy of the Standard Contractual Clauses relevant to any such transfer of your Personal Data by contacting us as set forth in the “ Contact Us ” section below. D. Cookies and Similar Technologies Whenever you visit or use our websites or online services, we may deploy cookies and related technologies (“Cookies”) to collect certain personal information about you. We use the information in order to enhance and personalize the experience, to help provide our services, to analyze website and service usage, and to help improve the websites and our related services. To find out more about cookies, visit https://www.internetcookies.org/. Third parties may also use Cookies embedded in our sites to collect information about your online activities over time and across different websites you visit. This information may be used by third parties to provide advertising tailored to your interests on other websites, apps and services you visit. You can review your Internet browser settings, typically under the sections “Help” or “Internet Options,” to exercise choices you have for certain Cookies, or you can opt out of the collection and use of some Cookies through tools like the Network Advertising Initiative opt-out page. If you disable or delete certain Cookies in your settings, you may not be able to use features of our websites. We may use third party analytics such as Google Analytics or similar analytics services. For information on how Google processes and collects information using Google Analytics, please see www.google.com/policies/privacy/partners/, and for how to opt out, please see https://tools.google.com/dlpage/gaoptout. The opt-outs described above may not work for all browsers or devices. If you have any questions regarding our use of cookies and other similar technologies, please contact us as set forth in the “Contact Us” section below. E. Rights You May Have To the extent required by Relevant Law, upon your reasonable and good faith request, we will inform you whether we hold any of your Personal Data as part of our In-scope Processing.  With respect to your Personal Data collected and used in our In-scope Processing, under the Relevant Law you may also be able to: obtain a copy of your Personal Data in an easily accessible format; request that we correct or update any of your Personal Data that is inaccurate; restrict or limit the ways in which we use your Personal Data; object to the processing of your Personal Data; request the deletion of your Personal Data; and request that we transmit your Personal Data to another party. To submit a request, please complete the Non-US Data Subjects Rights Request Form .  Because we want to avoid taking action regarding your Personal Data at the direction of someone other than you, we may need to ask you for information verifying your identity.  We will respond to your request within a reasonable timeframe. If our In-scope Processing as to your Personal Data is solely based on your consent, in certain cases you may also have the right under a Relevant Law to withdraw your consent to our processing.  If you withdraw your consent to the use or sharing of your Personal Data for the purposes set out in these Disclosures, or otherwise limit our use of your Personal Data or request its deletion, we may no longer be able to provide you some or all of the related services. Please note that, in certain cases, we may continue to process your Personal Data after you have withdrawn consent or requested that we delete your Personal Data, if we have a legal basis to do so.  For example, we may need to retain certain data to comply with an independent legal obligation, for achieving the lawful purposes for which we obtained the data, or for such reasons as keeping our services and operations safe and secure or safeguarding our rights or the rights or safety of others. If you have any complaints regarding our privacy practices, you may be able to make a complaint to your national data protection authority, supervisory authority, or other legal authority. F. User Generated Content Some of our online activities, such as course websites, listservs, chat rooms and bulletin boards, enable users to submit their own content.  Please remember that any Personal Data you submit or post as user-generated content in these circumstances could in some cases be seen by others or become public.  You should exercise caution when deciding to disclose your personal, financial or other information in such submissions or posts.  We cannot prevent others from using that information in a manner that may violate these Disclosures, the law or your personal privacy and safety.  We are not responsible for the results of such postings. G. Updates to the Disclosures We may update these Disclosures from time to time without prior notice by posting revised Disclosures.  You can determine when these Disclosures were last revised by checking the Last Updated date at the beginning of these Disclosures. H. Representatives Representatives in the European Union : Name:   Harvard Global Research Support Centre Ireland DAC Online: GDPR Representative Form Address:  Harvard Global Research Support Centre Ireland DAC Attention: GDPR Representative 10 Earlsfort Terrace Dublin 2 D02 T380 Ireland Representative in the UK : Harvard Global UK Online: GDPR Representative Form Address:  Harvard Global UK Attention: GDPR Representative 71 Queen Victoria Street London, United Kingdom EC4V 4BE I. Contact Us If you have any questions, comments, requests or concerns about these Disclosures or other privacy-related matters, you may contact us in the following ways: Online: GDPR Representative Form Address:  Harvard University Attention: International Privacy Disclosures Coordinator Suite 370 1033 Massachusetts Avenue Cambridge, MA 02138 USA Harvard University Massachusetts Hall Cambridge, MA 02138 Copyright © 2024 The President and Fellows of Harvard College | Accessibility | Digital Accessibility | Report Copyright Infringement Log In close menu close search Search Search Site"
}