{
  "id": 8,
  "date": "2024-05-18T18:24:24.294489",
  "url": "https://college.harvard.edu/about/dean-harvard-college/messages-to-Parents-Families",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Harvard College Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Messages to Parents & Families Breadcrumb Home - About Supreme Court Decision June 29th, 2023 I urge you to read the joint statement that was issued this morning in response to the Supreme Court decision handed down today Welcome Home August 19th, 2021 I am looking forward to welcoming you and your student to Harvard College in the coming days. Hundreds of deeply committed faculty members, administrators, and College staff have worked hard to ensure our community is ready for our full return to campus life. FAS Fall 2021 Planning Update March 22nd, 2021 I am writing to share Dean Gay's message announcing that Harvard College expects a full return to campus for the Fall 2021 semester. Beginning the Spring Together January 26th, 2021 I hope that your new year is off to a good start, and that you are staying healthy. I am writing today to share a message which was sent to our students earlier today as we begin the spring semester together. Our Common Project January 21st, 2021 I write to share Dean Gay’s important letter to the faculty and staff from earlier today. While I was inspired by the words and performances during yesterday’s inauguration, especially those written by our own Amanda Gorman ’20, I was also painfully aware, as I’m sure you were, that it was occurring against the backdrop of the horrific events of January 6th. And it was difficult to face the fact that the lights illuminated around the Lincoln Memorial Reflecting Pool marked the enormous loss of 400,000 lives to the pandemic in this country. Looking Forward to Spring Semester January 11th, 2021 I hope you are doing well and staying healthy during these difficult times. By now, you may have seen a message from University leaders earlier today noting the continued surge in COVID-19 cases. We continue to closely monitor the circumstances to ensure that we are doing everything we can to keep our community healthy. Reflections December 18th, 2020 As we approach the end of a year unlike any we could have ever imagined, there is simply no way that I can adequately express my gratitude for each and every one of you, and the partnership we have had during this extraordinarily challenging time. Spring Term and Panel Discussion Invite December 1st, 2020 By now, you have likely seen the message from President Bacow, Dean Gay and me sent earlier today regarding plans for the Spring 2021 term. Below you will find key points from the message, as well as an invitation to a panel discussion tomorrow (Wednesday, December 2nd) at 7:00 PM EST. So Much To Be Thankful For November 25th, 2020 Each year as I gather with family on Thanksgiving, one of the things I am most grateful for is the partnership of our students’ family and friends. Without your help and support, building this extraordinary community would never be possible. Some Thoughts Before Election Day October 30th, 2020 As we head into the final weekend before the U.S. presidential election, I am writing to share a message that will be sent to our students later this afternoon. As you are of course well aware, this year has presented our entire community with an unprecedented set of challenges. Pagination Current page 1 Page 2 Page 3 Page 4 Page 5 Page 6 Next page Next page Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification."
}