{
  "id": 8,
  "date": "2024-05-18T18:24:06.258824",
  "url": "https://college.harvard.edu/academics/liberal-arts-sciences/concentrations",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Harvard College Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public Video description: up close of students in the classroom, and then it pans to a female professor reading from a book to the class,  students in the auditorium in a large class then it pans to the back of a male professor teaching in the front of the class, Concentrations Breadcrumb Home - Academics - Liberal Arts & Sciences - Concentrations Overview What are Concentrations? At Harvard College, students choose a \"concentration,\" which is what we call a major. You also have the opportunity to choose a secondary concentration as a minor or pursue a special concentration where you can design your own course of study. With more than 3,700 courses in 50 undergraduate fields of study, you'll have plenty of chances to find your passion. Search * Fields of Study Arts * Engineering * History * Languages, Literatures, and Religion * Life Sciences * Math and Computation * Physical Sciences * Qualitative Social Sciences * Quantitative Social Sciences * Degree Type B.A. * B.S. * 49 Results Based on Your Selection Bachelor of Art = B.A. Bachelor of Science = B.S. African and African American Studies B.A. Social Sciences The Department of African and African American Studies brings together scholars and scholarship from many disciplines to explore the histories, societies, and cultures of African and African-descended people. The field of African and African American Studies is not only interdisciplinary but also comparative and cross-cultural. Visit the African and African American Studies Page Anthropology B.A. Social Sciences Anthropology is the study of human diversity in the distant past and the present and teaches us to recognize the remarkable array of circumstances in which human beings live their lives and make meaning from them. Visit the Anthropology Page Applied Math B.A. Sciences, Social Sciences Applied mathematics represents a quantitative liberal arts degree. The degree provides the opportunity for combining mathematical thinking with any subject for which mathematics can be productively applied. In  some instances, combining applied mathematics with a particular subject can lead to a program of study that is quite similar to studying that subject itself. For example, applied mathematics with physics as an application area is quite similar to studying physics. On the other hand, there are other instances (combining applied mathematics with psychology or government) where the degree program would be quite different. Visit the Applied Math Page Art, Film, and Visual Studies B.A. Arts and Humanities The concentration in Art, Film, and Visual Studies enables students to develop skills in the practice and the critical study of the visual arts. It includes photography, filmmaking, animation, video art, painting, drawing, printmaking, and sculpture, film and visual studies, critical theory, and the study of the built environment. The department has a strong commitment to fostering dialogue among makers, critics, and theorists. Visit the Art, Film, and Visual Studies Page Astrophysics B.A. Sciences The science of astrophysics involves the study of matter and radiation in the universe as understood through the laws of physics. Astronomical phenomena exhibit an extreme range of physical conditions, from superfluid neutrons in neutron stars, high-temperature nuclear reactions in supernovae, and strong gravitational fields near black holes, to the unique state of the universe during its earliest phases. Theoretical attempts to describe these and more familiar phenomena (such as stars and galaxies) have achieved a useful understanding in many cases. However, our overall knowledge of the universe is still woefully incomplete, and our contemporary physical knowledge is often stretched to its limits in attempting to understand physical conditions that cannot be reproduced in terrestrial laboratories. Visit the Astrophysics Page Biomedical Engineering B.A. Engineering & Applied Sciences, Sciences Biomedical Engineering lies at the intersection of the physical and life sciences, incorporating principles from physics and chemistry to understand the operation of living systems. As in other engineering fields, the approach is highly quantitative: mathematical analysis and modeling are used to capture the function of systems from subcellular to organism scales. An education in Biomedical Engineering, and engineering more broadly, enables students to translate abstract hypothesis and scientific knowledge into working systems (e.g., prosthetic devices, imaging systems, and biopharmaceuticals). This enables one to both test the understanding of basic principles and to further this knowledge, and it places this understanding in the broader context of societal needs. Visit the Biomedical Engineering Page Chemical and Physical Biology B.A. Sciences Chemical and Physical Biology provides a link between classical approaches to studying biology and the chemical tools and physical methods required to understand dynamic changes in complex biological systems. Visit the Chemical and Physical Biology Page Chemistry B.A. Sciences Chemistry is the science of the structure, properties, and reactions of matter. It is both a basic science, fundamental to an understanding of the world we live in, and a practical science with an enormous number and variety of important applications. Knowledge of chemistry is fundamental to an understanding of biology and biochemistry and of certain aspects of geology, astronomy, physics, and engineering. Visit the Chemistry Page Chemistry and Physics B.A. Sciences There is exciting science on the somewhat arbitrary and fluid boundary between chemistry and physics. Chemists and physicists often study the same phenomena in slightly different ways, and it is very useful, in the boundary area, to have training in both fields. Recognizing this, the physics department has for many years offered the concentration in Chemistry and Physics. Visit the Chemistry and Physics Page Classics B.A. Arts and Humanities, Social Sciences The study of the Classics is an interdisciplinary enterprise involving critical engagement with the literature, art, material culture, and history of the Greco-Roman world. A concentration in the Classics equips students with all the tools necessary for understanding the forms of expression and ways of life of the cultures of antiquity, and for understanding the development of those cultures over time. Concentrators learn skills that are broadly applicable to the analysis of any complex cultural system or artifact. They also acquire fluency in a tradition of art, literature, and philosophy that has been vitally relevant in many periods and contexts, and that remains highly influential today. Visit the Classics Page Comparative Literature B.A. Arts and Humanities Comparative literature is the department for students who want to cross boundaries -- between languages, between cultures, between disciplines. We welcome students who are interested in studying literature in more than one national and linguistic tradition, students who want to explore literature in relation to other arts and media (e.g., film, music, visual art) or disciplines (e.g., philosophy, government, WGS, religion), and students who seek to formulate an individualized program of study within the arts and humanities. Visit the Comparative Literature Page Comparative Study of Religion B.A. Arts and Humanities, Social Sciences The concentration in the Comparative Study of Religion invites students to explore the most consequential and momentous questions relevant to the understanding of individual and communal human life.  Concentrators consider topics such as the significance of ritual and practice; differing conceptions of human nature and the nature of the divine; and comparative study of how people understand the meaning of life, suffering, and death.  Our program is unique in allowing students to take up these and other “big” questions in rigorous and critical ways. Visit the Comparative Study of Religion Page Computer Science B.A. Sciences Computer science is about tools and technology, and also about understanding and engaging with the world. From swarms of insects to elementary particles, rational agents in a market, and neurons in a brain, the computational viewpoint has proven a fruitful way to understand natural, social, and engineered systems. Correspondingly, the Computer Science concentration has strong ties not just to engineering, but also economics, law, biology, physics, statistics, mathematics, linguistics, and more. Because information technology affects every aspect of society, graduates with computer science degrees have access to a large variety of careers, including engineering, teaching, medicine, law, basic science, finance, and management. Visit the Computer Science Page Earth and Planetary Sciences B.A. Sciences The Earth and Planetary Sciences department is focused on critical events that have shaped the Earth’s evolution and its place in the solar system. Our approach is to apply interdisciplinary tools to investigate processes from tectonic plate to microbial scale, and across the full sweep of geological time, from the early Earth to the modern world. Using a combination of theoretical, computational, laboratory, and field-based methods, we study natural experiments in Earth's history, and ultimately test the limits of the Earth’s resilience in the geological past and in our progressively warming world. Visit the Earth and Planetary Sciences Page East Asian Studies B.A. Arts and Humanities, Social Sciences The concentration in East Asian Studies seeks to develop a critical understanding of the human experience in East Asia. To study East Asia is to be exposed to a world with different forms of political activity and social relations, religious traditions of great depth and philosophical schools with enduring insights, and literatures of unusual range and power. It is also to study a world that since the 19th century has come to share in the dilemmas of modernity that we all confront. Visit the East Asian Studies Page Economics B.A. Social Sciences Economics is a social science that covers broad subject matter in seeking to understand the social world. An economic analysis begins from the premise that individuals have goals and that they pursue those goals as best they can. Economics studies the behavior of social systems—such as markets, corporations, legislatures, and families—as the outcome of interactions through institutions between goal-directed individuals. Ultimately, economists make recommendations that they believe will make people better off. Visit the Economics Page Electrical Engineering B.A. B.S. Engineering & Applied Sciences Electrical Engineering provides the information and communications pathways that link us together, the techniques that allow us to send a multitude of complex information over long distances ever more rapidly, and that allow us to carry out demanding computation on massive amounts of data in ever shorter periods of time. Electrical engineers utilize basic materials properties to craft new devices and systems that will be able to rapidly receive, transmit and store information with ever greater accuracy and efficiency. Visit the Electrical Engineering Page Engineering Sciences B.A. B.S. Engineering & Applied Sciences Engineering plays a critical role in enhancing social progress and improving our quality of life. The Engineering Sciences program educates future leaders with the technical background necessary to develop and critically evaluate the next wave of engineering innovations, to apply these innovations to important local and global problems, and to make informed decisions about them in a societal context. Visit the Engineering Sciences Page English B.A. Arts and Humanities Humans use stories to cope and thrive, from oral poetic traditions to novels, screenplays, and hip hop rhymes. The English Department hones your expertise as a maker and interpreter of stories. By studying English literature, you will learn how to analyze and appreciate the language of the past and to craft new narratives for the future. You will develop expertise in communicating meaningfully through language and in interpreting others’ rhetoric, skills more crucial than ever in our text-saturated world. Along the way, you will both devise and encounter dazzling imaginary worlds that bring readers and writers together across vast expanses of space and time. We commit ourselves to helping students immerse themselves in the literary worlds they know and love, discover new worlds they might not think to explore, acquire the means to write and read according to their own developing tastes, and sustain themselves on their intellectual and creative journeys. Visit the English Page Environmental Science and Engineering B.A. Engineering & Applied Sciences Environmental Science and Engineering (ESE) is an interdisciplinary program with the goal of understanding, predicting, and responding to natural and human-induced environmental change. Addressing environmental issues such as global warming, stratospheric ozone depletion, or local and regional air and water pollution requires perspectives from a diverse set of scientific disciplines including atmospheric physics and chemistry, oceanography, glaciology, hydrology, geophysics, ecology, and biogeochemistry. This program is structured around the view that the environmental system is comprised of a complex set of chemical, physical, and biological interactions, made even more complicated by the various activities of human society. Through exploration of the underlying processes and feedbacks within the Earth system, and with a range of approaches from theory and modeling to experiments and observations, students are trained to think about environmental processes in an integrated fashion, preparing them to manage the environmental challenges we face. Visit the Environmental Science and Engineering Page Environmental Science and Public Policy B.A. Sciences, Social Sciences The concentration in Environmental Science and Public Policy (ESPP) is designed to provide a multidisciplinary introduction to current problems of the environment. It is founded on the premise that the ability to form rational judgments concerning many of the complex challenges confronting society today involving the environment requires both an understanding of the underlying scientific and technical issues and an appreciation for the relevant economic, political, legal, historical, and ethical dimensions. Depending on preparation, students may be encouraged to substitute more advanced courses for these requirements. In consultation with their concentration advisor, Through their field of specialization, students develop expertise in a particular field of study relating to the environment. Visit the Environmental Science and Public Policy Page Folklore and Mythology B.A. Arts and Humanities Folklore and Mythology is a liberal education in and of itself. The program encourages the study of any given community through its language and culture, offering an array of choices for drawing on a variety of disciplines in the humanities and social sciences. To focus on the folklore and mythology of a community (at local, regional, national, or even trans-national levels) is to understand how that group or society defines itself through stories, music, food, folktales, legends, dramas, dance, rituals, beliefs, proverbs, epics, myths, customs, law codes, festival celebrations, “wisdom literature,” and many other forms of expressive culture and artistic communication. To study the folklore and mythology of any group is to discover how that group identifies itself in relation to others. Visit the Folklore and Mythology Page Germanic Languages and Literature B.A. Arts and Humanities Our program invites you to explore the languages, literatures, societies and cultures of the German-speaking and Scandinavian regions of Europe: Germany, Austria, Switzerland, Liechtenstein; and Denmark, Iceland, Norway, and Sweden. We offer language courses in German and Swedish as well as tutorials in Danish, Dutch, Icelandic, Norwegian, and Old Norse, all of which provide a gateway to an exciting exploration of the tremendous impact these cultures have had on the development of Western civilization – from the Vikings to the present day. Visit the Germanic Languages and Literature Page Government B.A. Social Sciences The Department of Government—like political science—is an umbrella for a remarkable range of political subjects and approaches to studying them. It stands at the cross-roads of history, law, economics, sociology, philosophy, and ethics, borrowing from these disciplines as well as constructing theories and methods of its own. Visit the Government Page History B.A. Social Sciences History is a broad discipline encompassing every dimension of human interaction in the past, including social life, the economy, culture, thought, and politics. Students of history study individuals, groups, communities, and nations from every imaginable perspective—employing all the techniques of the humanities and social sciences to raise questions and probe for answers. Students explore the origins and developments that have shaped our contemporary world; and take courses that span the globe and range in chronological scope from antiquity to today. Visit the History Page History and Literature B.A. Arts and Humanities, Social Sciences Harvard’s oldest concentration, History & Literature is an interdisciplinary humanities program where you work closely with outstanding faculty in small-group and one-on-one tutorials. Beyond these tutorials, you take courses from a variety of departments as you develop your individual interests at the intersection of art, history, politics, and culture. Visit the History and Literature Page History and Science B.A. Social Sciences History & Science is an interdisciplinary field of study. The program offers students a variety of opportunities to expand their understanding of the scientific enterprise and to explore in detail how science has developed in history and how science has shaped other human activities. Students are challenged to ask big questions about science, medicine, and technology, and their place in human societies across time. How do scientists come to know things about the natural world? Why should we believe what they tell us? What are some social, ethical, political and religious implications of science? How do they affect the way people in different times and places live their lives? Visit the History and Science Page History of Art and Architecture B.A. Social Sciences The History of Art & Architecture concentration offers training in the historical interpretation and critical analysis of the visual arts and architecture. It develops the skills of visual discrimination and verbal expression fundamental to art historical analysis. Art history is a multifaceted discipline embracing many different methods, perspectives and interests. Training in the critical analysis of art seeks to clarify the perception – and understanding – of how artworks relate to the techniques and materials used in their making, and to the environment in which they are seen. It also fosters the ability to make and explain judgments of quality and value. Visit the History of Art and Architecture Page Human Developmental and Regenerative Biology B.A. Sciences Human Developmental and Regenerative Biology (HDRB) is a life science concentration that educates students on how human beings develop from a fertilized egg, are maintained and repaired throughout adulthood, and age till life’s end. Students will be given a broad education in modern life sciences by studying important biological principles within the specific rubric of the developing and regenerating body. By adding an explicit and heavy emphasis on hands-on research opportunities in all four undergraduate years, HDRB will engage students with an interest in research and take advantage of Harvard’s special strengths as a teaching college and research university. Visit the Human Developmental and Regenerative Biology Page Human Evolutionary Biology B.A. Sciences Human Evolutionary Biology (HEB) explores all aspects of human biology and behavior from an evolutionary perspective. HEB thus provides students with the knowledge and skills they need to investigate and answer questions about how and why humans are the way we are, and why that matters for real world problems. Research in human evolutionary biology has implications for medical science, exercise physiology and diet as well as for economics, psychology, political science, religion and literature. Visit the Human Evolutionary Biology Page Integrative Biology B.A. Sciences Evolution is the strand that ties together all of biology: from the adaptive specifics of a membrane pore to grand events in the history of life, such as the Cambrian Explosion, when, 540 million years ago, life went in a single bound from simple to complex. Adaptive evolution is a response to the demands of the environment, whether this is the environment within a cell or an ecological community of interacting organisms. Integrative Biology (IB) therefore is inherently inter-disciplinary, encompassing mathematical and computational biology, functional and genetic approaches to morphology and development, as well as genetics, evolution, and ecology. Visit the Integrative Biology Page Linguistics B.A. Arts and Humanities, Social Sciences Linguists are engaged in the study of language structure, which is the ultimate interdisciplinary enterprise. Linguistic theory attempts to model a complex domain of human knowledge that is also central to philosophy of mind and to cognitive psychology. The linguistic models that theoretical linguists construct are formal in character and rely on computational and mathematical methodologies. As such, linguistics has a mutually beneficial relationship with computer science and the study of artificial intelligence. Visit the Linguistics Page Mathematics B.A. Sciences Mathematics is the science of order, and mathematicians seek to identify instances of order and to find notions and tools to perceive order where it is a priori hidden from view. Perhaps the most important concept of mathematics is that of function, which provides us with the means to study dependence and change. The study of real functions of a real variable (and later complex functions), particularly in connection with the limit concept, is called analysis. The most effective tool for this study is the infinitesimal calculus that analyzes the relation between functions and their derivatives. Then there are the notions and tools for the study of number systems and their generalizations; these form the branch of mathematics called algebra. Here the primary concepts are group, ring, field, and module. A third over-arching set of notions and tools concerns geometry, which now goes far beyond the classical study of the space we live in to include spaces of high dimension and topology, the abstract theory of shape. Visit the Mathematics Page Mechanical Engineering B.S. Engineering & Applied Sciences Mechanical engineering is a discipline of engineering that uses the principles of physics and materials science for the analysis and design of mechanical and thermal systems. Mechanical engineering is critical to the success of many human enterprises - it plays a central role in the generation and distribution of energy, transportation, manufacturing, and infrastructure development. Nearly every product or service in modern life has been touched in some way by a mechanical engineer. Visit the Mechanical Engineering Page Molecular and Cellular Biology B.A. Sciences Molecular and Cellular Biology is rooted in the investigation of biological processes based on the study of molecules and their interactions in the context of cells and tissues, and how the genome orchestrates cell behavior. Visit the Molecular and Cellular Biology Page Music B.A. Arts and Humanities The concentration in Music exposes students to a wide variety of musical styles, sounds, and musical traditions in order to develop their critical understanding of music in diverse cultural and historical contexts. The concentration also provides a solid foundation in theory, analysis, composition, and criticism, while developing critical listening skills, which are a pivotal contribution that engagement with music makes to the humanities. Although the Department of Music is not in itself a school of music with a performance department, all of our courses support the intellectual development of musicians, and several of our courses incorporate or focus on performance. Visit the Music Page Near Eastern Languages and Civilizations B.A. Arts and Humanities, Social Sciences The Department of Near Eastern Languages and Civilizations introduces students to the ancient and modern peoples, languages, cultures, and societies of the Near/Middle East. Loosely defined as stretching from Morocco in the west to Iran and Afghanistan in the east, the region is home some of the world’s great religions and civilizations. Historically, the influence of its languages, literatures and cultures has extended to Central, East and Southeast Asia, sub-Saharan Africa, Europe and North America. Thus, the study of the Near and Middle East is an important area of academic inquiry on account of its political, economic and cultural significance on the international stage. Visit the Near Eastern Languages and Civilizations Page Neuroscience B.A. Sciences Neuroscientists explore what is arguably the least understood and most important area of biology: how billions of electrically charged neurons create our rich sensory, emotional, and intellectual life (and no less than all animal behavior!). Neuroscience as a field is interdisciplinary and encompasses many areas of science, including genetics, chemistry, molecular biology, mathematics, cell and systems biology, computer science, and cognitive science. Neuroscientists study every aspect of the brain - from genes to behavior. As such, when you become a neuroscience student you will get broad training as a biologist as well as a new perspective on what it means to be a human. Visit the Neuroscience Page Philosophy B.A. Arts and Humanities, Social Sciences Philosophy studies many of humanity’s fundamental questions: how should we live, what kind of society should we strive towards, what are the limits of human knowledge? What is truth? Justice? Beauty? These questions are central to our lives, because in much of what we do, we at least implicitly assume answers to them. Philosophy seeks to reflect on these questions and answer them in a systematic, explicit, and rigorous way—relying on careful argumentation, and drawing from outside fields as diverse as economics, literature, religion, law, mathematics, the physical sciences, and psychology. And while most of the tradition of philosophy is Western, we seek to connect with non-Western traditions like Islam and Buddhism, as well. Visit the Philosophy Page Physics B.A. Sciences The concentration in Physics serves a variety of goals and interests. Many concentrators seek an understanding of the subtle, profound, and fundamental laws—relativity, quantum mechanics, and the basic force laws—that govern the behavior of all matter. Often these studies involve the smallest units of matter: molecules, atoms, nuclei, and sub-nuclear particles. A major interest of other Physics concentrators is the exploration and explanation of the diverse properties to which these laws give rise in macroscopic systems such as fluids and solids. Still others study aspects of more complex systems like oceans and atmospheres, stars, and living matter. Visit the Physics Page Psychology B.A. Sciences, Social Sciences Psychology is the scientific study of the mind, and as such, we investigate the minds of humans and other species. We try to understand the mind at many different levels of analysis, from taking measurements from the brain, through learning about the individual, all the way to understanding groups and organizations. Most of the research conducted in Harvard’s Department of Psychology concerns basic psychological processes such as attention, perception, memory, categorization, reasoning, decision-making, language, cognitive and social development, social cognition, intergroup relations, and morality. In addition, some members of the department conduct research on the etiology, development, and treatment of psychopathology. All members of the department share the common goal of understanding mind, brain, and behavior through empirical investigation, and their teaching and research reflect this goal. Visit the Psychology Page Romance Languages and Literature B.A. Arts and Humanities In the Department of Romance Languages and Literatures (RLL), undergraduates discover the literatures, cultures, and critical approaches of societies worldwide where French, Italian, Portuguese, Spanish, and Catalan are spoken. RLL offers language courses from the beginning to advanced levels, as well as opportunities for accelerated work and study abroad.  The heart of the concentration consists of courses about literature and society taught in French, Italian, Portuguese, and Spanish.  Faculty also offer advanced courses in English on special topics that involve more than one language tradition. Visit the Romance Languages and Literature Page Slavic Literatures and Cultures B.A. Arts and Humanities The concentration in Slavic Literatures and Cultures offers you the opportunity to study the great works and cultural traditions, past and present, of Russia and the other Slavic countries, especially Ukraine, Poland, and the Czech Republic. These countries share a rich cultural life as well as a turbulent and fascinating history. In the Slavic concentration, you will develop proficiency in Russian or another Slavic language such as Czech, Polish, or Ukrainian; you will learn to read literary works in the original language, gain valuable experience for working and traveling abroad, and come to understand these cultures and the important role they have played in the modern world Visit the Slavic Literatures and Cultures Page Social Studies B.A. Social Sciences Social Studies was founded in 1960 by a distinguished group of faculty who believed that the study of the social world requires an integration of the disciplines of history, political science, economics, sociology, and anthropology. For over five decades, Social Studies has brought together outstanding teachers and intellectually engaged students who share a fascination with social science research and theory and a deep interest in applying social science to contemporary social, economic, and political problems. Visit the Social Studies Page Sociology B.A. Social Sciences Sociology is the study of society, of the social frameworks within which we live our lives. It is a study of social life at every level, from two-person relationships to the rise and fall of nations and civilizations. Visit the Sociology Page South Asian Studies B.A. Arts and Humanities, Social Sciences A concentration in South Asian Studies enables students to develop a critical understanding of the diverse cultures, histories, languages and literatures of South Asia, which includes Bangladesh, India, Nepal, Pakistan, Sri Lanka, and Tibet. South Asia is home to more than a billion people and some of the world’s most fascinating and important civilizations. Its influence has extended historically from Central, East, and Southeast Asia to Europe and North America, which today have vibrant South Asian diasporas. The study of South Asia is an increasingly important area of academic inquiry, especially in recent decades as the region emerges as a global cultural, economic, and political power. Visit the South Asian Studies Page Statistics B.A. Sciences, Social Sciences Statistics is a relatively young discipline, organized around the rapidly growing body of knowledge about principled methods for data collection and data analysis, the making of rational decisions under uncertainty, and the modeling of randomness in any quantitative inquiries, including the social, natural, and medical sciences. Statistics has a theoretical core surrounded by a large number of domains of application in fields such as anthropology, astronomy, biology, business, chemistry, computer science, economics, education, engineering, environmental sciences, epidemiology, finance, forensic science, geophysical sciences, government, history, law, linguistics, mathematics, medicine, physics, population science, psychology, sociology, and many others. Visit the Statistics Page Studies of Women, Gender, and Sexuality B.A. Social Sciences The concentration in Studies of Women, Gender, and Sexuality (WGS) brings together a wide range of academic fields in the humanities, social sciences, and sciences (including history, literature, visual studies, anthropology, sociology, ethnic studies, political science, psychology, and biology, to name just a few). As an interdisciplinary field of study, WGS pays close attention to how social norms have changed over time and how they vary across cultures. The concentration also actively investigates the ways in which ideas about gender and sexuality have shaped public policy, civil rights, health care, religion, education and the law, as well as the depiction of women and men in art, literature, and the popular media. WGS courses are characterized by a strong commitment to critical thinking, as well as a spirit of open and sustained intellectual inquiry. Visit the Studies of Women, Gender, and Sexuality Page Theater, Dance & Media B.A. Arts and Humanities Theater, Dance & Media (TDM) combines historical and theoretical study of live and digital arts with the practice of those arts. Taught by FAS Faculty, and by practitioners from the American Repertory Theater (A.R.T.) and the Dance Center, as well as numerous visiting artists/scholars each year, students are introduced to the rigor and discipline required to participate in professional theater, dance and media practices. TDM emphasizes collaboration. The concentration explores the many ways to act, design, direct, compose, choreograph, dance, write, produce and organize live art and digital media. Our studio courses model and study the many forms of art collaboration; similarly, scholarly courses look to the history and theory of culture as a complement to the skills gained in studio practice. Visit the Theater, Dance & Media Page Related Stories Concentrations Explained Author: Nadine Class of '22\n Alumni Choosing My Concentration Author: Olga Class of '22\n Alumni Concentrations, Course Selection, and Shopping Week: My Experience as an Undeclared Student Author: Carter Class of '23\n Alumni Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification. Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Skip to site header Skip to main content"
}