{
  "id": 8,
  "date": "2024-05-18T18:24:07.220064",
  "url": "https://accessibility.huit.harvard.edu/digital-accessibility-policy",
  "university_name": "Harvard University",
  "title": "",
  "content": "Skip to main content Main Menu Utility Menu Search HARVARD.EDU GA4 Tracking Code Digital Accessibility​ Report Report a Web Accessibility Concern ➜ Search Training & Support Instructor-Led Trainings Self-Paced Trainings DAS Office Hours Accessibility Services Content Essentials Academic Multimedia Documents Emails Forms Data Visualizations Practices Techniques Accessibility Testing Working with Vendors Hosting Accessible Meetings Roles For Content Creators For Developers For Faculty For Managers For Purchasers Policies HOME / POLICIES / Harvard University Digital Accessibility Policy This Policy is established to promote equal access to information technology and digital content and to improve the user experience of IT and digital / online media for all users, including persons with disabilities. Policy Statement Harvard University is committed to making University Information Technology and University Digital Content accessible. For the purposes of this Policy, “accessible” means a person with a disability is afforded the opportunity to acquire the same information, engage in the same interactions, and enjoy the same services as a person without a disability in an equally effective and equally integrated manner, with substantially equivalent ease of use. Digital Accessibility Standards Toward meeting the University’s commitment to accessibility, Harvard expects University Information Technology and University Digital Content to conform to applicable Digital Accessibility Standards to the fullest extent possible. For the purposes of this Policy, the Digital Accessibility Standards (or “the Standards”) are The World Wide Web Consortium’s Web Content Accessibility Guidelines version 2.1, Level AA Conformance (WCAG 2.1 Level AA) for websites and web-based applications and services. Software and services that are not web-based should conform to WCAG 2.1 Level AA to the extent such guidelines may usefully be applied to improve the accessibility of these resources. In the case of digital hardware interfaces, the Standards also include the federal Section 508 standards described in Chapter 4 (“Hardware”) of Appendix C to 36 C.F.R. Part 1194, whether or not such instances of hardware are covered by the regulation. The Path Forward New Instances of University IT Instances of University Information Technology newly purchased, licensed, or internally developed after June 1, 2023 are expected to conform to the Standards to the fullest extent possible at the point of rollout or implementation. Where such conformance with the Standards is not technically feasible or may require extraordinary measures due to the nature or purpose of the Information Technology, a request for exception may be submitted for review by an appropriate University, School, or Unit Authority. New University Content Starting on June 1, 2023, Harvard users using University IT to post, distribute, or publish University Content should aim to make such content conform to the Standards, to the extent technically feasible and in accordance with the University Content framework specified in the Implementation Procedures. Where conformance with the Standards is not technically feasible, Harvard users should consider how to make University Content available in an alternative format accessible (as defined above) to persons with disabilities. Existing University IT and Content As further outlined in the Implementation Procedures, the Accessibility Steering Committee will establish and recommend to Senior Leadership a prioritization plan for improving the accessibility of existing University Information Technology, including websites and web-based applications, and the existing University Content hosted, published, or communicated on those platforms. Priority will be given to University IT platforms that provide the most essential functions to, and are most broadly and regularly used by, Harvard faculty, staff, and students. In the case of public-facing websites, priority will be given to sites that are among the most highly trafficked and to those that contain core institutional information. Procurement Considerations Harvard personnel purchasing or procuring University Information Technology are responsible for ensuring that suppliers seeking to develop or provide University IT are aware of this Policy and that contracts with such vendors hold them accountable to the Standards to the fullest extent possible. Harvard Strategic Procurement, the HUIT Vendor Management Office, and others charged with supporting IT procurement efforts should support these efforts when involved in IT purchases. The Implementation Procedures published under this Policy will identify resources, strategies, and guidelines for securing the greatest possible level of conformance to the Standards from third-party vendors, and purchasers and providers of University IT are expected to adopt and practice them. The Policy expects that the University will apply such market power as it has to prioritize and promote digital accessibility. However, the Policy recognizes that the University is able to exert less control over some “off-the-shelf” Information Technology developed and marketed outside the University. Definitions “University Information Technology” or “University IT” is Information Technology purchased, developed, deployed, or used for University Business and, in the case of web-based applications and websites, is hosted on a Harvard-owned or -controlled domain. “Information Technology” includes software; server-based, personal computer, mobile device, and web-based applications and websites; website hosting and design services; development, hosting, maintenance, and archiving services; cloud-based applications and information processing or storage services; digital hardware interfaces; and digital database configurations and interfaces. “University Content” is Digital Content created, posted, distributed or published for University Business. “Digital Content” consists of any information or communication accessed or displayed in a digital format or medium, as text, image, audio, or video. “University Business” includes activities carried out by Harvard faculty and staff in furtherance of Harvard University’s mission of teaching and research but does not include activities organized or conducted by students or student organizations. “Senior Leadership” includes the University’s President, Provost, Executive Vice President, and Vice Presidents; the Deans of the several Schools, their Department Chairs, and the Directors of University and School Centers or their designees. Responsibility The University expects that Senior Leadership will promote broad awareness of this Policy, assign responsibility to ensure the accessibility of University IT provided within their jurisdictions, and designate Digital Accessibility Liaisons. Improving digital accessibility requires the attention and commitment of the entire University community. Accordingly, all members of the Harvard community should be mindful of this Policy and aim to ensure that University Content they post to, publish on, or communicate through University IT is accessible. Where possible, including on websites operated by the University, Harvard administrators should indicate commitment to accessibility by posting a link to this Policy. Resources and Support The University is committed to providing resources and support to the Harvard community in order to effectuate this Policy. Accessibility Steering Committee The Accessibility Steering Committee is convened by the President and/or Provost. In addition to preparing the prioritization plan described above (see “Existing University IT and Content”), the ASC is responsible for (1) providing periodic review and revision of this Policy and its Implementation Procedures, including making appropriate updates to the Policy’s Standards definition as industry standards and practices evolve, with recommendations going to the President and/or Provost; (2) working with Senior Leadership to promote general awareness of this Policy; (3) assessing and reporting to the President and/or Provost the University’s accessibility efforts as outlined in this Policy; and (4) establishing a process and designating appropriate authorities to review and decide on requests for Policy exceptions. Digital Accessibility Services The Office of Digital Accessibility Services (“DAS”) within Harvard University Information Technology is responsible for supporting Senior Leadership across the University in creating and sustaining a culture of commitment at Harvard. In addition to devising Implementation Procedures for the ASC to review, DAS provides training, guidance, and information on accessibility standards and best practices and works with University IT purchasers and providers, and their technical partners, to advise or augment their efforts toward adopting the Standards. Guided by ASC priorities, DAS tracks and supports remediation efforts throughout Harvard. Digital Accessibility Liaisons Digital Accessibility Liaisons (“DAL”) are appointed by Senior Leadership. DAL coordinate local accessibility efforts and report on progress to the ASC and DAS. University Disability Resources University Disability Resources (UDR) within Central Administration provides leadership to University efforts to ensure an accessible, inclusive, and welcoming learning and working environment for persons with disabilities while complying with federal and state regulations. UDR serves as a University-wide resource on disability-related information, procedures, and services for the Harvard community, digital and otherwise. Exceptions and Remediation As outlined in the Implementation Procedures, IT purchasers or providers requesting an exception to this Policy may be required to submit an accommodation plan detailing how the unit will make, as applicable, the services or information provided by the University IT in question available to persons with disabilities, by alternate accessible (as defined above) means. The additional cost and expense incurred to bring University IT into conformance will not be considered a valid basis for grant of an exception, except in extraordinary circumstances and as approved by the Accessibility Steering Committee (“ASC”). Further details on exceptions processes will be included in the Implementation Procedures document. The ASC may require that some or all non-conforming portions of an instance of University Content (as provided in the University Content framework specified in the Implementing Procedures) or University IT be brought into conformance by designated staff or suppliers, and the expense of that work may be charged to the unit that is responsible for assuring the accessibility of that asset. If the ASC is unable to identify who is responsible for an instance of University Content that does not conform to the framework, then the ASC may ask that HUIT remove the non-conforming content from view until it can be brought into conformance. Upon a specific request by an individual who is unable to access specific University Content due to non-conformance to the Standards, either the requested content must be updated to conform to the Standards or the requested content otherwise must be made available in an alternative format in a timely manner. The unit responsible for the creation and maintenance of University Content is responsible for making it accessible or providing the accessible alternative. Disclaimer This Policy establishes internal guidelines and expectations for the purpose of promoting and advancing digital accessibility at Harvard University. Harvard reserves the right to modify the Policy unilaterally at any time. The Policy is not intended to create, nor does it create, any contractual or other legal obligation on Harvard’s part, or any contractual or other legal right for any member of the Harvard community or the general public. Note: this updated Policy supersedes the previous Digital Accessibility Policy, which was made effective on April 30, 2019 and applied exclusively to “University Websites,” which was defined to include only certain public-facing websites within a Harvard-controlled domain. The updated Policy has a broader scope and applies to all websites within Harvard-controlled domains, as well as the other forms of Information Technology listed in the definition above. --- Last updated: June 1, 2023 Report Report a Web Accessibility Concern ➜ Related Implementation Procedures Frequently Asked Questions Read the Gazette Article Upcoming Policy training 2024 Jun 12 Introduction to Digital Accessibility & Harvard's Policies 10:30am to 12:00pm All Trainings DAS Office Hours Not sure where to start with accessibility? We're here to help! The Digital Accessibility Services (DAS) team is available to answer your questions and provide guidance and support to the Harvard community. Stop by our virtual DAS Office Hours on the 2nd and 4th Fridays of each month from 10am-12pm. Upcoming DAS Office Hours University Disability Resources For access to all other disability-related resources and guidance for students, faculty, staff, visitors and guests, please visit University Disability Resources ➜ Contact Us - DAS Footer Contact Us About Digital Accessibility Services (DAS) digitalaccessibility@ harvard.edu Siteimprove Usability script Site-wide CSS Admin Login Copyright © 2024 The President and Fellows of Harvard College | Accessibility | Digital Accessibility | Report Copyright Infringement"
}