{
  "id": 8,
  "date": "2024-05-18T18:24:03.963194",
  "url": "https://news.harvard.edu/gazette/story/2023/12/college-accepts-692-under-early-action-program/",
  "university_name": "Harvard University",
  "title": "Sections",
  "content": "Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy Menu Sections Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy Featured Topics Ultra-processed foods More aspirin Driver hubris Exposome Events Featured series Wondering A series of random questions answered by Harvard experts. Explore the Gazette Events Article archive About us News+ Podcast Read the latest ‘I haven’t really had a proper weekend in a long time’ Party like it’s 2020 Study of Psychedelics in Society and Culture announces funding recipients For Media & Journalists Athletics News & Scores Digital Accessibility Privacy Policy Trademark Search Search the Harvard Gazette Go Ultra-processed foods More aspirin Driver hubris Exposome Events The Weeks Bridge as seen from the Dunster House tower. Kris Snibbe/Harvard Staff Photographer Campus & Community College accepts 692 under Early Action Program December 14, 2023 4 min read Class of 2028 invited to attend Visitas on April 14-15 Harvard College on Thursday accepted 692 students to the Class of 2028 from a pool of 7,921 who applied under the Early Action Program. “It’s exciting to see that so many of the nation’s and the world’s most promising students have been admitted early to the Class of 2028.  Their extraordinary range of talent and many contributions to their communities will add immeasurably to Harvard over the next four years and beyond,” said Admissions and Financial Aid Dean William R. Fitzsimmons. Students deferred in Early Action will be considered again in the regular decision cycle. That deadline is Jan. 1, and those applicants will receive decisions in late March. This year’s Early Action pool marks a return to numbers consistent with pre-pandemic sizes. Today’s acceptances come after the Griffin Financial Aid Office’s recent expansion of its robust support of students. The establishment of a new launch grant gives students receiving full financial support – those whose annual family income is $85,000 or less — $2,000 in the fall of their junior year to help with the costs associated with getting ready for post-Harvard life. Since 2016, incoming students on full support have been eligible for similar start-up grants to help smooth their transition to campus. “Our terrific financial aid program, especially with the new launch grant, is able to provide even more support to students who need it most. Financial support combined with resources like those provided through the Mignone Center for Career Success make it possible for all students to follow their goals during and after Harvard,” said Jake Kaufmann, Griffin Director of Financial Aid. Of the Class of 2028’s accepted Early Action cohort, 15.5 percent come from first-generation college backgrounds, compared with about 14 percent last year. Additionally, 20.8 percent had their application fees waived due to financial need compared with 19.7 percent last year. This year, Harvard joined STORY (Small Town Outreach, Recruitment, and Yield), a new consortium of 30 public and private universities working to raise the awareness in rural communities about opportunities at Harvard and similar institutions.  The STORY consortium traveled to five locations in the South and Midwest this fall to speak with students, families, and high school college counselors about the admissions process and financial aid. Students from rural communities and small towns make up 10 percent of accepted students to date. Among accepted students so far, 22.3 percent are from New England, 20.8 percent are from the mid-Atlantic, 14.5 percent are from the South, 8.4 percent are from the Midwest, 17.2 percent are from the West, and nearly 17 percent are from outside the United States. Applicants for the Class of 2028 were the first to experience Harvard’s reorganized application supplement.  Harvard removed the single optional essay in which students could select from 10 suggested topics, and replaced it with required short answer questions, all of which were previously optional short answers or suggested supplemental essay topics. Requiring students to respond to each question ensures that the admission committee has consistent information to review across applicants. The questions ask students to reflect on their own experiences, intellectual interests, plans after college, and living with others. “We continue to attract applications from a diverse range of secondary schools and communities around the world. Students have responded well to this year’s essay questions, using them to share their passions and hopes for the future. We look forward to seeing what these students contribute to the community once they are here,” said Director of Admissions Joy St. John. Harvard College continues to allow students to apply without requiring SAT or ACT scores, a change in policy announced three years ago for the admitted classes of 2026-2030. Students were notified of Early Action decisions at 7 p.m. Thursday. Those admitted are not obligated to attend and have until May 1 to make their final decision. The deadline to apply for regular decision is 11:59 p.m. Eastern time on Jan. 1. Harvard College will welcome accepted students to campus for Visitas weekend April 14-15. At that time, the Class of 2028 is invited to attend classes and events as well as learn about resources and opportunities.  Students will receive information about Visitas and Crimson Connect via the Admitted Student Website . Share this article Share on Facebook Share on LinkedIn Email article Print/PDF You might like Campus & Community ‘I haven’t really had a proper weekend in a long time’ Longtime supporter of grads Kathy Hanley caps 13-year quest with a Commencement of her own Part of the Commencement 2024 series 5 min read Campus & Community Party like it’s 2020 Class of ’24 gets a do-over on high school prom that pandemic took away Part of the Commencement 2024 series 4 min read Campus & Community Study of Psychedelics in Society and Culture announces funding recipients Three major events, including Psychedelics Bootcamp 2024, to be hosted over summer 4 min read Trending Science & Tech Epic science inside a cubic millimeter of brain Researchers publish largest-ever dataset of neural connections 3 min read Campus & Community Pop star on one continent, college student on another Model and musician Kazuma Mitchell managed to (mostly) avoid the spotlight while at Harvard 5 min read Campus & Community Finding right mix on campus speech policies Legal, political scholars discuss balancing personal safety, constitutional rights, academic freedom amid roiling protests, cultural shifts 5 min read Sections Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy Explore the Gazette Events Article archive About us News+ Podcast Our recent series Fixing the Constitution Many analysts and citizens believe that the Constitution, more than 230 years old, is out of touch with contemporary America. We asked five scholars to isolate the problem they’d attack first. Life | Work A series focused on the personal side of Harvard research and teaching. Follow us on Instagram LinkedIn TikTok Facebook YouTube Email For Media & Journalists Athletics News & Scores Digital Accessibility Privacy Policy Trademark"
}