{
  "id": 8,
  "date": "2024-05-18T18:06:13.836002",
  "url": "https://college.harvard.edu/admissions",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public Video description: Aerial shots of Harvard, students around campus Admissions Breadcrumb Home - Admissions On This Page: Overview Why Harvard Visit & Connect How to Apply Afford Harvard Admissions Statistics Policies and Reporting Overview The Future is Calling Harness your curiosity and learn about the world—and yourself. Through our liberal arts and sciences curriculum, you'll discover how to use your passions to build a bright future. Frequently Asked Questions How will the delayed FAFSA processing impact admissions or financial aid decisions? Do not worry! Delayed FAFSA submissions will not impact the timing of admissions or financial aid decisions at Harvard. If you are admitted and if you have submitted the CSS Profile and all necessary tax returns to IDOC by our financial aid application deadline, your financial aid decision will be available at the time of admission. As always, if you complete those parts of your financial aid application after the deadline, there is no penalty or reduction in the amount of aid you can receive, but you may experience a delay in receiving your aid decision. Paying the admissions application fee is a hardship for my family. Can I get a waiver? We are committed to making the application process accessible for all students. If the admissions application fee presents a hardship for you or your family and you plan on applying for financial aid, the fee will be waived. Please follow the steps below to request a fee waiver: Common Application Confirm that you meet at least one of the indicators of economic need and then select “Yes” to the prompt “ You are eligible for application fee waivers if you meet one or more of the following criteria.\" Complete the fee waiver signature. Coalition Application, Powered by Scoir Confirm that you meet at least one of the indicators of economic need listed in the Fee Waiver section of your Profile. If you do not meet one of the indicators of economic need, you may enter the Harvard-specific fee waiver code on the payment page: JH3S5Q2LX9 Transfer Applicants Please see the Transfer Application Requirements for information about requesting a transfer application fee waiver. What admissions criteria do you use? There is no formula for gaining admission to Harvard. Academic accomplishment in high school is important, but the Admissions Committee also considers many other criteria, such as community involvement, leadership and distinction in extracurricular activities, and personal qualities and character. We rely on teachers, counselors, and alumni to share information with us about an applicant's strength of character, their ability to overcome adversity, and other personal qualities. How can I add new accomplishments/awards/accolades to my submitted application? We understand that you might receive new recognitions or awards after you’ve submitted your application. We welcome the submission of this additional notable information. You may upload information about notable accomplishments and awards using the Applicant Portal . Why Harvard Discover what makes Harvard the standard for liberal arts and sciences education. From our unparalleled academics to our revolutionary financial aid, we strive to offer the best resources to the next generation of leaders. Read more about choosing Harvard Crimson Pride Harvard is home to 42 Division I intercollegiate sports teams - more than any other college in the country. Innovation From physical spaces to funding, Harvard provides the support for students to investigate and explore their world. Groundbreaking Research Undergraduates have access to more than $7 million in funding to pursue research in the sciences, social sciences, arts, or humanities. Creative Expression Theater, Dance, and Media - one of Harvard's newest concentrations - is just one of the many pathways in the arts and humanities. Visit & Connect Visit & Connect From your own home, or while walking around Cambridge, there are lots of ways to explore our campus. Click any of the links below to learn more about everyday life at Harvard. Quick Links Explore Harvard Virtual Tour Online Information Sessions Read Student Stories Join Our Email List Take a Virtual Tour Apply How to Apply We’ll guide you through the Common Application or Coalition Application, Powered by Scoir, and answer any questions you have along the way. Quick Links First-Year Applicants Application Requirements Transfer Applicants International Applicants Visiting Undergraduate Students U.S. Military Veterans Admissions Deadlines November 1 - Restrictive Early Action Restrictive Early Action applicants are notified by mid-December. January 1 - Regular Decision Regular Decision applicants will be notified by the end of March. Learn About Applying Restrictive Early Action Afford Harvard Harvard is affordable for all admitted students. Financial aid covers all demonstrated need for all students, regardless of citizenship or citizenship status. Families making under $85,000 a year pay nothing for their student's education, and families making between $85,000-$150,000 pay 0-10% of their incomes. Learn more about financial aid Calculate Your Estimated Scholarship How affordable is Harvard? See for yourself with our Net Price Calculator. Net Price Calculator Spotlights and Stories My Favorite Places On / Around Campus As I look back on my 4 years, I would like to share some of my favorite places around Harvard's campus. Read Full Story Latest Stories Goodbye, Harvard Read Full Story First Time Visiting the Boston Children's Hospital My Unusual Path to Neuroscience, and Research I’d always wanted to do research, but getting into it was one of the most intimidating things I’ve done in college. Read Full Story Vacation on Campus: Events in Boston this Summer As the school year ends and everyone starts leaving campus for their much-deserved summer getaway, I dream of a romantic summer voyage. Read Full Story View all student stories Admissions News College accepts 1,937 to Class of 2028 March 28th, 2024 College accepts 692 under Early Action Program December 14th, 2023 Harvard further expands financial aid to ease access March 31st, 2023 View all news Admissions Statistics Admissions Statistics Harvard welcomes students from across the country and all over the world, with diverse backgrounds and far-ranging talents and interests. Quick Links Admissions Statistics Diversity and Access Guide: Application Tips Financial Aid Fact Sheet A Profile of the Admitted Class of 2027 Statistics 56,937 56,937 Applicants 1,966 1,966 Admitted students 16 16 % International students 55 55 % Receive need-based scholarships Learn More About Harvard Join our email list to download our brochure and stay in touch. Sign Up Related Topics First-Year Applicants Here's everything you need to know about applying to Harvard College as a first-year applicant. Apply For Financial Aid We strive to make our financial aid application as streamlined as possible. Application Requirements Here you'll find a detailed explanation of each requirement of the application, including teacher recommendations, test scores, and school reports. Policies and Reporting Annual Fire Safety Report The Harvard University Environmental Health and Safety Department publishes the Annual Fire Safety Report , which includes fire safety polices, evacuation procedures, and fire statistics. Clery (Campus Security) Act The University is required by federal law (The Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act, 20 U.S.C. 1092(f), known as the “Clery Act”) to publish an annual security report. A copy of the report as well as the disclosure procedures can be found on the Harvard University Police website . Code of Conduct Harvard University is committed to the highest standard of ethics and conduct, and financial aid staff are bound to the conflict of interest and commitment policies applicable to all Harvard employees. Harvard has adopted a Code of Conduct relating to educational loan programs. Copyright Infringement Harvard University is committed to maintaining the integrity and availability of the Harvard network for the vital educational and research purposes for which it was designed and prohibits the use of its network to violate the law, including the U.S.Copyright Act. Please read the annual copyright disclosure . Disability University Disability Services serves as a central resource on disability-related information, procedures and services for the University community and provides expertise in the development, implementation, and acquisition of standard disability-related University practices, procedures and resources. FERPA The Family Educational Rights and Privacy Act of 1974, as amended (“FERPA”) is a federal law that gives students certain rights with respect to their education records. More information is available on the Registrar’s website . Retention and Graduation Rates As required, we have reported our graduation rates of degree-seeking, first-time, full-time undergraduates to the department via the IPEDs website . Additional rates for students in select categories can be found on this chart . Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification. Toggle Admissions Submenu Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Skip to site header Skip to main content"
}