{
  "id": 8,
  "date": "2024-05-18T18:23:57.199987",
  "url": "https://news.harvard.edu/gazette/story/2023/03/college-makes-regular-admission-offers-to-1220/",
  "university_name": "Harvard University",
  "title": "Sections",
  "content": "Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy Menu Sections Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy Featured Topics Ultra-processed foods More aspirin Driver hubris Exposome Events Featured series Wondering A series of random questions answered by Harvard experts. Explore the Gazette Events Article archive About us News+ Podcast Read the latest ‘I haven’t really had a proper weekend in a long time’ Party like it’s 2020 Study of Psychedelics in Society and Culture announces funding recipients For Media & Journalists Athletics News & Scores Digital Accessibility Privacy Policy Trademark Search Search the Harvard Gazette Go Ultra-processed foods More aspirin Driver hubris Exposome Events Hollis Hall and Stoughton Hall in Harvard Yard are two of the dorms assigned to first-year students. Stephanie Mitchell/Harvard Staff Photographer Campus & Community Harvard further expands financial aid to ease access March 30, 2023 5 min read College makes regular-admission offers to 1,220, as University changes family-income threshold for second year Harvard College has offered regular admission to 1,220 applicants for the Class of 2027, with 1,942 admitted in total, including those selected in the early action process . The total number of applications for the Class of 2027 was 56,937. “Each year Harvard seeks extraordinarily talented students from across the nation and around the world,” said William R. Fitzsimmons, dean of admissions and financial aid. “The students admitted to the Class of 2027 are remarkable by any measure, and we hope they choose to bring their diverse ideas, beliefs, and experiences to our campus.” Building on its long-standing commitment to increasing opportunity for all talented students regardless of their economic resources, the University is announcing another expansion of the Harvard Financial Aid Initiative (HFAI) for low- and middle-income families. Beginning with the class admitted this week, the cost to attend Harvard College, which includes tuition, housing, food, and fees, will be free for families with annual incomes below $85,000. This is an increase from the $75,000 annual income threshold announced last year . Nearly 25 percent of College students come from families with incomes under $85,000. “Harvard is committed to enrolling students of exceptional ability and character from all socioeconomic backgrounds,” said Claudine Gay, Edgerley Family Dean of the Faculty of Arts and Sciences. “This expansion opens Harvard’s doors wider than ever before, and we hope continues to make Harvard an attractive choice for undergraduates who seek to bring their purpose and passion to our community.” Harvard’s undergraduate financial aid program continues to benefit from consistent and aggressive investment. Since launching HFAI in 2005 the University has awarded more than $3 billion in support, and its annual aid budget has risen more than 200 percent, from $80 million to $246 million in 2023. All first-year students from families with incomes of less than $85,000 with typical assets will also receive a $2,000 start-up grant to help with move-in costs and other expenses incurred in the transition to College. This grant was launched in 2016. Based on projections, roughly 55 percent of students will receive need-based grants, allowing aided families to pay an average of $13,000 annually. “The further expansion of our financial aid program underscores our continued, unwavering commitment to making Harvard affordable for all deserving students,” said Jake Kaufmann, Griffin Director of Financial Aid. “We are deeply grateful to the generations of Harvard alumni and friends who have made this possible.” In 2020, Harvard expanded its financial aid program by eliminating the summer work expectation from awards beginning in the 2020–21 academic year and replacing it with scholarship funds. Students are not required to take out loans and are only expected to contribute $3,500 through work during the semesters to meet their estimated personal expenses, including books. In this application cycle, an estimated 19 percent qualified so far for federal Pell grants, typically awarded to students from lower-income backgrounds. Students who will be in the first generation of their families to graduate from a four-year college or the equivalent represent nearly 20 percent of this year’s admitted class. Harvard’s net-price calculator makes it easy for families to get a sense of the College’s affordability. For students not receiving need-based aid, the total cost of attendance (including tuition, housing and food, and fees) is scheduled to increase by 3.5 percent to $79,450 for the 2023–2024 academic year. “The class of 2027 comes from an unusually wide range of backgrounds and life experiences,” said Joy St. John, director of admissions. The members of this year’s admitted class, who learned of the decisions Thursday evening, hail from all 50 states, the District of Columbia, Puerto Rico, and 102 countries. International students make up 14.5 percent of the class, and 8.3 percent are U.S. dual citizens. About 22.2 percent come from the mid-Atlantic states, 17.4 percent from the South, 15.9 percent from New England, 17 percent Western and Mountain states, 10.1 percent from the Midwest, and 0.3 percent from U.S. territories. The Class of 2027 reflects the increasing diversity of the College’s applicants, with 15.3 percent identifying as African American/Black, 29.9 percent as Asian American, 11.3 percent as Latinx, 2.2 percent as Native American, and 0.5 percent as Native Hawaiian. Women account for 53.6 percent of all those accepted. As the pandemic continues to disrupt high school students’ access to standardized testing, Harvard announced in January 2022 an extension of its test-optional policy, allowing applicants through the Harvard Class of 2030 to apply without submitting SAT or ACT scores. Harvard has continued efforts to recruit U.S. military veterans, working with groups affiliated with the Defense Department and joining the Service to School’s VetLink program in 2017. Twenty-three veterans were admitted to this year’s class, and 43 students have expressed interest in ROTC. Harvard plans to welcome students to campus for an in-person Visitas, held from April 23-24. The College will host a number of events to welcome the admitted Class of 2027 and introduce them to the community, as well as to available resources and opportunities. Harvard will also continue to host virtual events for students via Crimson Connect, its online platform for the Class of 2027, which will be used throughout the spring to engage with current students, faculty, and staff. Students will receive information about Visitas and Crimson Connect via the Admitted Student Website. In-person Visitas programming will be contingent upon University, local, and state public health guidance. Admitted students will be notified directly of any programming changes. Staff members of the Griffin Financial Aid office will be available to speak with students and their families this month to help them as they make their final college choices. Students have until the end of the day on Monday, May 1, to reply to their offers of admission. Share this article Share on Facebook Share on LinkedIn Email article Print/PDF You might like Campus & Community ‘I haven’t really had a proper weekend in a long time’ Longtime supporter of grads Kathy Hanley caps 13-year quest with a Commencement of her own Part of the Commencement 2024 series 5 min read Campus & Community Party like it’s 2020 Class of ’24 gets a do-over on high school prom that pandemic took away Part of the Commencement 2024 series 4 min read Campus & Community Study of Psychedelics in Society and Culture announces funding recipients Three major events, including Psychedelics Bootcamp 2024, to be hosted over summer 4 min read Trending Science & Tech Epic science inside a cubic millimeter of brain Researchers publish largest-ever dataset of neural connections 3 min read Campus & Community Pop star on one continent, college student on another Model and musician Kazuma Mitchell managed to (mostly) avoid the spotlight while at Harvard 5 min read Campus & Community Finding right mix on campus speech policies Legal, political scholars discuss balancing personal safety, constitutional rights, academic freedom amid roiling protests, cultural shifts 5 min read Sections Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy Explore the Gazette Events Article archive About us News+ Podcast Our recent series Fixing the Constitution Many analysts and citizens believe that the Constitution, more than 230 years old, is out of touch with contemporary America. We asked five scholars to isolate the problem they’d attack first. Life | Work A series focused on the personal side of Harvard research and teaching. Follow us on Instagram LinkedIn TikTok Facebook YouTube Email For Media & Journalists Athletics News & Scores Digital Accessibility Privacy Policy Trademark"
}