{
  "id": 8,
  "date": "2024-05-18T18:06:24.183432",
  "url": "https://college.harvard.edu/",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Harvard College Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public Home - Harvard College Slides Video description: Student walks up stairs of library and through stacks. Harness your curiosity to learn about the world—and yourself Video description: Students dance on stage in colorful garb Uncover a world of possibility, as limitless as your imagination Video description: Student walks through lab and uses 3D printer Embrace challenges and emerge with opportunities Video description: Group of students walk across bridge Venture into new territory and chart your own path Video description: Aerial view of Harvard's campus Access an affordable education with unparalleled resources Slide Controls The following controls are not necessary for screen readers because all slides are available in the preceding list \"We co-create an inclusive community that fuels exploration, discovery, and connection.\" Rakesh Khurana Danoff Dean of Harvard College Start Your Journey Explore Harvard Academics Academics Through intellectual vitality, the Harvard College community seeks to establish a culture in which all members speak, listen, and ask questions of each other – and ourselves – with curiosity and respect. Fields of Study Fields of Study At Harvard College, students choose a \"concentration,\" which is what we call a major. With more than 3,700 courses in 50 undergraduate fields of study, you'll have plenty of chances to find your passion. Diversity & Inclusion Diversity & Inclusion Harvard fosters a living and learning environment where you can celebrate your individuality—and where you can explore the shared ideas and experiences that connect us all. Faculty Faculty Working side by side with undergraduates, Harvard professors encourage students to see with new eyes. Through research, coursework, and casual interactions, students and faculty learn from and challenge each other on a daily basis. Residential Life Residential Life The residential community system is one of Harvard's best known traditions - first-years live together in Harvard Yard, and then students spend the next three years in one of Harvard's historic Houses. Student Life Student Life From your professors and House advisors to your friends and teammates, Harvard is a vibrant community where you can feel supported and encouraged. No matter where you come from, Harvard is home. Athletics Athletics Harvard is home to 42 nation-leading Division I intercollegiate sports teams. Our outstanding varsity athletes excel in competition, fuel Crimson pride across campus, and carry on the rich legacy of Harvard Athletics. Health & Wellbeing Health & Wellbeing Caring for your mental and physical well-being positions you to do your best in the classroom or in any endeavor you pursue. Harvard has a wide array of opportunities that provide a strong foundation to help you stay healthy and maximize wellbeing. Cambridge & Boston Cambridge & Boston Cambridge and Boston are separated by the Charles River but share a vibrant student population, an exciting blend of cultures, and a stimulating urban pulse. These two cities will host some of your most cherished memories. College Guides College Guides These guides cover many topics - including applying and financial aid, funding summer research, and navigating Harvard's many campus resources. Prospective Students Application Requirements Application Requirements Interested in applying to Harvard College? This page gives detailed instructions about each component of the application. Most information applies to first-year and transfer applicants. Financial Aid Overview Financial Aid Overview You can afford Harvard. The Griffin Financial Aid Office provides need-based aid that allows us to bring the best students to Harvard, regardless of their ability to pay. Net Price Calculator Net Price Calculator Try out this calculator tool to get a quick estimate of what your family would be expected to contribute to the cost of a Harvard education. Diversity & Access Diversity & Access When students come to Harvard, they bring their perspective on the world—an understanding that is deeply tied to their culture, background, and experiences. The result is a diverse, open-minded community where dialogue and debate are not only encouraged—they're inevitable. Visit Our Campus Visit Our Campus We welcome you to attend a campus visit of Harvard College. A campus visit consists of a one hour information session with an admissions officer and 1-2 current students, followed by a one hour campus tour. Online Information Session Online Information Session Join Harvard College admission officers and students for a live online information session with Q&A. Virtual Tour Virtual Tour Use our Virtual Tour to discover spaces that aren't even available on an in-person campus tour, such as classrooms, laboratories, residence halls, and more. International Applicants International Applicants We welcome applications from all over the world. Our admissions and financial aid processes are the same for all applicants - regardless of nationality or citizenship. Transfer Applicants Transfer Applicants Each year, we accept a small group of exceptional students to transfer to Harvard from other similar liberal arts programs. U.S. Military veterans may be particularly interested in our transfer program. Frequently Asked Questions Frequently Asked Questions Visit this page to read through the most frequently asked questions about applying to Harvard. Current Students Concentrations Concentrations At Harvard College, students choose a \"concentration,\" which is what we call a major. With more than 3,700 courses in 50 undergraduate fields of study, you'll have plenty of chances to find your passion. College Offices College Offices The staff of Harvard's campus offices ensure you always have somewhere to turn for help navigating college life. Improve your study skills, take the first step on the path to career success, or enliven your day with an infusion of arts and culture. Financial Aid Application Information Financial Aid Application Information This page includes helpful information about financial aid application deadlines, the CSS Profile, the FAFSA, and other required forms. Events Calendar Events Calendar Discover what's happening on campus. News & Announcements News & Announcements Check out this page for the latest updates on Harvard's campus. Messages to Students Messages to Students Read the latest leadership statements here. Navigating Campus Navigating Campus Navigating day-to-day campus life is made easier with this collection of important resources and information for booking spaces, student activities and organizations, academics, health and wellness support, and more. Health & Wellbeing Health & Wellbeing Caring for your mental and physical well-being positions you to do your best in the classroom, on the field, or in any endeavor you set your mind to. Harvard has a wide array of opportunities that provide a strong foundation to help you stay healthy and learn about methods to maximize wellbeing. Parents & Families Family Resource Page Family Resource Page We hope the information on this page helps parents, family members, or guardians of prospective or current Harvard students along the journey from applying to graduating. First-Year Experience Office (FYE) First-Year Experience Office (FYE) Meet the office that most directly supports first-year students. This page offers information about making the transition from high school to college. Parent & Family Engagement Office Parent & Family Engagement Office We are committed to providing resources and opportunities for parents and families to learn about the College and share in the milestones your student will experience during their time at Harvard. Family Weekend Family Weekend During Family Weekend each fall, families can experience Harvard College through the eyes of their student. Attend courses, meet faculty, talk to other families, and receive valuable information about the Harvard experience. Messages to Parents & Families Messages to Parents & Families Check out this page to read the most recent messages for parents and families of students. High School Counselors Counselor Resources Counselor Resources The Admissions Committee considers counselors as invaluable colleagues and partners in the college selection and application process. We hope the information on this page is helpful to you as you guide your students. Application Requirements Application Requirements Read about the application requirements for first-year applicants and transfer students as well as deadlines for application rounds. Financial Aid Financial Aid Harvard offers incredibly generous financial aid packages. We hope you'll advise students to learn more about the financial support as they consider Harvard - it is likely more affordable than they expect! Net Price Calculator Net Price Calculator This quick estimator tool will give students and their families estimates of what they'd be expected to contribute to the cost of a Harvard education. Nearly 1/4 of our Harvard families pay nothing for their student to attend. Application Tips Guide Application Tips Guide This guide provides tips about every section of the application and the Harvard supplement. Scenes around Campus With its mix of historic buildings and modern facilities, Harvard College provides everything students need to learn, grow, and enjoy the college experience, having transformative experiences that help shape their future. Visit the Harvard College Admissions TikTok @harvardcollege Options are endless. Make it feel like home! 🎨💐📚🦋 #DormRoom #DormDecor #Harvard #HarvardCollege #fyp #DormTour ♬ original sound - harvardcollege - Harvard College @harvardcollege YardFest 2k24 😎 #Harvard #HarvardCollege #CollegeLife #YardFest #YardFest2024 #Tinashe #GoodVibesOnly ♬ original sound - harvardcollege - Harvard College @harvardadmissions Did you know we have a ceramics program and facilities at Harvard? #ceramics #arts #liberalarts #harvard #college #fyp ♬ original sound - harvardadmissions - Harvard Admissions @harvardcollege Paw-ty planning is hard 🐾 #SashaTurnsThree #Harvard #HarvardUniversity #Pawty #PawtyTime ♬ Funny video \"Carmen Prelude\" Arranging weakness(836530) - yo suzuki(akisai) @harvardadmissions behind the scenes of Ghungroo ‘24 #community #performingarts #fyp #harvard #studentlife ♬ original sound - harvardadmissions - Harvard Admissions @harvardadmissions Which house would you want to be sorted into? #harvard #collegedorm #reslife #college #fyp ♬ original sound - harvardadmissions - Harvard Admissions Student Stories Advising on a Campus I'm Getting to Know Read Full Story Latest Stories Goodbye, Harvard Read Full Story First Time Visiting the Boston Children's Hospital My Unusual Path to Neuroscience, and Research I’d always wanted to do research, but getting into it was one of the most intimidating things I’ve done in college. Read Full Story Vacation on Campus: Events in Boston this Summer As the school year ends and everyone starts leaving campus for their much-deserved summer getaway, I dream of a romantic summer voyage. Read Full Story Read more student stories What is a \"liberal arts & sciences\" education? The liberal arts & sciences offer a broad intellectual foundation for the tools to think critically, reason analytically and write clearly. These proficiencies will prepare students to navigate the world’s most complex issues, and address future innovations with unforeseen challenges. Shaped by ideas encountered and created, these new modes of thinking will prepare students for leading meaningful lives, with conscientious global citizenship, to enhance the greater good. What is a \"liberal arts & sciences\" education? How many courses does Harvard offer? Harvard offers more than 3,700 courses. For a complete copy of the course catalog, please visit registrar.fas.harvard.edu . How many courses does Harvard offer? How large are classes? Some introductory courses as well as several other popular courses have large enrollments. Yet, the median class size at Harvard is 12. Of the nearly 1,300 courses offered last fall, for example, more than 1,000 of them enrolled 20 or fewer students. How large are classes? What is Harvard's graduation rate? The College's graduation rate is normally 98 percent, among the highest at American colleges and universities. Everyone admitted to Harvard has the ability to complete all academic requirements successfully. What is Harvard's graduation rate? Is on-campus housing guaranteed? Harvard guarantees housing for all four years. First-year students live in one of the 17 dormitories in or adjacent to historic Harvard Yard. Self-selected groups of students are assigned to one of 12 residential Houses for the final three years of undergraduate study. About 350 to 500 students live in a House, each of which includes its own dining hall, library, advising staff, and many other resources. Read more about residential life . Is on-campus housing guaranteed? Where will I take my meals? First-year students all eat together in Annenberg Hall. During sophomore through senior year, students typically eat in the dining hall located within their Houses, although students can choose to eat at other House dining halls as well. See more about dining . Where will I take my meals? News When math is the dream April 19th, 2024 A fresh take on must-see TV April 18th, 2024 College accepts 1,937 to Class of 2028 March 28th, 2024 View all news A Better World Together Harvard is committed to creating an inclusive living and learning environment for every member of our community. Diversity & Inclusion Quick Links Current Students Resources Reapply for Financial Aid College Offices Advising Student Employment Research Funding Explore Events Study Abroad Student Stories Cambridge & Boston Prospective Students Explore Visit & Explore Why Harvard Academic Environment Virtual Tour Guide to Preparing for College All Guides & Resources for Prospective Students Apply What We Look For First-Year Applicants Application Requirements Apply for Financial Aid International Applicants View all resources Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification."
}