{
  "id": 8,
  "date": "2024-05-18T18:24:16.660413",
  "url": "https://college.harvard.edu/informacion-en-espanol",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Harvard College Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public Información en Español Breadcrumb Home On This Page: Overview Harvard College Pagando por tus estudios Solicitudes ¿Qué buscamos? Dominio del idioma inglés Visita Overview ¿Por qué no Harvard? ¿Por qué no tú? Aquí, encontrarás información que te ayudará a conocer más de Harvard College, desde nuestro amplio programa de asistencia financiera hasta nuestro proceso de admisión holístico. Harvard College Aunque Harvard es conocida por su personal docente de primer nivel y sus infinitas oportunidades, creemos firmemente que una de nuestras principales fortalezas es la diversidad excepcional de nuestra comunidad. IMPORTANTE: Harvard College es la escuela de pregrado de Harvard University. Para información sobre programas de escuela posgrado (medicina, leyes, administración de empresas, educación, etc.), favor de consultar el directorio de escuelas para contactar la oficina apropiada. Calculator Calcule su beca estimada ¿Qué económico es Harvard? Mire para sí mismo con nuestra calculadora de precios netos. Calculadora de precios netos Pagando por tus estudios Una vez que un estudiante sea admitido en Harvard, trabajamos junto a su familia para asegurar que puedan pagar el costo de asistir la universidad. Estamos interesados en los mejores estudiantes, más allá de su situación económica. Por eso, nos comprometemos a cumplir plenamente con la necesidad financiera durante los cuatro años. Estudiantes internacionales tienen acceso a la misma ayuda financiera que sus compañeros estadounidenses, sin importar su estado de ciudadanía. De hecho, alrededor del 60% de estudiantes reciben becas de acuerdo a su necesidad con un costo promedio de $ 12.000 por año. 20% de nuestras familias no pagan nada. No se requieren préstamos como parte de nuestra ayuda financiera; la ayuda que ofrecemos es en la forma de becas. Tomamos como base dos principios fundamentales: La admisión en Harvard no toma en cuenta la habilidad de pago. Esto significa que tu necesidad financiera no afectará la posibilidad de ser admitido La ayuda financiera depende enteramente de la necesidad financiera, no del mérito Nuestros funcionarios de ayuda financiera estudiantil colaboran con las familias para determinar cuál es su necesidad financiera y el pago que les corresponderá hacer. Para muchas familias, esto representa entre el 0% y el 10% del ingreso familiar. También se le pedirá al estudiante que contribuya con el costo de su educación con empleo durante el año escolar y el verano. Consulta nuestra calculadora de precio neto para tener una idea de cuánto te costará una educación de Harvard. En menos de cinco minutos, tendrás un estimativo de tu paquete de ayuda financiera y del pago que le correspondería a tu familia. Creemos que te sorprenderá gratamente. Más información sobre cómo funciona la asistencia financiera ¿Por qué no Harvard? ¿Por qué no tú? This preview video does not contain audio. Ver el vídeo ℹ︎ Video End of embedded content Solicitudes Cada solicitante de Harvard College es cuidadosamente evaluado. No existen fórmulas para ser admitido, pero esperamos que esta información te ayude a comprender qué es lo que buscamos en nuestro proceso holístico de admisión. ¿Qué buscamos? Buscamos estudiantes prometedores que contribuirán a la comunidad de Harvard durante sus años en la universidad y que contribuirán a la sociedad más allá de la graduación. Aunque el desempeño académico es muy importante, el Comité de Admisiones considera muchos otros factores en sus decisiones: rasgos personales, talentos especiales o excelencia de toda clase, puntos de vista formados a partir de circunstancias personales o particulares, y la capacidad de aprovechar de las oportunidades y los recursos disponibles. Requisitos para presentar la solicitud Información para padres acerca de la solicitud Dominio del idioma inglés Los estudiantes deben tener un conocimiento sólido del idioma inglés, incluyendo la capacidad de comprender y expresar ideas de manera rápida y clara. No es obligatorio tomar el examen de aptitud en idioma inglés (TOEFL) ni otros exámenes de competencia idiomática. En caso de haberlos ya tomado, puedes presentar tus calificaciones como parte del solicitud, pero no es mandatorio. Solicitantes internacionales Harvard Virtual Tour https://www.youvisit.com/#/vte/?data-platform=v&data-link-type=immersive&data-i… Visita Asiste a una sesión informativa sobre admisiones y un recorrido . Visitar Harvard es una manera estupenda de aprender acerca de la vida diaria en la universidad, de conocer estudiantes actuales, y de explorar a Cambridge y Boston. Es más fácil experimentar que describir los aspectos intangibles de la comunidad de Harvard, el atmósfera de Harvard Yard, y la calidez y el entusiasmo de sus alumnos. Sabemos que muchos estudiantes no tienen la posibilidad de visitar las universidades antes de presentar sus solicitudes. Por eso, esperamos que nuestro sitio web sirva para destacar las vastas oportunidades de Harvard y la efusión de su comunidad. También puedes hacer un recorrido virtual para obtener una vista previa de Harvard desde la comodidad de tu hogar. Related Topics Virtual Tour If you can't make it to Cambridge to visit us, don't worry. Our virtual tour takes you around campus and into residential halls, classrooms, and more. Affordability For 90% of American families, Harvard is more affordable than their local state school. Diversity and Access When students come to Harvard, they bring their talent, curiosity, and intelligence. They also bring their perspective on the world. Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification."
}