{
  "id": 8,
  "date": "2024-05-18T18:24:06.677416",
  "url": "https://college.harvard.edu/financial-aid/how-aid-works",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public How Aid Works Breadcrumb Home - Financial Aid - How Aid Works On This Page: Overview Our Principles Determining Need Cost of Attendance Types of Aid Bills & Payments Overview By The Numbers Statistics $ 13 13 K Average Parent Contribution 24 24 % Of Harvard Families Pay Nothing 100 100 % Of Demonstrated Financial Need is Met Our Principles You Can Afford Harvard Getting into Harvard can be challenging. Figuring out how to pay for it shouldn't be. Harvard is more affordable than public universities for 90 percent of Americans—and international students receive exactly the same financial aid as American students. Because we want to bring the best people to Harvard regardless of their financial circumstances, we follow two important principles: Need-blind admissions. Your financial need and your aid application will never affect your chance of being admitted to Harvard. 100% need-based aid. We base aid awards on need, not on merit. This means that financial aid supports the students who will benefit from it the most. Furthermore, we meet 100 percent of our students' demonstrated financial need. We will work with you and your family one-on-one to help you navigate the options and make sure Harvard is an affordable option for your education. Revolutionary Financial Aid This preview video does not contain audio. Video description: Lucerito and her parents in their California home Watch \"Revolutionary Financial Aid\" ℹ︎ Video End of embedded content Determining Need Our financial aid officers will work closely with you and your family to determine your demonstrated need and your family’s expected contribution. For many families, this is between zero and 10 percent of family income. Because everyone's circumstances are unique, it's difficult to summarize the many financial aid options and policies that exist. The simplest way to put it is this: We want to make Harvard accessible and affordable for everyone who gets in—no matter what. Use our Net Price Calculator to quickly estimate your aid package and expected family contribution. You can also visit the MyInTuition Quick College Cost Estimator to see just how affordable an education can be at Harvard and other schools. FAQs about determining need Parent Contribution We determine parent contribution through a careful review of your family's income, assets, and overall financial circumstances. For families with annual incomes below $85,000 (increased from $75,000 beginning in the 2023-24 academic year), the expected contribution is zero. Families with annual incomes between $85,000 and $150,000 will contribute between 0 and 10 percent of their income. Those with incomes above $150,000 will be asked to pay proportionately more than 10 percent based on their circumstances. Families who have significant assets will be asked to pay more, but home equity and retirement assets are not considered in our assessment of financial need. Parents may provide their contribution from savings, current income, future income (through borrowing), or a combination of these methods. You can use our net price calculator to estimate your expected family contribution. Student Contribution As the primary beneficiary of a Harvard education, all students are expected to contribute to their college expenses. Your financial aid award will include a standard expected contribution from your own earnings. In the past, students were expected to contribute from both term-time and summer earnings; however, we have recently expanded our financial aid program by eliminating the summer work expectation for all students beginning in the 2020-21 academic year. Students are still expected to contribute a standard amount through term-time work to meet their estimated personal expenses. If you have savings or other assets, you will also be expected to contribute a small portion toward college expenses. This determination will be included with your financial aid award. Most students work to meet their student contribution, and jobs on campus are plentiful and varied. Visit our Guide to Student Employment for more information. Some students use outside awards or loans to replace their expected contribution. If you can't save up enough for your student contribution, the Harvard Loan program may be able to help. Unusual Family Circumstances We know that every family is different. Your financial circumstances are also unique. We are happy to work with you on an individual basis if you have complex, uncommon, or challenging financial circumstances that are not easily described in the standard aid application. We hope families discuss the cost of going to college and agree that paying for education is a priority, but we can't provide extra aid for students whose parents withdraw financial support. Similarly, we can't provide additional aid for families that have incurred large consumer debts. Please know that we will work with you and your family to make Harvard as affordable as possible. Contact the FAO to learn more. Net Price Calculator How affordable is Harvard? Use our Net Price Calculator and see for yourself. Net Price Calculator Cost of Attendance We know that paying for a private college education is a significant undertaking. Our goal is to make sure it remains manageable for you and your family. These values represent the full cost of a Harvard education before taking into account financial aid or scholarships, so the amount that your family will pay will likely be significantly lower. If you are eligible for aid, you may also receive an additional allowance for travel and personal expenses. You can use our Net Price Calculator to gain a better estimate of your personal cost of attendance. Tuition & Estimated Expenses 2024-2025 2024-2025 Cost of Attendance Tuition $56,550 Fees $5,126 Housing $12,922 Food $8,268 Subtotal - billed costs $82,866 Estimated personal expenses $2,500 Estimated books $1,000 Estimated transportation costs $0-$4,800 Total billed and unbilled costs $86,366-$91,166 In addition, health insurance is required at a cost of $4,202 (for 2024-25) unless you are covered under your family’s health plan. 2023-2024 2023-2024 Cost of Attendance Tuition $54,269 Fees $4,807 Housing $12,424 Food $7,950 Subtotal - billed costs $79,450 Estimated personal expenses $2,500 Estimated books $1,000 Estimated transportation costs $0-$4,500 Total billed and unbilled costs $82,950-$87,450 In addition, health insurance is required at a cost of $4,120 (for 2023-24) unless you are covered under your family’s health plan. 2022-2023 2022-2023 Cost of Attendance Tuition $52,659 Fees $4,602 Room $12,056 Board $7,446 Subtotal - billed costs $76,763 Estimated personal expenses (including $800-$1,000 for books) $3,500 Estimated travel costs $0-$4,150 Total billed and unbilled costs $80,263-$84,413 In addition, health insurance is required at a cost of $4,080 (for 2022-23) unless you are covered under your family’s health plan. History of Financial Aid Harvard’s long tradition of opportunity and access continues to be strengthened by the partnership and generosity of our amazing alumni and donor community. History of Financial Aid Types of Aid Financial aid is completely need-based and considers many factors, such as your family’s income, assets, size, and unusual expenses. There are no merit-based awards, and we have no preferential policies that give some students more attractive awards than others. When you qualify for financial aid from Harvard, we create an individualized aid package to meet all of your demonstrated need. This may include scholarship funds and student employment, as well as any scholarships you’ve earned from outside sources. Parent and student loans are also available for interested families, although we will never require you to take out loans. Learn more about types of aid Bills & Payments Your attention should be on your education, not your bill. We strive to make our billing and payment process as streamlined as possible. Learn more about bills and payments. Learn more about bills and payments Related Topics Prospective Students Find information on applying for financial aid as a first-year student. We're here to help. Types of Aid Your financial aid package is made up of a combination of scholarship (grant) funds, student employment, and any potential outside awards. Financial Aid Fact Sheet Get the facts about Harvard College's revolutionary financial aid program. Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification. Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Skip to site header Skip to main content"
}