{
  "id": 8,
  "date": "2024-05-18T18:24:11.132469",
  "url": "https://studentservices.fas.harvard.edu/",
  "university_name": "Harvard University",
  "title": "Welcome to Student Services!",
  "content": "Skip to main content Main Menu Utility Menu Search HARVARD.EDU GA4 tracking code Staff Directory About Welcome to Student Services! Supporting an equitable academic and residential experience across Harvard College, Harvard Griffin GSAS, and SEAS. About Student Services How we can help Accessibility Providing accommodations for students with disabilities in Harvard College, Harvard Griffin GSAS, and SEAS. Progress to Degree Supporting academic planning, student records, and enrollment for Harvard College, Harvard Griffin GSAS, and SEAS students. Undergraduate Campus Housing Providing housing assignments and managing housing policies for Harvard College students. Undergraduate Academic and Community Standards Promoting academic integrity and upholding community standards at Harvard College. Our Offices FAS Disability Access Office Visit Website FAS Registrar's Office Visit Website College Housing Office Visit Website College Office of Academic Integrity and Student Conduct Visit Website Our Partners Harvard Griffin GSAS Office of Student Services The Harvard Griffin GSAS Office of Student Services assists graduate students having academic or personal difficulties, manages student life programs, and provides support regarding sexual or gender-based harassment. Contact Harvard Griffin Student Services Staff Harvard Griffin GSAS Office of Residential Life The Harvard Griffin GSAS Office of Residential Life serves as the primary housing resource for Harvard Griffin GSAS students. Contact Harvard Griffin GSAS Residential Life staff Supporting Harvard College, Harvard Griffin GSAS, and SEAS CONTACT FAS Disability Access Office dao@fas.harvard.edu FAS Registrar's Office registrar@fas.harvard.edu College Housing collegehousing@fas.harvard.edu College Office of Academic Integrity and Student Conduct adboard@fas.harvard.edu honorcouncil@fas.harvard.edu Dean of Student Services deanburke@fas.harvard.edu LOCATION Smith Campus Center 1350 Massachusetts Avenue, 4th Floor Cambridge, MA 02138 121c94ef91d795121b88054a10c45274 Student Services CSS Styles Admin Login Copyright © 2024 The President and Fellows of Harvard College | Privacy | Accessibility | Digital Accessibility | Report Copyright Infringement"
}