{
  "id": 8,
  "date": "2024-05-18T18:24:00.969814",
  "url": "https://college.harvard.edu/admissions/apply/first-year-applicants",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public First-Year Applicants Breadcrumb Home - Admissions - Apply - First-Year Applicants On This Page: Overview First-Year Application Requirements Application Timeline Restrictive Early Action Mailing Your Application Overview Take the next step in your academic journey. We seek promising students who will contribute to the Harvard community during their college years, and to society throughout their lives. While academic accomplishment is important, the Admissions Committee considers many other factors—strong personal qualities, special talents or excellences of all kinds, perspectives formed by unusual personal circumstances, and the ability to take advantage of available resources and opportunities. First-Year Application Requirements All first-year applicants—both international and U.S. candidates—must complete the Common Application or Coalition Application by Scoir , along with the required supplements. You will need to submit: Common Application or apply Coalition, Powered by Scoir. This includes: Subsets of questions An activities list Personal essay ( Common Application prompts , Coalition Application prompts ) Harvard College Questions for the Common Application or Coalition Application Harvard supplement. There are five required short-answer questions with 200 word limits for each $85 fee (or request a fee waiver ) SAT or ACT - In exceptional cases when those tests are not accessible, one of the following can meet the requirement: AP exam results IB Actual or Predicted Scores GCSE/A-Level Actual or Predicted Results National Leaving Exams Results or Predictions AP or other examination results are not required, but may be submitted School Report (which includes a counselor letter) and high school transcript Teacher Recommendations (2) Midyear School Report (after your first semester grades) Final School Report (for admitted students only) View detailed application requirements Application Timeline You may apply to Harvard under either our Restrictive Early Action or our Regular Decision program, both of which allow you to compare admission and financial aid offers from other institutions and to wait until May 1 to make a final college choice. Your materials are due by the deadline for whichever round you choose; high school counselors may submit supporting materials up to a week after the deadline if necessary. Restrictive Early Action candidates apply by November 1 and receive notification by mid-December . Regular Decision candidates apply by January 1 and receive notification by the end of March . You are welcome to apply to Harvard using the Common Application which opens August 1, or the Coalition Application, Powered by Scoir, which opens August 15. First-year Timeline Questions View detailed application timeline Spring or Summer  (prior to the year you apply) Consider taking the following tests: SAT or ACT - Harvard requires the submission of standardized testing Fall (of the year you apply) As early in the fall as possible, please submit: Your online application to Harvard, via the Common Application or the Coalition Application, Powered by Scoir. This is needed to open your admissions file, track your documents, and set up a possible alumni interview. The $85 application fee or a fee waiver request . You may send the application supplements at a later date, preferably no later than 2 weeks after the application deadline. October 31 Restrictive Early Action applicants: We request that you submit your required test scores by the end of October. However, you are still eligible to apply using the November series as they should reach us in time for consideration. November 1 Restrictive Early Action applicants: Your portions of the application are due by November 1 at 11:59pm (your local time); high school counselors may submit supporting materials up to one week later if necessary. Also submit your financial aid application so that if you are admitted, we will be able to send you financial aid information in mid-December when decisions are released. Early November If you are applying Regular Decision, we recommend that you submit standardized test scores from the November series or earlier, though you may submit December scores (SAT) or February scores (ACT). Mid-December Restrictive Early Action applicants: Decisions released. January 1 Your portions of the application are due by January 1 at 11:59pm (your local time); high school counselors may submit supporting materials up to one week later if necessary. February 1 Notify the Admissions Office ( fileroom@fas.harvard.edu ) if you have not received your application confirmation email. Submit your financial aid application (if still pending), so that if you are admitted, we will be able to send you financial aid information in late March when decisions are released. Mid-February Request that your school submit your Midyear School Report forms with your most recent grades. End of March First-year admission decisions released. Early May Reply deadline for admitted students. No deposit required. How and when to submit ACT or SAT scores (for students submitting standardized test scores) You may self report your SAT and ACT test scores. Admitted students who decide to enroll at Harvard College and have submitted self-reported ACT or SAT test scores will be required to submit official test scores at the time of enrollment. If you are applying Restrictive Early Action, we would like your testing results by the end of October; however, you may submit the November series if needed. For Regular Decision, although it is possible to submit scores from tests taken as late as the February, we recommend that you submit testing as early as possible. You can afford Harvard In just a few minutes, you can get a personalized estimate of your Harvard scholarship with our Net Price Calculator. Net Price Calculator Restrictive Early Action Applying to Harvard under the Restrictive Early Action program empowers you to make a college choice early. Early applicants apply by November 1 and hear from us by mid-December. If your record and accomplishments have been consistently strong over time, Restrictive Early Action may be an attractive choice. You don’t have to commit to coming to Harvard, but you will learn earlier if it is an option for you. Consider if Restrictive Early Action is Right for You What is Restrictive Early Action? Harvard welcomes interested applicants to apply under our Restrictive Early Action plan by November 1 in order to be notified of a decision in mid-December. Restrictive Early Action is a non-binding early program, signifying that if admitted, you are not obligated to attend, and have until May 1 to reply to our offer of admission. IMPORTANT: If you are applying to Harvard under Restrictive Early Action, you may not apply to any other private institution under an Early Decision, Early Action, or Restrictive Early Action plan, or to a binding early program at a public university. You are welcome to apply early to any public university, military academy, or university outside of the United States under a non-binding program. Additionally, you are able to apply to other universities under their Regular Decision or Early Decision II programs. If your application is deferred in the early action round, you may apply to a binding early decision program at another college (i.e. Early Decision II). You may apply for scholarships or special academic programs with an early deadline at another institution, public or private, if the timing is proven to be a necessary aspect for consideration, and the outcome is non-binding. Harvard will meet the full financial need of admitted students regardless of whether they apply Restrictive Early Action or Regular Decision. Is it easier to be accepted if I apply Restrictive Early Action? Harvard does not offer an advantage to students who apply early. While admit rates tend to be higher in Restrictive Early Action, this reflects the remarkable strength of the applicant pool rather than a benefit of application timing. For any individual student, the final decision likely would be comparable whether the student applies Restrictive Early Action or Regular Decision. What are the benefits of applying Regular Decision? Regular Decision offers important practical advantages. You will have more time to edit and proofread your portions of the application, and more time for your teachers and counselors to become familiar with you before they write on your behalf. Your application may be strengthened by senior year extracurricular achievements, course selections, academic performance, or other important factors. Mailing Your Application Applications that are received in the mail will be treated equally by the Admissions Committee. However, applications submitted online are processed faster and allow your school officials to submit their part of your application online as well. Please choose one option only: either apply online or send an application through the mail.* *All application materials sent become the property of the Office of Admissions & Financial Aid. We will not be able to return any application materials as a result. Please do not mail valuable, personal, or original materials as a part of your application if you wish to keep your work. Printable First-Year Application Forms Click the links below to access the PDF application forms. First Year Application Teacher Evaluation Counselor Recommendation Other Recommendation Midyear Report School Report Homeschool Supplement to the School Report International Supplement to the School Report Final Report Optional Report Harvard Supplement Fee Waiver Where to mail your application Please mail your entire application to: Harvard College Admissions 86 Brattle Street Cambridge, MA 02138 USA Learn More About Harvard Join our email list to download our brochure and stay in touch. Sign Up Related Topics Application Requirements Here you'll find a detailed explanation of each requirement of the application, including teacher recommendations, test scores, and school reports. Apply For Financial Aid We strive to make our financial aid application as streamlined as possible. Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification. Toggle Admissions Submenu Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Skip to site header Skip to main content"
}