{
  "id": 8,
  "date": "2024-05-18T18:24:12.204889",
  "url": "https://apply.college.harvard.edu/portal/22-info-tour",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "This website uses scripting to enhance your browsing experience. Enable JavaScript in your browser and then reload this website. This website uses resources that are being blocked by your network. Contact your network administrator for more information. Skip to main content Harvard College Primary Navigation About Admissions Financial Aid Academics Life at Harvard On Campus Information Sessions & Tours We welcome you to attend a campus visit of Harvard College. A campus visit consists of a one hour information session with an admissions officer and 1-2 current undergraduate students, followed by a one hour campus tour led by a current undergraduate student. Please note that the visit schedule is typically posted one month prior to each semester. There will be no on-campus information sessions and tours on Harvard College holidays, during other college closures and on most school breaks. We will conduct visits during the summer months in June and July. During scheduled off-times, we encourage you to attend a virtual information session. Registration Instructions Registration for a campus visit is required . To sign up, please select an available date from the calendar below. Multiple events may pop up when you select an available date. Click on the event labeled \"On-Campus Visit\" at the time that works for you, and then complete the registration form on a new page. Once your registration is complete, we will be in touch via email with helpful information to plan your visit and visit reminders. If you arrive on campus without registering, a member of our visitor team will help you to determine your best options including providing information about a self-guided tour and helping you to register for an open tour date and time. If the on-campus sessions are full, here are a few options for you: Sign up for an online session here - this is a 1 hour live session with an admissions officer. Click here to do a self-paced virtual tour of Harvard's campus. If you are in the area, you may stop by our office at 5 James Street from 9am-5pm Monday to Friday (11am-5pm on Wednesdays) and pick up a self-guided tour map and ask questions of the Visitor Center staff. COVID-19 Precautions A negative COVID test is not required to participate in campus information sessions and tours, however all visitors and their guests must agree neither they nor their family members will attend an event if they have tested positive for COVID-19 in the past 10 days, been exposed to someone who has tested positive for COVID-19 in the past 10 days, or experienced symptoms of COVID-19 within 48 hours prior to the event. An email reminder will go out to all registered attendees 48 hours before the event. Group Visits/Tours Visiting parties are limited to groups of 5. For groups of 6 or more, please contact the Harvard University Visitor Center to arrange a visit. If you are interested in bringing a group of students from a high school, community based organization (CBO), or other college access group serving students traditionally underrepresented in higher education, we would like to work with you to accommodate this request. You can request a visit here . Important information for your visit Special Accommodations - there will be space on the registration form to request special accommodations. Please note that we require 21 days advance notice in order to secure ASL interpreters. We cannot provide interpreters for other languages at this current time. Those requesting the use of a wheelchair must leave a current driver’s license or state ID with our Visitor Center personnel until the chair is returned. Most buildings are closed to the public. Public restrooms will be available in the Elizabeth Cary Agassiz House before/after the information session, and at the end of the tour at Smith Campus Center. At this time, it is not possible to store luggage or other personal property during your visit. We apologize for any inconvenience this may cause, especially for families who have traveled long distances to join us. Your registration and attendance have no bearing on the admissions process should you decide to apply. Guests are not permitted to record any part of the information session and/or tour. On-Campus Visit Calendar & Registration Legend: Available Unavailable / Filled Not Scheduled Site Footer Social Links Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you."
}