{
  "id": 8,
  "date": "2024-05-18T18:24:04.592224",
  "url": "https://news.harvard.edu/gazette/story/2024/03/college-accepts-1937-to-class-of-2028-admissions/",
  "university_name": "Harvard University",
  "title": "Sections",
  "content": "Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy Menu Sections Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy Featured Topics Ultra-processed foods More aspirin Driver hubris Exposome Events Featured series Wondering A series of random questions answered by Harvard experts. Explore the Gazette Events Article archive About us News+ Podcast Read the latest ‘I haven’t really had a proper weekend in a long time’ Party like it’s 2020 Study of Psychedelics in Society and Culture announces funding recipients For Media & Journalists Athletics News & Scores Digital Accessibility Privacy Policy Trademark Search Search the Harvard Gazette Go Ultra-processed foods More aspirin Driver hubris Exposome Events File photo by Dylan Goodman Campus & Community College accepts 1,937 to Class of 2028 Students represent 94 countries, all 50 states March 28, 2024 4 min read Harvard College has accepted 1,937 students to the Class of 2028 from a pool of 54,008 applicants. This marks the fourth consecutive year Harvard has received more than 50,000 applications. Students accepted during the regular admissions cycle number 1,245. Last December, the College offered admissions to 692 students who applied under the Early Action Program . “Beyond another strong applicant pool, we are delighted by the stunning array of talents and lived experiences the Class of 2028 will bring with them from throughout the United States and around the world,” said William R. Fitzsimmons, dean of admissions and financial aid. By the numbers Nearly 1 in 4 Undergraduates come from a family whose annual income is $85,000 or less $2,000 “Start-up grants” for first-year students and “launch grants” for juniors are given to students whose family incomes are $85,000 or less $3 billion+ In undergraduate financial aid has been awarded since launching the Harvard Financial Aid Initiative 55% Of Harvard undergraduates receive financial aid $13,000 Average parent contribution for aided students Nearly 85% Of the Class of 2023 graduated debt-free Members of the Class of 2028, who learned of the decisions Thursday evening, hail from all 50 states, the District of Columbia, Puerto Rico, the U.S. Virgin Islands, and 94 countries. They are 53.1 percent women and 46.9 percent men. Students who will be in the first generation of their family to graduate from a four-year college or the equivalent represent 20.5 percent of the class. In this application cycle, 20.7 percent qualified for federal Pell grants, typically awarded to students from lower-income backgrounds. International students make up 15.4 percent of the class, and 9.6 percent are U.S. dual citizens. An estimated 20.1 percent come from the mid-Atlantic states, 16.2 percent from the South, 16.6 percent from New England, 18.5 percent from Western and Mountain states, 11.4 percent from the Midwest, and 0.4 percent from U.S. territories. Harvard continues efforts to recruit U.S. military veterans, working with groups affiliated with the Defense Department and through Service to School’s Vetlink program. Twenty-one veterans were admitted to the Class of 2028, and 41 students have expressed interest in ROTC. Members of the admitted class will benefit from the recent expansion of the financial aid program. Last spring , the Griffin Financial Aid Office announced that students whose family income is $85,000 or less will receive full financial support to attend Harvard. It also announced last fall a new launch grant giving students who receive full financial support $2,000 in the fall of their junior year to help with costs associated with preparing for life after graduation. Since 2016, students receiving full financial aid have been eligible for similar startup grants to help them adjust to life on campus. “We are always thinking about impact, and the new launch grant gives students extra resources — for graduate school test prep, or travel to a job interview — as they begin planning for their next chapters. This support — in combination with the work of the Mignone Center for Career Success — allows us to help the students who need it most,” said Jake Kaufmann, Griffin Director of Financial Aid. The work to expand opportunities for students accessing financial aid includes the 2020 decision to remove the summer work expectation. Nearly one-quarter of students attend Harvard with no parent contribution. In the 2023-2024 academic year, the average parent contribution for aided students was $13,000. For students who do not receive need-based aid, the total cost of attendance (including tuition, housing and food, and fees) is scheduled to increase 4.3 percent to $82,866 for the 2024-2025 academic year. This application cycle benefited from a robust recruitment effort that included students, faculty, staff, and alumni. Admissions officers traveled to 150 cities in the U.S. and around the world to conduct in-person information sessions while more than 7,000 alums helped interview applicants and recruit students through college fairs and other events. “We often focus on the end results in admissions, but it is also important to acknowledge the tremendous work that goes into getting us here,” said Director of Admissions Joy St. John. “We could not build this talented and diverse pool of applicants without this support.” Harvard welcomes admitted students to campus for Visitas programming April 14-15. At that time, the Class of 2028 is invited to attend classes and events as well as learn about resources and opportunities. Students will receive information about Visitas and Crimson Connect, an online platform for the Class of 2028, via the Admitted Student Website . Students have until May 1 to reply to their offers of admission. Share this article Share on Facebook Share on LinkedIn Email article Print/PDF You might like Campus & Community ‘I haven’t really had a proper weekend in a long time’ Longtime supporter of grads Kathy Hanley caps 13-year quest with a Commencement of her own Part of the Commencement 2024 series 5 min read Campus & Community Party like it’s 2020 Class of ’24 gets a do-over on high school prom that pandemic took away Part of the Commencement 2024 series 4 min read Campus & Community Study of Psychedelics in Society and Culture announces funding recipients Three major events, including Psychedelics Bootcamp 2024, to be hosted over summer 4 min read Trending Science & Tech Epic science inside a cubic millimeter of brain Researchers publish largest-ever dataset of neural connections 3 min read Campus & Community Finding right mix on campus speech policies Legal, political scholars discuss balancing personal safety, constitutional rights, academic freedom amid roiling protests, cultural shifts 5 min read Health Good genes are nice, but joy is better Harvard study, almost 80 years old, has proved that embracing community helps us live longer, and be happier 9 min read Sections Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy Explore the Gazette Events Article archive About us News+ Podcast Our recent series Fixing the Constitution Many analysts and citizens believe that the Constitution, more than 230 years old, is out of touch with contemporary America. We asked five scholars to isolate the problem they’d attack first. Life | Work A series focused on the personal side of Harvard research and teaching. Follow us on Instagram LinkedIn TikTok Facebook YouTube Email For Media & Journalists Athletics News & Scores Digital Accessibility Privacy Policy Trademark"
}