{
  "id": 8,
  "date": "2024-05-18T18:06:40.376296",
  "url": "https://registrar.fas.harvard.edu/student-information-privacy",
  "university_name": "Harvard University",
  "title": "Student Records and Privacy",
  "content": "Skip to main content Main Menu Utility Menu Search HARVARD.EDU GA4 Tracking Code - DO NOT REMOVE FAS Registration Forms Handbooks Reports Courses my.harvard Help Search Bar Calendars Learning Tuition and Fees Academic Programs Check-In Enrollment Cross-Registration Take Exams Records Student Records and Privacy Transcripts Degree/Enrollment Verification Placement and Standardized Exam Scores Data/Reporting Services Graduation Apply to Graduate Submit Your Dissertation Diplomas Honors Commencement Teaching Create Courses Sectioning Grading Administer Exams Academic Advising Report (AAR) Training and Documentation Spaces For Courses For Sections/Events For Student Organizations HOME / RECORDS / Student Records and Privacy What's on this page? About your student record Update your personal information Access your student record Family Educational Rights and Privacy Act (FERPA) Education records Directory information FERPA blocks Other disclosures permitted under FERPA Related forms Who is this for? Everyone About your student record All students have access to their own education records. You may contribute to your student record if you feel there is need for clarification. To be useful, your student record must be accurate and complete. The officials who maintain your student record are in charge of the functions reflected in the records and the offices where the records are kept. In FAS these officials include: FAS Registrar's Office Officers of the Graduate School of Arts and Sciences, Harvard College, and Faculty of Arts and Sciences Update your personal information The my.harvard student information system contains directory information for each student such as your: Name Address Phone number Email Emergency contact Missing person contact You can update this information at any time via my.harvard via the Personal Information tab. We highly recommend reviewing your personal information every 3 months. Learn how to update your personal information Access your student record In-person requests: Due to COVID-19, we will not accept in-person student record requests until further notice. If you would like to view your student record ( education records ), complete the appropriate step below based on your school or alumni status. You must indicate which records you would like to view in order for your form to be processed. Harvard College students Complete the Undergraduate Student Record Request form Send your completed form to fileviewing@fas.harvard.edu from your Harvard-issued (@college.harvard.edu) email address Once we receive your request, we will gather the appropriate records and give you access within 45 days of receiving your request GSAS students For access to your GSAS student record, please contact GSAS Student Affairs at studaff@fas.harvard.edu Alumni Complete the Alumni Student Record Request form Send your completed form to fileviewing@fas.harvard.edu from an email address on file with Harvard Alumni Affairs Once we receive your request, we will gather the appropriate records and give you access within 45 days of receiving your request Guidelines for viewing your student record When a record contains information about more than one student, the student requesting access may inspect and review only the portion of the record relating to them. You are not permitted to view letters and statements of recommendation to which you waived your right of access, or that were placed in your file before January 1, 1975. You should direct any questions you have about the accuracy of your education records to the person in charge of the office that maintains the records. If you still have questions, please contact the Associate Registrar for Operations, at registrar@fas.harvard.edu . If you are unable to resolve issues through informal communications, you may need to resolve challenges concerning the accuracy of records during a hearing. Family Educational Rights and Privacy Act (FERPA) The Family Educational Rights and Privacy Act of 1974, as amended (FERPA) is a federal law that gives students certain rights with respect to their education records. Note: As an institutional policy Harvard FAS does not offer a FERPA waiver form or parental release form for access to student information. Education Records We routinely maintain records that describe and document your work and progress as a student in the Faculty of Arts and Sciences. Your education records generally include information such as: Permanent and local addresses Admissions records Enrollment status Course grades Reports and evaluations Completion of requirements and progress toward the degree Records of disciplinary actions Letters of recommendation Directory Information Directory information is information that under FERPA can be made available to the general public. Faculty of Arts and Sciences Directory Information All FAS students have the following directory information in their record: Full name Reported date of birth Dates of attendance Concentration Class year Digitized image (please note that while Harvard classifies photos and images as directory information, these are rarely released to parties outside the University without your permission) Local or campus residence address and telephone number University email address Secondary school (for College students) Undergraduate college (for GSAS students) Hometown or city at the time you applied for admission Original class at time of matriculation Degree candidate status Date of graduation (actual or expected) Degree(s) received with field of concentration and level of honors granted (if any) Department of study University prizes, fellowships, and similar honors awarded In certain cases, your and your parents' or guardians' home addresses and telephone numbers Harvard College students may have additional directory information in their record including: House affiliation Height and weight (members of athletic teams only) Student employees, in certain circumstances, may have additional directory information in their record including: Job title Teaching appointment (if applicable) Employing department and dates of employment Harvard University Directory Information Please note that Harvard University's definition of directory information may include additional components and that University-level directory information requests may therefore include additional pieces of information. FERPA blocks You may prevent FAS from disclosing your directory information—this is called a FERPA block. If you would like to enable a FERPA block, you must inform the FAS Registrar's Office, ordinarily in person ( view business hours ). Possible consequences of enabling a FERPA block include: Missed mailings, messages, and announcements Not being able to verify your enrollment or degree status Not being included in the Harvard Commencement program If you have previously chosen to enable a FERPA block, you can reverse your decision by emailing the Registrar's Office at registrar@fas.harvard.edu . Other disclosures permitted under FERPA In addition to permitting the disclosure of directory information , FERPA allows FAS to disclose education records without your knowledge or consent under certain circumstances. For example, disclosure is permitted to Harvard officials with a legitimate educational interest in the records. This means that the person needs your information in order to fulfill their professional responsibilities including: including instructional, supervisory, advisory, administrative, academic or research, staff support or other duties. Harvard officials include: Faculty Administrators Clerical employees Professional employees Harvard University Health Services staff members Harvard University Police Department officers Agents of the University, such as independent contractors or vendors performing functions on behalf of FAS or the University Members of Harvard's governing boards Students serving on an official FAS, College, GSAS or University committee, or assisting other Harvard officials in performing their tasks Your education record also may be shared with parties outside the University under certain conditions, including, for example, in situations involving a health and safety emergency. Additionally, the FAS Registrar's Office will forward your education records to other agencies or institutions that have requested your records and in which the student seeks or intends to enroll or is already enrolled so long as the disclosure is for purposes related to your enrollment or a transfer to another institution. If either Harvard College or the Graduate School of Arts and Sciences finds that you have committed a disciplinary violation involving a crime of violence or a non-forcible sex offense, then FAS also may, if legally permitted and appropriate in the judgment of Harvard College or the Graduate School of Arts and Sciences, disclose certain information about the disciplinary case. The disclosure may include: Your name Violation committed Sanction imposed Student rights under FERPA Under both Harvard policy and FERPA, as a student or former student you may inspect and review certain components of your education records maintained by Harvard. You may: Exercise limited control over other people's access to your education records Seek to correct your education records if you believe them to be inaccurate, misleading or otherwise in violation of your FERPA rights File a complaint with the U.S. Department of Education if you believe Harvard has not complied with the requirements of FERPA Be fully informed of your rights under FERPA Complaints regarding alleged violation of rights of students under FERPA may be submitted in writing within 180 days to the Family Policy Compliance Office, US Department of Education, 400 Maryland Avenue, S.W., Washington, DC 20202-5920. Related Forms Biographical Information Update Request Make changes or corrections to the name, gender and/or marital status listed in your student record Record Request Form – Current Students Request to view your student file. (Harvard Griffin GSAS students should contact the Harvard Griffin GSAS Office of Student Affairs.) Application for Part-Time Study All student record forms Need Assistance? Student Data and Privacy Support Email : registrar@fas.harvard.edu with student record or FERPA questions Email : fileviewing@fas.harvard.edu to submit your Student Record Request Form Resources U.S. Department of Education – About FERPA Current student Record Request Form (PDF) Records Student Records and Privacy Transcripts Degree/Enrollment Verification Placement and Standardized Exam Scores Data/Reporting Services Website Problem Tab Report Website Problem Faculty of Arts and Sciences Registrar's Office Smith Campus Center 1350 Massachusetts Avenue, Suite 450 Cambridge, MA 02138 Tel: 617-495-1543 Fax: 617-495-0815 Virtual office hours 10:00am-12:00pm ET, on Mondays, Tuesdays, Thursdays, and Fridays About the FAS Registrar's Office Who We Are Contact Us Message Center Academic Calendars Handbooks Forms Reports People Information For Alumni Instructors Staff Students Find your Registrar's Office If you are not enrolled or teaching in the Faculty of Arts and Sciences, please contact the Registrar's Office for your school. Access list of Harvard Registrars JavaScript CSS Styles Admin Login Copyright © 2024 The President and Fellows of Harvard College | Privacy | Accessibility | Digital Accessibility | Report Copyright Infringement"
}