{
  "id": 8,
  "date": "2024-05-18T18:24:17.298694",
  "url": "https://oue.fas.harvard.edu/",
  "university_name": "Harvard University",
  "title": "Welcome to the Office of Undergraduate Education",
  "content": "Skip to main content Main Menu Utility Menu Search HARVARD.EDU Teaching at FAS Apply to Harvard Harvard College Registrar Search HOME Academics College Curriculum General Education Divisional Distribution Quantitative Reasoning with Data Expository Writing Language Requirement Academic Integrity at Harvard College Certificate for Civic Engagement Getting Started Concurrent Masters Experiential Study Independent Study Placement Exams Harvard College Rising Scholars Program Awards, Prizes, and Events Co-Curriculars Faculty-Student Engagement Classroom to Table Internship and Career Planning Research and Fellowships Study Abroad Summer Funding Policy Additional Resources Support Resources For Faculty & Staff Start of Term Information Teaching and Learning Support Teaching Resources for Faculty Teaching and Learning Support Academic Field Trips AI Guidance & FAQs Mid-Semester Feedback Welcoming Visitors to Courses Instructional Support Communications and Resources Section Allocation Tool Trainings and Meetings for Administrative Staff Instructional Lunch Fund Academic Policy & Handbooks for Faculty and Students Funding for Teaching Course Innovation Funds PIFIE Resources for Concentrations Climate in the Curriculum Retreat Derek Bok Center for Teaching and Learning About People Affiliated Offices Communications Welcome to the Office of Undergraduate Education Faculty Key Dates for Fall 2023 Course Registration Process Find key dates for the Fall 2023 Course Registration Process . For the full academic calendar, please see the Registrar's site. Faculty Resources Updated health and safety guidelines for faculty and instructors. Find answers to questions and resources related to in-person teaching and instruction for the 2023-2024 academic year. Simultaneous Course Enrollment New Policy going into effect fall 2021. (FAS Voted March 2020) College Events Calendar : Visit the calendar for academic, academic support, and social events throughout the year. Additional Resources First-Year Guide to Fall Registration : A calendar guide for incoming Harvard students with key registration dates and answers to frequently asked questions about Gen Ed, Expos, First-Year Seminars, and Hum 10. Course Preview Period and Course Registration : Information on the FAS Registrar's Office website for Harvard College students regarding course registration. View the Course Exploration and Registration Guide . Course innovation funds : Information about the proposal process and deadline for projects in pedagogy, course design, and undergraduate education. Academic Calendar : View the 2023-24 academic calendar for Harvard College. Practical Steps to Follow in Case of Classroom Disruption Office of Undergraduate Education Harvard College University Hall North Cambridge, MA 02138 Phone: 617-495-0450 Email: oue@fas.harvard.edu Quick Links Academic Calendar College Events Calendar FAS Registrar's Office Dean of Students Office Program in General Education Student Handbook Admin Login Copyright © 2024 The President and Fellows of Harvard College | Accessibility | Digital Accessibility | Report Copyright Infringement"
}