{
  "id": 8,
  "date": "2024-05-18T18:24:09.739954",
  "url": "https://www.harvard.edu/privacy-statement/",
  "university_name": "Harvard University",
  "title": "Privacy statement",
  "content": "Skip to main content Harvard University Search Search Quick Links Find a Person A to Z index Menu Academics Academics Academics Learning at Harvard can happen for every type of learner, at any phase of life. Degree programs Academics Degree programs Browse all of our undergraduate concentrations and  graduate degrees. Undergraduate Degrees Graduate Degrees Other Professional and Lifelong Learning Harvard Online Harvard Schools Academics Visit each School for information on admissions and financial aid. Explore more Harvard College Harvard Business School Harvard Division of Continuing Education Harvard Divinity School Harvard Faculty of Arts and Sciences Harvard Kenneth C. Griffin Graduate School of Arts and Sciences Harvard Graduate School of Design Harvard Graduate School of Education Harvard John A. Paulson School of Engineering and Applied Sciences Harvard Kennedy School Harvard Law School Harvard Medical School Harvard Radcliffe Institute Harvard School of Dental Medicine Harvard T.H. Chan School of Public Health Campus Campus Harvard's Campus Get tickets to our next game, hours and locations for our libraries and museums, and information about your next career move. Libraries Campus Explore our libraries Arnold Arboretum Horticultural Library Baker Library and Special Collections Biblioteca Berenson Botany Libraries Cabot Science Library Countway Library Dumbarton Oaks Research Library Ernst Mayr Library Fine Arts Library Frances Loeb Library Fung Library Gutman Library Harvard Divinity School Library Harvard Film Archive Harvard Law School Library Harvard Map Collection Harvard University Archives Harvard-Yenching Library HKS Library and Knowledge Services Houghton Library Lamont Library Loeb Music Library Robbins Library of Philosophy Schlesinger Library on the History of Women in America Tozzer Library Widener Library Woodberry Poetry Room Museums Campus Explore our museums The Arnold Arboretum Carpenter Center for the Visual Arts Collection of Historical Scientific Instruments Graduate School of Design Exhibitions Harvard Art Museums Harvard Forest Harvard Museum of Natural History The Harvard Museum of the Ancient Near East Harvard Museums of Science and Culture Harvard University Herbaria Mineralogical and Geological Museum Museum of Comparative Zoology The Peabody Museum of Archaeology and Ethnology Warren Anatomical Museum Athletics Work at Harvard Events Commencement In Focus In Focus Explore and understand the world with Harvard In Focus is a curated examination of Harvard's research, scholarly work, and community. Recent topics include: Commencement 2024 In Focus Celebrating the Class of 2024 Join the celebration for Harvard University’s 373rd Commencement and explore the amazing scholarship of our graduates. Explore the ceremony and our graduates What's inside? Meet the Class of 2024 Learn about Commencement speaker Maria Ressa Climate Solutions In Focus Climate Solutions Faculty and students from across the Harvard community are working on ways to address climate change and its effects. Explore the solutions What's inside? Tracking methane from space The \"Harvard Thinking\" podcast explores climate change Space In Focus Space Harvard researchers are asking the big questions about the universe, building tools to answer them, and sharing their discoveries with the world. Travel the stars What's inside? What is a solar eclipse? Who were the women of Harvard's early astronomical research? Explore the In Focus archives Visit Visit Visit Harvard Ideas and assistance for your trip to our campus. Tours Maps and directions Tour Providers About About About Harvard Learn how Harvard is structured, explore our long history, and discover our extended community. History of Harvard About History of Harvard Harvard is perhaps best-known because of its enduring history of innovation in education. But even die-hard Harvard buffs are not likely to know all of these Harvard firsts and historical snippets. Learn more History timeline Nobel Laureates Honorary Degrees Harvard shields Leadership and governance About Learn about our Leadership President Officers and Deans Harvard Corporation Board of Overseers University Professorships Diversity and Inclusion Endowment Harvard in the Community Harvard in the World News News The Harvard Gazette Official news from Harvard University about science, medicine, art, campus life, University issues, and broader national and global concerns. Trending News Stories News Read more news Epic science inside a cubic millimeter of brain Researchers publish largest-ever dataset of neural connections Finding right mix on campus speech policies Legal, political scholars discuss balancing personal safety, constitutional rights, academic freedom amid roiling protests, cultural shifts Good genes are nice, but joy is better Harvard study, almost 80 years old, has proved that embracing community helps us live longer, and be happier Sign up for the Daily Gazette Navigation Quick Links A to Z index Find a Person Events Media Relations Alumni Give Now Emergency Harvard University Close Privacy statement This Privacy Policy discloses the privacy practices for www.harvard.edu, the main Harvard University website. Please note that Harvard Schools, Centers, and other Harvard units and affiliates have separate privacy policies. By using this website, you are consenting to our collection and use of information in accordance with this Privacy Policy. What information do we gather about you? We and our third-party vendors collect certain information regarding your use of www.harvard.edu, such as your IP address and browser type. Your session and the pages you visit on www.harvard.edu will be tracked, but you will remain anonymous. We may use your IP address to identify the general geographic area from which you are accessing Harvard.edu. We connect data from different systems but do not link IP addresses to any personal information. We may also collect other information as described in this policy. What do we use your information for? We use the information we gather from you for systems administration purposes, abuse prevention, and to track user trends, and for the other purposes described in this policy. If you send us an email, the email address you provide may be used to send you information, respond to inquiries, and/or other requests or questions. We will not share, sell, rent, swap, or authorize any third party to use your email address for commercial purposes without your permission. User information may be shared with third-party vendors to the extent necessary to provide and improve web services or other communications to users. For example, we use third parties such as Chartbeat and Google Analytics to generate reports on site usage, web traffic, user behavior, and user interests in order to optimize our website for our visitors. We also use geographic, demographic, and interest-based reports of our website visitors to create custom audience lists. We prohibit any third parties who receive user information for this purpose from using or sharing user information for any purpose other than providing services for the benefit of our users. We may also provide your information to third parties in circumstances where we believe that doing so is necessary or appropriate to satisfy any applicable law, regulation, legal process or governmental request; detect, prevent or otherwise address fraud, security, or technical issues; or protect our rights and safety and the rights and safety of our users or others. How is this information collected and how can you opt out? Google and other third parties may use cookies, web beacons, and similar technologies to collect or receive information from this website and elsewhere on the internet and use that information to provide measurement services and target ads. For more information on Google Analytics, consult their terms of use , privacy practices , and ads settings . You can opt out of the collection and use of this information through tools like the Network Advertising Initiative opt-out page . Cookies Cookies are small files that are stored on your computer (unless you block them). We use cookies to understand and save your preferences for future visits and compile aggregate data about site traffic and site interaction so that we can offer better site experiences and tools in the future. You may disable cookies through your individual browser options or you can opt out of the collection and use of this information through tools like the Network Advertising Initiative opt-out page . Other websites and cookies This website may contain links to other websites. We are not responsible for the privacy practices or the content of such websites. Cookies may be set by parties other than us. These “third-party cookies” may, for example, originate from websites such as YouTube, Twitter, Facebook, Soundcloud, or other social media services for which www.harvard.edu has implemented “plug-ins.” Since the cookie policies of these sites change over time, you should determine their policies by visiting the privacy policy pages of these sites directly. Information protection This site has reasonable security measures in place to help protect against the loss, misuse, and alteration of the information under our control. However, no method of transmission over the Internet or method of electronic storage is 100% secure. Users located outside the United States of America If you are located in a country outside of the United States which has enacted a personal data protection law, please click here for additional privacy disclosures that may apply to you. Changes to this policy This Privacy Policy may be amended from time to time. Any such changes will be posted on this page. Effective date The effective date of this policy is September 7, 2022. Security & Brand Report Copyright Infringement Report Security Issue Trademark Notice Website Accessibility Digital Accessibility Privacy statement Get In Touch Contact Harvard Maps & Directions Jobs © 2024 The President and Fellows of Harvard College Instagram TikTok LinkedIn Facebook YouTube"
}