{
  "id": 8,
  "date": "2024-05-18T18:23:59.597316",
  "url": "https://college.harvard.edu/admissions/apply/transfer-applicants",
  "university_name": "Harvard University",
  "title": "Primary Navigation",
  "content": "Skip to main content Primary Navigation About About Overview Mission, Vision, & History Mission, Vision, & History Submenu History of Financial Aid Dean Rakesh Khurana Dean Rakesh Khurana Submenu Messages to Students Messages to Parents & Families Dean's Office Staff Campus Campus Submenu Campus Spotlights College Offices News & Announcements Admissions Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Financial Aid Financial Aid Overview Net Price Calculator Net Price Calculator Submenu Calculadora de precios netos How Aid Works How Aid Works Submenu Types of Aid Bills & Payments Apply For Financial Aid Apply For Financial Aid Submenu Prospective Students Current Students Financial Aid Forms Additional Funding & Procedures Additional Funding & Procedures Submenu Managing Your Aid Study Abroad Summer School Federal Disclosures Academics Academics Overview Liberal Arts & Sciences Liberal Arts & Sciences Submenu Concentrations Dual Programs of Study for Music Study Abroad Faculty Faculty Submenu Faculty Spotlights Research Advising Student Life Student Life Overview Student Life Overview Submenu Events Residential Life Residential Life Submenu Cambridge & Boston Student Activities Student Activities Submenu Leadership & Service Traditions Athletics Health & Wellbeing Diversity & Inclusion Student Stories Student Stories Submenu Meet Our Students Alumni Profiles Menu and Search Guides Guides Search Search Close Menu, Guides, and Resources Menu, Guides, and Resources Menu About Toggle About Submenu About Overview Mission, Vision, & History Dean Rakesh Khurana Campus College Offices News & Announcements Admissions Toggle Admissions Submenu Admissions Overview Why Harvard Explore Harvard Apply Financial Aid Toggle Financial Aid Submenu Financial Aid Overview Net Price Calculator How Aid Works Apply For Financial Aid Additional Funding & Procedures Federal Disclosures Academics Toggle Academics Submenu Academics Overview Liberal Arts & Sciences Faculty Research Advising Student Life Toggle Student Life Submenu Student Life Overview Residential Life Student Activities Athletics Health & Wellbeing Diversity & Inclusion Student Stories Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please click here for additional information about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Guides Application Tips Navigating Campus Preparing for College How to Complete the FAFSA What to Expect After You Apply View All Guides Resources FAQs Parents & Families Alumni School Counselors Información en Español Undergraduate Viewbook View All Resources Close Search and Useful Links Search the site Search * Search Search Suggestions Top Searched Tuition Majors Courses Scholarships Sports International Students Transfer Common Questions What is the difference between Harvard College and Harvard University? What is a \"liberal arts & sciences\" education? Paying the admissions application fee is a hardship for my family. Can I get a waiver? Can I self-report my test scores? Helpful Links FAQs Applicant Portal Events Contact Us my.harvard Alert: Harvard Yard Closed to the Public Please note, Harvard Yard gates are currently closed. Entry will be permitted to those with a Harvard ID only. Last Updated: May 03, 11:02am Close Alert Open Alert: Harvard Yard Closed to the Public Transfer Applicants Breadcrumb Home - Admissions - Apply - Transfer Applicants On This Page: Overview About Our Transfer Program Eligibility What We Look For Timeline Application Requirements Transferring Course Credit Contacting Transfer Admissions Overview Each year, we accept a small group of exceptional students to transfer to Harvard College from other similar liberal arts programs. U.S. Military veterans may be particularly interested in our transfer program if they've completed at least one full academic year, and not more than two, of college coursework. Transfer FAQs Do transfer students qualify for financial aid? Yes. All transfer applicants, including international students, are eligible to apply for need-based financial aid. Transfer applicants should follow the prospective student financial aid application instructions. How are transfer students supported on campus? Enrolling students take part in a fall orientation program and are connected with a dedicated transfer adviser who helps with academic planning and the transition to Harvard life. Transfer students who live on-campus will find strong community in their undergraduate Houses, and students who live off campus will benefit from the Dudley Community. Transfer students are also supported by peer advisers , who were themselves transfer students from prior years. What courses transfer to Harvard College? Is there a list of transferrable courses? The Harvard College Registrar's Office grants credit for work done at another college or university to each admitted transfer student on an individual basis after careful evaluation. The admissions office does not keep a list of transferrable courses and cannot advise on this matter during the application process. Harvard College typically accepts courses taken while enrolled as a full-time student in an undergraduate program similar to our liberal arts curriculum. The Committee also looks for strong preparation in the student's expected field of specialization. Can I concentrate in business, journalism, law, or medicine? While you can take courses related to these fields, Harvard's academic programs are not pre-professional, in that they do not provide vocational training. Many Harvard graduates plan to continue their education in professional or graduate schools, often in these fields. Please note that both medicine and law are postgraduate programs in the United States. If you are not a U.S. citizen but wish to continue your education in a professional program, particularly in an American medical school, we advise you to consult specific graduate and professional programs in advance to understand those schools' admissions and financial aid policies concerning international students. I am an international prospective transfer student. What is the transfer application process for me? The application process and requirements are exactly the same for international students. Our financial aid program also applies to all applicants regardless of nationality or citizenship. For more information, you can view all of the transfer application requirements here . About Our Transfer Program Each fall, we welcome a very small number (12 on average) of transfer students to Harvard College. We seek students whose previous academic experience will prepare them to flourish in our rigorous and rewarding liberal arts program. In our candidates for transfer admission, we look for: A clearly defined academic need to transfer A proven record of achievement at your current institution Strong faculty recommendations Recently, we have received more than 1,500 transfer applications per year. In pools of this size, the number of well-qualified applicants far exceeded the number of students admitted and enrolled each year as transfer students. As admission to transfer to Harvard is competitive, we encourage you to explore a variety of colleges in your transfer search. Eligibility To be eligible to transfer, you must have completed at least one continuous academic year in a full-time degree program at one college, and not more than two academic years, by the time you would be enrolling at Harvard . You must complete at least two full years of study at Harvard. Once a student has completed more than two years total of college at another institution, regardless of courses taken, that student is no longer eligible for transfer admission. Students are eligible to transfer only from a liberal arts curriculum that is similar to Harvard’s. Candidates whose education has been in a vocational, professional, technical, online, extension, or performance program will not ordinarily qualify for transfer admission. Students who have completed one full-time year of college in a regular degree program in lieu of their senior year of high school (often referred to as dual enrollment) should apply for first-year admission if these courses are taken for credit towards a high school diploma. Students who are enrolled part-time are not eligible unless they have previously completed one full-time, continuous academic year. If you are too advanced in your studies to qualify for transfer, you may be interested in the Visiting Undergraduate Student Program. No student with a bachelor's degree or other first university degree from any other university, whether American or foreign, is eligible for admission to Harvard College. Students interested in continuing their studies beyond the bachelor's degree might wish to consider one of the 12 Harvard University graduate schools . The Harvard College Admissions Office is independent of these schools and their admissions policies. Take a Virtual Tour Use our Virtual Tour to discover spaces that aren't even available on an in-person campus tour, such as classrooms, laboratories, residence halls, and more. Explore Harvard What We Look For Through our admissions process, we strive to give you ample opportunities to best demonstrate your interests and accomplishments. We welcome candidates who have gone directly from high school into college as well as those who have followed less traditional paths. The Admissions Committee looks for achievement in a rigorous program of study, especially in your expected field of specialization. Beyond strong grades, test scores, and recommendations, the Committee considers other non-academic factors such as significant extracurricular engagements and talents. We also consider an applicant’s personal qualities such as a capacity for leadership, creativity, resiliency, intellectual curiosity, and independent thinking. In addition to our standard application materials, you may submit supplementary materials showcasing exceptional or unusual talents, including musical performance, artistic work, and research material. Learn more about what we look for Timeline Harvard accepts transfer students for fall semester entrance only; we do not admit students for the spring semester. The transfer application becomes available during the fall of the academic year. March 1 : Deadline for all transfer application and financial aid materials. The Transfer Admissions Committee begins to review applications after the application deadline. We will notify applicants of admissions decisions in June. Submitting your materials early does not increase your chances of admission, but it does provide more opportunities to track down any missing documents and ensure that your application is full and complete by the time we begin our review. Please note that college transcripts should be sent between January and March in order to reflect your most updated academic credentials. From the service to school Veteran transfer students from community colleges make Harvard home Read the full story in the Gazette Application Requirements Transfer Application from the Coalition Application, Powered by Scoir , or Common Application . Harvard College Questions and Writing Supplement for the Common Application $85 fee (or request a fee waiver by sending an email to adm-tran@fas.harvard.edu ) Standardized testing*: The SAT or ACT is required of all transfer applicants. In exceptional cases, when those are not accessible for a student, one of the following can meet the requirement: AP exam results IB Actual or Predicted Scores GCSE/A-Level Actual or Predicted Results National Leaving Exams Results or Predictions College/Dean’s/Registrar’s report Official College Transcript College Instructor Recommendations (2) Official High School Transcript * If you have applied to Harvard in the past, we will have access to your previous application in our review process including any scores that you submitted with earlier applications. Test scores can be particularly helpful for non-traditional students. We encourage non-traditional students to submit an exam taken within three years of applying for transfer to reflect current academic ability. Self-reported scores are acceptable during the application process; official scores are required of enrolling students. View detailed application requirements Printable Transfer Application Forms All applications are treated equally, whether they are received in the mail or online. However, applications submitted online are processed faster and allow your school officials to submit their part of your application online as well. Please choose one option only: either apply online or send an application through the mail. Please note that you can only download and print the following forms - you will not be able to complete them electronically. College Report (often completed by the Registrar’s Office; formerly called Registrar’s or Dean’s Report) Harvard Transfer Supplement Midterm Report (Optional) Instructions for Submitting Required Materials Submitting the College Report (required), High School Transcripts (required) or Midterm Report (not required) By mail: Harvard College Admissions and Griffin Financial Aid Office Attn: Undergraduate Transfer Admissions 86 Brattle Street Cambridge, MA 02138 By fax: 1 (617) 495-8821 Please address documents to the attention of the Transfer Admissions team. If you are faxing internationally, make sure to check if there is any additional number you need to input prior to dialing 1 (617) 495-8821. If your school official is not able to submit materials in these ways, they may send them to us as PDFs at adm-tran@fas.harvard.edu . Please request that your school official include your name and application number in the subject line of the email for easier processing. They must send the document(s) from their official institutional email account (if they have one). Submitting College Transcripts By electronic credential exchange network (PREFERRED METHOD): If your college is a member of the following electronic credential exchange networks, please make every effort to send your college transcript through these secure channels: National Student Clearinghouse Parchment Scrip-Safe Naviance Network By mail: Harvard College Admissions and Griffin Financial Aid Office Attn: Undergraduate Transfer Admissions 86 Brattle Street Cambridge, MA 02138 If your school official is not able to submit materials in these ways, they may send them to us as PDFs at adm-tran@fas.harvard.edu . Please request that your school official include your name and application number in the subject line of the email for easier processing. They must send the document(s) from their official institutional email account (if they have one). Transferring Course Credit Harvard will honor comparable coursework you have done prior to your transfer admission, while also giving you time to take advantage of Harvard’s course offerings and delve deeply into your concentration. You will be allowed to transfer in a maximum of 16 semester-long courses—the equivalent of two full years of academic work—providing you the opportunity to take the remaining half of the courses required for your A.B. or S.B. degree at Harvard. The Harvard College Registrar’s Office grants credit for work done at another college or university to each admitted transfer student on an individual basis after careful evaluation. While Harvard does not audit transcripts prior to application to determine eligibility, the descriptions below should be helpful in determining which of your courses may transfer. Our office is unable to make recommendations in regards to coursework at your current institution or advise on anticipated class standing during the application process. Which courses are eligible for credit? You may receive credit for courses taken in a full-time, daytime program of study at an accredited degree-granting institution, provided that you: Took courses comparable to those offered in Harvard’s liberal arts curriculum. Earned grades of “C” (or the equivalent) or better Which courses are not eligible for credit? Unfortunately, we are unable to grant credit for certain accomplishments. Harvard does not typically award credit for: Online or distance education courses Night or extension courses Courses taken on a part-time basis Technical or vocational courses such as accounting, marketing, journalism, law, agriculture, nursing, business, communications or specialized military training coursework Dual-enrollment courses counted for credit toward a high school diploma Work done prior to admission in an isolated term, semester or quarter at another college, unless the college from which you are transferring has granted credit for that work Credit gained by accelerating in an academic year at another college College Level Placement Exam (CLEP), Advanced Placement Exam (AP/IB) results, or any credit earned by examination, even when credited to your degree by the college or university from which you wish to transfer Summer school courses, except for those at your current college/university or courses at Harvard Summer School Contacting Transfer Admissions The Transfer Admissions team will be available to answer questions by email at adm-tran@fas.harvard.edu Monday through Friday between the hours of 9am and 5pm ET. Email Transfer Admissions Related Topics Application Tips Not sure how to fill out the admissions application to Harvard? Here are some helpful tips from our admissions committee. Application Requirements Here you'll find a detailed explanation of each requirement of the application, including teacher recommendations, test scores, and school reports. Advising Your advisors can help you you plan your degree program or take advantage of unique academic opportunities such as study abroad. Site Footer Helpful Links Frequently Asked Questions Applicant Portal Admitted Students Contact Us My.Harvard University Resources Academic Calendar Campus Map Dean of Students Office Directory Office of Undergraduate Education Office of Student Services Important Addresses Harvard College University Hall Cambridge, MA 02138 Harvard College Admissions Office and Griffin Financial Aid Office 86 Brattle Street Cambridge, MA 02138 Social Links TikTok Twitter Facebook Instagram Youtube Legal Links Privacy Copyright Disclosure Accessibility Digital Accessibility Copyright © 2024 The President & Fellows of Harvard College Harvard College If you are located in the European Union, Iceland, Liechtenstein or Norway (the “European Economic Area”), please read the Additional EEA Privacy Disclosures about ways that certain Harvard University Schools, Centers, units and controlled entities, including this one, may collect, use, and share information about you. Harvard does not discriminate against applicants or students on the basis of race, color, national origin, ancestry or any other protected classification. Toggle Admissions Submenu Admissions Overview Admissions Overview Submenu Admissions Statistics Why Harvard Why Harvard Submenu Affordability Academic Environment Residential Life Innovation Arts & Humanities Student Activities Diversity and Access Explore Harvard Explore Harvard Submenu On-Campus Visits Meet Us Online Virtual Tour Connect With Students Apply Apply Submenu First-Year Applicants Considering a Gap Year Application Requirements Transfer Applicants U.S. Military Veterans Visiting Undergraduate Students International Applicants Skip to site header Skip to main content"
}