{
  "id": 8,
  "date": "2024-05-18T18:24:08.669569",
  "url": "https://dmca.harvard.edu/annual-copyright-disclosure",
  "university_name": "Harvard University",
  "title": "",
  "content": "Skip to main content Main Menu Utility Menu Search HARVARD.EDU FAQs Contact Digital Millennium Copyright Act Overview University Advisory Contact Copyright Policy Enforcement Annual Disclosure Legal Alternatives Related Policies DMCA Compliance Policy for Staff Search HOME / Annual Copyright Disclosure Harvard University is committed to maintaining the integrity and availability of the Harvard network for the vital educational and research purposes for which it was designed and prohibits the use of its network to violate the law, including the U.S. Copyright Act. The unauthorized distribution of copyrighted material, including unauthorized peer-to-peer file sharing, violates the Copyright Act and may subject you to civil and criminal liabilities. Penalties for copyright infringement include civil and criminal penalties. In general, anyone found liable for civil copyright infringement may be ordered to pay either actual damages or \"statutory\" damages affixed at not less than $750 and not more than $30,000 per work infringed. For \"willful\" infringement, a court may award up to $150,000 per work infringed. A court can, in its discretion, also assess costs and attorneys' fees. For details, see Title 17, United States Code, Sections 504, 505. Willful copyright infringement can also result in criminal penalties, including imprisonment of up to ten years and a fine of $250,000 for an individual. For more information, please see the Web site of the U.S. Copyright Office at www.copyright.gov , especially their FAQ's at www.copyright.gov/help/faq . http://ifap.ed.gov/ . Harvard complies fully with the Digital Millennium Copyright Act (\"DMCA\"). Users of the Harvard network found to have engaged in repeated infringement of copyright are subject to termination of their network access and may be reported to the appropriate Dean or Human Resources officer for disciplinary action. Find Harvard's policy , or review the FAQ's . A paper copy of this notice is available upon request by contacting dmca@harvard.edu . For printable version, click below: annual_copyright_notice.pdf 4.46 MB Digital Millennium Copyright Act Questions or concerns? Please contact: dmca@harvard.edu Overview University Advisory Contact Copyright Policy Policy Enforcement Annual Copyright Disclosure Legal Alternatives Related Policies DMCA Compliance Policy for Staff Frequently Asked Questions 7903ca7a0ccd9f7395062ed32397b6f3 df8d55c536f5a623666bae38c95b1ebc Admin Login Copyright © 2024 The President and Fellows of Harvard College | Privacy | Accessibility | Digital Accessibility | Report Copyright Infringement"
}