{
  "id": 9,
  "date": "2024-05-18T18:20:35.288762",
  "url": "https://ed.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Improving lives through learning",
  "content": "Skip to content Skip to navigation Future Students Current Students Faculty/Staff Alumni Careers Enter your keywords for search News Directory Events Give Toggle navigation Enter your keywords for search Programs & Degrees Admissions & Aid Faculty & Research About Future Students Current Students Faculty/Staff Alumni Careers News Directory Events Give Together,\n        we are Improving lives through learning Learn\n      More You are here Home Home Stanford Graduate School of Education is dedicated to solving education's greatest challenges. Through rigorous research, model training programs and partnerships with educators worldwide, we're pursuing equitable, accessible and effective learning for all. Our Vision Programs We offer undergraduate, MA, PhD and professional learning programs Learn how to apply Doctoral Develop expertise and produce relevant research that improves understanding, policies and practice. Master's Advance your knowledge and skills to become a leading agent for positive change in classrooms and beyond. Undergraduate Engage in a vibrant learning community centered on scholarship that improves lives. Professional Grow your career with high-quality programs online and on-campus. Faculty Our multidisciplinary faculty are leaders in research and teaching Faculty Profiles Rebecca Silverman Associate Professor See profile → Amado Padilla Associate Dean for Faculty Affairs See profile → Maria Araceli Ruiz-Primo Associate Professor See profile → Benjamin Domingue Associate Professor See profile → Christine Min Wotipka Associate Professor (Teaching) See profile → Hilda Borko Professor See profile → Bruce McCandliss Professor See profile → Research May 15, 2024 Research Stories Softening the sharp edges in mathematics K-12 | Science and Math Education | Teaching May 6, 2024 Research Stories 70 years after Brown v. Board of Education, new research shows rise in school segregation Education Policy | Poverty and Inequality | Race and Equity Feb 27, 2024 Research Stories Changing the history course Civics and History | Curriculum and Instruction | Impact See all News and Media Our Community Our faculty, students, alumni and staff focus on improving lives through learning, teaching, discovery and innovation. Learn more about who we are Alvaro Fernandez, MBA '01, MA '02 A learning organism Keep reading Magdalena Gross, Senior Research Associate Learning about complicated histories Keep reading We’re accelerating solutions to the world’s most pressing challenges in\n                        education. The Stanford Accelerator for Learning is the first university-wide initiative on learning. Housed at\n                    the GSE, the Accelerator connects scholars across disciplines and with external partners to bridge\n                    research and practice and bring innovative, scalable learning experiences across the lifespan. Visit the Accelerator website to\n                        learn more. Back to the Top Stanford Graduate School of Education 482 Galvez Mall Stanford, CA 94305-3096 Tel: (650) 723-2109 Contact Admissions GSE Leadership Site Feedback Site Map Web Accessibility GSE IT Career Resources Faculty Open Positions Explore Courses Academic Calendar Office of the Registrar Cubberley Library Webmail StanfordWho StanfordYou 25Live Login Improving lives through learning Facebook Twitter LinkedIn YouTube Flickr Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 ."
}