{
  "id": 9,
  "date": "2024-05-18T18:20:42.197248",
  "url": "https://admission.stanford.edu/afford/",
  "university_name": "Stanford University",
  "title": "Search form",
  "content": "Skip to content Undergraduate Admission Menu Search form Search term Plan Afford Engage Apply Quick Links News & Announcements Application Requirements Tours and Programs Cost of Attendance Admission Volunteers Story 1 Story 2 Story 3 Story 4 Story 5 MAKING A WORLD-CLASS EDUCATION POSSIBLE We meet the full financial need of every admitted undergraduate who qualifies for assistance. Previous Story Next Story Afford A Stanford Education is Affordable. Stanford offers comprehensive, need-based financial aid that makes it possible for all admitted undergraduate students to attend â and we do not expect students to borrow to meet their need. Learn how the program works, then use the net price calculator to get an award estimate based on your familyâs financial situation. Financial Aid at a Glance See How Aid Works Almost half of all Stanford undergraduates receive need-based financial aid. Families earning less than $150,000 with assets typical of that income level pay no tuition. Families earning less than $100,000 with assets typical of that income level pay no tuition or room and board. Learn About Types of Financial Aid Stanford provides financial aid in the form of scholarships, which do not need to be repaid. Federal and state grants, outside scholarships, and student employment are additional sources of funding. We do not expect you to take out student loans to cover your college costs. Estimate Your Cost to Attend Stanford The average need-based scholarship in the current freshman class is more than $70,000. Use the net price calculator tool to see what level of financial aid you can expect to receive if you attend. Students Share Their Stories Jemima grew up as one of six kids, with a mom â her \"rock and shining star\" â who worked the night shift as a nurse. She thought of Stanford as her super-reach school, until she got in and realized it would cost her almost nothing to attend. Cameron comes from Neah Bay, Washington, where his mom is an intake clerk, his dad is a fisherman, and \"everybody knows everybody.\" He was motivated by family and community to get a good college education â but knew his parents wouldn't be able to contribute to covering the cost. Tracie always knew she wanted to be able to provide two things for her kids: braces and a good education. But as her oldest daughter approached the end of high school, she began to worry that she wouldn't be able to afford the cost of college. Programs Admission Forums, Student Programs, and Special Events Brochures Stanford Preview and Viewbook Join the Mailing List Contact Us University Policies Engage with Us Stanford complies with the Jeanne Clery Act and publishes crime statistics for the most recent three-year period. View the full report . Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University . Stanford , California 94305 ."
}