{
  "id": 9,
  "date": "2024-05-18T18:20:25.766494",
  "url": "https://admission.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Search form",
  "content": "Explore Boldly. Dream Audaciously. Undergraduate Admission Discover Stanford Experience the freedom to be the person you want to be, freedom to dive deep into academic discovery, and freedom to pursue your passions. Faculty and staff will spark and support your inquiry, and your peers will challenge you in a dynamic learning environment where listening and respectful discourse are paramount. Stanford will provide you the opportunity of a lifetime. Academics Tours & Programs Community & Belonging Campus Life Athletics Arts It isn’t just about the courses or the grades. It’s about the human being behind all of it. The cornerstones of resilience—learning, seeking advice, getting perspective and finding community—offer a way for young people to grow as they embark on the next major step in their lives. – Richard H. Shaw, Dean of Undergraduate Admission Application Deadlines OCT 15 Restrictive Early Action Application with Arts Portfolio NOV 1 Restrictive Early Action Standard Application DEC 5 Regular Decision with Arts Portfolio JAN 5 Regular Decision Standard Application MAR 15 Transfer Application with or without Arts Portfolio We look forward to learning about you through your application. Planning for College Applying to Stanford Watch Video A Stanford Education is Possible. Stanford offers comprehensive, need-based financial aid that makes it possible for all admitted undergraduate students to attend — and we do not expect students to borrow to meet their need. Learn how the program works, then use the net price calculator to get an award estimate based on your family’s financial situation. Learn more about financial aid at Stanford News & Announcements Transfer decision release The Office of Undergraduate Admission will release decisions to Transfer applicants on Friday, May 10 at 4 p.m. (PDT). See details Decisions will be available in the Stanford portal . If you have not yet logged in or are having difficulty logging into your portal, reset your credentials by selecting “Forgot Your Password?” from the login page. Testing policy for Fall 2025 applicants For the 2023–24 and 2024–25 admission cycles, Stanford will not require ACT or SAT scores for first-year or transfer applicants. See details Our test optional policy will extend to applicants applying for the Fall 2025 entry term. Stanford is committed to a holistic review of all candidates. We consider the vast array of information provided in and with each student’s application, whether that information includes test scores or not. Students may continue to self-report test scores in their application if they would like. Applications without test scores will not be at a disadvantage. The NCAA Eligibility Center has announced a standardized testing policy for students who intend to play NCAA Division I or II sports: “the NCAA will no longer require standardized testing as part of the eligibility criteria.” top Follow @EngageStanford Programs Admission Forums, Student Programs, and Special Events Brochures Stanford Preview and Viewbook Join the Mailing List Contact Us University Policies Engage with Us Stanford complies with the Jeanne Clery Act and publishes crime statistics for the most recent three-year period. View the full report . Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University . Stanford , California 94305 ."
}