{
  "id": 9,
  "date": "2024-05-18T18:20:35.871947",
  "url": "https://vpge.stanford.edu/gateways/prospective-students",
  "university_name": "Stanford University",
  "title": "Information for Prospective Students",
  "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Office of the Vice Provost for Graduate Education Search this site Submit Search Menu Academic Guidance Advising & Mentoring Advising Policies Advising Expectations Advising Practices & Resources Mentoring Resources Policies & Planning Research Policies Problem Solving & Crisis Intervention School Dean's Office Contacts Faculty Advisory Committee Student & Postdoc Advisory Committee Diversity Initiatives Awards 2023 Recipients 2022 Recipients 2021 Recipients 2020 Recipients 2019 Recipients 2018 Recipients 2017 Recipients 2016 Recipients 2015 Recipients 2014 Recipients Programs & Funding Recruitment Professional Development Programs & Funding Grad Grow Search Grad Grow Competencies Campus Partners Ethnic and Community Centers Career Centers Career Planning Stanford Courses Career Development Courses Communication Courses Leadership & Management Courses Diversity, Equity & Inclusion Courses Teaching & Mentoring Courses Interdisciplinary Courses Professionalism Courses Interdisciplinary Learning Stanford Graduate Summer Institute 2024 SGSI Course Overview 2023 SGSI Course Overview 2022 SGSI Course Overview Networking & Learning Programs & Funding Stanford Courses Fellowships & Funding Graduate Student Funding Other Stanford Fellowships External Funding VPGE Fellowships VPGE Fellowship Policies GFS Entry Information VPGE Funding Opportunities Current VPGE Fellows All 2023 Fellows All 2022 Fellows All 2021 Fellows All 2020 Fellows All 2019 Fellows All 2018 Fellows All 2017 Fellows All 2016 Fellows All 2015 Fellows All 2014 Fellows Graduate Fellowships Faculty Advisory Committee We're expanding what's possible in graduate education. Join us! Information for Prospective Students Main navigation Skip to main content Secondary Navigation New Graduate Students Prospective Students Faculty & Staff Main content start Apply Apply directly to departments and programs via the Graduate Admissions application. Check out Stanford's seven Schools and nearly 100 departments and programs offering graduate degrees. Visit Graduate Admissions Explore Graduate Programs Visit Stanford's Seven Schools Knight-Hennessy Scholars Learn About Recruitment Consider Join Stanford's globally diverse graduate student community of 9,400 students, most living on campus and receiving some form of financial support. See How Diversity Works at Stanford Explore Housing Options Read About Finances Discover How We Cross Disciplinary Boundaries The Stanford Grad Experience and Advice to Prospective Students Engage Find the resources you need to make your transition to graduate studies at Stanford. Learn about how VPGE and our campus partners support student success. Visit the Grad Gateway Discover Professional Development Opportunities Explore Campus Resources Stanford Office of the Vice Provost for Graduate Education Web Login Instagram YouTube Flickr Flickr About VPGE Overview Our Mission Meet the Vice Provost History & Milestones Staff Contact Us Report a website problem Quick Links Calendar Programs Recent News Subscribe to Newsletter Partners New Students Faculty & Staff Prospective Students Bookmarks Graduate Academic Policies Graduate Admissions Graduate Funding Graduate Life Office Office of the Registrar Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
}