{
  "id": 9,
  "date": "2024-05-18T18:20:21.721162",
  "url": "https://gradadmissions.stanford.edu",
  "university_name": "Stanford University",
  "title": "Welcome to Graduate Admissions",
  "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Graduate Admissions Search this site Submit Search Menu Home Explore Programs How to Apply Eligibility Dates and Deadlines Application Overview Transcripts Test Scores Statements Recommendations Application Fee GRE Fee Reduction Waivers Program Participation Waivers Eligible Programs School-Based Waivers Apply Now FAQ Current Stanford Students Admitted Students Respond to the Offer Requirements of Admission Official Transcripts & Degree Conferral Documents TOEFL Scores & English Placement Test Frequently Asked Questions Welcome Letter Important Dates and Deadlines Funding Graduate Study Estimated Expense Budget Receipt of Aid from Stanford International Students About Welcome to Graduate Admissions Learn about university-wide admission requirements and processes for MA, MS, PhD, and other non-professional graduate programs. How to Apply Main content start Your Starting Point for Graduate Study at Stanford Browse this website to learn about university-wide requirements and processes for admission to MA, MS, PhD, and other non-professional graduate programs in the following Stanford schools: Graduate School of Education | School of Engineering | School of Humanities & Sciences | School of Medicine | Doerr School of Sustainability Explore Graduate Programs Applying to a Professional School? The professional schools have separate admissions offices and applications. Visit their websites below for information about applying to their graduate programs. Graduate School of Business: MBA | MSx | PhD School of Law: JD | Advanced Degrees School of Medicine: MD | MS in Physician Assistant Studies Why Stanford? Consider joining Stanford’s globally diverse graduate community of 9,300 students. Watch Playlist: The Stanford Grad Experience and Advice to Prospective Students Visit Stanford’s Seven Schools See How Diversity Works at Stanford Fund Your Graduate Study Explore Campus Resources Pursue Leadership Development and Funding with Knight-Hennessy Scholars Stanford Graduate Admissions Web Login Visit Campus Map Contact Us Related Links Explore Graduate Programs Graduate Diversity Funding Graduate Study Vice Provost for Graduate Education Knight-Hennessy Scholars Gateways for... Prospective Graduate Students New Graduate Students Stanford Staff (Login Required) Graduate Admissions oversees the application process for non-professional graduate programs (e.g., MA, MS, PhD). To learn about the application processes for professional programs (e.g., JD, MBA, MD), visit the corresponding links on our homepage . Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
}