{
  "id": 9,
  "date": "2024-05-18T18:20:51.204184",
  "url": "https://parents.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Search form",
  "content": "Skip to content Families Stanford University Menu Search form Search term Home FAQ Get Involved How Do I Pay? Stay Informed Tips Vital Info Latest News Latest News Q&A With Vice Provost for Undergraduate Education Sarah Church — The Major Declaration Journey April 18, 2023 3:41 pm Spring each year at Stanford shines a spotlight on Major Declaration Season, as undergraduates are required to select a major no later than the spring of their sophomore year. Vice Provost for Undergraduate Education Sarah Church offers insights into the major declaration process and some guidance for parents and families who may be navigating this… Read more Q&A With Vice Provost for Undergraduate Education Sarah Church — The Major Declaration Journey An update on social life on the Farm from Student Affairs' Samuel Santos Jr. November 17, 2022 7:36 am Dear Stanford undergraduate parents, I hope you, and your students here at Stanford, are doing well this fall. Here on the Farm it’s a busy time of many activities, and the height of many students’ academic work for the quarter, with the promise of a restful and restorative winter break not far off. I’m writing… Read more An update on social life on the Farm from Student Affairs' Samuel Santos Jr. Welcome to the new academic year: A message from vice provosts Susie Brubaker-Cole, Sarah Church September 8, 2022 3:15 pm Hello Stanford families, We are thrilled to welcome you to the new academic year! Some students are here with us now for residential student staff training, September Studies, athletics, and more, and many more will be joining us in a few short weeks. We’re excited about fall quarter, and we hope you are, too. As… Read more Welcome to the new academic year: A message from vice provosts Susie Brubaker-Cole, Sarah Church More news Stay Informed Reapproaching Stanford Stanford Report Stanford Magazine Parent News Archive See all Vital Information Public Safety Pertinent Policies Vaden Health Center COVID-19 information for parents and guardians See all Events New Student Orientation Family Weekend Commencement See all Get Involved Parents and Family Engagement Parents’ Club See all Parents' Helpline mykidis@stanford.edu 650-725-0649 In an Emergency emergency.stanford.edu 650-725-5555 844-ALERTSU (844-253-7878) Learn more at AlertSU How Do I Pay? Read more about how students pay for Stanford with the assistance of their families and the university. Stanford + Parents/Guardians The student is at the center — and is the focus — of this important partnership. Our Policy Prospective Parents Helpful Sites Visitor Information Academic calendar New Student Information Undergraduate Education Office of Alcohol Policy and Education Bing Overseas Studies Student Financial Services Financial Aid CashCourse for students Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 ."
}