{
  "id": 9,
  "date": "2024-05-18T18:20:52.054253",
  "url": "https://alumni.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Featured Events",
  "content": "Skip to main content Alumni Directory (external link) Email (external link) Search Events Featured Events All Alumni Events Alumni Community Events (external link) Career Events Student Events University Events (external link) Stanford Athletics Tickets (external link) Reunion Homecoming Reunion 2024 Ways to Volunteer View Schedule Registration Alumni Center Events Host with SAA Event Spaces Planning Resources Introducing Online Class Notes Log in to read Class Notes (external link) Reading & Resources News & Stories Recent Stories STANFORD magazine (external link) Newsletters Read Class Notes (external link) Learn Learning Opportunities Recorded Live Talks (external link) Recommended Podcasts Subscribe to Learn List Career Connections Getting Started Students Career Resources Give Career Support Post or Find Jobs (external link) Post or Find Internships (external link) Connect on Alumni Directory (external link) Alumni Linkedin Group (external link) Racial Justice Resources Our Mission Resources Moving Stanford Forward Racial Justice Events Programs & Perks Perks & Membership Perks for All Alumni Become an SAA Member SAA Membership Card SAA Member Benefits Sierra Programs Summer Family Camp Faculty/Staff Weekend Healthy Living Retreat for Women Memorial Day Weekend Sierra Camp Conference Center (external link) Sierra Programs Updates Travel/Study The Stanford Advantage Find a Destination Experiences Custom Journeys Trip Alerts Shop Wine Collection (external link) Stanford Alumni Fan Shop (external link) Communities Clubs & Groups Discover Alumni Groups Interest & Affinity Groups Professional Groups Regional Groups (U.S.) Regional Groups (International) School Groups (external link) Shared Identity Groups Leader Resources Young Alumni Recent Grad Resources Stanford 10 Undergraduate Students All Undergraduates Frosh Sophomores Juniors Seniors Senior Awards Senior Commencement Events Graduate Students All Graduate Students Grad Student Awards Grad Commencement Volunteer Volunteer Opportunities Leadership Richard W. Lyman Award Multicultural Alumni Hall of Fame Beyond the Farm Join a Project Project Leaders Stanford Associates Grants Awards Associates Designees Board of Governors Trustee Nominations Board Facts Becoming a Trustee Current Trustees (external link) About About Us Get to Know SAA Departments Executive Leadership Jobs (external link) Alumni Center Amenities & Space Dedication & Donors Contact Us Get in Touch Frequently Asked Questions Update Your Contact Info (external link) Submit a Class Note (external link) Submit an Obituary (external link) Introducing Online Class Notes Log in to read Class Notes (external link) Alumni Directory (external link) Email (external link) Search Events Featured Events All Alumni Events Alumni Community Events (external link) Career Events Student Events University Events (external link) Stanford Athletics Tickets (external link) Reunion Homecoming Reunion 2024 Ways to Volunteer View Schedule Registration Alumni Center Events Host with SAA Event Spaces Planning Resources Introducing Online Class Notes Log in to read Class Notes (external link) Reading & Resources News & Stories Recent Stories STANFORD magazine (external link) Newsletters Read Class Notes (external link) Learn Learning Opportunities Recorded Live Talks (external link) Recommended Podcasts Subscribe to Learn List Career Connections Getting Started Students Career Resources Give Career Support Post or Find Jobs (external link) Post or Find Internships (external link) Connect on Alumni Directory (external link) Alumni Linkedin Group (external link) Racial Justice Resources Our Mission Resources Moving Stanford Forward Racial Justice Events Programs & Perks Perks & Membership Perks for All Alumni Become an SAA Member SAA Membership Card SAA Member Benefits Sierra Programs Summer Family Camp Faculty/Staff Weekend Healthy Living Retreat for Women Memorial Day Weekend Sierra Camp Conference Center (external link) Sierra Programs Updates Travel/Study The Stanford Advantage Find a Destination Experiences Custom Journeys Trip Alerts Shop Wine Collection (external link) Stanford Alumni Fan Shop (external link) Communities Clubs & Groups Discover Alumni Groups Interest & Affinity Groups Professional Groups Regional Groups (U.S.) Regional Groups (International) School Groups (external link) Shared Identity Groups Leader Resources Young Alumni Recent Grad Resources Stanford 10 Undergraduate Students All Undergraduates Frosh Sophomores Juniors Seniors Senior Awards Senior Commencement Events Graduate Students All Graduate Students Grad Student Awards Grad Commencement Volunteer Volunteer Opportunities Leadership Richard W. Lyman Award Multicultural Alumni Hall of Fame Beyond the Farm Join a Project Project Leaders Stanford Associates Grants Awards Associates Designees Board of Governors Trustee Nominations Board Facts Becoming a Trustee Current Trustees (external link) About About Us Get to Know SAA Departments Executive Leadership Jobs (external link) Alumni Center Amenities & Space Dedication & Donors Contact Us Get in Touch Frequently Asked Questions Update Your Contact Info (external link) Submit a Class Note (external link) Submit an Obituary (external link) Introducing Online Class Notes Log in to read Class Notes (external link) Events Featured Events All Alumni Events Alumni Community Events (external link) Career Events Student Events University Events (external link) Stanford Athletics Tickets (external link) Reunion Homecoming Reunion 2024 Ways to Volunteer View Schedule Registration Alumni Center Events Host with SAA Event Spaces Planning Resources Introducing Online Class Notes Log in to read Class Notes (external link) Reading & Resources News & Stories Recent Stories STANFORD magazine (external link) Newsletters Read Class Notes (external link) Learn Learning Opportunities Recorded Live Talks (external link) Recommended Podcasts Subscribe to Learn List Career Connections Getting Started Students Career Resources Give Career Support Post or Find Jobs (external link) Post or Find Internships (external link) Connect on Alumni Directory (external link) Alumni Linkedin Group (external link) Racial Justice Resources Our Mission Resources Moving Stanford Forward Racial Justice Events Programs & Perks Perks & Membership Perks for All Alumni Become an SAA Member SAA Membership Card SAA Member Benefits Sierra Programs Summer Family Camp Faculty/Staff Weekend Healthy Living Retreat for Women Memorial Day Weekend Sierra Camp Conference Center (external link) Sierra Programs Updates Travel/Study The Stanford Advantage Find a Destination Experiences Custom Journeys Trip Alerts Shop Wine Collection (external link) Stanford Alumni Fan Shop (external link) Communities Clubs & Groups Discover Alumni Groups Interest & Affinity Groups Professional Groups Regional Groups (U.S.) Regional Groups (International) School Groups (external link) Shared Identity Groups Leader Resources Young Alumni Recent Grad Resources Stanford 10 Undergraduate Students All Undergraduates Frosh Sophomores Juniors Seniors Senior Awards Senior Commencement Events Graduate Students All Graduate Students Grad Student Awards Grad Commencement Volunteer Volunteer Opportunities Leadership Richard W. Lyman Award Multicultural Alumni Hall of Fame Beyond the Farm Join a Project Project Leaders Stanford Associates Grants Awards Associates Designees Board of Governors Trustee Nominations Board Facts Becoming a Trustee Current Trustees (external link) About About Us Get to Know SAA Departments Executive Leadership Jobs (external link) Alumni Center Amenities & Space Dedication & Donors Contact Us Get in Touch Frequently Asked Questions Update Your Contact Info (external link) Submit a Class Note (external link) Submit an Obituary (external link) Introducing Online Class Notes Log in to read Class Notes (external link) Hello, what can we help you find today? Search Clear Search Consider browsing by category: Popular Topics Programs & Resources for Students (external link) Request your official Stanford transcript (external link) Potential COVID Exposures on Campus (external link) Alumni Membership Card (external link) Stanford Alumni Email Contact Information SAA Customer Service (external link) Stanford University Contact Information (external link) SAA Departments Stanford Alumni Welcome Home Step into the virtual home of Stanford’s global community—a place where the Cardinal spirit thrives beyond the palm-lined campus. Reconnect with classmates, discover opportunities, and stay up-to-date on the latest research and ideas coming out of Stanford. Stanford Alumni Association Your Class Notes, Now Online Introducing a new digital portal to read and submit Class Notes. Log in to read Class Notes (external link) Stories News, views, and perspectives from the Stanford community. Grounded (external link) from STANFORD magazine N. Scott Momaday, whose writing sparked a renaissance in Indigenous literature, turns his attention to the earth. Melinda French Gates Will Be 2024 Commencement Speaker at Stanford (external link) from Stanford Report Commencement Weekend will feature an address by Melinda French Gates, co-chair of the Bill & Melinda Gates Foundation and founder of Pivotal Ventures. Discover more from your alumni community. Read stories Optional screen reader text Alumni Magazine—May 2024 (external link) Dig into the current issue of STANFORD magazine. Programming With a Purpose There ’ s something for everyone at Stanford Alumni. We ’ re here to help you connect, learn and grow every step of the way. Career Connections Looking to make a career change or network with other alumni? Don’t miss out on our career resources. See career resources Students Welcome, Stanford students! Don’t miss out on special programming developed just for you. Find student programming Travel/Study Filling Fast! Soak in Jane Austen’s world of Georgian treasures, cruise the moody waters of the British Isles, or discover London and the surrounding countryside. Each trip is all its own, but also connected through the vast histories, landscapes, and cuisines that are unique to the United Kingdom. Jun 10 – to Jun 19 British Isles A cruise through the waterways of Great Britain and Ireland A feast for the heart and mind, this trip has in-depth study, local cuisines, and lush landscapes. The Sea Cloud Spirit, our home on the sea, is a three-masted beauty. Jun 18 – to Jun 26 England Jane Austen and Georgian treasures of South England Follow in the footsteps of the beloved author as we embark on exclusive tours of the houses and settings that made up the backdrop of Austen’s life in southern England. Aug 29 – to Sep 05 London An insider’s tour of English art and culture Enjoy exclusive access to some of London's greatest museums and performing arts venues and visit historic artists’ homes and studios in the surrounding countryside. Explore 2024 trips (external link) Loading... Loading... Sponsors See what SAA offers just for alumni and SAA members. Stanford Alumni Association Frances C. Arrillaga Alumni Center 326 Galvez Street Stanford, CA 94305-6105 Map on Google (external link) Facebook Page LinkedIn Page Twitter Page Instagram Page Youtube Channel Get to Know SAA STANFORD Magazine (external link) Contact Us Help Access SAA Member Card Check your alumni email (external link) My Alumni Account (external link) Give to Stanford (external link) Accessibility Privacy Policy Terms of Use Code of Conduct Stanford University Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305."
}