{
  "id": 9,
  "date": "2024-05-18T18:20:24.116608",
  "url": "https://careersearch.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Life at Stanford",
  "content": "Settings Skip to main content Stanford Careers Menu Life at Stanford Life at Stanford Life at Stanford Learn about our array of employee benefits, what makes Stanford life unique, and our commitment to diversity, equity and inclusion. Culture Diversity Benefits How We Hire FAQ Areas of Work Areas of Work Areas of Work Together, we're working towards our collective future. Find your role by browsing our areas of work. Administration Athletics Children Services Communications Facilities Finance and Accounting Food Services Fundraising | Development Health Services IT and Information Analytics Legal Marketing Program and Project Managment Research People | HR Security and Police Student Services Locations Stories Job Search My Submissions My Profile My Submissions Job Search My Profile ☰ Jobs FAQs 🔍  No suggested location found; would you like to perform a keyword search with this location instead? No Yes Sorry, we couldn't find your location.  Please type in a location you are interested in. 🔍 Search Sign Up for Job Alerts! Not ready to apply? Take just a minute to sign up for job alerts. 👥 Sign Up for Job Alerts Browse Jobs Browse jobs by type or location. My Submissions Track your opportunities. My Submissions Jobs FAQs Site Map © Stanford University. All rights reserved. Global Impact We believe in having a global impact Climate and Sustainability Stanford's deep commitment to sustainability practices has earned us a Platinum rating and inspired a new school aimed at tackling climate change. Medical Innovations Stanford's Innovative Medicines Accelerator is currently focused entirely on helping faculty generate and test new medicines that can slow the spread of COVID-19. Technology From Google and PayPal to Netflix and Snapchat, Stanford has housed some of the most celebrated innovations in Silicon Valley. Advancing Education Through rigorous research, model training programs and partnerships with educators worldwide, Stanford is pursuing equitable, accessible and effective learning for all. Working Here We believe you matter as much as the work I love that Stanford is supportive of learning, and as an education institution, that pursuit of knowledge extends to staff members through professional development, wellness, financial planning and staff affinity groups. Nora Cata School of Engineering I get to apply my real-world experiences in a setting that welcomes diversity in thinking and offers support in applying new methods. In my short time at Stanford, I've been able to streamline processes that provide better and faster information to our students. Phillip Cheng Office of the Vice Provost for Student Affairs Besides its contributions to science, health, and medicine, Stanford is also the home of pioneers across disciplines. Joining Stanford has been a great way to contribute to our society by supporting emerging leaders. Denisha Clark School of Medicine I like working in a place where ideas matter. Working at Stanford means being part of a vibrant, international culture in addition to getting to do meaningful work. Laura Lind Office of the President and Provost Getting Started We believe that you can love your job Join Stanford in shaping a better tomorrow for your community, humanity and the planet we call home. 4.2 Review Ratings 81% Recommend to a Friend View All Jobs Resources FAQ Work Arrangement LCA Notifications Disability and Diversity Services Veterans Jeanne Clery Act – Campus Safety Report Image Credit Resources FAQ Work Arrangement LCA Notifications Disability and Diversity Services Veterans Jeanne Clery Act – Campus Safety Report Image Credit Equal Opportunity and Disability Accommodations Consistent with its obligations under the law, the University will provide reasonable accommodations to applicants and employees with disabilities. Applicants requiring a reasonable accommodation for any part of the application or hiring process should contact Stanford University Human Resources by submitting a contact form . Stanford is an equal employment opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. See Admin Guide 1.7.4: Equal Employment Opportunity, Non-Discrimination, and Affirmative Action Policy ; Know Your Rights: Workplace Discrimination is Illegal ; Pay Transparency Non-Discrimination Provision . Equal Opportunity and Disability Accommodations Consistent with its obligations under the law, the University will provide reasonable accommodations to applicants and employees with disabilities. Applicants requiring a reasonable accommodation for any part of the application or hiring process should contact Stanford University Human Resources by submitting a contact form . Stanford is an equal employment opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. See Admin Guide 1.7.4: Equal Employment Opportunity, Non-Discrimination, and Affirmative Action Policy ; Know Your Rights: Workplace Discrimination is Illegal ; Pay Transparency Non-Discrimination Provision . © Stanford University, Stanford California 94305 Stanford Home Maps and Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non Discrimination Accessibility 0 0"
}