{
  "id": 9,
  "date": "2024-05-18T18:20:17.902087",
  "url": "https://emergency.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Current Status",
  "content": "Skip to content Emergency Information Stanford University Menu Home Resources About this site Current Status There is no emergency at this time. Emergency Hotlines 650-725-5555 844-ALERTSU (844-253-7878) For Emergency Assistance Dial 911 (9-911 from campus phones) UPDATE to report of threat on campus February 16, 2024 3:20 pm ALERTSU UPDATE: 2/16/24 at 3:14pm DPS responded to several locations on campus in response to the threat and has since conducted additional investigation. At this time, DPS has no additional information that lends credibility to the threat of a shooting on campus. Please call 911 immediately if you observe any suspicious activity. https://police.stanford.edu/alert ________________________________________ This emergency notification is being sent in compliance with the Clery Act. FAQs about the Clery Act and the AlertSU notifications can be found here: https://police.stanford.edu/pdf/Clery-FAQ.PDF ALERTSU – Report of a threat to commit a shooting February 16, 2024 1:41 pm ALERTSU: 02/16/2024 at 12:40pm, an unidentified person called the non-emergency phone at Palo Alto dispatch stating he was at the entrance to campus and intended to commit a shooting. DPS responded immediately to the area and has been evaluating the veracity of the call. Out of an abundance of caution, we are notifying the community. Call 911 immediately if you observe suspicious activity. ________________________________________ This emergency notification is being sent in compliance with the Clery Act. FAQs about the Clery Act and the AlertSU notifications can be found here: https://police.stanford.edu/pdf/Clery-FAQ.PDF AlertSU AlertSU is the Stanford University emergency notification system. It delivers time-sensitive emergency notifications via phone, email, text messages, and outdoor warning sirens to all members of the Stanford community. Learn more about AlertSU Public Safety Alerts Community Public Safety Alerts include non-emergency alerts about crimes and issues which could potentially affect the larger Stanford community. See community alerts Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 ."
}