{
  "id": 9,
  "date": "2024-05-18T18:20:21.467916",
  "url": "https://community.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Welcome to Stanford",
  "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Community Engagement Office of External Relations Search this site Submit Search Menu Home Explore Campus Getting to campus Maps Campus Walks Learn K-12 Programs Undergraduate Programs Community College Programs Lifelong Learning Online Learning Resources for Educators Summer Programs Discover Stories Cool Podcasts from Stanford Engage Engaging Regionally OCE Seed Funding 2024 Community Engagement Impact Funds 2023 Seed Funding Projects 2022 Seed Funding Projects 2021 Seed Funding Projects Supporting the Community Engaging Globally Opportunities and Resources for Visiting Appointments Resources for International Visitors with Appointments Community Engagement Map Giving Back Community Partnership Awards Events Stanford Events Veterans Day Supporting Regional Gatherings Contact Us Welcome to Stanford We’re just a walk, a short ride, or a click away. Stanford lives its founding values when we connect with our communities next door – and across the globe. About the Office of Community Engagement Main content start Engage with Stanford The relationships we build invigorate lives and help us solve the challenges we share. Explore Campus Enjoy the many offerings, rich history, and quiet beauty of the campus. Learn how Arts, Athletics, the Dish, and more There’s a lot going on. Check our events, or go at your own pace. Show me! A deep sense of place From the beginning, Stanford, along with the neighboring communities it joined, has grown and developed from rural roots. How we’re connected From using ancestral craft techniques at the Farm to the classical Indian dance showcase by Stanford Noopur, there are activities nearly every day, including dance, film, food, festivals, author readings and workshops. Enjoy Asian American Pacific Islander Heritage month with Saturday's Pasifika Fest from the Pacific Islander Student Association May 18 at Wilbur Field. See the more than 30 events that reflect the many and distinct cultures under the umbrella of “AAPI.” Learning Opportunities Take advantage of Stanford's renowned educational programs and instructors. K - 12 Lifelong Learning Online Learning How do you describe Stanford's engagement with community? Stanford offices, centers, and institutes that engage with the world Where we engage Looking for something? Need to contact us for an answer to your question? Reach us here The Office of Community Engagement is part of the Office of External Relations. Office of External Relations Stanford Community Engagement Office of External Relations Office of External Relations Address Office of Community Engagement Frances C. Arrillaga Alumni Center 326 Galvez Street Stanford , CA 94305 United States Stanford External Relations Admin Login Resources Campus Map Careers Diversity Works Noise and Traffic Management Public Safety \"HeadsUp\" construction information Quick Links Athletics Stanford Arts Stanford Annual Events Stanford Archives Stanford Children's Health Stanford Health Care Stanford University Libraries Undergrad & Graduate Admission Office for Religious & Spiritual Life Sign up for Stanford Report news and information about Stanford Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
}