{
  "id": 9,
  "date": "2024-05-18T18:20:29.193095",
  "url": "https://humsci.stanford.edu/",
  "university_name": "Stanford University",
  "title": "",
  "content": "Skip to main content Dismiss alert Stanford School of Humanities and Sciences Search Search Toggle main menu visibility Mobile site main navigation Prospective Students Guide on Getting Into Grad School A Message from Dean Debra Satz Self-assessment and Selecting Grad Programs Suggested Graduate School Prep Timeline Advice on Non-Traditional Paths Between Undergrad Degrees and Grad Programs Funding Graduate Studies Preparing Your Applications Writing Your Personal Statements Requesting Recommendation Letters Interviewing and Talking with Prospective Faculty How Your Application Is Reviewed Making Your Final Decision Additional Resources H&S Summer Research Programs Current Students Diversity Resources and Programs Fellowships and Funding H&S Dean’s Scholars Fellowship CUNY Exchange Program Sterling Award for Undergraduates Helpful Stanford Resources for Students and Postdocs WINGS (Wellness Information Network for Graduate Students) Academics and Research Centers, Institutes, and Affiliates Explore programs of study in H&S Careers of Humanities Alumni News COVID-19: H&S faculty in the news Events About H&S Dean Dean's Message Past Dean's Messages Dean's Initiatives Diversity and Inclusion H&S Council Senior Associate Deans Administrative Leads Staff National and International Awards American Academy of Arts and Sciences MacArthur Fellowship National Academy of Sciences National Humanities Medal National Medal of Science Nobel Prize Pulitzer Prize H&S Dean's Teaching Awards H&S History H&S Past Deans Stanford Land Acknowledgment Giving Ways to Give Annual Giving to Graduate Education Support World-Class Faculty Strengthen Graduate Scholarship Enhance the Arts Globalize the Curriculum Transform Science Education and Research Expand Our Understanding of the Universe Desktop site main navigation Prospective Students Current Students Academics and Research News Events About Giving Native plants take root in the Muwekma Four Directions Garden at Stanford University. Photo by Ishmael Bruno. New gift will help Stanford reimagine Native American Studies through a 21st-century Indigenous lens Scroll to more content Research and learning are the foundations of discovery. Explore H&S Departments and Programs Communication Theater and Performance Studies Mathematical and Computational Science* Statistics In the Moment The conversation continues after the Democracy and Disagreement session on Israel and Palestine. Featured speakers Salam Fayyad and Alon Tal talk with students, and session moderator Larry Diamond speaks with H&S Dean Debra Satz. Read more about the session and watch the recording . Photo by LiPo Ching/Stanford University News Envisioning the future for Palestinians and Israelis May 7, 2024 Dynamic enzyme acts like a Swiss Army knife for ribosomes May 9, 2024 A ‘magic’ angle between layers in a stacked nanoscale system offers intriguing material properties May 8, 2024 Survival is success in Mexico City’s underground rehab centers May 1, 2024 See all news The School of Humanities and Sciences is the center of a world-class liberal arts education. 49 Departments and Programs 50 Undergraduate Majors 43 Master's Degrees 33 Doctoral Degrees Series Faculty Awards Awards and honors earned by H&S faculty Submit information about a recent or upcoming faculty award or honor. Awards Faculty Richard Meyer receives 2023 Dedalus Foundation Exhibition Catalogue Award Seven faculty elected to American Academy of Arts & Sciences Stanford faculty named AAAS Fellows Rachel Jean-Baptiste awarded 2024 David H. Pinkney Prize Joel Cabrita receives National Institute for the Humanities and Social Sciences book award Two Stanford scholars awarded Guggenheim Fellowship Steven Boxer receives 2024 Ellis R. Lippincott Award Yakov Eliashberg receives 2024 Frontiers of Knowledge Award Rodolfo Dirzo receives 2024 Frontiers of Knowledge Award Two Stanford physicists win grants for ‘tabletop’ experiments with big implications Martha Cyert named a fellow of the American Society for Biochemistry and Molecular Biology Peter Stansky wins 2023 Peter Davison Award Josiah Ober receives 2023 Barry Prize Clayborne Carson honored with 2023 Freedom Award Surya Ganguli named to 2023 Schmidt Science Polymaths Program cohort Shelley Fisher Fishkin receives 2023 American Studies Association lifetime achievement award Physicist Harold Hwang wins McGroddy Prize for New Materials Kathryn Olivarius awarded AHA Prize in American History Kristy Red-Horse elected to the National Academy of Medicine Steven Banik named 2023 Moore Inventor Fellow Stephen Shenker and Leonard Susskind awarded 2023 Dirac Medal Stanford-led collaboration to explore electrodynamics of neutron stars and black holes receives $8M in funding from Simons Foundation Russell Poldrack named 2023 British Academy fellow Steven Banik and Christopher O. Barnes named 2023 Pew Biomedical Scholars Gordon H. Chang awarded 2023-24 research fellowship from The Huntington Lauren O’Connell receives 2023 Camille Dreyfus Teacher-Scholar Award Aron Rodrigue made honorary citizen of Greek city of Didymoteicho David O. Siegmund awarded 2023 C.R. and Bhargavi Rao Prize Gretchen Daily receives 2023 Eminent Ecologist Award Kathryn Gin Lum wins 2023 Merle Curti Intellectual History Award Kathryn Olivarius receives 2023 Frederick Jackson Turner Award Carolyn Bertozzi receives 2023 American Association for Cancer Research award R. Lanier Anderson elected board chair of American Philosophical Association Monika Schleier-Smith honored with 2023 Benjamin Franklin NextGen Award Richard Zare awarded a 2023 Benjamin Franklin Medal Matthew Sommer awarded $60,000 grant from NEH Richard Roberts elected honorary fellow of American Society for Legal History Rowan Dorin awarded 2022 Mary L. Dudziak Digital Legal History Prize View all in series Explore All Series The natural sciences in H&S offer an exciting environment for you to learn and discover new knowledge, methodologies, and technologies; work side by side with world-class faculty mentors and research staff; and help solve today's important problems. Explore the natural science guide. Video file /sites/default/files/2024-01/Montage%20-%20Bass.mp4 Anne T. and Robert M. Bass Biology Research Building Watch the video About The School of Humanities and Sciences is the foundation of a liberal arts education at Stanford. The school encompasses 24 departments and 25 interdisciplinary programs. It is the university's home for fundamental research, where free, open, and critical inquiry is pursued across disciplines. Learn more about H&S Footer Social Links Facebook Twitter Youtube H&S resources Facilities and Capital Planning Faculty Affairs Finance Graduate and Undergraduate Studies Human Resources Information Technology Planning, Compliance, and Administrative Effectiveness Public Relations Research Administration Contact Us Building 1, Main Quad 450 Jane Stanford Way Stanford, CA 94305-2070 Phone: 650-723-2275 Fax: 650-723-3235 Campus Map University resources Report a website problem Stanford Non-Discrimination Policy Stanford University Stanford footer: Top links Stanford Home Maps & Directions Search Stanford Emergency Info Stanford footer: Bottom links Terms of Use Privacy Copyright Trademark Non-Discrimination Accessibility © Stanford University, Stanford, California 94305"
}