{
  "id": 9,
  "date": "2024-05-18T18:20:40.396337",
  "url": "https://www.stanford.edu/about/",
  "university_name": "Stanford University",
  "title": "Search Stanford:",
  "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content A Societal Mission Stanford was founded almost 150 years ago on a bedrock of societal purpose. Our mission is to contribute to the world by educating students for lives of leadership and contribution with integrity; advancing fundamental knowledge and cultivating creativity; leading in pioneering research for effective clinical therapies; and accelerating solutions and amplifying their impact. Excellence in research, teaching, and medical care Who we are What drives our faculty, students, and staff is a spirit of possibility, a legacy inherited from our pioneering founders who created Stanford in the memory of their only child to benefit other people’s children. At Stanford, we learn from our past but focus on the future, continually looking for new ways to make the world a better place. We believe strongly in the role that higher education plays in supporting a thriving society. Colleges and universities not only prepare students for their chosen path, but they help create the next generation of citizen leaders and problem solvers. Higher education institutions pursue a distinct and enduring mission in our society, dedicated solely to the creation and dissemination of knowledge. The breadth and richness of the fabric that comprises the world’s institutions of higher learning are integral to long-term human advancement and well-being. Educating tomorrow’s global citizens Stanford provides students the opportunity to engage with big ideas, to cross conceptual and disciplinary boundaries, and to become global citizens who embrace diversity of thought and experience. We offer students broad and deep academic programs across seven schools and multiple fields – including the arts and humanities, natural and social sciences, engineering, sustainability, medicine, law, education, and business. The university’s breadth of excellence and culture of innovation uniquely position it to attract and retain the best faculty in the world, who offer students the knowledge and tools to discover and embrace new ideas, and to prepare for successful careers and lives of service. The need for strong ethical principles to achieve a common good is embedded across our educational offerings. Stanford’s distinguished alumni network and highly engaged alumni community provide students with lifelong access to mentors and peers, who help to create partnerships with the world beyond campus, once again enhancing the collective contributions of our community. Learn more about academics Creating knowledge in an environment of academic freedom Unfettered inquiry is the foundation of research and education. Driven by a deep belief in academic freedom, we continually pose questions and develop new ideas to advance knowledge. Fundamental, curiosity-driven research is central to the university’s mission, and students have extensive opportunities to join Stanford scholars in research that develops new knowledge and deepens understanding of ourselves and the world around us. A hallmark of Stanford is our extensive and vibrant ecosystem of interdisciplinary research. With all seven of Stanford’s schools located on our historic campus and many institutes serving as a hub for collaboration across academic fields, the opportunities for disruptive breakthroughs are numerous and the results are evident. Stanford has had 36 Nobel Prize winners since the university’s founding and is tied among research universities for the most Nobel Prizes won since 2000. We are equally purposeful in thinking actively about the ethical implications of our research and its application in the broader world. Learn more about research Rapidly advancing knowledge into application Building on our culture of interdisciplinary collaboration that drives discovery and innovation, the university is creating “accelerators” to readily support university researchers with funding, infrastructure, technological resources, and external partners so that discoveries made at Stanford can become solutions with impact far beyond campus. Examples include the Innovative Medicines Accelerator, dedicated to reducing the time and cost of making medicines while ensuring more effective treatments are reaching patients, and the Sustainability Accelerator within the Stanford Doerr of Sustainability, the university’s first new school in 70 years and a testament to its commitment to being a leader on climate-related research and education. Work is also ongoing within Stanford’s Graduate School of Education to accelerate more effective and equitable learning solutions, and at the Stanford Impact Labs, which creates an innovative research and development pipeline for the social sciences. Learn more about the Sustainability Accelerator Excellence in clinical care Our medical enterprise, Stanford Medicine, provides access to unparalleled patient care across the San Francisco Bay Area, while its world-class researchers make groundbreaking discoveries that advance medical care across the globe. Comprising the School of Medicine, Stanford Health Care, and Stanford Children’s Health, our medical enterprise focuses on predicting, preventing, and curing disease by tailoring health care to the unique biology and life circumstance of each of us. Stanford Medicine enjoys both physical proximity and strong research ties to the university’s other schools, allowing for strong partnerships among world-class faculty that accelerate tangible health benefits for patients. Learn more about Stanford Medicine Access A deep respect for diversity in all its forms Stanford values diversity in background, experience, interests and perspectives. We see to cultivate a campus environment in which all students have the opportunity to learn from each other’s experiences and to think critically about their own views and preconceptions. The university seeks to provide all students with the opportunity and tools to build community and connection across the racial, socioeconomic, geographical, and political lines that often present barriers to greater understanding, mutual respect, and authentic friendship. Opportunities to foster social responsibility and an abiding appreciation for ethics are integral to the Stanford educational experience. Learn more about admission Financial support that makes a difference We strive to support each student in accessing the full amount of financial aid needed to thrive at Stanford. This commitment to financial equity changes not only the lives of students who receive it, but also the education of those who learn alongside them. Nearly 70 percent of Stanford undergraduates receive some form of financial aid, and those from lower-income families have their tuition, room, and board provided for in full. More than 80 percent of those who receive an undergraduate degree from Stanford graduate with no debt. Learn more about financial aid Community A thriving student life A flourishing residential campus is an integral part of the world-class educational experience Stanford offers. Stanford is home to a community of creative and accomplished people from around the world, from acapella singers to Olympic athletes. Students can choose from among more than 600 student organizations to become involved in, ranging from religious, ethnic, and cultural groups to organizations focusing on the arts and community service, to social, athletic, and recreational activities. And Stanford offers 36 varsity sports – 20 for women and 16 for men – in addition to campus-wide physical education academic classes, fitness and wellness, aquatics, intramurals, adventure programming, and 43 club sports. Learn more about campus life Strong relationships with our neighbors Stanford is proud to be a citizen of Silicon Valley and the Bay Area. We engage and build meaningful relationships with our neighbors through events, public exhibitions and performances in the arts, lectures, and lifelong learning, both on campus and online. We support local parents with access to health information, help K-12 teachers increase interest and involvement in math and science, and provide the local business community with access to lectures by today’s entrepreneurial thought leaders. And our medical enterprise, Stanford Health Care, provides access to unparalleled patient care across the Bay Area, while its world-class researchers make groundbreaking discoveries that advance medical care across the globe. Learn more about community engagement Learn more Stanford was founded in 1885 by California senator Leland Stanford and his wife, Jane, “to promote the public welfare by exercising an influence in behalf of humanity and civilization.” The university is governed by a Board of Trustees, President, Provost, Academic Council and a number of other academic and administrative officers. Leadership and Governance Our History Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
}