{
  "id": 9,
  "date": "2024-05-18T18:20:48.288619",
  "url": "https://www.stanford.edu/research/",
  "university_name": "Stanford University",
  "title": "Search Stanford:",
  "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Research From Nobel Prize winners to undergraduates, all members of the Stanford community are engaged in the creation of knowledge. 15 Institutes Cross interdisciplinary boundaries 20 Libraries Hold over 12 million items $1.98 Billion Sponsored research budget The Research Enterprise Stanford’s culture of collaboration drives innovative discoveries in areas vital to our world, our health, and our intellectual life. Interdisciplinary Research At the intersection of disciplines is where new ideas emerge and innovative research happens. Stanford Research Institutes, Labs & Centers Fifteen independent labs, centers, and institutes engage faculty and students from across the university. Independent Laboratories, Centers and Institutes Other Research Centers & Labs Academic departments sponsor numerous other research centers and labs. Listing of Stanford Research Centers Where Research Happens SLAC National Accelerator Laboratory SLAC is a U.S. Department of Energy national laboratory operated by Stanford, conducting research in chemistry, materials and energy sciences, bioscience, fusion energy science, high-energy physics, cosmology and other fields. SLAC National Accelerator Laboratory Hoover Institution The Hoover Institution, devoted to the study of domestic and international affairs, was founded in 1919 by Herbert Hoover, a member of Stanford’s pioneer class of 1895 and the 31st U.S. president. Hoover Institution Stanford Woods Institute for the Environment Working toward a future in which societies meet people’s needs for water, food and health while protecting and nurturing the planet. Stanford Woods Institute Stanford Humanities Center Advancing research into the historical, philosophical, literary, artistic, and cultural dimensions of the human experience. Stanford Humanities Center Stanford Bio-X Biomedical and life science researchers, clinicians, engineers, physicists and computational scientists come together to unlock the secrets of the human body. Stanford Bio-X Freeman Spogli Institute for International Studies (FSI) Understanding problems, policies and processes that cross borders and affect lives around the world. Freeman Spogli Institute More Research Centers Libraries Stanford University Libraries Stanford is home to more than 20 individual libraries, each with a world-class collection of books, journals, films, maps and databases. Stanford University Libraries Online Catalog SearchWorks is Stanford University Libraries’ official online search tool providing metadata about the 8 million+ resources in our physical and online collections. SearchWorks Undergraduate Research Undergraduate Advising and Research (UAR) connects undergraduates with faculty to conduct research, advanced scholarship, and creative projects. Undergraduate Research Research Administration The Office of the Vice Provost and Dean of Research, provides comprehensive information about the research enterprise at Stanford. DoResearch Find A Researcher Search and read profiles of Stanford faculty, staff, students, and postdocs. Find researchers with whom you would like to collaborate. Stanford Profiles Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
}