{
  "id": 9,
  "date": "2024-05-18T18:20:40.912213",
  "url": "https://www.stanford.edu/academics/",
  "university_name": "Stanford University",
  "title": "Search Stanford:",
  "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Academics Stanford students create and apply knowledge by thinking and doing, preparing for leadership in a rapidly changing world. 2,323 Faculty members 6:1 Student-to-faculty ratio Nearly 200 Graduate fields of study Undergraduate Studies Undergraduate Education Stanford Undergrad is your guide to undergraduate academics and opportunities run by the Vice Provost for Undergraduate Education. Stanford Undergrad Majors Explore the 66 major fields of undergraduate study at Stanford. Explore Majors Undergraduate Facts & Figures Approximately 7,800 undergraduate students attend Stanford. Learn more about the undergraduate program and student body. Facts about the Undergraduate Program Seven schools on one campus offer students boundless opportunities to pursue their passions and collaborate on solving complex global problems. Learn more about our seven schools Graduate Studies Office of the Vice Provost for Graduate Education The VPGE office works collaboratively across the University to ensure that every graduate student has the best possible education. Graduate Education Graduate Facts & Figures Today, 9,688 students are pursuing 14 distinct postbaccalaureate degrees in nearly 200 graduate programs in all seven of Stanford’s schools. Learn more about graduate studies at Stanford. Facts about Graduate Studies Lifelong Learning From Pre-K to College Readiness Stanford offers a wide range of programs, classes, internships, and an entire online high school. Our world-class faculty challenge young people to explore and achieve – through STEM research, internationally focused courses, and arts experiences. Pre-K to College Readiness Professional Development Learn from our expert faculty as you grow your knowledge in your professional sphere or prepare to pivot into a new career. Professional Development Learning for Exploration and Enrichment No matter where you live or work, Stanford offers learning opportunities that empower you to feed your curiosity, seek meaning, and engage wholeheartedly in the world. Learning for Exploration and Enrichment Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
}