{
  "id": 9,
  "date": "2024-05-18T18:20:37.516611",
  "url": "https://vpge.stanford.edu/fellowships-funding/graduate-student-funding",
  "university_name": "Stanford University",
  "title": "Graduate Student Funding",
  "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Office of the Vice Provost for Graduate Education Search this site Submit Search Menu Academic Guidance Advising & Mentoring Advising Policies Advising Expectations Advising Practices & Resources Mentoring Resources Policies & Planning Research Policies Problem Solving & Crisis Intervention School Dean's Office Contacts Faculty Advisory Committee Student & Postdoc Advisory Committee Diversity Initiatives Awards 2023 Recipients 2022 Recipients 2021 Recipients 2020 Recipients 2019 Recipients 2018 Recipients 2017 Recipients 2016 Recipients 2015 Recipients 2014 Recipients Programs & Funding Recruitment Professional Development Programs & Funding Grad Grow Search Grad Grow Competencies Campus Partners Ethnic and Community Centers Career Centers Career Planning Stanford Courses Career Development Courses Communication Courses Leadership & Management Courses Diversity, Equity & Inclusion Courses Teaching & Mentoring Courses Interdisciplinary Courses Professionalism Courses Interdisciplinary Learning Stanford Graduate Summer Institute 2024 SGSI Course Overview 2023 SGSI Course Overview 2022 SGSI Course Overview Networking & Learning Programs & Funding Stanford Courses Fellowships & Funding Graduate Student Funding Other Stanford Fellowships External Funding VPGE Fellowships VPGE Fellowship Policies GFS Entry Information VPGE Funding Opportunities Current VPGE Fellows All 2023 Fellows All 2022 Fellows All 2021 Fellows All 2020 Fellows All 2019 Fellows All 2018 Fellows All 2017 Fellows All 2016 Fellows All 2015 Fellows All 2014 Fellows Graduate Fellowships Faculty Advisory Committee Graduate Student Funding Main navigation Skip to main content Secondary Navigation Graduate Student Funding Other Stanford Fellowships External Funding VPGE Fellowships VPGE Fellowship Policies VPGE Funding Opportunities Current VPGE Fellows Main content start The cost of graduate study at Stanford and the resources available for financial support vary by degree, school, and enrollment status. Students are encouraged to plan ahead and anticipate their financial needs. Campus Offices and Resources Your Degree Program Many funding policies and resources are local, so seek out your student services staff, faculty advisor, or faculty director of graduate studies for help or advice first. Financial Aid Office Stanford's main Financial Aid Office (FAO) offers a broad overview of graduate student funding and generates a sample graduate student budget (or estimated “cost of attendance”). The FAO also administers loans and manages Stanford Support Programs such as the Emergency Grant-In-Aid Funds and the Graduate Family Grant Program. The Graduate School of Business, School of Medicine, and Stanford Law School have financial aid offices to serve students pursuing professional degrees. Read the Graduate Basics page Review the Student Budget Learn about Stanford Support Programs Office of the University Registrar The \"Reg Office\" posts annual tuition rates . Student Services Center The Student Services Center can help you understand and pay your bill and provides other student services. Mind Over Money The Mind Over Money program provides workshops. coaching, and extensive personal finance resources, including information about taxes and saving for retirement , to support students' financial wellness during their time at Stanford and beyond. Controller’s Office The Controller’s Office offers information about taxes, student employment, and travel reimbursement. Graduate Academic Policies and Procedures The GAP provides guidelines for graduate financial support, including definitions of typical funding sources and minimum salaries for research and teaching assistants. Read about graduate policies See current assistantship rates Related Links VPGE Fellowships & Funding Other Stanford Fellowships External Funding Stanford Office of the Vice Provost for Graduate Education Web Login Instagram YouTube Flickr Flickr About VPGE Overview Our Mission Meet the Vice Provost History & Milestones Staff Contact Us Report a website problem Quick Links Calendar Programs Recent News Subscribe to Newsletter Partners New Students Faculty & Staff Prospective Students Bookmarks Graduate Academic Policies Graduate Admissions Graduate Funding Graduate Life Office Office of the Registrar Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
}