{
  "id": 9,
  "date": "2024-05-18T18:20:39.889761",
  "url": "https://www.stanford.edu/health-care/",
  "university_name": "Stanford University",
  "title": "Search Stanford:",
  "content": "Skip to content Stanford University Information for: Students Faculty & Staff Families Visitors Alumni Search Menu News Events Academics Research Health Care Campus Life Admission About Search term Search Stanford: Web People Search Web Other ways to search: Map Profiles Main Content Health Care Clinical care, research, and education fuel innovation to advance human health. 1,600+ Faculty physicians New adult hospital Opened in 2019 540,000+ Annual pediatric visits to Stanford Children’s Patient Care We coordinate expertise with the most advanced treatments and technology for the best possible patient outcomes. Stanford Health Care Stanford Medicine delivers unparalleled care for each patient’s unique needs. Our multidisciplinary approach to health care coordinates expertise with the most advanced technology for the best possible outcomes. Stanford Health Care Stanford Children’s Health Stanford Children’s Health is the only health care network in the Bay Area – and one of the few in the country – exclusively dedicated to pediatric and obstetric care. Stanford Children's Health Research We are drawn to the difficult problems, the ones for which prevailing science does not yet have a framework to understand. Medicine Stanford Medicine scientists transform cancer cells into weapons against cancer Medicine Moms’ and babies’ medical data predicts prematurity complications Medicine Potential and pitfalls of smart toilets: Would you use one? Medicine Single drug injection wards off COVID-19 hospitalizations, in Stanford Medicine-led trial More Stanford Medicine Research Education Our strength in interdisciplinary scholarship, our dedicated faculty, and a culture of innovation set the training ground for the next generation of biomedical leaders and pioneers. Stanford School of Medicine With easy access to world-class faculty and coursework in medical science as well as engineering, computer science, education, business, and the humanities, aspiring physicians and scientists can experiment across disciplines and customize their education to match their interests. Stanford School of Medicine Facebook Twitter Instagram LinkedIn YouTube iTunes U Schools Business Education Engineering Humanities & Sciences Law Medicine Sustainability Departments Departments A - to Z Interdisciplinary Programs Research Research Centers A - to Z Libraries Health Care Stanford Health Care Stanford Children's Health Online Learning Stanford Online About Stanford Facts History Accreditation Admission Undergraduate Graduate Financial Aid Resources Campus Map Community Engagement Directory Stanford Profiles Applying Visiting Giving Careers Faculty Positions Contact Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Copyright Stanford University . Stanford , California 94305 ."
}