{
  "id": 9,
  "date": "2024-05-18T18:20:27.197654",
  "url": "https://facultypositions.stanford.edu/en-us/listing/",
  "university_name": "Stanford University",
  "title": "Open Faculty Positions",
  "content": "Skip to main content Stanford University Stanford Faculty Positions Applicant login Menu Applicant login Open Faculty Positions Send me jobs like these We will email you new jobs that match this search. Great, we can send you jobs like this, if this is your first time signing up, please check your inbox to confirm your subscription. The email address was invalid, please check for errors. You must agree to the privacy statement Subscribe Recaptcha Privacy agreement Search results Pediatric Otolaryngology Assistant Professor, Associate Professor or Professor Stanford University Seeking Assistant, Associate or Full Professor in the Division of Pediatric Otolaryngology, in the Department of Otolaryngology-Head and Neck Surgery at Stanford University School of Medicine Assistant, Associate or Full Professor: Vascular Neurosurgery Physician Scientist Stanford University 18 Apr 2025 11:55 PM Pacific Daylight Time The Department of Neurosurgery at Stanford University School of Medicine seeks a full-time vascular neurosurgeon at the rank of Assistant, Associate or Full Professor in the University Medical Line based primarily at Stanford University Medical Center. We are particularly interested in candidates who have significant skills as an outstanding surgeon, teacher, and scientist. We are interested in surgeon scientists who are either open vascular neurosurgery trained, or dual trained in open vascular neurosurgery and neuro interventional radiology. Radiation Oncologist for Proton Therapy Program, Open Rank Stanford University The Division of Radiation Therapy in the Department of Radiation Oncology at Stanford University seeks a board eligible or board-certified radiation oncologist to join the Department as an Assistant, Associate or Full Professor in the University Medical Line. We are particularly interested in candidates who have clinical experience and research in proton therapy. This position will be instrumental in the development of the Proton Therapy Program at our Cancer Center in Palo Alto. Sensory Biologist Assistant Professor, Associate Professor or Professor Stanford University Sensory Biologist or Clinician Scientist sought for the Department of Otolaryngology — Head & Neck Surgery at Stanford University (PhD or MD or equivalent) to join as a faculty member at the rank of assistant professor, associate professor or professor in the University Tenure Line, University Medical Line, or the Non-Tenure Line-Research. Pediatric Neonatology Hospitalist Stanford University The Division of Neonatology in the Department of Pediatrics at Stanford University School of Medicine/ Stanford Medicine Children’s Health is recruiting board certified/eligible pediatricians with strong clinical skills in the hospital care of sick newborns and a special interest in neonatal medicine. We currently have openings for full-time, part-time, and moonlighting positions to join the Division as Clinical Assistant Professors, Clinical Associate Professors, or Clinical Professors in the Clinician Educator Line. Pediatric Immunotherapy Clinical Assistant, Associate, Clinical Professor Stanford University The Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University is seeking board certified/eligible Pediatric Oncologists with an interest in CAR-T and Immunotherapy who can contribute to the Division’s clinical and research enterprise at the Assistant, Associate, or Full Professor level in the Clinician Educator lines. Pediatric Oncology Solid Tumor Clinician Educator Stanford University The Department of Pediatrics, Division of Pediatric Hematology/Oncology in the Stanford University School of Medicine, is seeking board certified/eligible applicants at the Assistant, Associate, or Full Professor level in the Clinician Educator or Medical Center lines who can contribute to the Division’s clinical and research enterprise. Areas of emphasis include solid tumors, with a record of successful collaboration and mentorship. Pediatric Hematology Clinician Educator Stanford University The Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University seeks board certified/eligible pediatric hematology applicants who can contribute to the Division’s clinical and research enterprise at the Assistant, Associate, or Full Professor level in the Clinician Educator lines. Gyn and Head & Neck  Radiation Oncologist Stanford University The Division of Radiation Therapy in the Department of Radiation Oncology at Stanford University seeks a board eligible or board-certified radiation oncologist to join the Department as a Clinical Assistant Professor in the Clinician Educator line. We are particularly interested in candidates who have interest and experience with gynecologic brachytherapy. Clinical Pain Scientist Stanford University The Department of Anesthesiology, Perioperative and Pain Medicine seeks a clinical pain research faculty member (open rank) in the University Tenure Line or University Medical Line. Research areas of interest include acute and chronic pain. We are particularly interested in candidates who have programs focusing on clinical trials, regional anesthesia, implementation science, economics, epidemiology, health services research, public health policy, precision medicine, or other high-impact topics. Gastrointestinal Oncology: Assistant, Associate, or Full Professor Stanford University The Division of Oncology in the Department of Medicine at Stanford University invites applications for a position in Gastrointestinal (GI) Oncology in the University Medical Line (UML) at the rank of Assistant Professor, Associate Professor, or Full Professor.  We are seeking a board-certified or eligible Gastrointestinal (GI) oncologist with demonstrated excellence or potential in clinical care, scholarly research, institutional service, education, and mentoring.  A successful candidate will have a commitment to innovative clinical care and high impact research that advances the field of oncology. Intraoperative Neurophysiologic Monitoring (IONM) Stanford University The Division of Intraoperative Neurophysiologic Monitoring (IONM) in the Department of Neurology  at Stanford University seeks a board-certified neurologist to join the Department as Clinical Assistant Professor in the Clinician Educator Line. The major criterion for appointment in the Clinician Educator Line is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill. We are particularly interested in candidates who have general clinical neurophysiology or one of the subspecialty areas, such as EMG, EEG or evoked potentials and are board certified in clinical neurophysiology. Adolescent Medicine Clinician Educator Stanford University The Division of Adolescent Medicine in the Department of Pediatrics at Stanford University School of Medicine/ Stanford Medicine Children’s Health is recruiting a Clinician Educator as a Clinical Instructor, Clinical Assistant Professor, Clinical Associate Professor, or Clinical Professor. The major criterion for appointment as Clinician Educators is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill. Adolescent Medicine Researcher Stanford University The Division of Adolescent Medicine in the Department of Pediatrics at Stanford University seeks an innovative and collaborative researcher to join the Division as an Assistant Professor, Associate Professor, or Professor in the University Tenure Line, University Medical Line or the Non-tenure Line (Research). We are particularly interested in candidates with MD, MD/PhD, PhD (or equivalent degrees). Hematology Physician Scientist Stanford University The Department of Medicine, Division of Hematology, seeks a physician scientist to be appointed as Assistant or Associate Professor in the University Medical Line (UML). The candidates should have an outstanding (or has the potential to have a)  record of accomplishment in clinical care, teaching, and a focused area of research activity in hematologic malignancies with relevance to acute leukemias, myelodysplastic syndromes, or multiple myeloma. The candidates will be considered across broad areas of expertise including clinical trials and translational research with a laboratory component. Computational Biologist/Data Scientist - Open Rank Stanford University The Stanford Cardiovascular Institute and the Division of Cardiovascular Medicine in the Department of Medicine at Stanford University invite applicants for a faculty position at the rank of Assistant, Associate or Full Professor in the Non-Tenure Line (NTL-R) as a Computational Biologist/Data Scientist. Pediatric Surgeon -  Critical Care Surgeon Stanford University The Division of Pediatric Surgery in the Department of Surgery at Stanford University is seeking to fill two full-time academic surgeon positions. These faculty positions will be at the Assistant, Associate, or full Professor level (based on the candidate’s qualifications) in the University Medical Line (UML). We are particularly interested in candidates who have skills in surgical critical care. The primary location for these positions will be at Stanford Children’s Health, with a percentage of time dedicated to one or more of our satellite locations, including Santa Clara Valley Medical Center, Good Samaritan Hospital, California Pacific Medical Center, and John Muir Medical Center. Child Neurology-Pediatric Stroke CE Stanford University The Division of Child Neurology in the Department of Neurology at Stanford University seeks a board-eligible or board-certified child neurologist to join the Department as Clinical Assistant Professor or Clinical Associate Professor in the Clinician Educator Line. We are particularly interested in candidates who are fellowship-trained in pediatric stroke, adult stroke, and/or pediatric neurocritical care. MIPS Translational Medical Imaging Faculty Position Stanford University The Department of Radiology at Stanford University seeks an Assistant Professor, Associate Professor of full Professor in the University Tenure Line or Non-Tenure Line (Research) to join the Molecular Imaging Program at Stanford. Biomedical Informatics/Immunology/Rheumatology Open Rank Stanford University The Divisions of Immunology and Rheumatology and the Stanford Center for Biomedical Informatics Research in the Department of Medicine at Stanford University are seeking to hire an informatician for an appointment at the rank of Assistant, Associate, or Full Professor, with expertise in either translational research or clinical research. The successful candidate will have formal training in biomedical informatics (or a related discipline) and will develop new computational methods that can be applied to areas such as inﬂammatory disease, autoimmune disease, immunologic mechanisms of disease, “omics” research, clinical research, and pre-clinical models of disease. The position will be in the University Tenure Line or University Medical Line, with the expectation that time will be split among research, mentoring/teaching activities, and (for those with the appropriate training) clinical service. More Jobs 69 Current opportunities Pediatric Otolaryngology Assistant Professor, Associate Professor or Professor Stanford University Seeking Assistant, Associate or Full Professor in the Division of Pediatric Otolaryngology, in the Department of Otolaryngology-Head and Neck Surgery at Stanford University School of Medicine Assistant, Associate or Full Professor: Vascular Neurosurgery Physician Scientist Stanford University 18 Apr 2025 11:55 PM Pacific Daylight Time The Department of Neurosurgery at Stanford University School of Medicine seeks a full-time vascular neurosurgeon at the rank of Assistant, Associate or Full Professor in the University Medical Line based primarily at Stanford University Medical Center. We are particularly interested in candidates who have significant skills as an outstanding surgeon, teacher, and scientist. We are interested in surgeon scientists who are either open vascular neurosurgery trained, or dual trained in open vascular neurosurgery and neuro interventional radiology. Radiation Oncologist for Proton Therapy Program, Open Rank Stanford University The Division of Radiation Therapy in the Department of Radiation Oncology at Stanford University seeks a board eligible or board-certified radiation oncologist to join the Department as an Assistant, Associate or Full Professor in the University Medical Line. We are particularly interested in candidates who have clinical experience and research in proton therapy. This position will be instrumental in the development of the Proton Therapy Program at our Cancer Center in Palo Alto. Sensory Biologist Assistant Professor, Associate Professor or Professor Stanford University Sensory Biologist or Clinician Scientist sought for the Department of Otolaryngology — Head & Neck Surgery at Stanford University (PhD or MD or equivalent) to join as a faculty member at the rank of assistant professor, associate professor or professor in the University Tenure Line, University Medical Line, or the Non-Tenure Line-Research. Pediatric Neonatology Hospitalist Stanford University The Division of Neonatology in the Department of Pediatrics at Stanford University School of Medicine/ Stanford Medicine Children’s Health is recruiting board certified/eligible pediatricians with strong clinical skills in the hospital care of sick newborns and a special interest in neonatal medicine. We currently have openings for full-time, part-time, and moonlighting positions to join the Division as Clinical Assistant Professors, Clinical Associate Professors, or Clinical Professors in the Clinician Educator Line. Pediatric Immunotherapy Clinical Assistant, Associate, Clinical Professor Stanford University The Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University is seeking board certified/eligible Pediatric Oncologists with an interest in CAR-T and Immunotherapy who can contribute to the Division’s clinical and research enterprise at the Assistant, Associate, or Full Professor level in the Clinician Educator lines. Pediatric Oncology Solid Tumor Clinician Educator Stanford University The Department of Pediatrics, Division of Pediatric Hematology/Oncology in the Stanford University School of Medicine, is seeking board certified/eligible applicants at the Assistant, Associate, or Full Professor level in the Clinician Educator or Medical Center lines who can contribute to the Division’s clinical and research enterprise. Areas of emphasis include solid tumors, with a record of successful collaboration and mentorship. Pediatric Hematology Clinician Educator Stanford University The Division of Hematology, Oncology, Stem Cell Transplantation and Regenerative Medicine in the Department of Pediatrics at Stanford University seeks board certified/eligible pediatric hematology applicants who can contribute to the Division’s clinical and research enterprise at the Assistant, Associate, or Full Professor level in the Clinician Educator lines. Gyn and Head & Neck  Radiation Oncologist Stanford University The Division of Radiation Therapy in the Department of Radiation Oncology at Stanford University seeks a board eligible or board-certified radiation oncologist to join the Department as a Clinical Assistant Professor in the Clinician Educator line. We are particularly interested in candidates who have interest and experience with gynecologic brachytherapy. Clinical Pain Scientist Stanford University The Department of Anesthesiology, Perioperative and Pain Medicine seeks a clinical pain research faculty member (open rank) in the University Tenure Line or University Medical Line. Research areas of interest include acute and chronic pain. We are particularly interested in candidates who have programs focusing on clinical trials, regional anesthesia, implementation science, economics, epidemiology, health services research, public health policy, precision medicine, or other high-impact topics. Gastrointestinal Oncology: Assistant, Associate, or Full Professor Stanford University The Division of Oncology in the Department of Medicine at Stanford University invites applications for a position in Gastrointestinal (GI) Oncology in the University Medical Line (UML) at the rank of Assistant Professor, Associate Professor, or Full Professor.  We are seeking a board-certified or eligible Gastrointestinal (GI) oncologist with demonstrated excellence or potential in clinical care, scholarly research, institutional service, education, and mentoring.  A successful candidate will have a commitment to innovative clinical care and high impact research that advances the field of oncology. Intraoperative Neurophysiologic Monitoring (IONM) Stanford University The Division of Intraoperative Neurophysiologic Monitoring (IONM) in the Department of Neurology  at Stanford University seeks a board-certified neurologist to join the Department as Clinical Assistant Professor in the Clinician Educator Line. The major criterion for appointment in the Clinician Educator Line is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill. We are particularly interested in candidates who have general clinical neurophysiology or one of the subspecialty areas, such as EMG, EEG or evoked potentials and are board certified in clinical neurophysiology. Adolescent Medicine Clinician Educator Stanford University The Division of Adolescent Medicine in the Department of Pediatrics at Stanford University School of Medicine/ Stanford Medicine Children’s Health is recruiting a Clinician Educator as a Clinical Instructor, Clinical Assistant Professor, Clinical Associate Professor, or Clinical Professor. The major criterion for appointment as Clinician Educators is excellence in the overall mix of clinical care, teaching, administrative and/or scholarship appropriate to the programmatic need the individual is expected to fulfill. Adolescent Medicine Researcher Stanford University The Division of Adolescent Medicine in the Department of Pediatrics at Stanford University seeks an innovative and collaborative researcher to join the Division as an Assistant Professor, Associate Professor, or Professor in the University Tenure Line, University Medical Line or the Non-tenure Line (Research). We are particularly interested in candidates with MD, MD/PhD, PhD (or equivalent degrees). Hematology Physician Scientist Stanford University The Department of Medicine, Division of Hematology, seeks a physician scientist to be appointed as Assistant or Associate Professor in the University Medical Line (UML). The candidates should have an outstanding (or has the potential to have a)  record of accomplishment in clinical care, teaching, and a focused area of research activity in hematologic malignancies with relevance to acute leukemias, myelodysplastic syndromes, or multiple myeloma. The candidates will be considered across broad areas of expertise including clinical trials and translational research with a laboratory component. Computational Biologist/Data Scientist - Open Rank Stanford University The Stanford Cardiovascular Institute and the Division of Cardiovascular Medicine in the Department of Medicine at Stanford University invite applicants for a faculty position at the rank of Assistant, Associate or Full Professor in the Non-Tenure Line (NTL-R) as a Computational Biologist/Data Scientist. Pediatric Surgeon -  Critical Care Surgeon Stanford University The Division of Pediatric Surgery in the Department of Surgery at Stanford University is seeking to fill two full-time academic surgeon positions. These faculty positions will be at the Assistant, Associate, or full Professor level (based on the candidate’s qualifications) in the University Medical Line (UML). We are particularly interested in candidates who have skills in surgical critical care. The primary location for these positions will be at Stanford Children’s Health, with a percentage of time dedicated to one or more of our satellite locations, including Santa Clara Valley Medical Center, Good Samaritan Hospital, California Pacific Medical Center, and John Muir Medical Center. Child Neurology-Pediatric Stroke CE Stanford University The Division of Child Neurology in the Department of Neurology at Stanford University seeks a board-eligible or board-certified child neurologist to join the Department as Clinical Assistant Professor or Clinical Associate Professor in the Clinician Educator Line. We are particularly interested in candidates who are fellowship-trained in pediatric stroke, adult stroke, and/or pediatric neurocritical care. MIPS Translational Medical Imaging Faculty Position Stanford University The Department of Radiology at Stanford University seeks an Assistant Professor, Associate Professor of full Professor in the University Tenure Line or Non-Tenure Line (Research) to join the Molecular Imaging Program at Stanford. Biomedical Informatics/Immunology/Rheumatology Open Rank Stanford University The Divisions of Immunology and Rheumatology and the Stanford Center for Biomedical Informatics Research in the Department of Medicine at Stanford University are seeking to hire an informatician for an appointment at the rank of Assistant, Associate, or Full Professor, with expertise in either translational research or clinical research. The successful candidate will have formal training in biomedical informatics (or a related discipline) and will develop new computational methods that can be applied to areas such as inﬂammatory disease, autoimmune disease, immunologic mechanisms of disease, “omics” research, clinical research, and pre-clinical models of disease. The position will be in the University Tenure Line or University Medical Line, with the expectation that time will be split among research, mentoring/teaching activities, and (for those with the appropriate training) clinical service. More Jobs 69 Powered by PageUp Job search Refine search Work type CE - Clinician Educator 53 Non-Tenure Line (Research) 11 University Medical Line 49 University Tenure Line 30 Locations Stanford University 88 VA Palo Alto Health Care System (VAPAHCS) 2 Categories School Doerr School of Sustainability 1 School of Engineering 2 School of Humanities & Sciences 1 School of Medicine 86 Get Help Questions about a job or your application? Find out how to request help Equal Opportunity Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job. Stanford is an equal employment opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity,\r\n                            national origin, disability, protected veteran status, or any other characteristic protected by law. Stanford welcomes applications from all who would bring additional dimensions to the University’s research, teaching, and clinical missions. Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University. Stanford, California 94305."
}