{
  "id": 9,
  "date": "2024-05-18T18:20:30.999574",
  "url": "https://library.stanford.edu/",
  "university_name": "Stanford University",
  "title": "What can we help you find?",
  "content": "Skip to main content Stanford University Stanford Libraries Library Accessibility My Account Contact Us Menu Keyword Search Search Home Services Services submenu Services A-Z Search and find Borrow and request Off-campus access Instruction support Course reserves Research support Research support submenu Find a subject specialist Subjects A-Z Guides Workshops Increase your research impact Data support and services Explore collections Libraries Libraries submenu Branches and centers Places to study News and events Search Quick Links: My Account Search Results Accessibility Contact Us What can we help you find? Keyword Search Search Search gives results from this site, catalog , articles+ , guides , online exhibits , and EarthWorks . Today's Hours See all hours Highlights Shortlist Announced for the 2024 William Saroyan International Prize for Writing Press release Learning the history of evolution and primatology In the media Tompkins Conservation places archive at the Stanford University Libraries in support of ongoing field studies and research in Chile and Argentina Press release Coming soon Stanford Libraries presents The New Deal & The Federal Writers' Project | Selections from the Bruce and Rachel Jeffer Collection , on view May 6, 2024, through January 26, 2025, in the Peterson Gallery and Munger Rotunda, Cecil H. Green Library, Bing Wing. Learn more about the exhibit Current and upcoming events See more events Oct 25 — Jun 23 Seeing Silicon Valley Exhibition 10/25/2023 October 25, 2023 - June 23, 2024 Open in map Jan 9 — Jun 21 The Apes & Us: A Century of Representations of Our Closest Relatives Exhibition 1/9/2024 January 9, 2024 - June 21, 2024 Open in map Mar 13 — Jun 15 Religion in Manga and Anime: A Poster Exhibition by IntroSems RELIGST 6N Exhibition 3/13/2024 March 13, 2024 - June 15, 2024 Open in map Nuremberg Trial Archives The Taube Archive of the International Military Tribunal at Nuremberg, 1945-1946 (IMT) is now available as the result of a partnership between the Stanford Libraries and the Stanford Center for Human Rights and International Justice. Find out more about the partnership Featured collections See more collections Ruth Asawa Papers The papers of Japanese American artist and educator Ruth Asawa document her art as well as her involvement in arts education, civic art, and arts administration. The collection contains correspondence, notes, portfolios, publicity, articles and publications, design sketches, photographs, and audiovisual media. View the collection Gordon Moore papers, 1958–2005 This collection contains Moore’s Intel lab notebooks, personal and business correspondence, Intel presentations, memos and white papers, personal notes from meetings, greeting cards, photographs, cassette tapes and videos. The materials date from 1958 to 2005, but the majority dates from 1968 to 1999. View the collection Eliasaf Robinson Tel Aviv Collection Assembled over a span of forty years by Eliasaf Robinson, a Tel Aviv native and Israel's most prominent antiquarian bookseller, this collection comprises a rich trove of books, pamphlets, magazines, printed ephemera, posters, postcards, photographs, maps, architectural plans, and original documents about the early history of Tel Aviv, \"the First Hebrew City.\" View the finding aid Kogu me lugu: digital video interviews, 2014 Explore this collection of oral history interviews with members of the Estonian diaspora who have lived under or fled from the Soviet and/or German occupation in Estonia. View the collection Maps of Africa Stanford Libraries is home to a strong collection of maps of Africa, including maps donated by Oscar I. Norwich and Caroline Batchelor as well as maps from the Barry Lawrence Ruderman Collection, the University of Cape Town Collections, and the David Rumsey Map Collection. View the exhibit The Durand-Lesley Propeller Collection The Durand-Lesley propellers in the Terman Library are the surviving artifacts of a famous experiment in early aviation history which defined a process method in engineering research still in use today. Read our article about the collection Latest news See more news Polish scholarly journal devoted to the history of the book and archival collections Story Sabrina Gunn joins Special Collections as the Digital Archivist for the Dianne Feinstein Senatorial Papers Staff news Linnea Shieh promoted to Head, Terman Engineering Library Staff news Web accessibility Stanford University is committed to providing an online environment that is accessible to everyone, including individuals with disabilities. Having trouble accessing any of this content due to a disability? Learn more about accessibility at Stanford and report accessibility issues . Stanford Libraries 557 Escondido Mall Stanford, CA 94305 All locations and hours Contact us Who we are About us Staff directory Department directory Staff publications and research Student job openings Careers Administration General policies Copyright notice System status Support Stanford Libraries Donate Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University. Stanford, California 94305."
}