{
  "id": 9,
  "date": "2024-05-18T18:20:31.348210",
  "url": "https://postdocs.stanford.edu/prospective-postdocs",
  "university_name": "Stanford University",
  "title": "SUNetID Login",
  "content": "Skip to content Skip to navigation SUNetID Login SUNetID Login Office of Postdoctoral Affairs All Postdocs. All the Time. Search form Search Navigation menu Main menu Home About Prospective Postdocs Current Postdocs Faculty Mentors Postdoc Admins Prospective Postdocs Stanford has a thriving academic community which includes over 2,400 postdoctoral scholars. Stanford prides itself on recruiting skilled and talented scholars from all over the world and supporting their training to independent careers. If you are considering Stanford for postdoctoral training, explore the full range of faculty and research interests, familiarize yourself with the postdoc benefits, and understand the cost of living in the vibrant and dynamic Bay Area. Considering Stanford? Successful postdoctoral training requires strong mentoring relationships. Postdocs are appointed to a faculty sponsor who supports their training. Use these links to identify the best research and mentoring fit for you. Finding Faculty Mentors How To Apply SOM Faculty List University Faculty List Open Postdoctoral Positions Stanford Life Stanford is in the heart of Silicon Valley, in easy reach of arts, nature, and intellectual pursuits. Cost of Living Campus Life Postdoc Community Housing Quick Links Funding Levels and Guidelines Postdoc Benefits Visas for Postdocs Fellowship Opportunities Postdoctoral Recruitment Initiative in Sciences and Medicine (PRISM) About About Us Postdoc Benefits Open Postdoc Positions Diversity in Postdoctoral Scholar Training Postdoc Emergency Resources Verify Appointments Policy Policy Funding Guidelines Budgeting for Fellowships Contact Us Medical School Office Building (MSOB) 1265 Welch Rd., Suite 100 Stanford, CA 94305-5402 Map to MSOB Building Contact OPA Submit suggestions here! Connect Facebook Twitter Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 ."
}