{
  "id": 9,
  "date": "2024-05-18T18:20:21.167321",
  "url": "https://giving.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Giving to Stanford",
  "content": "Skip to main content My Giving (external link) Contact Us Make a Gift (external link) Stanford Giving Menu Areas to Support Why Give How to Make a Gift Give Now Online (external link) Phone or mail Stocks, securities, or wire transfers Memorial or honorary gifts Matching gifts International gifts The Stanford Fund Reunion campaigns Give Over Time New pledge (external link) Make a pledge payment (external link) Give a recurring gift (external link) Plan Your Gift Planned Giving overview Meet the team Bequests and estate plan gifts Life income gifts Donor advised funds Give assets All the ways to make a gift Give through The Stanford Fund to support undergrads. About The Stanford Fund Your Impact Donor Recognition My Giving (external link) Honor rolls (external link) Stanford Loyal Stanford Fund leadership giving Endowed positions Recent estate gifts Founding Grant Society Founders’ Circle Pioneers Pledge All donor communities Give With Your Class Seniors for The Stanford Fund Dollars for Doers Challenge Undergrad reunion campaigns Business school reunion (external link) Law school reunion (external link) Other Ways to Get Involved Ways to volunteer Stanford Fund volunteers Reunion volunteers Stanford Alumni Association (external link) Outreach Volunteer Alumni Link (OVAL) (external link) Read about the many ways you accelerate Stanford’s purposeful impact in the world. Find stories About Office of Development Get to know us Contact us Careers About Giving Gift policies About endowed giving Frequently asked questions Stories We’re here to help you make your biggest impact. Connect with the giving team Search this site Giving to Stanford When you give to Stanford, you drive positive change in the world. Discover why giving matters The Stanford Fund Make a difference in the life of a student. Securities and transfers Make a gift of stock or other securities. Areas to Support Explore opportunities to support the Stanford community. Diversity, equity, inclusion Support inclusion, equity, and access for all. Athletics Support student-athletes today to create leaders for tomorrow. Planned Giving Achieve your philanthropic and financial goals. Why I give “The world needs creative, cross-functional solutions to the existential challenges we face. Stanford is a special place in a constant state of renewal, and it requires work from alumni to keep it special. I want to play my very small part in that.” Calley Means, ’08 Read the latest stories Gift helps expand, reimagine Native American Studies Stanford's Native American Studies program receives a first-of-its-kind gift from Eric and Wendy Schmidt that will further existing offerings and support new ones VanDerveer honored with named court, coachship A women’s basketball assistant coachship to honor former coach Tara VanDerveer was created by a gift from Tashia and John Morgridge, MBA ’57. Donor-funded curriculum transformation projects gain momentum Six teams across campus aim to ensure that all Stanford students can experience belonging and success. See all stories Make your gift Supporting students, fueling groundbreaking research, advancing solutions to societal challenges—your gifts to Stanford drive positive change in the world. Give now (external link) Links to more information Support your cause. Explore giving stories. Talk to a staff member. Stanford Giving Need to get in touch? P.O. Box 20466 Stanford, CA 94309-0466 (650) 724-0627 Talk to the team About Office of Development Office of External Relations (external link) Alumni Association (external link) Careers Make a gift Give now (external link) Gift policies How to make a gift Request help with your gift (external link) FAQs Tax ID 94-1156365 Information for … Advisors Alumni Alumni in reunion Institutional funders (external link) International donors Parents and families Students Stanford University Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University. Stanford, California 94305. Close Hi, what can we help you find today? Uh oh, it looks like nothing was submitted. Please enter your search terms above and hit enter or click the search icon. Consider browsing by category: Popular topics How to make a gift Talk to the team Planned giving Stocks, securities, or wire transfers Frequently asked questions Get Involved Make a gift (external link) Discover areas to support Support The Stanford Fund Become a volunteer Read donor stories"
}