{
  "id": 9,
  "date": "2024-05-18T18:20:32.461222",
  "url": "https://engineering.stanford.edu/",
  "university_name": "Stanford University",
  "title": "The science of light",
  "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Engineering Search this site Submit Search Menu Admission & Aid Graduate Admission Coterm Coterm Funding and Financial Aid Engineering Coterminal Fellowship Financial Aid Students & Academics Academics Undergraduate Degree Programs Graduate Degree Programs Online Learning Terman Engineering Award Terman Awards 2023-2024 Terman Awards 2022-2023 Terman Awards 2021-2022 Terman Awards 2020-2021 Terman Awards 2019-2020 Terman Award 2018-2019 Terman Awards 2017-2018 Terman Awards 2016-2017 Terman Awards 2015-2016 Terman Awards 2014-2015 Terman Awards 2013-2014 Terman Awards 2012-2013 Terman Awards 2011-2012 Terman Awards 2010-2011 Terman Awards 2009-2010 Terman Awards 2008-2009 Terman Awards 2007-2008 Terman Awards 2006-2007 Terman Awards 2005-2006 Terman Awards 2004-2005 Support and Resources Undergraduate Resources Graduate Resources Tutoring Career Resources Jobs and Internships Student Organizations Terman Engineering Library Global Engineering Programs Global Engineering Internships GEI Program Structure GEI Application Process Internship Host Companies GEI Program Recommendation Travel Information GEI Frequently Asked Questions International Graduate Student Programming Board Event Proposal Form Chinese UGVR Program UGVR Alumni Program Structure Host a UGVR Student About Equity and Inclusion Initiatives About the Equity and Inclusion Initiatives Our Student Community Undergraduate Programs Stanford Summer Engineering Academy (SSEA) SSEA 2024 Staff FAQs Summer Session Grants Additional Calculus for Engineers (ACE) Enroll in ACE Courses Meet Your ACE CAs Become an ACE Course Assistant ACE Course List Contact Us | ACE Leadership Team Prospective Graduate Programs Graduate Pathways to STEM Program At a Glance GPS Frequently Asked Questions Summer Undergraduate Research Fellowship (SURF) Stanford Exposure to Research and Graduate Education (SERGE) Stanford Engineering Research Introductions (SERIS) Fee Waivers Graduate school frequently asked questions Graduate Programs Summer Opportunities in Engineering Research and Leadership (Summer First) NSF Research Exchange Program Dean’s Graduate Student Advisory Council STEM K-12 Education Initiatives Funding and Financial Aid Funding Your Master’s Degree Funding Your PhD Teaching and Course Assistantships Technical Communication Program Consulting Request Form Frequently Asked Questions The Student Experience Faculty & Research Faculty Emeritus Faculty In Memoriam Events Departments Aeronautics & Astronautics Bioengineering Chemical Engineering Civil & Environmental Engineering Computer Science Electrical Engineering Management Science & Engineering Materials Science & Engineering Mechanical Engineering Institutes, Labs and Centers Faculty Awards 2023-2024 Faculty Awards 2022-2023 Faculty Awards 2021-2022 Faculty Awards 2020-2021 Faculty Awards 2019-2020 Faculty Awards 2018-2019 Faculty Awards 2016-2017 Faculty Awards 2015-2016 Faculty Awards 2014-2015 Faculty Awards 2012-2013 Faculty Awards 2011-2012 Faculty Awards 2010-2011 Faculty Awards 2009-2010 Faculty Awards 2008-2009 Faculty Awards 2007-2008 Faculty Awards 2006-2007 Faculty Awards 2005-2006 Get Involved Welcome Engineering Alumni Connect With Your Community Advance Your Career Explore Our Events Jumpstart Your Alumnihood Stanford Engineering Reunion Weekend 2022 Support Engineering Why Give Funding Initiatives making@stanford Equity and Inclusion Initiatives Stanford Data Science & Computation Complex Endowed Professorships Endowed Faculty Scholars Endowed Fellowships Faculty Launch Fund Hasso Plattner Institute of Design (d.school) Engineering Fund Estate and Planned Gifts Pioneers Pledge How to Make Your Gift Development Contacts Industry Collaborations Gift Support Affiliate Programs Sponsored Research Recruiting Executive Education Technology Transfer/Technology Licensing About Dean Dean’s Office Directory Diversity, Equity and Inclusion Visit Location Inside the Engineering Quad Pillars History Persis S. Drell Heroes 2019 Heroes 2018 Heroes George and Alexandra “Sandra” Forsythe Jensen Huang Mae Jemison 2016 Heroes Martin Fisher Reed Hastings Perry McCarty 2015 Heroes Andreas Acrivos Marcian “Ted” Hoff Charles Simonyi 2014 Heroes Kenneth Arrow Sergey Brin Irmgard Flugge-Lotz Edward Ginzton Larry Page Sally Ride 2013 Heroes John A. Blume James H. Clark David Filo Martin Hellman John McCarthy William J. Perry Jerry Yang 2012 Heroes Craig Barrett Andreas Bechtolsheim Morris Chang George Dantzig Theodore Maiman Bradford Parkinson Calvin Quate Stephen Timoshenko 2011 Heroes Vint Cerf Ray Dolby William F. Durand William Hewlett Donald Knuth Charles Litton David Packard Fred Terman SoE-Future Vision Culture Education Impact Research The Catalyst for Collaborative Solutions White Papers The Committee The science of light How the field of photonics is creating a brighter future. Read More Main content start Stanford Engineering has long been at the forefront of groundbreaking research, education and innovation. Through the development and application of engineering principles across disciplines, we are tackling the major challenges of the 21st century. Read the latest about our research News and Information Stanford’s Code in Place introductory programming course offers a new model for large-scale interactive learning School News New drug delivery system could reduce daily diabetes shots to just three a year Health Materials Technology & Society Stanford Engineering announces annual staff award winners School News Meet some of the students, faculty and alumni who make up our community. Student spotlights >> Faculty back stories >> Alumni stories >> Diversity, Equity and Inclusion Central to the School of Engineering’s mission is a commitment to increasing diversity by supporting individuals historically excluded in the field. We welcome a diverse group of faculty, students, and staff in an environment that is nurturing, welcoming and inclusive of individuals from a variety of backgrounds, perspectives and beliefs. Learn more Degree & research opportunities With opportunities for exceptional research and mentorship and an array of majors and classes, students have the opportunity to get the most out of an experience at Stanford. We offer several degree programs , as well as research opportunities with faculty in labs and in worldwide experiences in the field. Start your application here What's it like to be a Stanford Engineering student? Learn more What is Aeronautical and Astronautical Engineering? At Stanford, the Department of Aeronautics and Astronautics integrates multiple engineering disciplines and focuses on structural, aerodynamic, propulsion, and guidance and control challenges posed by aircraft and spacecraft. Learn about Aeronautical and Astronautical Engineering Jump right in Learn more below about how to get involved or stay involved. Subscribe to our email & podcast Read our biweekly email and listen to Stanford Engineering’s Future of Everything podcast to learn all about our latest research. Subscribe to our email Stanford Engineering’s Future of Everything podcast Support engineering Your gift can make a positive change for our people and our research. Giving options Connect with alumni The Stanford Engineering community is made up of 70,000 people who are working to solve global problems. Plug in for lifelong learning opportunities, career support and mentorship opportunities. Learn more Stanford ENGINEERING Web Login Address 475 Via Ortega Stanford , CA 94305 United States Facebook Twitter LinkedIn Youtube Instagram Stanford Engineering News Events Departments Open Faculty Positions Open Staff Positions Intranet Give Visit Contact Us Sign up for our email Your source for the latest from the School of Engineering Subscribe now Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
}