{
  "id": 9,
  "date": "2024-05-18T18:20:28.272298",
  "url": "https://facts.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Student Enrollment",
  "content": "Skip to main content Stanford University (link is external) Stanford Facts Search this site Submit Search Menu Home About Stanford Welcome to Stanford Campus History Historic Milestones Alumni Academics Schools & Programs Undergraduate Education Graduate Education Faculty Postdoctoral Scholars Research Research & Innovation Technology & Inventions Libraries and Resources Campus Life Student Life Cardinal Athletics The Arts Administration & Finances University Administration Presidents and Provosts Staff Finances Stanford Medicine Search this site Submit Search Stanford Facts Learn more about Stanford University, a place of learning, discovery, and innovation. Founded in 1885, Stanford’s areas of excellence span seven schools along with research institutes, the arts and athletics. Student Enrollment 7,841 undergraduate Class of 2027 profile 9,688 graduate As of Autumn Quarter, 2023 Faculty 2,323 faculty members 20 Nobel laureates are currently members of the Stanford community Campus 8,180 contiguous acres Over 600 buildings Research 7,500+ externally sponsored projects $1.98 billion total budget Established 1885 Opened 1891 Leadership President Richard Saller Provost Jenny Martinez Seven Schools Business Doerr School of Sustainability Education Engineering Humanities and Sciences Law Medicine Endowment $36.5 billion (as of August 31, 2023) Download Download the fact book PDF by clicking on the book image above Stanford University Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305."
}