{
  "id": 9,
  "date": "2024-05-18T18:20:27.806838",
  "url": "https://sustainability.stanford.edu/",
  "university_name": "Stanford University",
  "title": "Understanding how wildfires change soil could aid recovery",
  "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Search this site Submit Search Menu Impact Get Involved A Living Lab Community Commencement Faculty Faculty talks Community Awards Environmental Justice Diversity, Equity & Inclusion About our DEI Vision Community DEI Resources DEI Library Prospective Students Current Students Faculty & Staff Excellence in DEI Awards Meet the DEI Team SURGE SURGE program details FAQs Potential Projects for 2024 Land Acknowledgment Events Alumni Events All Events Get Involved Advance your Career Awards Leadership Dean Arun Majumdar Advisory Council Our Values and Practices How we put our values into practice Field expectations Reporting structures and resources Admissions & education Student Experience Careers Undergraduate Research Opportunities Hopkins Internships - Summer Undergraduate Research Funds (HI-SURF) Mentoring Undergraduates in Interdisciplinary Research (MUIR) Summer Undergraduate Program on Energy Research (SUPER) Sustainability Undergraduate Research in Geoscience and Engineering (SURGE) Admissions Executive Education Field Learning Wrigley Field Program in Hawaii Field Resources Professional Development Academic Professional Program The Pillars FAQs Events Sustainability Graduate Certificates Climate Change Sustainable Energy Sustainability Decision Making FAQs K-12 Outreach Geokids Program Geokids FAQs Young Investigators Internship Options FAQs Postdoctoral Resources The school Departments & Programs Environmental Behavior Sciences Global Environmental Policy Sustainability Accelerator Institutes & Centers Shared Analytical Facilities & Research Resources Industrial Affiliates Programs Research news History News & events Main content start Understanding how wildfires change soil could aid recovery Severe wildfires can drive chemical changes in soil that affect ecosystem recovery and risks to human health. A new study finds broader surveillance and modeling of these changes could inform strategies for protecting lives, property, and natural resources, and managing wildlife. Read how wildfires change soil chemistry Our research Transformative research by our scholars reveals insights into our world and drives ideas to impact. Read about our research and impact Sign up for our monthly newsletter John Kerry shares his ‘unfettered’ optimism on climate May 14, 2024 The 68th Secretary of State and first presidential envoy on climate discussed protests, nuclear energy, and why he left government in a wide-ranging conversation moderated by venture capitalist John Doerr. Stanford Report Events People with gas and propane stoves breathe more unhealthy nitrogen dioxide May 3, 2024 A new study of air pollution in U.S. homes reveals how much gas and propane stoves increase people’s exposure to nitrogen dioxide, a pollutant linked to childhood asthma. Even in bedrooms far from kitchens, concentrations frequently exceed health limits while stoves are on and for hours after burners and ovens are turned off. Stanford News Health and wellbeing Hurricane risk perception drops after storms hit April 9, 2024 Programs and policies that help households go beyond stocking up on food and medical supplies to invest in longer-term protections could overcome the risk perception gap and support adaptation to rising climate-related threats. Stanford News Human behavior Apply now Admissions Graduate certificates Postdoctoral fellowships Arun Majumdar Inaugural Dean, Stanford Doerr School of Sustainability “Mother Earth is begging us to restore the atmosphere, the oceans, and our biodiversity. For our own sake. For the sake of our children and grandchildren.” Read the full text of Majumdar's opening remarks Meet the Dean Learn about the school Our distinctive three-part structure is designed to amplify global impact. Departments and programs generate knowledge Institutes innovate across disciplines The Accelerator drives policy and technology solutions Our community Sustainability challenges affect everyone, and we need to include all voices in creating global solutions. We support a diverse community of faculty, students, and staff through our DEI programming, including our courses , financial aid, and affinity groups . We also hold ourselves accountable by tracking our progress . Meet our people Learn more about our DEI programs News about our people and programs John Kerry shares his ‘unfettered’ optimism on climate May 14, 2024 The 68th Secretary of State and first presidential envoy on climate discussed protests, nuclear energy, and why he left government in a wide-ranging conversation moderated by venture capitalist John Doerr. Stanford Report Events How to get corporate sustainability right May 8, 2024 Mastercard’s chief sustainability officer discusses how companies can avoid greenwashing and align with their social and environmental values. Stanford Woods Institute for the Environment Cities & Society Spotlight: Josheena Naggea May 7, 2024 \"Every time I go home, it's a powerful, grounding experience to visit Blue Bay. I grew up in Mauritius, a small island nation 500 miles east of Madagascar in the Indian Ocean.\" Center for Ocean Solutions Postdoctoral researchers Read all school news Join us There are many ways to join us in our commitment to cultivating deep knowledge and high-impact solutions to pressing planetary challenges. Follow our updates Learn about our advances and impact through email and social media. Follow us Get involved We offer many opportunities to join us in making a difference. Get involved Support our work Your support helps us fund new research, hire faculty, and create solutions. Support us Upcoming events See All Events May 18 Paper Worlds: Urbano Monte and the Global Renaissance Conference/Symposium Saturday, May 18, 2024 | 10:00am - 4:30pm PDT David Rumsey Map Center May 18 Questions for a Tree Performance Saturday, May 18, 2024 | 7:00pm PDT O'Donohue Educational Farm May 20 Branner Library Monthly Book & Map Exhibit: Asian American and Pacific Islander Heritage Month Exhibition Monday, May 20, 2024 Mitchell Earth Sciences Earth. Climate. Society. The Stanford Doerr School of Sustainability draws on a deep understanding of Earth, climate, and society to create knowledge and scalable solutions, in collaboration with partners worldwide. Together, we strive to create a future where humans and nature thrive in concert and in perpetuity through excellence in research, education, innovation, and service. Learn how we’ll have an impact Stay connected Get involved Follow us Contact Us Visit Us Facebook LinkedIn Twitter Instagram Threads Quick links Admissions Upcoming events Give Open staff positions Open faculty positions Intranet Login Website feedback Learn more Departments and Programs Stanford Woods Institute for the Environment Precourt Institute for Energy Sustainability Accelerator Stanford land acknowledgement Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
}