{
  "id": 9,
  "date": "2024-05-18T18:20:47.271463",
  "url": "https://visit.stanford.edu",
  "university_name": "Stanford University",
  "title": "Search form",
  "content": "Visitor Information Services Visitor Information Welcome to the Farm Stanford University is a place where pioneering spirit meets 21st-century possibility. Announcements Spring 2024 Tours and Programs for Prospective Undergraduates (Updated 2/12/2024) The schedule of prospective undergraduate tours and programs being offered for Stanford’s 2024 Spring Break week (March 25-29) and for Spring Quarter (April 1 - June 5) was posted for online registration at 12:00pm noon (Pacific Time) on Monday, February 12. See details We strongly encourage prospective undergraduates wishing to visit campus to consider a visit (if possible) that does not fall during the period from March 16 through April 14, when visitor volume is high but student activity and tour availability is limited by final exams, Stanford's own Spring Break, and the beginning of the Spring academic Quarter. These dates fill up quickly. Additional space will be added if/as student staffing allows. The Office of Undergraduate Admission offers a variety of tours and programs – both virtual and in-person – for prospective undergraduate students and their supporters, with expanded offerings on Mondays and Fridays. Additional programming generally includes virtual offerings on a weekly basis. Tours are provided to qualifying organized groups from Tuesday-Thursday based upon availability; group visits require advance booking. The Stanford Visitor Center is generally open from Monday through Friday from 9:00am-5:00pm (with the exception of federal holidays and some breaks between quarters) to provide information about visiting campus. Tours for Approved Groups/Organizations available by reservation (Updated 3/22/2024) Guided tours of campus for groups of prospective undergraduate students (schools, organizations, etc.) are available to approved groups by advance reservation on most weekdays during the academic quarter. See details The Office of Undergraduate Admission is pleased to announce that 45-minute tours are once again provided by advance reservation to qualifying organizations, with tours times available for reservation during the fall on most weekdays (holiday periods excluded) from Week 3 through Week 10 of each academic quarter. Please note that no group tours or visits will be scheduled from March 15 through April 15, 2024 , the period just before, during, and after Stanford's Spring Break. At this point, all new Group Tour requests should be sent to grouptours@stanford.edu . Requests that have already been submitted for fall and beyond will be reviewed and receive responses based upon tour availability and qualifying status. Qualifying organizations: The Office of Undergraduate Admission seasonally offers guided tours by appointment for prospective undergraduate student groups of 10 or more people (up to 100 max) from the following categories: High Schools Community Colleges Not-For-Profit Organizations focused on Access or Exposure to College Qualifying Community Based Organizations Other groups: Middle schools, grade schools, and other qualifying organizations may request approval to visit and park on campus, and can be provided with resources to enjoy a self-guided visit with age appropriate sites, resources, and activities, but we are sorry to say that we are no longer providing staffing for guided tours for these age levels. Please note that we will not grant requests for group visits through commercial or third party tour operators. All requests and communications must come from and and be processed through a qualifying organization. Experience Stanford Stanford 360° Virtual Tour Welcome admitted students and all future applicants! Events Events at Stanford Current Weather Stanford, CA, USA Stanford Station Online Resources Virtual Tours Stanford Mobile App Related Sites Financial Aid Undergraduate Admission Contact Us Connect with us Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University . Stanford , California 94305 ."
}