{
  "id": 9,
  "date": "2024-05-18T18:20:27.448428",
  "url": "https://wasc.stanford.edu/",
  "university_name": "Stanford University",
  "title": "WSCUC reaffirms Stanford's accreditation",
  "content": "Skip to main content Skip to secondary navigation Stanford University (link is external) Stanford Accreditation Search this site Submit Search Menu Home 2023 Accreditation Overview Our report Accreditation committees Timeline Standards of Accreditation Standard 1 Standard 2 Standard 3 Standard 4 Student Achievement Overview Aims of a Stanford Education Resources Current accreditation Previous accreditation 2013 Accreditation Institutional Proposal (May 2008) Capacity and Preparatory Review (2010) Educational Effectiveness Review (2012) Steering Committee Members Investigation Subcommittees 2001 Accreditation 1991 Accreditation Distance Education WSCUC reaffirms Stanford's accreditation Read the commission's letter Main content start Accreditation Stanford is accredited by the Western Association of Schools and Colleges Senior College and University Commission (WSCUC). WASC Senior College and University Commission 985 Atlantic Avenue, Suite 100 Alameda, CA 94501 (510) 748-9001 In addition, certain programs of the university have specialized accreditation. For information, contact the Office of the University Registrar . Student Achievement Review information on student completion rates as well as assessments of degree programs. Read more Quick Links Stanford's most recent accreditation letter (2023) 2023 report (TPR) 2012 report (EER) What is WSCUC accreditation? WSCUC Accreditation Handbook Stanford Accreditation Web Login Related Links Stanford Registrar's Office IR&DS WSCUC Website Contact Us For further information regarding Stanford's reaffirmation of accreditation, please contact the Stanford Accreditation Steering Committee at accreditation@stanford.edu An individual may contact the Bureau for Private Postsecondary Education for review of a complaint. The bureau may be contacted at Bureau for Private Postsecondary Education, P.O. Box 980818, West Sacramento, CA 95798-0818, http://www.bppe.ca.gov , phone: (916) 574-8900 or fax (916) 263-1897 Web Accessibility: Stanford University is committed to providing an online environment that is accessible to everyone, including individuals with disabilities. Having trouble accessing any of this content due to a disability? Learn more about accessibility at Stanford and report accessibility issues . Stanford University (link is external) Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305. Back to Top"
}