{
  "id": 9,
  "date": "2024-05-18T18:07:36.766387",
  "url": "https://bulletin.stanford.edu/academic-polices/student-conduct-rights/nondiscrimination",
  "university_name": "Stanford University",
  "title": "Stanford University",
  "content": "Skip to main content Stanford University Academic Calendar 2023-24 Schedule of Classes Bulletin Archive Get Help Search . . . Stanford University Home Programs Courses Academic Policies Academic Policies A-Z Academic Progress Requirements Admissions Courses Degree Requirements Enrollment Examinations Financial Aid Grading Graduation Grievances Leaves and Returns Student Conduct and Rights Transfer and Test Credit Tuition and Fees Veterans and Military Benefits Home / Academic Policies / Student Conduct and Rights / Nondiscrimination Policy Nondiscrimination Policy Stanford University admits qualified students of any race, color, national or ethnic origin, sex, age, disability, religion, sexual orientation, gender identity, veteran status, or marital status to all the rights, privileges, programs, and activities generally accorded or made available to students at the University. Consistent with its obligations under the law, in the administration of the University's programs and activities, Stanford prohibits unlawful discrimination on the basis of race, color, national or ethnic origin, sex, age, disability, religion, sexual orientation, gender identity or expression, veteran status, marital status or any other characteristic protected by applicable law; Stanford also prohibits unlawful harassment including sexual harassment and sexual violence.  This policy applies to Stanford programs and activities both on and off-campus, including overseas programs. Contact Information Stanford’s Title IX Coordinator has been designated to handle inquiries regarding regarding this nondiscrimination policy: Kingscote Gardens (2nd floor), 419 Lagunita Drive, Stanford, CA 94305, (650) 497-4955 (voice), (650) 497-9257 (fax), titleix@stanford.edu (email). Individuals may also file complaints directly with the Office for Civil Rights, within the United States Department of Education, by following the information on this website: https://www2.ed.gov/about/offices/list/ocr/complaintintro.html . Quick Links Get Help Academic Calendar Tuition & Fees Enrolling in Courses Bulletin Quick Links About Stanford Share Feedback Schools Doerr School of Sustainability Graduate School of Business Graduate School of Education School of Engineering School of Humanities and Sciences School of Law School of Medicine Stanford University Stanford Home (link is external) Maps & Directions (link is external) Search Stanford (link is external) Emergency Info (link is external) Terms of Use (link is external) Privacy (link is external) Copyright (link is external) Trademarks (link is external) Non-Discrimination (link is external) Accessibility (link is external) © Stanford University. Stanford, California 94305."
}