{
  "id": 9,
  "date": "2024-05-18T18:20:37.257496",
  "url": "https://summer.stanford.edu/",
  "university_name": "Stanford University",
  "title": "",
  "content": "Skip to main content Courses from June 22, 2024 — August 18, 2024 Search Search Student Type Student Type Undergraduate Graduate High School Gap Year Current Stanford Students Courses Course List About Courses Academic Support Applying Applying Application Process Dates and Deadlines Eligibility Requirements International Students Costs Costs Tuition and Fees Calculator Tuition Grants Student Life Student Life Residential or Commuter Calendar of Events Campus Resources User account menu Apply Now User account menu Apply Now Student Type Student Type Undergraduate Graduate High School Gap Year Current Stanford Students Courses Course List About Courses Academic Support Applying Applying Application Process Dates and Deadlines Eligibility Requirements International Students Costs Costs Tuition and Fees Calculator Tuition Grants Student Life Student Life Residential or Commuter Calendar of Events Campus Resources Search Search Courses from June 22, 2024 — August 18, 2024 Discover Your Potential Here Begin Your Journey I want to live on campus commute to class The quality of instruction, engaging class environment, rigorous curriculum, enriching social activities, and creative approach make Stanford Summer Session a truly unparalleled experience. Alexis, recent Summer Session student Explore. Discover. Transform. Check out Student Life FAQ Tuition & Fees Find Courses Mailing List Contact Us Employment People facebook--teallogo instagram--teallogo youtube--teallogo Stanford Summer Session provides high-achieving and ambitious students a transformative educational experience at a world-class university. By combining challenging academics with a rich array of extra-curricular programming, Stanford Summer Session successfully shares the University’s culture of innovation, academic excellence, and global responsibility. Stanford Home Maps & Directions Search Stanford Emergency Info Terms of Use Privacy Copyright Trademarks Non-Discrimination Accessibility © Stanford University , Stanford , California 94305 . Group 3 Group Group 2"
}