{
  "id": 5,
  "date": "2024-05-18T18:23:08.026029",
  "url": "https://www.cs.jhu.edu/distinguished-lecture-series/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home CS Distinguished Lecture Series CS Distinguished Lecture Series Play background animation Pause background animation The Department of Computer Science is proud to host two lecture series: Gerald M. Masson Distinguished Lecture Series Association for Computing Machinery Lecture Series in Memory of Nathan Krasnopoler Gerald M. Masson Distinguished Lecture Series In 2016, the Department of Computer Science recognized Masson’s visionary leadership with a series of special events marking 30 years of computing at Johns Hopkins. That celebration included the establishment of the Gerald M. Masson Distinguished Lecture Series , which each year brings computer science researchers to the Homewood campus to talk about important topics in the field. To learn more about Gerald Masson, click here . 2023-24 Gerald M. Masson Distinguished Lecture Series Lectures to be presented at 10:30 a.m. in Hackerman B-17, unless otherwise noted. Stefano Soatto, with CLSP Amazon, UCLA Computer Vision Title: Toward Foundational Models of Physical Scenes: From Large Language Models to World Models and Back Date: September 28, 2023 Abstract: Now that a significant fraction of human knowledge has been shared through the internet, scraped and squashed into the weights of large language models, do we still need embodiment and interaction with the physical world to build representations? Is there a dichotomy between LLMs and “large world models?” What is the role of visual perception in learning such models? Can perceptual agents trained by passive observation learn world models suitable for control? To begin tackling these questions, Stefano Soatto will first address the issue of controllability of LLMs and propose a simplistic definition of “meaning” that reflects the functional characteristics of a trained LLM. He will show that a well-trained LLM establishes a topology in the space of meanings, represented by equivalence classes of the trajectories of an underlying dynamical model. Then, he will describe both necessary and sufficient conditions for controllability in such a space of meanings. He will highlight the relation between meanings induced by a trained LLM upon the set of sentences that can be uttered and “physical scenes” underlying sets of images that can be observed. Lastly, he will show that popular models ostensibly used to represent the 3D scene (neural radiance fields) can at most represent the images on which they are trained, but not the underlying physical scene; however, composing a NeRF with a latent diffusion model or another inductively-trained generative model yields a viable representation of the physical scene. View the recording >> Ohran Firat Google LLMs, AI, NLP Title: Ten Insights from a Machine Learning Researcher and Practitioner on Scaling Models and Languages in NLP in Ten Years Date: October 24, 2023 Abstract: The field of natural language processing has seen rapid growth in recent years, driven by advances in machine learning. As a result, NLP models have become increasingly large and complex, capable of performing a wide range of tasks and understanding many languages. This talk will discuss the evolution of NLP models from specialized to generalist, drawing on the speaker’s personal experience working in the field for over ten years. Topics covered will include: building massively multilingual and large neural machine translation systems (M4); infrastructure and system research enabling the construction of such systems (GPipe, GShard); foundational machine learning research that has advanced the state-of-the-art predictability (aka scaling laws); deployment and organizational challenges in the large language model space; and more. The talk will conclude with a discussion of the future of NLP and the potential of LLMs to unlock new frontiers. View the recording >> Q. Vera Liao Microsoft Research HCI, AI Title: Human-Centered AI Transparency Date: November 2, 2023 Abstract: Transparency—enabling appropriate understanding of AI models or systems—is considered a pillar of responsible AI. The AI research community and industry have developed an abundance of techniques and artifacts in the hope of achieving transparency, including transparent model reporting, model evaluation, explainable AI, and communication of model uncertainty. Meanwhile, the human-computer interaction community has taken human-centered approaches to these topics, building on its long-standing interests in design to support user understanding and appropriate mental models. In this talk, Q. Vera Liao will give an overview of common approaches and lessons learned from HCI research on AI transparency. With the recent rise of large language models and LLM-infused systems, she will also reflect on their unique challenges in providing transparency and discuss open questions. View the recording >> Justine Sherry Carnegie Mellon Networking Title: The I/O-Driven Server: Shifting Control of Data Movement in Future Data Centers Date: November 13, 2023 Abstract: Accelerators are everywhere in computer systems research today, and in this context, it is easy to see “smart” Network Interface Cards—which embed some programmable compute power in the network interface of the server—as simply another chapter in this story. In this talk, Justine Sherry will discuss how SmartNICs do more than simply “accelerate” network-intensive computing. Instead, she argues that SmartNICs radically reorient the control of data movement within the server in a way that is necessary for server hardware to scale with the deluge of network traffic in data centers. She will illustrate a few exemplary systems—Pigasus IDS, the Ensō NIC protocol, and the KOPI OS architecture—from her own research group, as well as exciting work in other labs, all of which reorient server data movement using programmable NICs. View the recording >> Aniruddha Kembhavi Allen Institute for AI Computer Vision Title: Building Foundation Models for Vision and Robotics Date: March 26, 2024 Abstract: Large language models support a whole gamut of tasks in natural language. In contrast, unification has been more challenging in computer vision, partly due to the heterogeneity of tasks in the visual domain and a scarcity of robotics data in the physical world. How do we create powerful unified systems for vision and robotics that can be as capable and creative as their language counterparts? Aniruddha Kembhavi will first present his work on Unified IO, the first single neural model to perform a large and diverse set of AI tasks spanning classical computer vision, image synthesis, vision-and-language, and natural language processing, and his follow-up work, Unified IO 2, that brings in video, audio, and action. Then he will present his recent surprising finding in robotics: Imitating shortest path planners in simulation can produce agents that can proficiently navigate, explore, and manipulate objects in the real world, with no human data or RL and with just RGB sensing—made possible by his recent works on ProcTHOR, HoloDeck, and ObjaVerse. Finally, he will present a compelling alternative to building unified models, Visual Programming, which uses language models as code generators to invoke smaller specialized vision models. This paradigm is efficient and effective, leverages models sourced from the entire community, and scales easily to large sets of diverse tasks. View the recording >> Zhiqiang Lin Ohio State University Cybersecurity Title: Rethinking the Security and Privacy of Bluetooth Low Energy Date: May 2, 2024 Abstract: Bluetooth Low Energy (BLE) stands at the forefront of near-range wireless communication technology, integral to a myriad of Internet of Things devices (spanning health care, fitness, wearables, and smart home applications), primarily due to its significantly low energy consumption. However, the past few years have unveiled numerous security flaws, placing billions of Bluetooth devices at risk. While luckily these flaws have been discovered (some of which have been fixed), there is no reason to believe that current BLE protocols and implementations are free from other flaws. In this talk, Zhiqiang Lin will present a line of recent efforts aimed at enhancing BLE security and privacy. In particular, he will first present the protocol-level downgrade attack, an attack that can force the secure BLE channels into insecure ones to break the data integrity and confidentiality of BLE traffic. Then, he will introduce the Bluetooth Address Tracking (BAT) attack, a novel protocol-level attack, which can track randomized Bluetooth MAC addresses by using an innovative allowlist-based side channel. Next, he will talk about the lessons learned, root causes of the attacks, and their countermeasures. Finally, he will conclude his talk by discussing future directions in Bluetooth security and privacy. View the recording >> 2020-21 Gerald M. Masson Distinguished Lecture Series Nick McKeown Stanford University Title: The Network as a Programmable Platform Date: October 13, 2020 Abstract: In the past 10 years, large network owners and operators have taken control of the software that controls their networks. They are now starting to take control of how packets are processed too. Networks, for the first time, are on the cusp of being programmable end-to-end, specified top-to-bottom, and defined entirely by software. We will think of the network as a programmable platform, a distributed system, that we specify top-down using software, rather than protocols. This has big ramifications for networks in the future, creating some interesting new possibilities to verify that a network is “correct by construction”, to measure and validate its behavior in real-time against a network specification, and to correct bugs through closed-loop control. 2019-20 Gerald M. Masson Distinguished Lecture Series Monica Lam Stanford Internet of Things Title: Building the Smartest and Open Virtual Assistant to Protect Privacy Date: October 8, 2019 Abstract: Virtual assistants, providing a voice interface to web services and IoTs, can potentially develop into monopolistic platforms that threaten consumer privacy and open competition. This talk presents Almond as an open-source alternative. Unlike existing commercial assistants, Almond can be programmed in natural language to perform new tasks. It lets users control who, what, when, where, and how their data are to be shared, all without disclosure to a third party. Almond has a Write-Once-Run-Anywhere (WORA) skill platform: skills need to be written only once and can run automatically on other assistants. This helps level the playing field for new assistants. Finally, Almond’s open-source technologies enable non-ML experts to develop natural language capabilities in their domains of interest. Through open-world collaboration, Almond can become the smartest virtual assistant. Lise Getoor UCSC ML + Privacy Title: The Unreasonable Effectiveness of Structure Date: October 10, 2019 Abstract: Our ability to collect, manipulate, analyze, and act on vast amounts of data is having a profound impact on all aspects of society. Much of this data is heterogeneous in nature and interlinked in a myriad of complex ways. From information integration to scientific discovery to computational social science, we need machine learning methods that are able to exploit both the inherent uncertainty and the innate structure in a domain. Statistical relational learning (SRL) is a subfield that builds on principles from probability theory and statistics to address uncertainty while incorporating tools from knowledge representation and logic to represent structure. In this talk, I will give a brief introduction to SRL, present templates for common structured prediction problems, and describe modeling approaches that mix logic, probabilistic inference and latent variables. I’ll overview our recent work on probabilistic soft logic (PSL), a SRL framework for large-scale collective, probabilistic reasoning in relational domains. I’ll close by highlighting emerging opportunities (and challenges!!) in realizing the effectiveness of data and structure for knowledge discovery. Jodi Forlizzi CMU Human Computer Interactions Talk Title: Designing Today’s Product-Service Ecologies Date: November 7, 2019 Abstract: This talk will reflect my walk through the discipline of design’s many eras and shifts, in order to understand this movement from designing products to designing platforms. The eras of user-centered design, experience design, service design, and systems design will be explored to better understand this migration. An alternative framing, product-service ecologies, will be introduced to stress a systemic and ecological view as a design approach to designing the products, services, environments, and platforms of today. A systemic view ensures that the designer can identify a need and understand the implications of designing something to impact the ecology in a positive way. A systemic view helps move the designer from problem solving to problem seeking, from modeling to understanding relationships, and from prototyping to perturbing the system to understand outcomes. It also ensures that designers are creating pragmatic and purposeful systems that will improve the state of today’s world. 2018-19 Gerald M. Masson Distinguished Lecture Series Vijay Kumar University of Pennsylvania Title: Opportunities and Challenges in Autonomy for Small Aerial Vehicles Date: September 25, 2018 Abstract: The last decade has seen significant advances in robotics and artificial intelligence leading to an irrational exuberance in technology. I will discuss the challenges of realizing autonomous flight in environments with obstacles in the absence of GPS. I will describe our approaches to state estimation and designing perception-action loops for high speed navigation with applications to precision agriculture and first response. Finally, I will discuss some of limitations with current approaches in the field and challenges in robotics and autonomy. Dahlia Malkhi VMWare Research Title: BFT in the lens of Blockchains and Blockchains in the lens of BFT Date: October 9, 2018 Abstract: Blockchain is a Byzantine Fault Tolerant (BFT) replicated state machine, in which each state-update is by itself a Turing machine with bounded resources. The core algorithm for achieving BFT in a Blockchain appears completely different from classical BFT algorithms:Recent advances in blockchain technology blur these boundaries. Namely, hybrid solutions such as Byzcoin, Bitcoin-NG, Hybrid Consensus, Casper and Solida, anchor off-chain BFT decisions inside a PoW chain or the other way around. This talk keynote will describe Blockchain in the lens of BFT and BFT in the lens of Blockchain, and provide common algorithmic foundations for both. Margo Seltzer University of British Columbia Talk Title: Automatically Scalable Computation Date: November 6, 2018 Abstract: As our computational infrastructure races gracefully forward into increasingly parallel multi-core and clustered systems, our ability to easily produce software that can successfully exploit such systems continues to stumble. For years, we’ve fantasized about the world in which we’d write simple, sequential programs, add magic sauce, and suddenly have scalable, parallel executions. We’re not there. We’re not even close. I’ll present a radical, potentially crazy approach to automatic scalability, combining learning, prediction, and speculation. To date, we’ve achieved shockingly good scalability and reasonable speedup in limited domains, but the potential is tantalizingly enormous. Eva Tardos Cornell Title: Learning and Efficiency of Outcomes in Games Date: April 2, 2019 Abstract : Selfish behavior can often lead to suboptimal outcome for all participants, a phenomenon illustrated by many classical examples in game theory. Over the last decade we have studied Nash equilibria of games, and developed good understanding how to quantify the impact of strategic user behavior on overall performance in many games (including traffic routing as well as online auctions). In this talk we will focus on games where players use a form of learning that helps them adapt to the environment. We ask if the quantitative guarantees obtained for Nash equilibria extend to such out of equilibrium game play, or even more broadly, when the game or the population of players is dynamically changing and where participants have to adapt to the dynamic environment. Avrim Blum Professor and Chief Academic Officer Toyota Technological Institute at Chicago Talk Title: Algorithmic fairness in Online Decision-making Date: April 16, 2019 Abstract: There is growing concern about fairness in algorithmic decision making: Are algorithmic decisions treating different groups fairly? How can we make them fairer? What do we even mean by fair? In this talk I will discuss some of our work on this topic, focusing on the setting of online decision making. For instance, a classic result states that given a collection of predictors, one can adaptively combine them to perform nearly as well as the best of those predictors in hindsight (achieve “no regret”) without any stochastic assumptions. Can one extend this guarantee so that if the predictors are themselves fair (according to a given definition), then the overall combination is fair as well (according to the same definition)? I will discuss this and other issues. This is joint work with Suriya Gunasekar, Thodoris Lykouris, and Nati Srebro. 2017-18 Gerald M. Masson Distinguished Lecture Series Susan Davidson University of Pennsylvania Title: Why Data Citation is a Computational Problem Date: October 5, 2017 Abstract: While principles and standards have been developed for data citation, they are unlikely to be used unless we can couple the process of extracting information with that of providing a citation for it. I will discuss the problem of automatically generating citations for data in a database given how the data was obtained (the query) as well as the content (the data), and show how the problem of generating a citation is related to two well-studied problems in databases: query rewriting using views and provenance.To download Dr. Davidson’s lecture poster, click here . To view the seminar video, click here . Shafi Goldwasser Massachusetts Institute of Technology Title: Pseudo Deterministic Algorithms and Proofs Date: Thursday, October 12, 2017 Abstract: Pseudo-deterministic algorithms are a class of randomized search algorithms, which output a unique answer with high probability. Intuitively, they are indistinguishable from deterministic algorithms by an polynomial time observer of their input/output behavior. In this talk I will describe what is known about pseudo-deterministic algorithms in the sequential, sub-linear and parallel setting. To download Dr. Goldwasser’s lecture series poster, click here . Ian Foster University of Chicago Title: Computing Just What You Need: Online Data Analysis and Reduction of Extreme Scales Date: Tuesday, December 5, 2017 Abstract: A growing disparity between supercomputer computation speeds and I/O rates makes it increasingly infeasible for applications to save all results for offline analysis. Instead, applications must analyze and reduce data online so as to output only those results needed to answer target scientific question(s). To download Dr. Foster’s lecture series poster, click here . To view the seminar video, click here . Manuelo Veloso University of California, Berkeley Title: Human-AI Interaction: Symbiotic Autonomy, Learning, and Transparency in Service Robots Date: Thursday, April 12, 2018 Abstract: In this talk, I will first introduce our CoBot service robots and their novel localization and symbiotic autonomy, which enable them to consistently move in our buildings, and learn from asking humans or the web for help to overcome their limitations. I frame the research as human-AI interaction also including an interpretability approach by language generation to alert and respond to human explanation requests. I will conclude with a brief discussion of AI, machine learning, and robotics, and their potential social impact. To download Dr. Veloso’s lecture series poster, click here . Jeff Dean Google Title: The Deep Learning Revolution in Building Intelligent Computer Systems Date: Thursday, April 26, 2018 Abstract: In this talk, I’ll highlight some of the design decisions we made in building TensorFlow, discuss research results produced within our group in areas such as computer vision, language understanding, translation, healthcare, and robotics, and describe ways in which these ideas have been applied to a variety of problems in Google’s products, usually in close collaboration with other teams. I will also touch on some exciting areas of research that we are currently pursuing within our group. To download Dean’s lecture series poster, click here . To view the seminar video, click here . 2016-17 Gerald M. Masson Distinguished Lecture Series Mark D. Hill University of Wisconsin-Madison Title: Computer Architecture 1975-2025 Date: Thursday, November 8 Abstract: This talk will explain how computer architects contribute to information technology that is transforming the world. It will present computer architecture basics and trends since the first microprocessor in the mid-1970s. It will then discuss how present challenges to Moore’s Law will open up new directions for computer systems, including architecture as infrastructure, energy first, impact of emerging technologies, and cross-layer opportunities. Reference: CCC “21 st Century Computer Architecture.”To download Dr. Hill’s lecture poster, click here . To view the seminar video, click here . Jim Kurose Assistant Director National Science Foundation Directorate of Computer & Information Science & Engineering (CISE) Title: An Expanding and Expansive View of Computing Date: Thursday, November 17 Abstract: Advances in computer and information science and engineering are providing unprecedented opportunities for research and education. My talk will begin with an overview of CISE activities and programs at the National Science Foundation and include a discussion of current trends that are shaping the future of our discipline. I will also discuss the opportunities as well as the challenges that lay ahead for our community and for CISE.To download Dr. Kurose’s lecture series poster, click here . To view the seminar video, click here . Ben Shneiderman University of Maryland, College Park Title: Interactive Visual Discovery in Event Analytics Electronic Health Records and Other Applications Date: Tuesday, March 7, 2017 Abstract: Advances in computer and information science and engineering are providing unprecedented opportunities for research and education. My talk will begin with an overview of CISE activities and programs at the National Science Foundation and include a discussion of current trends that are shaping the future of our discipline. I will also discuss the opportunities as well as the challenges that lay ahead for our community and for CISE. To download Dr. Shneiderman’s lecture series poster, click here . Ruzena Bajcsy University of California, Berkeley Title: Development of Kinematic and Dynamic Models For Individual Using System Estimation and Identification Techniques Date: Tuesday, April 11, 2017 Abstract: This talk will introduce a kinematic and dynamic framework for creating a representative model of an individual. Building on results from geometric robotics, a method for formulating a geometric dynamic identification model is derived. To download Dr. Bajcsy’s lecture series poster, click here . To view the seminar video, click here . Association for Computing Machinery Lecture Series in Memory of Nathan Krasnopoler This lecture series is made possible by the generosity of numerous supporters of the Nathan Krasnopoler Memorial Fund, established at the Whiting School of Engineering to benefit the Association for Computing Machinery (ACM.) Nathan Krasnopoler ’13, a computer science major, was severely injured in February 2011 when he was struck by a car while bicycling near the Homewood campus. Although he was wearing a helmet, Nathan suffered irreversible brain damage and passed away from his injuries in August 2011. A student of great promise and a leader in the Johns Hopkins chapter of the Association for Computing Machinery (ACM), Nathan was an active and valued member of the Johns Hopkins community. As a result of the crash and to prevent future injuries and loss of life caused by medically-impaired older drivers, Nathan’s family formed Americans For Older Driver Safety, a non-profit organization with a national focus. Since 2012, AFODS has promoted education of older drivers using research-based best practices. AFODS has created a curriculum for educating older drivers, has worked on public policy changes in Maryland, Missouri, and Kansas, and is currently developing an educational program for health care providers on medical conditions that affect driving and giving providers printed information for their patients on local mobility programs and driving evaluation programs. Gifts to this fund are used to sponsor an annual lecture in Nathan’s memory and to benefit the activities of the ACM. If you would like to honor Nathan’s memory and his dedication to the ACM, you are invited to make a tax-deductible contribution to the fund. Please visit engineering.jhu.edu/giving and indicate the Nathan Krasnopoler Memorial Fund in the “other designation” text box. For more information about the fund, please contact the Whiting School of Engineering’s Office of Development & Alumni Relations at (410) 516-8723 or engineering@jhu.edu . Previous programs: 2019 Program; to view the flyer, click here . 2018 Program ;to view the talk video, click here . 2017 Program ; to view the talk video, click here . 2016 Program Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}