{
  "id": 5,
  "date": "2024-05-18T18:23:25.897549",
  "url": "https://www.cs.jhu.edu/research/information-security/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Research Information Security Information Security Hopkins researchers are working to safeguard our digital world. Play background animation Pause background animation As we become more reliant on digital technologies, protecting online information and data is of critical importance. To address this need, our department has developed a large research portfolio related to computer security, privacy, and assurance. Housed within the Department of Computer Science is the Johns Hopkins Institute for Information Security , a leading hub for research and education in cryptography, privacy, medical information security, and software and system security. Through ISI’s leadership, the National Security Agency and the Department of Homeland Security have designated Johns Hopkins University as a Center of Academic Excellence in Information Assurance in Research and Education. Research Centers and Labs Advanced Research in Cryptography Lab Research at the ARC Lab covers all aspects of theoretical and applied cryptography. Advanced Research in Cryptography Lab Information Security Institute The JHU ISI is the university’s focal point for research and education in computer security, privacy, and assurance. Johns Hopkins Information Security Institute Security and Privacy in the Lifecycle of IoT for Consumer Environments The Security and Privacy in the Lifecycle of IoT for Consumer Environments Project, or SPLICE, addresses Internet of Things risks by examining the human, social, and technological scope of the security and privacy challenges emerging in smart homes across a wide range of residential stakeholders, including owners, occupants, renters, visitors, and domestic workers. SPLICE People Yinzhi Cao Assistant Professor and Technical Director of the JHU Information Security Institute Department of Computer Science ﻿ Email: yinzhi.cao@jhu.edu Phone: (410) 516-6718 Anton Dahbura Executive Director of Johns Hopkins Information Security Institute and Co-Director of the Johns Hopkins Institute for Assured Autonomy Department of Computer Science ﻿ Email: AntonDahbura@jhu.edu Phone: (410) 516-0211 Matthew Green Associate Professor Department of Computer Science ﻿ Email: mgreen@cs.jhu.edu Phone: (410) 861-0344 Susan Hohenberger-Waters Research Professor Department of Computer Science ﻿ Email: shohenb2@jhu.edu Abhishek Jain Associate Professor Department of Computer Science ﻿ Email: abhishekjain@jhu.edu Phone: (410) 516-4276 Xiangyang Li MSSI Program Director and Associate Teaching Professor Department of Computer Science ﻿ Email: xyli@jhu.edu Phone: 410-516-8521 Alex Marder Assistant Professor Department of Computer Science ﻿ Email: amarder@jhu.edu Aviel Rubin Professor Emeritus Department of Computer Science ﻿ Email: rubin@jhu.edu Phone: (410) 516-8177 AI image generators can be tricked into making NSFW content New safety tests by Johns Hopkins researchers reveal vulnerabilities of popular systems like DALL-E 2. Learn more Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}