{
  "id": 5,
  "date": "2024-05-18T18:23:28.437131",
  "url": "https://www.cs.jhu.edu/research/systems/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Research Systems & Networking Systems & Networking Our Systems & Networking faculty are undertaking research into all aspects of computer systems. Play background animation Pause background animation Systems and networking underpin nearly every aspect of our lives, from business and health care to transportation and entertainment. Research advances are crucial for providing new services and ensuring reliability and security in our increasingly digital world. Through theoretical advances, practical implementations, and open-source contributions, our research groups continue to push the boundaries of what’s possible in connecting systems and users. Our networking groups examine topics ranging from wireless and mobile networking, massively parallel hardware for ML/AI, the Internet of Things, cybersecurity, V2X-based transportation systems, software-defined networking, applications of ML/AI for network operations, and more. Meanwhile, our systems faculty are engaged in research projects that will lead to more robust, reliable, and secure computer systems for the real world, conducting state-of-the-art work in systems for big data, networks and network architectures, mobile security, cloud computing, and data-intensive computing and databases. Research Groups and Labs Distributed Systems and Networks Lab The DSN Lab focuses on dependable infrastructure research, making the computerized networked infrastructure our society relies upon resilient, performant, and secure. Distributed Systems and Networks Lab Order Lab The overarching goal of the lab is to advance the principles and practices in building next-generation dependable systems for emerging platforms. Order Lab People Yair Amir Professor Emeritus Department of Computer Science ﻿ Email: yairamir@jhu.edu Phone: (301) 806-4803 Randal Burns Bill and Lisa Stromberg Department Head and Professor Department of Computer Science ﻿ Email: randal@cs.jhu.edu Phone: (410) 516-8775 Yinzhi Cao Assistant Professor and Technical Director of the JHU Information Security Institute Department of Computer Science ﻿ Email: yinzhi.cao@jhu.edu Phone: (410) 516-6718 Anton Dahbura Executive Director of Johns Hopkins Information Security Institute and Co-Director of the Johns Hopkins Institute for Assured Autonomy Department of Computer Science ﻿ Email: AntonDahbura@jhu.edu Phone: (410) 516-0211 Soudeh Ghorbani Assistant Professor Department of Computer Science ﻿ Email: sghorba1@jhu.edu Phone: (410) 516-6781 Alex Marder Assistant Professor Department of Computer Science ﻿ Email: amarder@jhu.edu Krishan Sabnani Homewood Professor of Computer Science Department of Computer Science ﻿ Email: ksabnan2@jhu.edu Scott Smith Professor, Director of Graduate Studies Department of Computer Science ﻿ Email: scott@cs.jhu.edu Phone: (410) 516-5299 Alexander Szalay Bloomberg Distinguished Professor Department of Computer Science ﻿ Email: szalay@jhu.edu Phone: (410) 516-7217 Renjie Zhao Assistant Professor Department of Computer Science ﻿ Email: rjzhao@jhu.edu New CS faculty Alex Marder receives $5 million NSF grant Alex Marder, an assistant professor of computer science, has received the grant as part of the National Science Foundation’s Convergence Accelerator program. Learn more Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}