{
  "id": 5,
  "date": "2024-05-18T18:23:10.609128",
  "url": "https://www.jhu.edu/",
  "university_name": "Johns Hopkins University",
  "title": "",
  "content": "Skip to main content Video footage: Students walk to class on Keyser Quad with red tulips in the foreground, the camera floats over students and professors as they study in the atrium of the Bloomberg Center in DC, Hopkins community members gather at The Beach to watch a solar eclipse, two students walk through the Bloomberg School of Public Health, a student adds solution to containers in a lab. You are in a modal window. Press the escape key to exit. Open Menu Menu Search News & Events Apply Visit See programs Search jhu.edu Search jhu.edu search Common Searches Why is it called Johns Hopkins? What majors and minors are offered? Where can I find information about graduate programs? How much is tuition? What financial aid packages are available? How do I apply? How do I get to campus? Where can I find job listings? Where can I log in to myJHU? Where can I log in to SIS? Close menu Apply Visit See programs About Us Open About Us University Leadership History & Mission Diversity & Inclusion Notable Alumni Hopkins in the Community Hopkins Around the World News from Johns Hopkins Academics Open Academics Undergraduate Studies Graduate Studies Online Studies Part-Time & Non-Degree Programs Summer Programs Academic Calendars Schools & Divisions Open Schools & Divisions Advanced International Studies Applied Physics Laboratory Arts & Sciences Business Education Engineering Medicine Nursing Peabody Conservatory Public Health Admissions & Aid Open Admissions & Aid Undergraduate Admissions Graduate Admissions Plan a Visit Tuition & Costs Financial Aid Research & Faculty Open Research & Faculty Innovation & Incubation Bloomberg Distinguished Professors Milestones Undergraduate Research Libraries Campus Life Open Campus Life Our Campuses About Baltimore Housing & Dining Arts & Culture Health & Wellness Athletics Security Disability Services Calendar of Events Maps & Directions Contact the University Employment Opportunities my.jh.edu Give to the University For Alumni For Parents For News Media Athletics Close menu Close menu X Facebook LinkedIn Youtube Instagram Hub When ambition meets opportunity , anything is possible . At Johns Hopkins, you can explore ideas that interest you, find people who inspire and challenge you, and make discoveries that change your life—and the world. Explore Undergraduate Admissions Graduate Admissions Virtual Campus Tour Hopkins in the Community Hopkins Around the World Diversity and Inclusion at Hopkins Recent headlines from Johns Hopkins University Commencement Advice for the Class of 2024 Published May 17, 2024 Hopkins alums share some words of wisdom for this year’s graduates Q + A Students debate Israel’s future in long-running Hopkins course Published May 16, 2024 Steven David’s course helps students form and share thoughtful opinions about one of the most polarizing conflicts of our time Engineering Students invent quieter leaf blower Published May 14, 2024 Patent-pending design by Hopkins undergrads could be available in stores within two years Commencement 2024 Honorary degree recipients announced Published May 2, 2024 Degrees will be conferred during the universitywide Commencement ceremony on May 23 at Homewood Field More from the Hub A collection of some of the best recent shots from the university’s Instagram accounts First day of the spring semester, 35°F with snow edition View on Instagram The first skate session of the season at the JHU Ice Rink ⛸❄️✨ View on Instagram Chasing sunsets as summer fades. A new chapter begins – see you soon Blue Jays 💙 View on Instagram Johns Hopkins University at 555 Pennsylvania Ave NW stands tall against the DC skyline, where academic brilliance merges with the city’s vitality!\r\n\r\nLet’s commemorate this remarkable addition, uniting evidence-based research with the heartbeat of our nation’s capital. View on Instagram 🗺️ 37 countries 🌃 46 states 💙 One Class of 2027 View on Instagram Let’s take a look back at an incredible week of preparation! 🌟 The First Year Mentors have been gearing up with excitement, getting ready to welcome the new Jays! Now, as orientation week unfolds, they’re all set to lead the way into an unforgettable adventure. Get ready for an amazing journey… View on Instagram X Facebook LinkedIn Youtube Instagram Meet some of the students, faculty, and staff who call Hopkins home Never before have I been surrounded by such highly motivated individuals who inspire me to be my best. More from Kale Search programs Search Programs Our nine schools prepare students to excel in today’s world Arts & Sciences Business Education Engineering International Affairs Medicine Music & Dance Nursing Public Health Baltimore is more than just our hometown— it’s an extension of campus, offering learning and cultural opportunities that will complement your Hopkins experience. More about Baltimore Johns Hopkins University Address Baltimore, Maryland Phone number 410-516-8000 X Facebook LinkedIn Youtube Instagram Hub © 2024 Johns Hopkins University. All rights reserved. Search jhu.edu Search jhu.edu search About Us Academics Schools & Divisions Admissions & Aid Research & Faculty Campus Life Maps & Directions Contact the University Employment Opportunities my.jh.edu Give to the University For Alumni For Parents For News Media Athletics Contact the University Employment Opportunities University Policies and Statements Privacy Statement Title IX Information and Resources Higher Education Act Disclosures Clery Disclosure Accessibility Emergency Contact Information"
}