{
  "id": 5,
  "date": "2024-05-18T18:23:40.265242",
  "url": "https://www.cs.jhu.edu/about/message-from-dept-head/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home About Message from the Department Head Message from the Department Head Welcome to the Department of Computer Science at the Johns Hopkins University. Play background animation Pause background animation Welcome to CS@JHU. I would like to take the start of 2024 to relate some news and highlights from the past year and discuss the future of our community. 2023 was an incredibly exciting year in the discipline as we learned to live, learn, teach, and research using large language models and other foundational artificial intelligence. AI can be a beneficial technology. At JHU, we use it to enhance doctor-patient interactions , design better surgical robotics methods , and build the most efficient multilingual models for machine translation. AI is also incredibly hazardous, capable of reinforcing stereotypes and racism, producing false and dangerous content, and supporting malicious actors in committing fraud, conducting cyberattacks, and practicing plagiarism. Our researchers have tackled critical questions in AI safety and reliability: How can we protect ourselves from AI generating of violent or offensive content ? How do we ensure that AI produces factual responses that are grounded in observed data? How do we prevent AI from reinforcing racism and sexism ? CS@JHU remains at the forefront of innovation. I am proud to report that two JHU research teams earned spots on TIME’s Best Inventions of 2023 : Professor Suchi Saria uses AI to predict the risk of sepsis before human clinicians can even observe symptoms, while recent PhD graduate Zhaoshou “Max” Li and Professors Mathias Unberath and Russell Taylor collaborated with NVIDIA to create a neural algorithm that reconstructs three-dimensional objects from smartphone videos . We are also evolving how we conduct research and translate discoveries into practice, collaborating with industry partners to ensure that we’re working on the most important problems and that our solutions contribute value to society. The Amazon Initiative for Interactive AI gives fellowships to students and awards grants to faculty to work with Amazon researchers to better understand natural language, improve image-based web search, and enhance virtual commerce. We are also proud to work with Johns Hopkins Technology Ventures and the Pava Marie LaPere Center for Entrepreneurship to foster local entrepreneurship. Last year, we introduced the Singhal Family Entrepreneurship Award , which helps launch student-run software ventures. The CS department continues to grow in size, quality, and diversity. Our community includes more than 700 undergraduate majors, 200 PhD students, 200 master’s students, 35 tenure-track faculty, and eight teaching faculty. Over the next five years, we plan to double the size of our research community as part of a historic commitment by JHU to build the nation’s foremost destination for research in data science, machine learning, and AI. We encourage you to explore how you might participate in CS@JHU. Our website provides a good introduction to our research and education programs. I invite you to contact or visit us directly if you have additional questions, have a vision of how to join or partner with us, or just want to learn more. Randal Burns, Bill and Lisa Stromberg Department Head and professor of computer science Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}