{
  "id": 5,
  "date": "2024-05-18T18:23:50.092424",
  "url": "https://www.cs.jhu.edu/academic-programs/graduate-studies/current-graduate-students/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Graduate Studies Resources for Graduate Students Resources for Current Graduate Students Policies, resources, forms, and services for graduate students. Play background animation Pause background animation Student Manuals MSE Manual PhD Manual MSSI Program Information MSSI Program Information MSSI Program New Student Information Session Department Contacts for Graduate Students Your “go-to” Computer Science staff members Kim Franklin , Academic Program Manager 410-516-7451 | Malone 160 PhD program admissions PhD student questions and support Revelie Williams , Academic Program Manager Master’s program admissions General questions and student support for both the MSE and MSSI programs Schedule an advising slot Joanne Selinski , Associate Chair for Education for Computer Science 410-516-4117 | Malone 225 Manages course information and instruction Coordinates teaching assistant assignments and course assistant hiring Advises HopHacks , the annual hackathon Academic Advising JHU Academic Catalogue – Lists CS Department faculty, programs, and courses Course Information – Listings of the most recent course offerings in Computer Science Course Area Designators – A comprehensive list of CS graduate courses and their departmental area designators (Applications, Reasoning, Software, Systems, and Theory), including approved Engineering for Professionals (EP) online courses Course Change Form Academic Integrity Code – CS Department Policies & Procedures Engineering School Graduate Policies Health Insurance Information Graduate Board – Graduate Board procedures are the official campus-wide rules and regulations for graduate degrees Travel and Reimbursement Procedures Academic Integrity Code View the code here . MSE Research MSE Research Project/Essay/Thesis Master’s students in the Department of Computer Science have the option to complete their MSE degree requirements with 10 courses OR 8 courses and a research project/essay/thesis. The project is a fantastic opportunity for students to contribute to a body of knowledge while gaining meaningful collaborative research experience. On average, a project will take 1–2 semesters to complete. All of the details of a project are determined by and discussed between the student and their individual project advisor. The department requires that the Master’s Qualifying Project Agreement Form is completed and on file BEFORE the research begins. A commonly asked question is “What is the difference between the project, essay, and thesis?” Quite frankly, not much in most cases. Project/essay/thesis language is used interchangeably, but if there is a differentiating factor, it would be that a thesis is filed through the Electronic Theses & Dissertations process via the Sheridan Libraries. (Please contact Library Services directly for details.) While this is rarely done with master’s “projects,” it remains an option. The final deliverable will be determined by an individual’s project advisor. Below are the steps for MSE students completing a project: Consider your own interests. Seek out a faculty/project advisor with similar interests who has a primary, secondary/joint appointment or research faculty in the Department of Computer Science. Projects may not be completed with a faculty member just because they teach at JHU. Determine the specifics of the project with your faculty/project advisor. Complete the Master’s Qualifying Project Agreement Form and follow its instructions to send the form to the department before the project commences. When the project is finalized per the stipulations of the agreement form, send the signed and completed Qualifying Project Form (different than the agreement form) to the department’s Master’s Academic Program Manager and Senior Academic Program Coordinator. To assist in this process, one of our very own CS professors wrote an extensive guide titled “ How to Do Research with a Professor .” It will provide you with the tools you need to understand the full relationships for all parties involved in a collaborative research effort. For best results, start this process early in your graduate journey to responsibly manage your coursework and project demands. MSE Forms MSE in Computer Science Advising Worksheet MSE Certification Notes Computer Science GPA Calculation Master’s Qualifying Project Agreement Form Probation and Dismissal Policy (Page 2) PhD Forms PhD Course Completion Worksheet PhD Course Requirements Worksheet (Pre-F19) Computer Science GPA Calculation PhD Course Transfer Request Course Form Qualifying Project Agreement Form Qualifying Project Coversheet Academic Calendar and Course Schedules Academic Calendar – via Office of the Registrar, which details registration deadlines, breaks, class dates, exam periods, etc. Course Schedules – via the Student Information System. Course Information – via the CS Department. Computing Resources Department and Homewood campus-wide services for students See CS IT Support for departmental computing information , including information about student accounts and labs. Contact support@cs.jhu.edu for help with any departmental computing services. Homewood Campus Computing Resources In addition to the department’s computing resources, there are additional computing resources on the Homewood campus, including in the Milton S. Eisenhower Library and the Brody Learning Commons. Homewood Student Affairs Information Technology Services is the best source for information about computing labs, printing, software, and more on campus. Contact Johns Hopkins IT Services to report campus computing issues, to purchase software, and for general help. Search for software available to students here . Visit the Technology Store to purchase computers and more—with a student discount! Library Resources Visit the Johns Hopkins Sheridan Libraries page for general information. The library’s engineering guide includes articles, patents, standards, and other information to help you in your research. Find online library resources for engineers . Learn how to submit your dissertation. Questions? Contact Sue Vazakas , our academic liaison at the Sheridan Libraries. Career Resources Johns Hopkins’ Life Design Lab provides a breadth of career-related programs, including résumé writing and interview preparation workshops, discipline-focused career fairs, internship and full-time employment listings, and more. PHutures is the university’s professional development and career connections office, serving all doctoral students and postdocs—but especially those at the Whiting School of Engineering and the Krieger School of Arts and Sciences. Student Support Services Johns Hopkins offers a host of resources where students can ask for and receive help on a variety of topics. View these pages for information and hours: A wide range of student well-being resources is available through the Office of Student Life. The Office of Student Disability Services advises Johns Hopkins students with disabilities on available services, including accommodations on campus. Mental Health Services provides services to students who are in need of support and assistance related to their mental health—across a range of topics—in a caring environment. The Office of Institutional Equity offers a confidential sexual assault helpline . For emergencies, please call Campus Security at 410-516-7777 or the Baltimore City emergency line at 911. Graduation – MSE students When approaching the completion of the master’s program, please note that the date of conferral and graduation (attending commencement) are two separate events. Degree Conferral Conferring a degree is a process managed by the CS Department to ensure that all MSE program requirements have been met by a specified conferral date for graduating students. Each semester, detailed instructions are sent out to students to provide documentation for review by the department and then submitted to the WSE Dean’s Office for final approval. Commencement and Celebrations Although degrees are conferred in the fall and spring, there is only one Johns Hopkins Commencement ceremony , which is held in the spring. Please review the commencement website for details, contact information, and FAQs. The CS Department hosts a separate reception for its graduates and their family and friends. Invitations are sent out mid-spring. PhD Defense PhD students should coordinate with their dissertation committee to schedule their defense. Once scheduled, email the PhD Academic Program Manager with a high-resolution photo and the following information: Date & Time of Defense: Advisor(s): Dissertation Title: Abstract: Biography: Professional Plans: Personal Website: Dissertation Zoom Link: After you pass your defense and finalize your dissertation edits, your advisor(s) will prepare your Reader’s Letter, signed by all committee members. You shouldn’t submit your dissertation to the library until the Academic Program Manager has this letter. Once the Academic Program Manager has your Reader’s Letter, you may submit your dissertation to the library. Please see submission details here . There is a $60 ETD submission fee that the CS Department will cover. When you are ready to submit, please contact the Academic Program Manager to arrange a funds transfer. You will receive an email confirmation from etd-support@jhu.edu indicating that your dissertation was approved by the library. Forward that approval email to the Academic Program Manager for conferral processing. Graduation – PhD students Please complete this checklist in order to graduate: Apply to graduate in SIS. Go to your SIS Self-Service drop-down menu and choose Registration, Program of Study, and Apply to Graduate. Then complete all required fields and click SUBMIT. (Lots of students forget this part!) See additional graduate application details here . Confirm that the Academic Program Manager has your Reader’s Letter and your ETD approval. Inform the Academic Program Manager of your last day on payroll as soon as possible. Overpayments often occur if this information isn’t provided two weeks prior to your last day. Settling up with the university can be a challenge, so it’s best to avoid it if you can. Reach out to Revelie Williams if you haven’t yet—but still wish to—pick up your MSE degree. She will provide you with further instructions. International students must be in touch with the Office of International Students to apply for OPT. The application and approval process can take some time, so start the process as soon as possible. Check your transcript make sure you don’t have any missing grades. If you do, work together with the Academic Program Manager to resolve any issues. No changes can be made after graduation. Obtain your diploma at the Johns Hopkins Commencement Ceremony . Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}