{
  "id": 5,
  "date": "2024-05-18T18:23:02.591341",
  "url": "https://www.cs.jhu.edu/alumni-and-giving/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Alumni & Giving Alumni & Giving Our alumni are the department's most loyal and consistent supporters and are vital to our mission and community. Play background animation Pause background animation At the Johns Hopkins Department of Computer Science, we take pride in maintaining strong connections with our alumni, who are doing great things both personally and professionally. It is through the support of alumni and friends that the department has been able to maintain our role as a world leader in computer science research and education. We encourage all alumni to stay connected and get involved. Get Involved Build Your Network Connect with Hopkins Engineering alumni and broaden your professional and personal networks. WSE Alumni Resources Join the CS LinkedIn Group OneHop (JHU Alumni Network) Stay Connected Connect with us on social media to hear about alumni events and news, and share the amazing things you’re doing and update your contact information today. Twitter Facebook Update Your Information Give Back Lend your time and talents to contribute to the future success of our students and programs. Volunteer with the Whiting School Support Our Mission As alumni, you know better than anyone that the Whiting School of Engineering sets the standard for excellence in engineering education and research nationwide—and we can’t do it without your support. Give Today Alumni Stories View All News Building NBA analytics Categories Alumni Spotlight Paige Senal designs, implements, and tests product analytics across the NBA’s digital properties. President Biden awards National Medal of Technology and Innovation to Jeong Kim ’82, ’89 (MS) Categories Alumni Spotlight Computer Science alumnus recognized for advances in broadband optical systems, data communications, and wireless technologies. This new interactive map lets you scroll though the universe Categories Alumni Spotlight The map charts a broad expanse of the universe, from the Milky Way to 'the edge of what can be seen'. Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}