{
  "id": 5,
  "date": "2024-05-18T18:06:14.912379",
  "url": "https://www.cs.jhu.edu/academic-programs/graduate-studies/mse-programs/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Graduate Studies Master of Science in Engineering in Computer Science (MSE) Master of Science in Engineering in Computer Science (MSE) In This Section ﻿ Close ﻿ Master of Science in Engineering in Computer Science (MSE) Navigation MSE Admissions FAQ Play background animation Pause background animation The Computer Science Department in the Whiting School of Engineering (WSE) of Johns Hopkins University offers full-time programs at the Homewood campus in Baltimore. The MSE in Computer Science offers an official concentration in Human Language Technology , its only concentration jointly administered with the Center for Language and Speech Processing. (We also offer a Master of Science in Security Informatics. ) Entering students are expected to have completed a program of study equivalent to that required by the BS in computer science. Applicants from other disciplines are expected to have coursework (or equivalent experience) in intermediate programming (C++ and Java), data structures, computer system fundamentals, and mathematical foundations for computer science. The application process is handled through WSE’s Graduate Admissions Office online graduate student application . You will find instructions for applying to graduate degree programs for both international and domestic students here . Additionally, please review the MSE Admissions FAQ page for answers to commonly asked questions. A note about the GRE requirement listed below: The Department of Computer Science reviews applications on a holistic basis; although the GRE is required by the Whiting School of Engineering, scores are not reviewed by the admissions committee and thus are not a factor in final decisions. If you have further questions, feel free to email admissions@cs.jhu.edu . All required application materials are due at 11:59 PM EST by the deadlines for consideration: The MSE deadline for fall is February 15th. The MSE deadline for spring for U.S. citizens and permanent residents is November 15th. The MSE deadline for spring for international applicants is September 15th. The MSE CS application requires: Application $75 application fee Statement of purpose Resume/CV GRE — The Whiting School of Engineering requires GRE General Test scores for applications to all master’s programs. However, the Department of Computer Science does not review these scores nor do they have any impact on the outcome of admissions decisions during the application review process. TOEFL (if applicable) Two letters of recommendation Unofficial transcripts — If admitted, we will additionally require official versions. Learn about the admissions process and apply today Office of Graduate Admissions For Current Students Policies, resources, forms, course information, and services for graduate students. RESOURCES FOR CURRENT STUDENTS Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}