{
  "id": 5,
  "date": "2024-05-18T18:22:55.048761",
  "url": "https://www.jhu.edu/university-policies/",
  "university_name": "Johns Hopkins University",
  "title": "",
  "content": "Skip to main content University Policies and Statements You are in a modal window. Press the escape key to exit. Open Menu Menu Search News & Events Apply Visit See programs Search jhu.edu Search jhu.edu search Common Searches Why is it called Johns Hopkins? What majors and minors are offered? Where can I find information about graduate programs? How much is tuition? What financial aid packages are available? How do I apply? How do I get to campus? Where can I find job listings? Where can I log in to myJHU? Where can I log in to SIS? Close menu Apply Visit See programs About Us Open About Us University Leadership History & Mission Diversity & Inclusion Notable Alumni Hopkins in the Community Hopkins Around the World News from Johns Hopkins Academics Open Academics Undergraduate Studies Graduate Studies Online Studies Part-Time & Non-Degree Programs Summer Programs Academic Calendars Schools & Divisions Open Schools & Divisions Advanced International Studies Applied Physics Laboratory Arts & Sciences Business Education Engineering Medicine Nursing Peabody Conservatory Public Health Admissions & Aid Open Admissions & Aid Undergraduate Admissions Graduate Admissions Plan a Visit Tuition & Costs Financial Aid Research & Faculty Open Research & Faculty Innovation & Incubation Bloomberg Distinguished Professors Milestones Undergraduate Research Libraries Campus Life Open Campus Life Our Campuses About Baltimore Housing & Dining Arts & Culture Health & Wellness Athletics Security Disability Services Calendar of Events Maps & Directions Contact the University Employment Opportunities my.jh.edu Give to the University For Alumni For Parents For News Media Athletics Close menu Close menu X Facebook LinkedIn Youtube Instagram Hub About Us University Leadership Office of the President Office of the Provost History & Mission Gilman’s Inaugural Address Diversity & Inclusion Notable Alumni Hopkins in the Community Hopkins Around the World News from Johns Hopkins Academics Undergraduate Studies Academic Support Study Abroad Graduate Studies Online Studies Part-Time & Non-Degree Programs Summer Programs Academic Calendars Schools & Divisions Advanced International Studies Applied Physics Laboratory Arts & Sciences Business Education Engineering Medicine Nursing Peabody Conservatory Public Health Admissions & Aid Undergraduate Admissions Graduate Admissions Plan a Visit Tuition & Costs Financial Aid Research & Faculty Innovation & Incubation Bloomberg Distinguished Professors Milestones Nobel Prize winners Undergraduate Research Libraries Campus Life Our Campuses Homewood Campus About Baltimore Housing & Dining Arts & Culture Health & Wellness Athletics Security Emergency Contact Information Disability Services Calendar of Events Johns Hopkins University is pleased to offer a Policy and Document Library, a one-stop, searchable resource for all university-level policies, statements, and guidelines on a broad range of topics. Policies & Document Library Johns Hopkins University Address Baltimore, Maryland Phone number 410-516-8000 X Facebook LinkedIn Youtube Instagram Hub © 2024 Johns Hopkins University. All rights reserved. Search jhu.edu Search jhu.edu search About Us Academics Schools & Divisions Admissions & Aid Research & Faculty Campus Life Maps & Directions Contact the University Employment Opportunities my.jh.edu Give to the University For Alumni For Parents For News Media Athletics Contact the University Employment Opportunities University Policies and Statements Privacy Statement Title IX Information and Resources Higher Education Act Disclosures Clery Disclosure Accessibility Emergency Contact Information"
}