{
  "id": 5,
  "date": "2024-05-18T18:23:43.603720",
  "url": "https://www.cs.jhu.edu/academic-programs/undergraduate-studies/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Undergraduate Studies Undergraduate Studies In This Section ﻿ Close ﻿ Undergraduate Studies Navigation Undergraduate Academics Undergraduate Student Life Research Opportunities Undergraduate and Graduate Course Information Play background animation Pause background animation Wide-ranging options, the flexibility to create a course of study that reflects your interests and career goals, meaningful hands-on learning, community engagement, active student groups, access to unparalleled research opportunities , and a focus on individualized advising are among the hallmarks of computer science education at Johns Hopkins University. To accommodate our students’ diverse interests, we offer both BS and BA degree options as well as popular minor in computer science. No matter which path you choose, though, you’ll graduate with the knowledge, practical experience, connections, and understanding of the discipline’s central role in addressing today’s grand challenges that you need to lead, succeed, and make an impact on the world. Undergraduate Education Undergraduate Degree Options Our BS program is designed for students who desire a more technical course of study, while our BA program is for students who want to combine their interest in computer science with a non-engineering discipline. We also have many students from across the Homewood campus who double-major in computer science. BS & BA programs Computer Science Minor A computer science minor provide students with foundational knowledge in the field that can be applied to other engineering disciplines as well as studies in non-engineering subjects. Computer Science Minor Combined BS/MS Degree Program The combined BS/MS program enables undergraduates to apply for and begin taking courses towards their master’s degree before completing their BS. Most students apply for the program in their junior year and finish both degrees within five years. Combined BS/MS Program For Current Students Policies, resources, forms, course information, FAQs, and services for undergraduate students. RESOURCES FOR UNDERGRADS “ I chose to major in computer science because of how dynamic and robust the field is. Computer science always felt like this rapidly changing field of study and I just wanted to be a part of that. ” Aubin Lohier BS '21 Become a Hopkins Engineer Learn about the admissions process and start your application today. Undergraduate Admissions Get to Know Us Student-run Civic Hack challenge Computer science students’ annual HopHacks hackathon focuses on civil impact and improving urban life with open-source software-based solutions. A customizable search engine for young learners Computer science students helped create Searchin’ , a search engine that provides young students with age- or education-appropriate information. Steve Klinkner, Engr ’86: High-tech lost and found As the VP of engineering for Tile, computer science alum Steve Klinker, Engr ’86, envisions a worldwide finding network for all. Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}