{
  "id": 5,
  "date": "2024-05-18T18:23:30.514168",
  "url": "https://www.cs.jhu.edu/research/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Research Research Bridging disciplines and accelerating discoveries in computer science. In This Section ﻿ Close ﻿ Research Navigation Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine Play background animation Pause background animation Computer science research at the Johns Hopkins University is advancing computing technology, enabling new modes of thought, and transforming society. Our faculty conduct innovative, collaborative research aimed at solving large and complex interdisciplinary problems, drawing upon the university’s renowned strengths in areas including artificial intelligence, robotics, speech and language processing, medicine, and public health. The department is rapidly growing, with current core research areas of theory and programming languages; systems and networking; computational biology and medicine; information security; natural language processing; machine learning, artificial intelligence, and data science; robotics, computer vision, and graphics; and human-computer interaction. Researchers partners with colleagues in other engineering disciplines, as well as with investigators from the Johns Hopkins Krieger School of Arts and Sciences, the School of Medicine, and the Applied Physics Laboratory. Cross-Departmental Centers and Institutes Center for Language and Speech Processing Laboratory for Computational Sensing and Robotics Johns Hopkins Information Security Institute Institute for Data Intensive Engineering and Science Malone Center for Engineering in Healthcare Human Language Technology Center of Excellence Center for Computational Biology Mathematical Institute for Data Science Institute for Assured Autonomy Johns Hopkins Data Science and AI Institute Research Areas Theory & Programming Languages Focusing on the design, implementation, and use of computer programming languages. Learn More Systems & Networkings Our faculty are undertaking research into all aspects of computer systems and networks. Learn More Computational Biology & Medicine Faculty are engaged in a wide range of computational health and biology projects, from using data-driven tools to detect early signs of sepsis to DNA sequencing technology and evolutionary genomics. Learn More Information Security Hopkins researchers are working to safeguard our digital world. Learn More Natural Language Processing Creating innovative new technologies that will enable more natural interaction between human and computers. Learn More Machine Learning, AI, & Data Science Applying cutting-edge machine learning techniques to new datasets and domains. Learn More Robotics, Vision, & Graphics Research spans the areas of computer vision, computer graphics, and augmented and virtual reality. Learn More Human-Computer Interaction Placing people at the center of technological innovation. Learn more Computer-Assisted Medicine Our faculty are shaping the digital future across all aspects of health care. Learn more Institute for Assured Autonomy The Institute for Assured Autonomy is operating in partnership with industry, government and academia to ensure the safe, secure, reliable, and predictable integration of autonomous systems into society by covering the full spectrum of research and application across the three pillars of technology, ecosystem, and policy & governance. Visit the IAA website Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}