{
  "id": 5,
  "date": "2024-05-18T18:23:29.392338",
  "url": "https://www.cs.jhu.edu/research/theory-programming-languages/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Research Theory & Programming Languages Theory & Programming Languages Our Theory & Programming Languages group focuses on the design, implementation, and use of computer programming languages. Play background animation Pause background animation Our programming languages research spans many areas and includes type systems, language design, type inference, efficient implementation of higher-order typed languages, side effects, concurrency, security, and metaprogramming. Our researchers also investigate a broad variety of theoretical problems with the goal of gaining insights into some of the most important issues in computer science today. Active research areas include streaming algorithms, pseudorandomness, approximation algorithms, theoretical networking, hardness of approximation, and cryptography. Research Groups and Labs Algorithms and Complexity Studying a broad variety of theoretical problems to gain insight into some of the most fundamental problems of computer science. Algorithms and Complexity Programming Languages Laboratory Focusing on fundamental problems in programming languages. Programming Languages Laboratory People Vladimir Braverman Associate Professor Department of Computer Science ﻿ Email: vbraver1@jhu.edu Phone: (410) 516-4975 Michael Dinitz Associate Professor Department of Computer Science ﻿ Email: mdinitz1@jhu.edu Phone: (410) 516-6251 Susan Hohenberger-Waters Research Professor Department of Computer Science ﻿ Email: shohenb2@jhu.edu Abhishek Jain Associate Professor Department of Computer Science ﻿ Email: abhishekjain@jhu.edu Phone: (410) 516-4276 S. Rao Kosaraju Edward J. Schaefer Professor Emeritus Department of Computer Science ﻿ Email: skosara1@jhu.edu Phone: (410) 516-8134 Xin Li Associate Professor Department of Computer Science ﻿ Email: xli113@jhu.edu Phone: (410) 516-5847 Scott Smith Professor, Director of Graduate Studies Department of Computer Science ﻿ Email: scott@cs.jhu.edu Phone: (410) 516-5299 Computer scientists take fresh run at classic ski rental problem Researchers seek optimal choices at the ski lodge and inside the operating system. Read More Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}