{
  "id": 5,
  "date": "2024-05-18T18:23:48.899344",
  "url": "https://www.cs.jhu.edu/about/employment-opportunities/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home About Employment Opportunities Employment Opportunities Work at one of the top universities in the nation—consider a career with the Department of Computer Science at Johns Hopkins University. Play background animation Pause background animation Current Opportunities Tenured/Tenure-Track Faculty Positions Computer Science The Johns Hopkins University’s Department of Computer Science invites applications for tenure-track faculty positions. We anticipate making multiple offers across all areas of Computer Science and at all ranks. We will also offer an early action application option. Early Action. Full consideration will be given to candidates who submit applications by December 1, 2023. However, the department may take early action on candidates beginning October 1 to schedule interviews for the fall semester to better accommodate schedules during faculty hiring season. We encourage applicants to apply as soon as they are ready to take advantage of the scheduling flexibility that this offers, but emphasize that all applications submitted by December 1, 2023, will receive full consideration. This year’s search begins a large-scale expansion of the Whiting School of Engineering, with the goal of adding 150 new tenure-track professors at all ranks, of which 80 will be part of the new artificial intelligence institute . This expansion will include a new building and extensive computational resources that will establish Johns Hopkins as a leading engineering school with a top AI research program. The new institute will pursue broad applications of AI for the betterment of society, including in health, scientific discovery, autonomy, climate, and sustainability, in addition to research on the fundamentals and foundations of AI. As part of this expansion, the Department of Computer Science will experience substantial growth across all research areas to become one of the largest departments at a private university. The department currently has 35 full-time tenure-track faculty members, 7 research and 8 teaching faculty members, 225 Ph.D. students, over 200 MSE/MSSI students, and over 700 undergraduate students. There are several affiliated research centers and institutes including the Center for Computational Biology (CCB) , the Laboratory for Computational Sensing and Robotics (LCSR) , the Center for Language and Speech Processing (CLSP) , the Information Security Institute (ISI) , the Institute for Data Intensive Engineering and Science (IDIES) , the Malone Center for Engineering in Healthcare (MCEH) , the Institute for Assured Autonomy (IAA) , the Mathematical Institute for Data Science (MINDS ), and the SNF Agora Institute . More information about the Department of Computer Science can be found here ; more information about the Whiting School of Engineering can be found here . The department is conducting a broad and inclusive search and is committed to identifying candidates who, through their research, teaching, and service, will contribute to the diversity and excellence of the academic community. We welcome candidates who are poised to address grand challenges in computer science, can work across disciplines to solve societal challenges, and support JHU’s leading role in increasing undergraduate diversity across elite universities. More information on diversity and inclusion in the department is available here . Applicants should submit a curriculum vitae, a research statement, a teaching statement and (optionally) three recent publications. Junior (assistant) candidates should submit three to five letters of reference. Senior (associate/full) candidates should submit a list of references. Applications must be made online here . While candidates who complete their applications by December 1, 2023 will receive full consideration, the department may consider applications submitted after that date. Furthermore, the department may take early action on applications beginning October 1. Questions may be directed to fsearch202 3 @cs.jhu.edu . The Johns Hopkins University is committed to equal opportunity for its faculty, staff, and students. To that end, the university does not discriminate on the basis of sex, gender, marital status, pregnancy, race, color, ethnicity, national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or other legally protected characteristics. The university is committed to providing qualified individuals access to all academic and employment programs, benefits, and activities on the basis of demonstrated ability, performance, and merit without regard to personal factors that are irrelevant to the program involved. Teaching Faculty Computer Science The Department of Computer Science at Johns Hopkins University seeks applicants for full-time teaching positions. These are career-oriented, renewable appointments, responsible for the development and delivery of undergraduate and/or graduate courses depending on the candidate’s background and interests. We are searching broadly to meet teaching needs across the discipline, including subjects such as artificial intelligence, data science, and machine learning. Each position carries a course load of two to three courses per semester, with at most two different preps. Teaching faculty are encouraged to engage in educational research, departmental and university service, and student mentoring. Extensive grading support is given to all instructors. The university has instituted a non-tenure track career path for full-time teaching faculty culminating in the rank of Teaching Professor. Johns Hopkins is a private university known for its commitment to academic excellence and research. The Department of Computer Science is one of nine academic departments in the Whiting School of Engineering, on the beautiful Homewood campus. We are located in Baltimore, MD in close proximity to Washington, D.C. and Philadelphia, PA. See our department webpage for additional information about the department, including undergraduate and graduate programs and current course descriptions. Applicants for these positions should have a PhD in computer science or a closely related field. Demonstrated excellence in and commitment to teaching and excellent communication skills are expected of all applicants. Applications may be submitted online here . Questions may be directed to lecsearch@cs.jhu.edu . For full consideration, applications should be submitted by December 1, 2023. Applications will be accepted until the positions are filled. The department is conducting a broad and inclusive search and is committed to identifying candidates who, through their teaching and service, will contribute to the diversity and excellence of the academic community. We welcome candidates who are poised to address grand challenges within computer science, can work across disciplines to solve societal challenges, and support JHU’s leading role in increasing undergraduate diversity across elite universities. More information on diversity and inclusion in the department is available here . The Johns Hopkins University is committed to active recruitment of a diverse faculty and student body. The university is an Affirmative Action/Equal Opportunity Employer of women, minorities, protected veterans, and individuals with disabilities, and encourages applications from these and other protected group members. Consistent with the university’s goals of achieving excellence in all areas, we will assess the comprehensive qualifications of each applicant. Postdoctoral Fellowship Positions Biostatistics and Machine Learning The Johns Hopkins Individualized Health Initiative (Hopkins in Health) is a university-wide collaborative venture to bring advances in statistical science and machine learning to healthcare. Our mission is to: discover new ways to more precisely define, measure, and communicate each person’s unique health state and the trajectory along which it is changing; develop these discoveries into new methods that can be used to better inform patients and their clinicians, resulting in better medical care decisions and improved health outcomes; and apply new knowledge gained from the delivery of individualized care to produce better health outcomes at more affordable costs for whole populations. As part of this unique initiative, we are seeking applicants for multiple two-year postdoctoral and research scientist positions. Researchers will have the opportunity to gain broad exposure to topics in statistical science and machine learning and their applications to healthcare through regular interactions with other faculty and fellows within in Health and across their home departments of biostatistics and computer science. Both Johns Hopkins and All Children’s Hospital provide highly supportive and dynamic environments for junior investigators to grow and develop their future career. Example projects include: More than 80 known types of autoimmune disorder afflict up to 50 million Americans, an estimated 5-8% of the population. A significant challenge in treating individuals with these conditions is that disease presentation varies greatly across individuals. By using electronic health data captured over decades from tracking individuals with these diseases, the goals for this project are to develop methods to enable caregivers to tailor treatment options to each individual. Primary investigators: Suchi Saria, John C. Malone Associate Professor of Computer Science; Antony Rosen, Professor of Medicine and Rheumatology; Michelle Petri, Professor of Medicine and Rheumatology; Scott Zeger, Professor of Biostatistics Can one reliably infer changes in health status using symptom data captured via sensors embedded within phones? The goals of this project are to understand how smartphones can be used in everyday settings to monitor health in individuals with neurodegenerative disorders. This project will involve developing novel methods for measuring an individual’s health status over time and methods for individualizing interventions. Primary investigators: Suchi Saria, John C. Malone Associate Professor of Computer Science; Ray Dorsey, Professor of Neurology University of Rochester Can we use large-scale population databases to measure the effects of interventions on individuals? The goal of this project will be to develop novel statistical methods for individualizing diagnosis and treatment decisions and for evaluating the causal effects of interventions on children’s health outcomes. Primary investigators: Elizabeth “Betsy” Ogburn, Associate Professor of Biostatistics; Scott Zeger, Professor of Biostatistics; Jonathan Ellen, MD, Professor of Pediatrics and Epidemiology, Johns Hopkins University, and President of All Children’s Hospital, Johns Hopkins Medicine Applications are also welcomed from applicants interested in exploring other areas of methodological research at the intersection of machine learning, Bayesian analysis, causal inference, and computational health. Bios of inHealth Methods Investigators: Elizabeth “Betsy” Ogburn is an associate professor of biostatistics at the Johns Hopkins Bloomberg School of Public Health. She received her PhD in biostatistics from Harvard University, where she worked with Andrea Rotnitzky and Jamie Robins, followed by a postdoctoral fellowship with Tyler VanderWeele at the Harvard School of Public Health Program on Causal Inference. She works on developing statistical methodology for causal inference, with a focus on novel data sources and structures—for example, using electronic medical records to inform individual-level healthcare decisions and using social network and other data that evince complex dependence among observations. She collaborates with medical professionals, mathematicians, political scientists, and researchers across public health, and her research has received special recognition from a number of organizations, including the Journal of the Royal Statistical Society and the Atlantic Causal Inference Conference. Suchi Saria is a John C. Malone Associate Professor of Computer Science with a joint appointment in the Institute for Computational Medicine at Johns Hopkins University. Her research focuses on developing machine learning and statistical inference methods for modeling temporal systems, especially in healthcare. In her work, she developed one of the first studies modeling health trajectories in infants from routinely collected electronic health data; this led to a novel non-invasive and accurate risk stratification score for measuring health at birth in preterm infants, a technology now licensed by one of the largest monitoring companies in Japan. Her works have received recognition in the form of best paper nominations at the Uncertainty in AI and the American Medical Informatics Association meetings, a cover article in Science Translational Medicine, a Gordon and Betty Foundation award, a Google Faculty Research Award, and a National Science Foundation Computing Innovation Fellowship. She did her PhD with Daphne Koller from Stanford University and her postdoctoral training with Ken Mandl and Zak Kohane at Harvard University. Scott Zeger is a John C. Malone Professor of Biostatistics and the director of the Johns Hopkins Individualized Health Initiative. With his colleague Kung-Yee Liang, Zeger discovered the generalized estimating equation approach to regression analysis for correlated responses as they occur in longitudinal, time series, genetic, and other studies. This work made Zeger one of the ten most-cited mathematical scientists over parts of the last two decades. With colleagues Diggle, Heagerty, and Liang, Zeger has written “The Analysis of Longitudinal Data,” published by the Oxford University Press. Why Johns Hopkins? For more than a century, Johns Hopkins has been recognized as a leader in medical research and teaching, with a history of successfully combining innovation and the forefront of engineering and medicine. You will have access to: The Johns Hopkins health system, which includes six academic and community hospitals, four suburban health care and surgery centers, more than 30 primary health care outpatient sites, and programs for national and international patient activities. The Johns Hopkins Hospital is the only hospital in history to have earned the number one ranking by U.S. News for 22 years—an unprecedented 21 years in a row from 1991 to 2011, and again in 2013. The Bloomberg School of Public Health at Johns Hopkins, specializing in research on health and wellness nationally and internationally; it has consistently earned the number one rank by U.S. News since 1994, which was the first year the magazine began ranking schools of public health. Many top ranked programs and institutes at the intersection of engineering, medicine, and data science, including the departments of Biomedical Engineering and Biostatistics , the Institute for Computational Medicine , the Institute for Data Intensive Science and Engineering , and the Laboratory for Computational Sensing and Robotics . These groups host regular seminars and eminent visitors that provide broader exposure on the aforementioned topics. Qualifications: The ideal applicant should have A PhD degree and publication record in a statistical science, machine learning, or other data analysis field. Strong programming skills in a statistical language (R, MATLAB, SAS). Creativity, enthusiasm, and good communication skills. Interest in working on health problems, but prior experience not required. How to Apply : Interested applicants should submit their curriculum vitae, selected paper(s), two references, and a brief cover letter summarizing their background and interest to Suchi Saria. Applications will be considered until the position is filled. The Johns Hopkins University is an Affirmative Action/Equal Opportunity Employer. There are no citizenship restrictions for this position. Living in Baltimore We’re bringing the best minds in tech and innovation to Johns Hopkins University and the Baltimore metropolitan area. With its rich history and vibrant cultural scene, Baltimore and its suburbs have so much to offer. Top schools, acclaimed restaurants, and diverse housing options make this a wonderful place call home. Explore Baltimore The power and promise of data science and AI Learn about our investment in new faculty as part of the university's historic commitment to building the nation’s foremost destination for emerging applications, opportunities, and challenges presented by data science, machine learning, and AI. Learn more Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}