{
  "id": 5,
  "date": "2024-05-18T18:23:24.500699",
  "url": "https://www.cs.jhu.edu/research/language-speech-processing/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Research Natural Language Processing Natural Language Processing Our faculty are creating innovations that will enable more natural interaction between human and computers. Play background animation Pause background animation Researchers in the Natural Language Processing group work at the intersection of computer science, artificial intelligence, and computational linguistics. Projects in this area aim to understand how human language is used to communicate ideas and to develop technology for machine analysis, translation, and transformation of multilingual speech and text. Computer scientists in this group work closely with researchers in other departments via the Whiting School’s Center for Language and Speech Processing . Research Centers and Labs Center for Language and Speech Processing The CLSP conducts research across a broad spectrum of fundamental and applied topics, including acoustic processing, automatic speech recognition, big data, cognitive modeling, computational linguistics, information extraction, machine learning, machine translation, and text analysis. Center for Language and Speech Processing Human Language Technology Center of Excellence The HLTCOE focuses on advanced technology for automatically analyzing a wide range of speech, text, and document data in multiple languages. HLTCOE Linguistics at JHU Within the Department of Cognitive Science, linguistics research focuses on integrating formal linguistics within a broader cognitive science perspective by addressing questions about the nature of linguistic representations themselves, their processing, the architecture and learnability of the grammar, the implementation of linguistic theories in terms of neural computations, and language acquisition in the broader context of cognitive development. Linguistics at JHU People Mark Dredze Associate Head of Research and Strategic Initiatives and John C. Malone Professor Department of Computer Science ﻿ Email: mdredze@cs.jhu.edu Kevin Duh Assistant Research Professor Department of Computer Science ﻿ Email: kevinduh@cs.jhu.edu Jason Eisner Professor Department of Computer Science ﻿ Email: eisner@jhu.edu Phone: (410) 516-8438 Anjalie Field Assistant Professor Department of Computer Science ﻿ Email: afield6@jhu.edu Daniel Khashabi Assistant Professor Department of Computer Science ﻿ Email: danielk@jhu.edu Philipp Koehn Professor Department of Computer Science ﻿ Email: phi@jhu.edu Phone: (410) 516-3427 Tom Lippincott Associate Research Professor Department of Computer Science ﻿ Email: tom@cs.jhu.edu Benjamin Van Durme Associate Professor Department of Computer Science ﻿ Email: vandurme@jhu.edu Ziang Xiao Assistant Professor Department of Computer Science ﻿ Email: ziang.xiao@jhu.edu David Yarowsky Professor Department of Computer Science ﻿ Email: yarowsky@cs.jhu.edu Phone: (410) 516-5372 Alan Yuille Bloomberg Distinguished Professor Department of Computer Science ﻿ Email: ayuille1@jhu.edu Phone: (410) 516-5331 Multi-language mastery: minimized hardware, maximized efficiency Johns Hopkins computer scientists introduce a new method to reduce the size of multilingual language models. Learn more Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}