{
  "id": 5,
  "date": "2024-05-18T18:23:54.801443",
  "url": "https://www.cs.jhu.edu/about/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home About About A diverse and collaborative community on the cutting edge of computing and technology. In This Section ﻿ Close ﻿ About Navigation Message from the Department Head Diversity and Inclusion Employment Opportunities Play background animation Pause background animation Welcome to the Department of Computer Science at Johns Hopkins University, the nation’s first research institution. The department is dedicated to upholding the university’s long-standing tradition of excellence in research, education, and civic engagement. Research-Focused Our faculty and students collaborate across Johns Hopkins divisions, including with colleagues at the School of Medicine and the Applied Physics Laboratory , and are advancing discovery in areas ranging from AI, computational biology and medicine, and information security to machine learning, robotics, and speech and language processing. Excellence in Academics We offer BS, BA, and mul tiple graduate degree programs, which means our students can pursue a course of study that suits their specific interests and career goals while also ensuring that they have the foundational knowledge experiences they need to achieve professional success—no matter what path they choose. Active and Engaged Alumni Join our community and you’ll be part of a global network of alumni that includes entrepreneurs and leaders in a wide variety of industries—from cutting-edge tech firms to finance and medicine—as well as in academia, all of whom are invested and involved in our students’ success. Quick Facts 571 Undergraduate students Many of our undergraduates participate in research and work in laboratories. 151 Master's students We offer two highly-ranked master’s programs in computer science and information security, giving students the advanced technical skills they’ll need to take on leadership roles in the field. 205 PhD students PhD students work closely with our faculty experts. We are proud to train the next generation of scholars in computer science research. #24 Computer science program At the undergraduate and graduate level per the annual U.S. News and World Report Best Colleges rankings. Apply Now Learn about the admissions process and become a Hopkins Engineer Undergraduate Admissions Graduate Admissions Making an Impact Predicting cyber attacks between nations The Cyber Attack Predictive Index , an effort led by computer science’s Anton Dahbura, provides a predictive analysis of nations most likely to engage in the surreptitious strategy waged with keyboards, code, and destructive malware rather than soldiers, tanks, and airplanes. Responding to an urgent need Computer science faculty in the Malone Center for Engineering in Healthcare brought their expertise to bear on the challenges of COVID-19. Canine comfort One way to make pediatric patients feel more at home in a hospital environment is to give them a furry, four-legged friend— or a robotic equivalent . The data behind your burrito Computer science alum and lead data scientist at Chipotle, Mash Syed, Engr ’15 (MS) , offers in-depth data analysis to the company’s executives to help them make informed business decisions. Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}