{
  "id": 5,
  "date": "2024-05-18T18:23:36.331031",
  "url": "https://www.cs.jhu.edu/research/computer-assisted-medicine/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Research Computer-Assisted Medicine Computer-Assisted Medicine Shaping the digital future across all aspects of health care. Play background animation Pause background animation Research in computer-assisted medicine at Johns Hopkins University shapes the digital future across all aspects of health care, including prevention, diagnostics, and treatment. This long-term vision is accomplished by pioneering research at the intersection of medicine, nursing, and public health with core engineering disciplines, including data science, artificial intelligence, computer vision, robotics, and human-computer interaction. We seek to address problems holistically, resulting in groundbreaking technologies that enable precise predictive models that anticipate disease progression, patient-specific assessments at various scales, and personalized treatment plans and autonomous robotic execution, ultimately enhancing patient outcomes and optimizing health care resources. Our faculty leads transformative initiatives across diverse domains, including medical image analysis, wearable sensor technology, telemedicine solutions, medical robotics, human-machine teaming and assurance, explainable artificial intelligence, data science, and causal inference. Leveraging the unique interdisciplinary and collaborative environment that is Johns Hopkins, our researchers merge computer science methods with domain expertise to create innovative tools and platforms. These advancements drive the frontier of precision medicine, shaping the future of health care delivery by harnessing the power of computational tools to augment human expertise and revolutionize patient care. Research Groups and Labs Advanced Robotics and Computationally AugmenteD Environments Lab The ARCADE Lab develops collaborative intelligent systems that support clinical workflows to increase access to—and expand the possibilities of—highest-quality health care. In designing these systems, they pioneer human-centered solutions that are enabled by synergistic advancements across imaging, computer vision, machine learning, and interaction design and that are embodied in emerging technology such as mixed reality and robotics. ARCADE Lab Computer Integrated Interventional Systems Laboratory The CIIS Laboratory exists to develop surgical systems that integrate novel computer and human-machine interface technologies that will revolutionize surgical procedures, extending surgeons' abilities to achieve better outcomes at lower costs. Computer Integrated Interventional Systems Laboratory Laboratory for Computational Sensing and Robotics The LCSR’s mission is to create knowledge and foster innovation to further the field of robotics science and engineering. The center’s researchers see robotics as an essential link between computation and action that enhances the health, safety, and efficacy of humanity. Laboratory for Computational Sensing and Robotics Radiology AI Lab RAIL is an open-structured AI-focused research collaboration that aims to be a Hopkins-wide resource and touchstone for data science collaboration, particularly in image processing and analysis, and an international leader in the research, development, and commercialization of information technology related to AI in imaging informatics. Radiology AI Lab Sensing, Manipulation, and Real-Time Systems Lab The SMARTS Lab focuses on components and integrated systems for computer-assisted surgery and robotics in extreme environments, performs research in augmented and mixed reality for human-machine collaboration, and emphasizes system integration activities, including system architectures and component-based software engineering. Sensing, Manipulation, and Real-Time Systems Lab People Mark Dredze Associate Head of Research and Strategic Initiatives and John C. Malone Professor Department of Computer Science ﻿ Email: mdredze@cs.jhu.edu Craig Jones Assistant Research Professor Department of Computer Science ﻿ Email: craigj@jhu.edu Peter Kazanzides Research Professor Department of Computer Science ﻿ Email: pkaz@jhu.edu Phone: (410) 516-5590 Alejandro Martin-Gomez Assistant Research Professor Department of Computer Science ﻿ Email: alejandro.martin@jhu.edu Michael Oberst Assistant Research Professor Department of Computer Science ﻿ Email: moberst@jhu.edu Russell Taylor John C. Malone Professor Department of Computer Science ﻿ Department of Mechanical Engineering ﻿ Email: rht@jhu.edu Phone: (410) 516-4639 Mathias Unberath Assistant Professor Department of Computer Science ﻿ Email: mathias@jhu.edu Phone: (410) 516-4253 X-ray vision: Tech could improve efficiency of pelvic fracture surgery Johns Hopkins researchers harness the power of machine learning to develop a first approach to X-ray-guided surgical phase recognition. Learn more Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}