{
  "id": 5,
  "date": "2024-05-18T18:23:52.174177",
  "url": "https://www.cs.jhu.edu/academic-programs/undergraduate-studies/undergraduate-academics/current-undergraduate-students/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Undergraduate Studies Undergraduate Academics Resources for Undergrads Current Undergraduates Policies, resources, forms, and services for undergraduates. Play background animation Pause background animation Academic Resources, Worksheets, and Forms For CS majors and minors specifically IMPORTANT RESOURCES Undergraduate Advising Manual – the primary resource for CS majors Academic Program FAQ – answers to the most common questions CS “other” courses for BS Program – non-CS courses that may be used in a limited fashion toward CS credits Course Area Designations – a chart of CS courses and their Applications, Reasoning, Software, Systems, and Theory designations Academic Integrity Code 2021 BS/BA Program Worksheet (.xlsx) – required advising document to track and calculate progress toward satisfying the either the BS or BA degree requirements Focus Areas [optional] – guide selecting courses for particular research or career directions Pre-2021 Manuals and Forms Undergraduate Advising Manual (old) – contains essential information for majors and minors not found in the course catalog, for requirements Fall 2016 through Spring 2021 BS/BA Program Worksheet (.xlsx) (old) – required advising document to track and calculate progress toward satisfying the either the BS or BA degree requirements Approved Science Courses – science courses that may count toward the basic science requirement Sample Schedules BS Four-Year Standard – for BS students starting a CS major in their first year (2024) BA Four-Year Standard – for BA students starting a CS major in their first year (2024) Second Year Start – for students starting a CS major in their second year Transfer Semester – for students who have one semester without taking courses towards the degree (i.e., study abroad, etc.) Machine Learning Path – for students interested in taking upper-level CS machine learning courses Robotics Path – for students taking CS courses related to robotics Department Contacts for Undergraduates Your “go-to” Computer Science staff members Joanne Selinski , Director of Undergraduate Studies 410-516-4117 | Malone 225 | Office Hours Coordinates undergraduate academics and advising Manages course information and course assistant hiring Advises HopHacks , the annual hackathon Lyn Doan , Sr. Academic Program Coordinator 410-516-8001 | Malone 160 | Office Hours Can answer general undergraduate advising and program requirement questions Oversees CS major and minor declarations Supports undergraduate student groups and events Abigail Fanara , Sr. Academic Program Coordinator 410-516-8001 | Malone 160 | Office Hours Can answer general undergraduate advising and program requirement questions Supports student groups and events Handles course scheduling Revelie Williams , Academic Program Manager Oversees applications to the combined bachelor’s/master’s program Available for general questions for the MSE and MSSI programs Academic Advising and Policies Department, School, and University academic policies Department resources to keep you on track with your academic program: The CS Undergraduate Academics page has general information about our programs Explore CS programs and courses (JHU catalogue) Contact advising@cs.jhu.edu or your faculty advisor with questions about course selection, degree requirements, other minors and majors, and four-year degree planning. University policies to keep you on track with your academic program: University-wide undergraduate academic policies (JHU catalogue) WSE advising FAQ Contact wseadvising@jhu.edu or your WSE academic advisor with questions about school-wide policies and procedures. Academic Calendar, Course Schedules, and External Credit Policies Academic Calendar (Office of the Registrar) – registration deadlines, breaks, class dates, and exam periods Course Schedules (SIS Public Course Search) Course Information (CS Department) External Credit Policies (JHU Catalogue) – also summarized below: Students wishing to transfer credits can obtain an External Course Request form via SIS . Students can take up to 12 credits outside Hopkins toward their degrees (besides AP and IB credits and those earned by students who transferred in from other institutions). Obtain the desired course’s syllabus or detailed course description and submit the completed request form to academic advising, where the information will be reviewed for approval. Once approval has been given, you can then take course and must earn a C or higher to receive credit. The other school must send your transcript to Hopkins after course completion. Once the transcript is received, the necessary credits will be transferred to your Hopkins transcript, although your grade will not be calculated according to or factored into your Hopkins GPA. Computing Resources Department and Homewood campus-wide services for students See the CS IT Support page for departmental computing information , including information about student accounts and labs. Contact support@cs.jhu.edu for help with any departmental computing services. Homewood Campus Computing Resources In addition to the department’s computing resources, there are additional computing resources on the Homewood campus, including in the Milton S. Eisenhower Library and the Brody Learning Commons. Student Affairs Information Technology Services is the best source for information about on-campus computing labs, printing, software, and more. Contact Johns Hopkins IT Services to report campus computing issues, purchase software, and for general help. Search for available software. Visit the JHU Technology Store to purchase computers and more (with a student discount). Library Resources Visit the JHU Sheridan Libraries website for general information. For engineering-specific information (including articles, patents, standards, and resources), please see the Libraries’ Engineering Guide . You can also contact Sue Vazakas , academic liaison for engineering at the Sheridan Libraries for more information. Research, Internship, and Career Opportunities University-wide resources for undergraduate research, career planning, internships, and more Learn about different types of research opportunities , offered both through the department and from across the university, with links to multiple resources. Johns Hopkins’ Life Design Lab provides a breadth of career-related programs, including résumé writing and interview preparation workshops, discipline-focused career fairs, internship and full-time employment listings, and more. Students are encouraged to pursue internships during their winter and summer breaks; students can also take part in a paid internship or work under a faculty sponsor for academic credit. A maximum of one credit per semester may be earned doing an internship. The Department of Computer Science also regularly shares information about undergraduate part-time, summer, and full-time employment recruitment and opportunities. Sign up for our jobs mailing list here . Student Employment JHU and department student employment opportunities, processes, and policies Johns Hopkins University Student Employment University Experiential Learning at JHU (formerly Student Employment) provides listings of job opportunities at Johns Hopkins and information about tax forms, eligibility, work permits, paychecks, and more. Departmental Student Employment Undergraduates primarily work hourly as course assistants or research assistants in CS. Course Assistant information – We hire a small army to help with almost every course in the department. Students must be rehired for each semester they work as a course assistant. Research positions are sometimes advertised via email, but are mostly obtained through direct contact with professors. See our Research Opportunities page for more details. Students must complete a federal I-9 form the first time they work at JHU and after every lapse in work that is at least one full semester long. This process must be completed before a student begins work in the department. Information about submitting hours, pay dates, and more can be found on the University Experiential Learning site . Student Support Services Johns Hopkins offers a host of resources where students can ask for and receive help on a variety of topics. If you need someone to listen, you can talk to your faculty advisor, the Director of Undergraduate Studies , or your WSE academic advisor. Sometimes venting to someone may be all you need. Other times, though, you may want to talk to someone who is trained to help people in distress. View these pages for information and hours: A wide range of student well-being resources are available through the Office of Student Life. The Office of Student Disability Services advises Johns Hopkins students with disabilities on available services, including accommodations on campus. The Counseling Center provides services to students who are in need of support and assistance related to their mental health—across a range of topics—in a caring environment. JHU Sexual Assault Helpline For emergencies, call the JHU Security office at (410) 516-7777 or the Baltimore City Emergency Line at 911. Graduation A student’s four years at Johns Hopkins culminates in a big day of celebration, otherwise called graduation and commencement. Timeline to Graduation Submit your Application to Graduate when notified by the Whiting School. Information is available on the Registrar’s graduation page . Make sure you correctly note your BS or BA degree as a CS major. November – Fourth-year students send their completed Major Worksheet to advising@cs.jhu.edu , who will review it in January and confirm that they are on track to graduate. March – The department certifies graduation eligibility. April/May – Graduating students complete Exit Surveys. Celebrations Obtain your diploma at Johns Hopkins Commencement . Join your family and friends at the CS reception. Graduates will receive an invitation mid-spring. Early/Late Graduation Submit your Application to Graduate the semester before you intend to finish. Review your completed Major Worksheet with a department staff member the semester before you intend to finish. Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}