{
  "id": 5,
  "date": "2024-05-18T18:23:47.585799",
  "url": "https://www.cs.jhu.edu/academic-programs/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Academic Programs In This Section ﻿ Close ﻿ Academic Programs Navigation Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Accreditation & Enrollment Academic Integrity Code Play background animation Pause background animation At the undergraduate, master’s, and doctoral levels, Johns Hopkins University’s Department of Computer Science provides students with exceptional academic programs, opportunities to be mentored by faculty who are defining their fields, and professional preparation and access to a vast alumni network that helps position them for success, no matter what their area of interest may be. The department has a diverse culture of students from across the country and around the world who are active and engaged in campus life as well as within the greater Baltimore community. Explore Our Programs Undergraduate Programs One of the most distinctive features of undergraduate education at Johns Hopkins is the access that all undergraduates have to the research laboratories of some of the most outstanding faculty members in the world. Through this contact with our faculty, students are able to develop skills not easily taught in the classroom. Undergraduate Studies Graduate Programs Today’s industry demands computer scientists with deep skill sets and the ability to keep on the cutting edge of technology. An advanced degree from the Department of Computer Science at Johns Hopkins University will significantly enhance your career possibilities—our graduates are always in high demand. MS in Security Informatics MSE in Computer Science PhD Program Combined Bachelor’s/Master’s A combined BS/MSE in Computer Science or Security Informatics allows students to earn a graduate degree in five years and increase their earning power after graduation. Combined Bachelor’s/Master’s in Computer Science or Security Informatics Accreditation and Program Statistics View accreditation information for the BS program and explore each year’s enrollment numbers for our majors, minors, and graduate programs, as well as graduation numbers over the last 10 years. Accreditation and Program Statistics Apply Now Are you ready to become a Hopkins Engineer? Apply For Undergraduate Admission Apply for Graduate Admission Living in Baltimore Baltimore is where JHU students grow and build their lives. From popular tourist attractions—the Inner Harbor, the National Aquarium, and Fort McHenry (birthplace of “The Star Spangled Banner”)—to more off-the-beaten-path destinations—the Edgar Allan Poe House and Museum or the tranquil Sherwood Gardens—there is always something new to discover. Explore Baltimore Future leaders in computer science Our department is a lively community that enables students to achieve their full potential. Hopkins professor wins big on poker class bet - Nearly 250 students registered for the Avi Rubin’s Introduction to the Theory and Practice of Poker class , which had lectures focused on strategy, Machiavellian maneuvers, and how to calculate odds. The course culminated in a nail-biting final tournament. Dog training methods help JHU researchers teach robots to learn new tricks - With a training technique commonly used to teach dogs to sit and stay, PhD student Andrew Hundt showed a robot how to teach itself several new tricks, including stacking blocks. Hack to the future - HopHacks is a 36-hour biannual hackathon held at the Johns Hopkins University that encourages engineers, designers, and entrepreneurs to explore new ideas and create new applications. Teams of up to four university students work on projects from scratch. Course registration made easier with Semester.ly app - Created by a team of computer science majors, Semester.ly is an innovative course scheduling platform that has has taken root at Johns Hopkins and at other universities in North America. Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}