{
  "id": 5,
  "date": "2024-05-18T18:23:09.017743",
  "url": "https://www.cs.jhu.edu/people/cs-external-advisory-board/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home People External Advisory Board CS External Advisory Board Play background animation Pause background animation Robert L. Constable heads the PRL Project on automated reasoning and software verification at Cornell University, which he joined as faculty in 1968. He is known for his work connecting programs and mathematical proofs, which has led to new ways of automating the production of reliable software. Constable stepped down as the Dean of the Faculty of Computing and Information Science (CIS) at Cornell after serving from 1999 to 2009. CIS is a college-level unit created to advance Cornell’s academic and research initiative in computing and information science. Constable is a graduate of Princeton University, where he worked with Alonzo Church, one of the pioneers of computer science. Nick Culbertson is the CEO of Protenus, a Baltimore-based artificial intelligence company that specializes in health care compliance analytics. Prior to co-founding Protenus, Culbertson was a fellow at the Institute for Critical Infrastructure Technology and a medical student at the Johns Hopkins University. Culbertson served eight years as a U.S. Army Special Operations “Green Beret,” specializing in human intelligence network development and analysis. He is an active member of Baltimore’s non-profit community as an Albert Schweitzer Fellow and a board member of The 6th Branch, a veteran-led community revitalization organization. Culbertson received his bachelor’s degree from the Johns Hopkins University. Susan B. Davidson is the Weiss Professor of Computer and Information Science at the University of Pennsylvania, where she has been since 1982. Her research interests include database and web-based systems, scientific data management, provenance, crowdsourcing, and data citation. Davidson received a bachelor’s in mathematics from Cornell University in 1978 and a master’s and PhD in electrical engineering and computer science from Princeton University in 1980 and 1982, respectively. Melanie Dorn is an executive director at Morgan Stanley Wealth Management, where she is also a manager in field management technology, currently focused on financial advisor compensation, and a solutions architect for investment solutions technology. Prior to joining Morgan Stanley in 2015, Dorn held several leadership positions in technology at UBS and Prudential Securities, designing and implementing new systems that allowed financial advisors to expand business for their firms. She won the FinTech Futures Tech Leadership Award at the 20th Annual Banking Technology Awards and was named a Transformation Leader of the Year Finalist at the 2019 Women in IT Awards. Dorn earned a bachelor’s in computer science from the Johns Hopkins University. David B. Enabnit was f ormerly the technical director of the Office of Coast Survey in the National Oceanic and Atmospheric Administration, where he handled technical and management responsibilities for computer-assisted cartographic system development and deployment; managed technical and business responsibilities for print-on-demand development and commercialization; and served as the head of the U.S. delegation to the international standards-setting body for marine navigation data and systems. He was also a lieutenant colonel in the U.S. Army Reserve with a duty station as staff to the director of army research. Enabnit is now retired and exploring other interests. He received his bachelor’s and master’s degrees in physics from the Ohio State University and his master’s degrees in computer science and business from the Johns Hopkins University. Jacob Green is a technology entrepreneur based in Baltimore, Maryland. He is a partner in Spread Concepts LLC, a boutique consulting firm that develops advanced, research-based technology to address real-world problems in distributed systems and networking. Green is also one of the founding technical team members of LTN Global Communications, where he currently serves as the director of engineering. He additionally co-founded D-Fusion, an early business intelligence web-crawling firm. Green holds bachelor’s (’99) and master’s (’00) degrees in computer science from the Johns Hopkins University, as well as a bachelor’s (’99) in physics. Colin McCarthy is the co-founder of Nebula Research & Development, a quantitative hedge fund, where he applies statistical models to financial markets looking for novel investment opportunities. Prior to his current role, McCarthy was a trader at Cubist Systematic Strategies for nine years, where he built out a statistical arbitrage and volatility trading business. During his career in the financial markets, McCarhty has also managed capital at several other firms, including Fortress Investment Group, Swiss Re Financial Products, and Tesseract Capital Group. He also worked in the technology sector for Warp Solutions, a startup focused on building distributed networking infrastructure software. McCarthy received a bachelor’s in computer science in 1998 from the Johns Hopkins University and received a master’s in computer science from Stanford University in 2000. Cristina Nita-Rotaru is a professor in the Khoury College of Computer Science at Northeastern University, where she co-directs its Network and Distributed Systems Security Lab and is a founding member of the its Cybersecurity and Privacy Institute. Prior to joining Northeastern in 2015, she was a faculty member at Purdue University, which she joined in 2003. Nita-Rotaru is the recipient of several awards for her work in dependable and secure network protocols in distributed systems. She is also a member of the International Federation for Information Processing’s Working Group on Dependable Computing and Fault Tolerance and on the steering committee of the ACM Symposium on Access Control Models and Technologies. She is additionally the vice-chair of the Institute of Electrical and Electronics Engineers Technical Community on Dependable Computing and Fault Tolerance and is the chair of the steering committee of the Internet Society’s Network and Distributed System Security Symposium. Nita-Rotaru earned a PhD from the Johns Hopkins University in 2003. Cleve Pasarell , Engr ’04, is the vice president of engineering at 6sense, a business-to-business marketing and sales technology company based in San Francisco. At 6sense, he manages advertising technology, works with the Interactive Advertising Bureau, and helps coordinate engineering strategy, process, and security. Prior to joining 6sense, Pasarell founded and served as the chief technology officer of Granite Media, a marketing and advertising platform dedicated to generating new readership and revenue for publishers. Pasarell is also a founder and board member of Big Edition, a publishing company, and is a serial angel investor. Joe Pistritto is an active consultant on data center and site reliability engineering (SRE) topics. He previously served as the SRE director and site lead at Google’s San Francisco office, where he managed teams running base infrastructure for services including networking, financial transactions, and setup/teardown of data center compute environments. Before that, he worked in global infrastructure capacity planning at Google, was the vice president of engineering at several Bay Area startups, and was the vice president of internet products at Oracle. Pistritto graduated from the Johns Hopkins University with both a BS and MS in electrical engineering. Noah Presler is an associate product manager at Google/Alphabet Inc. He co-founded and co-created Semester.ly, a platform that makes college more collaborative and stress-free by bringing technology to difficult areas like course registration. It is used regularly by thousands of students at the Johns Hopkins University. Presler graduated from the Whiting School of Engineering in 2017 with a BS in computer science and minors in both applied mathematics and statistics and entrepreneurship and management. He hopes to combine these diverse subject areas to create impactful technologies that improve people’s lives at scale. Kumar Ramaiyer is the chief technical officer of Workday’s Planning Business Unit. Based in Cupertino, California, he has focused on planning and analytical problems for the last 20 years at Workday, Oracle, and a startup company later acquired by Oracle. His recent interests include using machine learning and data science to create intelligent plans for different domains and the use of conversational and generative artificial intelligence to improve the overall planning experience. Ramaiyer received his PhD in computer science from the Johns Hopkins University in 1996. Gary Siegel is currently a senior services executive at World Wide Technology, where he works with clients to create and deliver technology solutions to “make a new world happen.” Prior to this, he held various senior leadership roles at Accenture, NTT Data, and FAST Technologies. A hands‐on leader, Siegel holds a patent and has won a number of Quality Innovation Awards. He holds a master’s degree in computer science and a bachelor’s in computer engineering from the Johns Hopkins University. Sandeep Singhal is the senior director of engineering for AI systems at Meta (formerly Facebook), leading shared training, model processing, inferencing, and serving infrastructure. He previously led the company’s areas of storage infrastructure, powering product, analytics, and machine learning. He has held leadership roles at Google (leading Cloud Storage), Microsoft (general manager for Bing Maps and Local Search, Internet Explorer, and Windows networking), and IBM (chief architect for its pervasive computing division). Singhal co-founded ReefEdge Networks, a pioneer in wireless LAN security, mobility, and management products. He has also served on advisory panels supporting the Defense Advanced Research Projects Agency, the National Research Council, and the European Commission. His credits include 78 issued patents and dozens of publications, including three books. Singhal holds MS and PhD degrees in computer science from Stanford University, as well as bachelor’s degrees in computer science, mathematical sciences, and mathematics from the Johns Hopkins University. Jim Williams is the CEO of Siemens Molecular Imaging and is based in Knoxville, Tennessee. Prior to this, he worked with Siemens for seven years in Germany, where he was responsible for interventional X‐ray imaging. Working in the field of medical imaging, he received his PhD (’98) from the Johns Hopkins University and his undergraduate and master’s degrees from Rice University. Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}