{
  "id": 5,
  "date": "2024-05-18T18:23:46.627873",
  "url": "https://www.cs.jhu.edu/academic-programs/program-enrollment-and-outcomes/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Accreditation & Enrollment Accreditation & Enrollment Play background animation Pause background animation BS Program Objectives and Student Outcomes The BS in computer science degree program is accredited by the Computing Accreditation Commission of ABET under the General Criteria and Program Criteria for Computer Science and similarly named computing programs. Click here for more information regarding ABET-accredited programs within the Whiting School of Engineering. Program Educational Objectives What our graduates should be able to do several years after graduation: (Revised Fall 2022) Successfully engage in professional practice in the computing sciences or apply computer science tools and techniques to solving problems in other disciplines. Engage in continuous learning, including advanced study in the computing sciences. Work successfully in both independent and team environments , including diverse and interdisciplinary teams . Lead teams and provide vision for innovation. Behave in a professional and ethical manner. Practice inclusion and advocate for diversity . Student Outcomes Upon graduation, our graduates should possess the skills to: Analyze a complex computing problem and apply principles of computing and other relevant disciplines to identify solutions. Design, implement, and evaluate a computing-based solution to meet a given set of computing requirements in the context of the program’s discipline. Communicate effectively in a variety of professional contexts. Recognize professional responsibilities and make informed judgments in computing practice based on legal and ethical principles. Function effectively as a member or leader of a team engaged in activities appropriate to the program’s discipline. Apply computer science theory and software development fundamentals to produce computing-based solutions. Enrollment by Program Primary BS Majors per class year AY 12-13 AY 13-14 AY 14-15 AY 15-16 AY 16-17 AY 17-18 AY 18-19 AY 19-20 AY 20-21 AY 21-22 AY 22-23 1st year 34 32 53 47 59 72 62 75 83 91 107 1st year 2nd year 35 42 44 62 55 73 111 88 103 102 127 2nd year 3rd year 26 36 48 49 69 70 86 110 95 109 137 3rd year 4th year 29 26 38 48 62 86 84 98 125 112 132 4th year All Years BS 1st Major 124 136 183 206 245 301 343 371 406 414 503 All Years BS 1st Major Primary BA Majors, Second Majors, and Minors across all years AY 12-13 AY 13-14 AY 14-15 AY 15-16 AY 16-17 AY 17-18 AY 18-19 AY 19-20 AY 20-21 AY 21-22 AY 22-23 All Years BA 1st Major 3 3 3 4 8 11 15 13 16 22 25 All Years BA 1st Major All Years 2nd Majors 15 37 51 53 66 66 91 113 123 135 153 All Years 2nd Majors All Years Minors 22 32 43 63 67 118 122 116 157 173 196 All Years Minors Graduate Students Master’s and PhD Enrollments AY 12-13 AY 13-14 AY 14-15 AY 15-16 AY 16-17 AY 17-18 AY 18-19 AY 19-20 AY 20-21 AY 21-22 AY 22-23 All Years Master’s 71 72 52 55 85 121 129 112 82 86 156 All Years Masters All Years PhD 85 102 115 121 141 157 162 181 195 205 200 All Years PhD Graduation Statistics Undergraduate Numbers Primary BS Majors, BA Majors, Second Majors, and Minors AY 12-13 AY 13-14 AY 14-15 AY 15-16 AY 16-17 AY 17-18 AY 18-19 AY 19-20 AY 20-21 AY 21-22 AY 22-23 BS 1st Major Graduates 27 25 35 38 47 81 66 98 123 104 127 BS 1st Major Graduates BA 1st Major Graduates 4 1 2 3 3 6 8 3 8 6 6 BA 1st Major Graduates 2nd Major Graduates 4 10 12 7 17 23 14 30 24 41 40 2nd Major Graduates Minor Graduates 8 8 19 25 25 25 31 34 24 41 31 Minor Graduates Graduate Numbers MSE and PhD AY 12-13 AY 13-14 AY 14-15 AY 15-16 AY 16-17 AY 17-18 AY 18-19 AY 19-20 AY 20-21 AY 21-22 AY 22-23 MSE Graduates 40 62 46 49 66 81 94 79 48 88 102 MSE Graduates PhD Graduates 7 8 4 18 16 22 18 15 19 33 35 PhD Graduates Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}