{
  "id": 5,
  "date": "2024-05-18T18:23:51.108306",
  "url": "https://www.cs.jhu.edu",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Powerful Computing Johns Hopkins Computer Science is revolutionizing the role of computing, automation, and information security in everyday life. Apply Today Chatbots tell people what they want to hear Read More Hopkins engineers create a tool to curate more nuanced news footage Read More Researchers map genome for cats, dolphins, birds, and dozens of other animals Read More Program Highlights Undergraduate Programs By offering both BS and BA degree programs, students can pursue a degree with a highly technical focus or one that is better suited to be combined with a non-engineering major. Undergraduate Programs Master’s in Engineering Computer Science Pursue an MS degree in computer science to have a competitive advantage in some of today’s most in-demand career fields. MSE Program Master of Science in Security Informatics The full-time MSSI program is an immersive, three-semester program providing educational, research, and professional opportunities that are simply unparalleled in this rapidly expanding field. MSSI Program PhD Program As a doctoral student in computer science, you will be mentored by world-renowned faculty members, collaborate across university divisions, and contribute to the creation of knowledge. PhD Program Singhal Family Entrepreneurship Award The Department of Computer Science, in collaboration with the Pava Maria LaPere Center for Entrepreneurship, is pleased to announce new awards that will help launch student-run software ventures at Johns Hopkins University. Learn More The power and promise of data science and AI Learn about our investment in new faculty as part of the university's historic commitment to building the nation’s foremost destination for emerging applications, opportunities, and challenges presented by data science, machine learning, and AI. Learn more Get to know Johns Hopkins Computer Science Discover Computer Science at Johns Hopkins - Learn about our community, our educational and research activities, our student groups and more—directly from our students and faculty. Deciphering our DNA - Johns Hopkins computer scientists contribute to the first complete sequence of human genome . Teaching students to harness the power of AI for good - In the department’s Machine Learning: Deep Learning course, Mathias Unberath teaches the fundamentals of artificial intelligence and ethical approaches to using the powerful technology. Introducing the Institute for Assured Autonomy - Computer science faculty will join the Johns Hopkins Institute for Assured Autonomy , a new center focused on ensuring the safe, secure, reliable, and predictable integration of autonomous systems into society. Learn more about the department - Check out a snapshot of the Department of Computer Science here. Latest News View All News Chatbots tell people what they want to hear Categories Research Department News A Johns Hopkins-led team found that chatbots reinforce our biases, providing insight into how AI could widen the public divide on controversial issues. Celebrating the 2024 department and school awardees Categories Awards and Honors Department News Student Experience Outstanding students and faculty were honored at the annual Computer Science Department Awards Ceremony. Anqi Liu receives Amazon Research Award Categories Awards and Honors The award for AI research funds the development of open-source tools and research to advance the frontiers of machine learning. Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}