{
  "id": 5,
  "date": "2024-05-18T18:23:27.245999",
  "url": "https://www.cs.jhu.edu/research/computational-biology-medicine/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Research Computational Biology & Medicine Computational Biology & Medicine Our faculty are engaged in a wide range of computational health and biology projects, from using data-driven tools to detect early signs of sepsis to DNA sequencing technology and evolutionary genomics. Play background animation Pause background animation Computational biology involves applying computational methods to address biological questions and challenges. Our faculty are pioneering new directions in the field of computational biology and medicine, in close collaboration with world-renowned Johns Hopkins Medicine researchers. Johns Hopkins University is home to a strong network of scientists working in computational genomics with diverse interests in many kinds of computational and statistical analyses of genomes. Research Centers and Labs Center for Computational Biology The CCB is a multidisciplinary center dedicated to research on genomics, genetics, and DNA sequencing technology. Center for Computational Biology Center for Computational Genomics The CCG is a multidisciplinary initiative to support research and education in the field of computational genomics. Center for Computational Genomics Center for Imaging Science The CIS sits at the intersection of mathematics, computer science, biomedical engineering, and electrical engineering; using mathematical and computational approaches, CIS researchers are pioneering new discoveries in four major areas: medical image analysis, computer vision, computational biology, and statistical learning. Center for Imaging Science Institute for Computational Medicine The ICM develops quantitative approaches for understanding the mechanisms, diagnosis, and treatment of human disease through the application of mathematics, engineering, and computer science. Institute for Computational Medicine People Vladimir Braverman Associate Professor Department of Computer Science ﻿ Email: vbraver1@jhu.edu Phone: (410) 516-4975 Mark Dredze Associate Head of Research and Strategic Initiatives and John C. Malone Professor Department of Computer Science ﻿ Email: mdredze@cs.jhu.edu Craig Jones Assistant Research Professor Department of Computer Science ﻿ Email: craigj@jhu.edu Benjamin Langmead Associate Professor Department of Computer Science ﻿ Email: blangme2@jhu.edu Phone: (410) 516-2033 Steven Salzberg Bloomberg Distinguished Professor Department of Computer Science ﻿ Department of Biomedical Engineering ﻿ Email: salzberg@jhu.edu Phone: (410) 516-8246 Suchi Saria John C. Malone Associate Professor Department of Computer Science ﻿ Email: ssaria1@jhu.edu Phone: (410) 516-4126 Michael Schatz Bloomberg Distinguished Professor Department of Computer Science ﻿ Email: mschatz@jhu.edu Phone: (703) 966-1987 Mathias Unberath Assistant Professor Department of Computer Science ﻿ Email: mathias@jhu.edu Phone: (410) 516-4253 Male sex chromosome, missing piece in human genome, finally decoded The achievement could provide a clearer picture of the role the chromosome plays in male-specific development, fertility, and genetically triggered diseases like cancer. Read More Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}