{
  "id": 5,
  "date": "2024-05-18T18:23:18.054628",
  "url": "https://www.cs.jhu.edu/research/robotics-vision-graphics/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Research Robotics, Vision, & Graphics Robotics, Vision, & Graphics Our department has several labs that are engaged in research spanning the areas of computer vision, computer graphics, and augmented and virtual reality. Play background animation Pause background animation In robotics, our expertise ranges from minimally invasive surgical robots to the integration of robots into human environments to support daily tasks. Our computer vision group focuses on research in recognition, detection, medical imaging analysis, and computer vision for augmented reality. In graphics, our strengths include shape retrieval, symmetry detection, surface reconstruction, mesh editing, and image processing. We collaborate often with the university’s Laboratory for Computational Sensing and Robotics , widely regarded as one of the top robotics research sites in the world—particularly in the area of medical robotics. Research Groups and Labs Computational Interaction and Robotics Lab CIRL researchers are interested in understanding problems that involve dynamic, spatial interaction at the intersection of vision, robotics, and human-computer interaction. Computational Interaction and Robotics Lab Computer Aided Medical Procedures The CAMP lab aims to develop next-generation solutions for computer-assisted interventions, by studying, modeling, and monitoring surgical workflows to enable the development of novel patient- and process-specific imaging and visualization methods. Computer Aided Medical Procedures Computer Graphics Group The Johns Hopkins Computer Graphics Group investigates shape retrieval, symmetry detection, surface reconstruction, mesh editing, and image processing. Computer Graphics Group Intuitive Computing Laboratory The Intuitive Computing Laboratory focuses on designing and building intuitive interaction capabilities for computing and robotics technologies to be integrated into human environments to enhance supported task performance and user experience. Intuitive Computing Laboratory Laboratory for Computational Sensing and Robotics The LCSR is a locus for robotics research, covering domains from computer-integrated medicine to human-computer interaction to robotic deep sea exploration. Laboratory for Computational Sensing and Robotics Medical UltraSound Imaging and Intervention Collaboration Research Laboratory The MUSiiC Research Laboratory conducts research on advanced ultrasound techniques, including ultrasound elastography imaging, 3D ultrasound reconstruction methods, parallel and GPU implementations, CT-US registration, and segmentation. MUSIIC Research Laboratory People Greg Hager Mandell Bellmore Professor Department of Computer Science ﻿ Email: hager@jhu.edu Phone: (410) 516-5521 Chien-Ming Huang John C. Malone Assistant Professor Department of Computer Science ﻿ Email: chienming.huang@jhu.edu Phone: (410) 516-4537 Craig Jones Assistant Research Professor Department of Computer Science ﻿ Email: craigj@jhu.edu Peter Kazanzides Research Professor Department of Computer Science ﻿ Email: pkaz@jhu.edu Phone: (410) 516-5590 Misha Kazhdan Professor Department of Computer Science ﻿ Email: mkazhda1@jhu.edu Phone: (410) 516-0060 Suchi Saria John C. Malone Associate Professor Department of Computer Science ﻿ Email: ssaria1@jhu.edu Phone: (410) 516-4126 Tianmin Shu Assistant Professor Department of Computer Science ﻿ Email: tianmin.shu@jhu.edu Russell Taylor John C. Malone Professor Department of Computer Science ﻿ Department of Mechanical Engineering ﻿ Email: rht@jhu.edu Phone: (410) 516-4639 Mathias Unberath Assistant Professor Department of Computer Science ﻿ Email: mathias@jhu.edu Phone: (410) 516-4253 Alan Yuille Bloomberg Distinguished Professor Department of Computer Science ﻿ Email: ayuille1@jhu.edu Phone: (410) 516-5331 Navigational technology used in self-driving cars aids brain surgery visualization Johns Hopkins researchers demonstrate the promise of “augmented endoscopy,” a real-time neurosurgical guidance method that uses advanced computer vision techniques. Learn more Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}