{
  "id": 5,
  "date": "2024-05-18T18:22:57.289165",
  "url": "https://engineering.jhu.edu/admissions/graduate-admissions/full-time-programs/how-to-apply/general-application-requirements/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation About Engineering Departments Faculty Directory News Events JHU Engineering Magazine Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation Current Students Faculty & Staff Media Partners Faculty & PostDoc Careers ﻿ Staff Careers ﻿ Johns Hopkins University, Whiting School of Engineering Utility Navigation Apply Request Information Give ﻿ Site Navigation Vision ﻿ Education Doctor of Engineering ABET Accreditation Academic Departments Find Your Degree Undergraduate Studies Graduate Studies Combined Degrees Lifelong Learning Student Entrepreneurs Academic Catalogue Corporate Engagement Research Centers & Institutes Office of Research and Translation Corporate Engagement ASPIRE Postdoctoral Training Program SPUR@APL Undergraduate Research Global Initiatives Resources, Policies & Forms Major Faculty Awards and Honors Translation Pava Marie LaPere Center for Entrepreneurship Johns Hopkins Technology Ventures Corporate Engagement Cohen Translational Engineering Fund STEM Outreach Johns Hopkins Technology Innovation Center Admissions Undergraduate Admissions Graduate Admissions Visit Us Contact Us Student Life Undergraduate Student Affairs Graduate/LLL Student Affairs Career Services: Life Design Lab Living in Baltimore Beyond the Classroom Engineering Student Groups Opportunities Abroad Student Initiatives Fund University Policies Alumni Get Involved Ways to Give Named Professorships Keep in Touch Alumni Stories Alumni Lectures and Events Alumni Association Contact Diversity About Us Initiatives Recruitment Explore Hopkins Resources Fellowships Hopkins Engineering PROPEL PFTL: Passport to Future Technology Leadership Search ﻿ Info For ﻿ Close ﻿ Info For Navigation Current Students Faculty & Staff Media Partners Faculty & PostDoc Careers ﻿ Staff Careers ﻿ You are here: Home Admissions Graduate Admissions Full-Time Programs How to Apply General Application Requirements General Application Requirements General application requirements for full-time graduate programs in Engineering include GRE, application fee, unofficial transcripts, and bachelor’s degree completion. Play background animation Pause background animation Start your Engineering Application at any time . We will begin accepting applications in mid-August 2024 for spring, summer, and fall 2025 start terms. Application deadlines and requirements vary by degree program . All materials are due in the application at the time of submission; we do not accept updated or replacement materials via email. Visit Engineering for Professionals for part-time/online master’s degrees and certificate programs offered in the Whiting School of Engineering. Graduate Record Examination (GRE) The Graduate Record Examination (GRE) is the world’s most widely used admissions test for graduate & professional schools. Visit the Education Testing Service (ETS) testing website to view current updates for available testing in your country. It is at the program’s discretion how scores are used in the review process, and you can contact the program to which you are applying to directly for more information. Required for Master’s Applications The Whiting School of Engineering requires GRE General Test scores for applications to our master’s programs. The scores you enter on your application are considered self-reported and unofficial. Some programs may recommend taking the relevant subject test . Please check the instructions available on your degree program website for more information. We accept the GRE General Test – At Home Testing Edition . It’s offered everywhere that the test is normally available, based on the country of your account address. Not Required for PhD Applications The Whiting School of Engineering does not require GRE General Test scores for applications to our PhD programs. Most programs do not consider GRE scores when reviewing PhD applications, and you are not required to submit self-reported or official GRE scores. If admitted to a PhD program, you are not required to provide official GRE scores for verification. How to Send GRE Test Scores Send your official/verified scores directly from ETS , using Johns Hopkins University School of Engineering institution code 4655 . Scores are valid for 5 years from your test date. Official test scores must be sent from the Testing Agency at least 3 weeks prior to the score expiration date. Any requests made close to or after the expiration date may not be processed in time. Send GRE to Engineering Graduate Admissions (Full-Time Programs) Institution Code: 4655 Department (Not required by our application system): If prompted, select the program you are applying to or general/other option. Official Test Score(s) Delay Programs will use unofficial test scores for review while awaiting the officials scores from Testing Agency. Official GRE scores have a delay of up to 14 days between requesting official scores and when they are received by our application system. If your name formatting, date of birth, or email differs between your Testing Agency account(s) and your application account, scores may not populate to your application. If it has been more than 2 full weeks since requesting official scores, contact Engineering Graduate Admissions with your full name, application reference number, and GRE registration number to verify ETS scores sent to code 4655. GRE Fee Reduction Program ETS provides the GRE Fee Reduction Program for individuals who can demonstrate financial need, for those who are unemployed and receiving unemployment compensation, and for national programs that work with underrepresented groups. Please visit the GRE Fee Reduction Program to learn more. Application Fee and Waiver Request A fee of $75 is required for each application to Johns Hopkins School of Engineering. If a program offers a reduced fee ($25), it will be reflected in your application. UPDATE : When applying to a master’s degree program with a summer 2024 or fall 2024 start term, you will NOT be charged an application fee . If you have selected a master’s degree program in the application, you will not be able to apply for an application fee waiver, and you will not be prompted to remit payment before submitting your application. The application fee is non-refundable and must be received by the application deadline for the degree program that you are applying to. Payment is made in the payment section of the application by credit/debit card after completing the final “Review” section of the application. How to Request an Application Fee Waiver If you qualify for an application fee waiver, you must apply directly in the application. Please do not email Engineering Graduate Admissions for this request. Eligible reasons to request an application fee waiver are listed below. On the “Supporting Materials” section, under the “Application Fee Waiver” header: Select the “Yes” option for the question, “Are you applying for an application fee waiver?” Select the application reason from the dropdown menu (eligible program or financial hardship). Upload your supporting document verifying your participation in the eligible program (letter, email, certificate, etc.), or submit a letter explaining your financial hardship situation. Select the “Upload” button before selecting “Continue” to proceed to the next section of the application. Request an Application Fee Waiver based on Eligible Program The application fee may be waived for applicants with documented registration/participation in one of the following programs (and documentation must be uploaded within the application). Click to view the full list of programs eligible for consideration for an application fee waiver. Annual Biomedical Research Conference for Minority Students (ABRCMS) Baltimore Scholars Program Chocktaw/Chickasaw Scholarship Científico Latino GSMI Scholar Current Student or Graduate of a Historically Black College of University (HBCU) Explore Hopkins Financial Hardship Fulbright Grace Hopper Celebration Scholar Graduate Horizons Institute for Recruitment of Teachers (IRT) JHU REU JHU Undergrad/Grad Student Leadership Alliance Louis Stokes Alliance for Minority Participation (LSAMP) Math Alliance Maximizing Access to Research Careers (MARC) McNair Scholars Program Mellon Mays Graduate Initiatives Program (MMGIP) Mellon Mays Undergraduate Fellowship (MMUF) Meyerhoff Program Millennium Scholar MIT Laureates & Leaders Morgan State University Students National GEM Consortium National Name Exchange (NNE) National Organization for the Professional Advancements of Black Chemists and Chemical Engineers National Society of Black Engineers (NSBE) NCUR (National Council on Undergraduate Research) Out in Science, Technology, Engineering and Mathematics (oSTEM) Posse Scholar Project 1000 Society for Advancement of Chicanos/Hispanics and Native Americans in Science (SACNAS) Society of Hispanic Professional Engineers (SHPE) Society of Women Engineers (SWE) The Women+ of Color Project (W+OCP) Vellore Institute of Technology Veteran/Active Military Personnel Vietnam Education Request an Application Fee Waiver based on Financial Hardship To request a waiver based on financial hardship, please select the option on the application. Domestic applicants are encouraged to upload one of the following: FAFSA SAR Report, a letter from a college/university financial aid office, unemployment verification. Domestic and International applicants may also upload other forms that provide significant documentation or explanation of financial hardship. Do not send tax returns. All documents will be reviewed and verified for satisfactory evidence. If the uploaded document is not accepted, you will be contacted and asked to resubmit or to pay the application fee. Request an Application Fee Waiver based on Previous Denied Application within One Year Applicants who have previously applied and been denied admission may request to have their application considered again for another start term, and the application fee waived for one additional application, if within one year of the original application . Contact the Office of Engineering Graduate Admissions to request the fee waiver based on this reason. Applicants cannot maintain multiple application accounts and will be required to provide their original application reference number, application account email, and full name. Applicants may start a new application or request a one-time offer for admissions to create a duplicate copy of the original denied application, waive the application fee, and mark the application as un-submitted. The applicant is then responsible for updating any materials (resume, statement of purpose, transcripts, self-reported test scores, letters of recommendation) and submitting their application by the program’s specified deadline for the new start term. Please be aware, applications will be reviewed after the next application deadline, during the normal review period for each program. We recommend applicants wait until closer to the start term’s deadline to update materials and submit application, regardless of when the application is duplicated. 2024 Admissions Cycle Our 2024 admissions cycle begins August 15, 2023, for all 2024 start terms (spring, summer, fall). Previously denied applicants may contact us after August 21, 2023 , should you choose to apply again and would like to request a one-time fee waiver and/or duplication of original application. Transcripts Applicants are required to provide unofficial transcripts for application review. If a university-provided unofficial transcript is not available, contact our office for assistance by email: [email protected] . Unofficial Transcripts Unofficial transcripts must be added directly in the application under the “Academic History” section. Include all colleges and universities you have attended, starting with the school(s) where a bachelor’s degree was earned, followed by all other schools with a period of enrollment. If you are earning dual bachelor’s degrees from two schools, you must enter both schools and degrees separately and include unofficial transcripts from each school. List the expected “Degree” and “Date Conferred or Expected” for the school where you earned (or will earn) your bachelor’s degree. Only use the “No Degree Awarded or Expected” option if you will not complete a degree at that school. If you have listed more than one degree or period of enrollment at a single institution, you must upload an unofficial transcript for each entry. Updated Unofficial Transcripts – Not Accepted for Application Review We do not accept updated unofficial transcripts after your application has been submitted. Many applicants apply with partial or “incomplete” transcripts while in the process of completing a degree; programs are aware of this, utilize a holistic review of all materials submitted, and do not require updated transcripts. Official Transcripts – Not Accepted for Application Review Do not send official transcripts directly from your school or a third-party vendor for application review. Official transcripts are only required by admitted students at the time of enrollment and must include degree conferral. Newly admitted students should reference Submitting Final Documents for details. Certified Translations and Credential Evaluations The Office of Engineering Graduate Admissions requires literal, certified translations for all documents issued in a language other than English. For all foreign academic work, we strongly recommend, but do not require, that you submit a professional credential evaluation from World Education Services (WES). We recommend the WES ICAP course by course evaluation. Visit Information for International Students for detailed information on Certified Translations and Credential Evaluations. Bachelor’s Degree Completion All graduate applicants applying to the Whiting School of Engineering are required to have completed a bachelor’s degree or the equivalent prior to beginning our graduate program. We do not distinguish between a 3-year or 4-year degree. Admitted students will be required to submit final official transcripts with degree conferral by the end of their first term enrolled. Stay Connected OneHop Facebook Twitter Instagram YouTube LinkedIn Open site alert Johns Hopkins University, Whiting School of Engineering Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Footer Navigation Apply ABET Accreditation Johns Hopkins University ﻿ Engineering for Professionals ﻿ Visit ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Search Submit Site Navigation Vision ﻿ Education Doctor of Engineering ABET Accreditation Academic Departments Find Your Degree Undergraduate Studies Graduate Studies Combined Degrees Lifelong Learning Student Entrepreneurs Academic Catalogue Corporate Engagement Research Centers & Institutes Office of Research and Translation Corporate Engagement ASPIRE Postdoctoral Training Program SPUR@APL Undergraduate Research Global Initiatives Resources, Policies & Forms Major Faculty Awards and Honors Translation Pava Marie LaPere Center for Entrepreneurship Johns Hopkins Technology Ventures Corporate Engagement Cohen Translational Engineering Fund STEM Outreach Johns Hopkins Technology Innovation Center Admissions Undergraduate Admissions Graduate Admissions Visit Us Contact Us Student Life Undergraduate Student Affairs Graduate/LLL Student Affairs Career Services: Life Design Lab Living in Baltimore Beyond the Classroom Engineering Student Groups Opportunities Abroad Student Initiatives Fund University Policies Alumni Get Involved Ways to Give Named Professorships Keep in Touch Alumni Stories Alumni Lectures and Events Alumni Association Contact Diversity About Us Initiatives Recruitment Explore Hopkins Resources Fellowships Hopkins Engineering PROPEL PFTL: Passport to Future Technology Leadership Utility Navigation Apply Request Information Give ﻿ Secondary Navigation About Engineering Departments Faculty Directory News Events JHU Engineering Magazine Close ﻿"
}