{
  "id": 5,
  "date": "2024-05-18T18:23:07.014702",
  "url": "https://www.cs.jhu.edu/news/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home News News Play background animation Pause background animation Chatbots tell people what they want to hear Categories Research Department News A Johns Hopkins-led team found that chatbots reinforce our biases, providing insight into how AI could widen the public divide on controversial issues. Recent News Categories All Categories Alumni Spotlight Awards and Honors Department News Research Student Experience Apply Filters Chatbots tell people what they want to hear Categories Research Department News A Johns Hopkins-led team found that chatbots reinforce our biases, providing insight into how AI could widen the public divide on controversial issues. Celebrating the 2024 department and school awardees Categories Awards and Honors Department News Student Experience Outstanding students and faculty were honored at the annual Computer Science Department Awards Ceremony. Anqi Liu receives Amazon Research Award Categories Awards and Honors The award for AI research funds the development of open-source tools and research to advance the frontiers of machine learning. Grounding COVID-19’s flight plan: Students simulate viral spread in airports Categories Student Experience A project with Amazon Web Services offers insight into the disease’s transmission. Solving puzzles for prey at the Maryland Zoo Categories Student Experience Johns Hopkins undergraduate engineers bring the thrill of the hunt to bobcats Kilgore and Josie with their high-tech take on the classic “Whac-A-Mole” arcade game. New student ventures win Singhal Family Entrepreneurship Awards Categories Student Experience Awards and Honors The awards will help launch the student-run software ventures by providing their teams with the resources needed to translate their innovative concepts into viable products. An AI that really cares about the big C Categories Student Experience A multidisciplinary student team designed an AI-powered chatbot to answer cancer patients’ questions accurately and empathetically. AI lawyers need to hit the books: Study finds LLMs flunk Law 101 Categories Research Johns Hopkins researchers compare GPT models to “sloppy paralegals.” Yinzhi Cao to participate in DARPA competition Categories Department News Cao is part of a team selected by the Defense Advanced Research Projects Agency to develop cyber reasoning systems using artificial intelligence technology. Ali Madooei receives Whiting School of Engineering Excellence in Teaching Award Categories Awards and Honors The award honors extraordinary dedication to the university’s teaching mission, exceptional performance in the classroom, and a continuing commitment to tomorrow’s leaders. The importance of ambiguity Categories Research Johns Hopkins researchers find that large language models can handle multiple interpretations of the same sentence—but only if they’re told to. Chien-Ming Huang awarded Hopkins AITC funding Categories Awards and Honors This round of grant recipients will receive funding to develop new artificial intelligence technologies to promote healthy aging. Previous Page Next Page Page 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 of 22 Go Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}