{
  "id": 5,
  "date": "2024-05-18T18:23:44.626004",
  "url": "https://www.cs.jhu.edu/academic-programs/combined-bachelors-masters/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Combined Bachelor’s/Master’s Combined Bachelor’s/Master’s In This Section ﻿ Close ﻿ Combined Bachelor’s/Master’s Navigation Combined BS/MS Program FAQ Play background animation Pause background animation The Combined Bachelor’s/Master’s in Engineering (BS/MSE) program enables undergraduates to apply for and begin taking courses towards a master’s degree before completing their bachelor’s degrees. Most students apply for the program in their junior year and finish both degrees within five years. It is not necessary for your undergraduate major and your master’s degree to be in the exact same field. For example, many computer science undergraduates choose the concurrent program to get a Master of Science in Security Informatics . Mixing degrees is also an alternative to undertaking a double major in a closely-related field, such as a combination of computer science and computer engineering or math. As a combined degree student , you must satisfy all the requirements of your bachelor’s degree as well as all the requirements of your master’s degree. Please note that some departments may permit an overlap of two courses at most. All other courses, including undergraduate electives, must be separate and distinct for the two degrees. BS/MSE Eligibility Students enrolled at JHU as second-semester third-years or rising fourth-years, as well as transfer students who may fall into any of these categories, are eligible to apply to the combined program. The Whiting School of Engineering requires that: An undergraduate student apply to combined student status no later than by the application deadline of the first semester of their fourth year (typically a student’s seventh semester, or in other words, their second-to-last semester of undergraduate study), and An undergraduate student be admitted and enrolled by their graduate program no later than the start of their eighth/final undergraduate semester. Seniors in their final semester cannot apply to the combined program, but can apply to the MSE program as a new graduate candidate and will receive the same benefits as students who applied earlier. Application requirements Combined application (NOT the internal graduate option) Two letters of recommendation JHU unofficial transcripts Statement of purpose Resume GRE and TOEFL scores NOT required Deadlines The deadlines to apply are November 15 for the spring and February 15 for the fall. Additional Information Read the FAQ about the combined BS/MS program. Watch a previously recorded information session about the combined BS/MS program. If you are interested in applying for the combined degree program, apply online through the university’s graduate admissions website . For all other questions related to the combined program, contact our Academic Program Manager, Revelie Williams . Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}