{
  "id": 5,
  "date": "2024-05-18T18:23:42.049019",
  "url": "https://www.cs.jhu.edu/academic-programs/graduate-studies/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Graduate Studies Graduate Studies Our goal is to create a collaborative and empowering environment for over 350 graduate students. In This Section ﻿ Close ﻿ Graduate Studies Navigation Master of Science in Engineering in Computer Science (MSE) Master of Science in Security Informatics (MSSI) PhD Program Resources for Graduate Students Play background animation Pause background animation Working side-by-side with faculty who are redefining their fields of inquiry, graduate students in the Department of Computer Science apply their skills to topics ranging from mitigating the impacts of climate change to ensuring national security and improving our ability to diagnose and treat disease. Over the past two years alone, the links between our field and the most influential world events have been a constant. There are direct connections to the COVID-19 response, such as the role of computational biology in characterizing variants and the use of geographical data systems in tracking infections, mortality, and vaccinations. The worldwide struggle for racial and social justice also needs to be supported by machine learning and artificial intelligence algorithms that are anti-racist. Fair elections and trustworthy news rely on information technology tools that combat disinformation. We invite you to learn more about our graduate programs and consider the many ways we can help you make an impact on the world. Graduate Programs in Computer Science Master of Science in Engineering in Computer Science Students in our MSE program gain firsthand knowledge of current research and its applications and can develop an academic program that meets their academic and professional interests and goals. MSE in Computer Science Master of Science in Security Informatics (MSSI) The full-time MSSI program is an immersive, three-semester program providing educational, research, and professional opportunities that are simply unparalleled in this rapidly expanding field. MS in Security Informatics PhD in Computer Science Students who complete our PhD program are well-prepared for careers in academia, research, government, and industry. PhD in Computer Science “ The department’s combination of theoretical foundation and hands-on experience prepared me to understand and tackle research challenges. The faculty also actively promote industry collaborations and helped connect me with world-leading researchers within JHU and beyond. ” Zhaoshuo “Max” Li ‘19 (MSE), ‘22 (PhD) Join us Learn about the graduate admissions process of Johns Hopkins engineering and start your application today. Learn about graduate admissions Start your application today For Current Students Policies, resources, forms, course information, and services for graduate students. RESOURCES FOR GRADUATE STUDENTS Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}