{
  "id": 5,
  "date": "2024-05-18T18:23:14.729747",
  "url": "https://lists.cs.jhu.edu/mailman/listinfo/sem",
  "university_name": "Johns Hopkins University",
  "title": "",
  "content": "sem --\n\tComputer Science Seminar Announcements About sem English (USA) Announcements about upcoming seminars hosted by the Computer Science Department. To see the collection of prior postings to the list,\n\t      visit the sem\n\t\t  Archives .\n\t      ( The current archive is only available to the list\n                members. ) Using sem To post a message to all the list members, send email to sem@cs.jhu.edu . You can subscribe to the list, or change your existing\n\t    subscription, in the sections below. Subscribing to sem Subscribe to sem by filling out the following\n\t      form.\n\t  You will be sent email requesting confirmation, to\n            prevent others from gratuitously subscribing you. This is a hidden list, which means that the\n            list of members is available only to the list administrator. Your email address: Your name (optional): You may enter a\n\t    privacy password below. This provides only mild security,\n\t    but should prevent others from messing with your\n\t    subscription. Do not use a valuable password as\n\t    it will occasionally be emailed back to you in cleartext. If you choose not to enter a password, one will be\n            automatically generated for you, and it will be sent to\n            you once you've confirmed your subscription.  You can\n            always request a mail-back of your password when you edit\n            your personal options. Pick a password: Reenter password to confirm: Which language do you prefer to display your messages? English (USA) Please answer the following question to prove that\n                    you are not a bot: What is the three-letter abbreviation for Johns Hopkins University? sem Subscribers ( The subscribers list is only available to the list\n            administrator. ) Enter your admin address and password to visit  the subscribers list: Admin address: Password: To unsubscribe from sem, get a password reminder,\n        or change your subscription options enter your subscription\n        email address: If you leave the field blank, you will be prompted for\n        your email address sem list run by sem-owner at cs.jhu.edu sem administrative interface (requires authorization) Overview of all cs.jhu.edu mailing lists version 2.1.39"
}