{
  "id": 5,
  "date": "2024-05-18T18:23:23.183961",
  "url": "https://www.cs.jhu.edu/research/machine-learning-ai-and-data-science/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Research Machine Learning, AI, & Data Science Machine Learning, AI, & Data Science Our faculty are applying cutting-edge machine learning and artificial intelligence techniques to new datasets and domains. Play background animation Pause background animation Computers are now predicting stock market changes, detecting cancer, and translating documents—all thanks to the power of machine learning and artificial intelligence. At the forefront of this field are Hopkins engineers and computer scientists, building better algorithms to tackle problems once thought to be too complex for computers to solve. One of the department’s greatest strengths is applying data science and analytics to health care applications. Projects include using wearables data to monitor and prevent health problems, improving diagnostics, and turning patient care into precision medicine. Notably, our researchers quickly shifted focus to contribute to the fight against COVID-19 by developing prediction models to track the pandemic and analyzing data to understand health disparities, among other projects. Research Centers and Labs Data Science and AI Institute The Johns Hopkins Data Science and AI Institute focuses on research and education in data science, machine learning, and artificial intelligence across diverse fields, including neuroscience, precision medicine, climate resilience, sustainability, public-sector innovation, and social sciences. Data Science and AI Institute Institute for Data Intensive Engineering and Science The IDIES mission is to coalesce data-intensive science efforts at Johns Hopkins into a well-focused center of activity and to propel various fields towards new discoveries and breakthroughs. Institute for Data Intensive Engineering and Science JHU Machine Learning Group Our machine learning community seeks to push forward the state of the art in terms of theory, algorithms, models, and applications with an eye toward solving the most important challenges of our day. JHU Machine Learning Group Malone Center for Engineering in Healthcare The Malone Center for Engineering in Healthcare brings together engineers, clinicians, and care providers who are leveraging data analytics in novel ways, pioneering new technologies, and applying systems engineering principles to speed the deployment of research-based innovations that will enhance the efficiency, effectiveness, and consistency of health care. Malone Center for Engineering in Healthcare Mathematical Institute for Data Science The Mathematical Institute for Data Science (MINDS) at Johns Hopkins University brings together a multidisciplinary team of mathematicians, statisticians, computer scientists, and engineers to develop the fundamental mathematical, statistical, and computational principles for the analysis and interpretation of massive amounts of complex, high-dimensional data. Mathematical Institute for Data Science People Raman Arora Associate Professor Department of Computer Science ﻿ Email: rarora8@jhu.edu Phone: (410) 516-1327 Vladimir Braverman Associate Professor Department of Computer Science ﻿ Email: vbraver1@jhu.edu Phone: (410) 516-4975 Randal Burns Bill and Lisa Stromberg Department Head and Professor Department of Computer Science ﻿ Email: randal@cs.jhu.edu Phone: (410) 516-8775 Anton Dahbura Executive Director of Johns Hopkins Information Security Institute and Co-Director of the Johns Hopkins Institute for Assured Autonomy Department of Computer Science ﻿ Email: AntonDahbura@jhu.edu Phone: (410) 516-0211 Mark Dredze Associate Head of Research and Strategic Initiatives and John C. Malone Professor Department of Computer Science ﻿ Email: mdredze@cs.jhu.edu Kevin Duh Assistant Research Professor Department of Computer Science ﻿ Email: kevinduh@cs.jhu.edu Jason Eisner Professor Department of Computer Science ﻿ Email: eisner@jhu.edu Phone: (410) 516-8438 Anjalie Field Assistant Professor Department of Computer Science ﻿ Email: afield6@jhu.edu Greg Hager Mandell Bellmore Professor Department of Computer Science ﻿ Email: hager@jhu.edu Phone: (410) 516-5521 Craig Jones Assistant Research Professor Department of Computer Science ﻿ Email: craigj@jhu.edu Daniel Khashabi Assistant Professor Department of Computer Science ﻿ Email: danielk@jhu.edu Philipp Koehn Professor Department of Computer Science ﻿ Email: phi@jhu.edu Phone: (410) 516-3427 Tom Lippincott Associate Research Professor Department of Computer Science ﻿ Email: tom@cs.jhu.edu Anqi Liu Assistant Professor Department of Computer Science ﻿ Email: aliu@cs.jhu.edu Alejandro Martin-Gomez Assistant Research Professor Department of Computer Science ﻿ Email: alejandro.martin@jhu.edu Eric Nalisnick Assistant Professor Department of Computer Science ﻿ Email: nalisnick@jhu.edu Michael Oberst Assistant Research Professor Department of Computer Science ﻿ Email: moberst@jhu.edu Steven Salzberg Bloomberg Distinguished Professor Department of Computer Science ﻿ Department of Biomedical Engineering ﻿ Email: salzberg@jhu.edu Phone: (410) 516-8246 Suchi Saria John C. Malone Associate Professor Department of Computer Science ﻿ Email: ssaria1@jhu.edu Phone: (410) 516-4126 Michael Schatz Bloomberg Distinguished Professor Department of Computer Science ﻿ Email: mschatz@jhu.edu Phone: (703) 966-1987 Ilya Shpitser John C. Malone Associate Professor Department of Computer Science ﻿ Email: ishpits1@jhu.edu Phone: (410) 516-5119 Tianmin Shu Assistant Professor Department of Computer Science ﻿ Email: tianmin.shu@jhu.edu Alexander Szalay Bloomberg Distinguished Professor Department of Computer Science ﻿ Email: szalay@jhu.edu Phone: (410) 516-7217 Mathias Unberath Assistant Professor Department of Computer Science ﻿ Email: mathias@jhu.edu Phone: (410) 516-4253 Benjamin Van Durme Associate Professor Department of Computer Science ﻿ Email: vandurme@jhu.edu Ziang Xiao Assistant Professor Department of Computer Science ﻿ Email: ziang.xiao@jhu.edu Alan Yuille Bloomberg Distinguished Professor Department of Computer Science ﻿ Email: ayuille1@jhu.edu Phone: (410) 516-5331 Putting trust to the test Hopkins researchers unveil new uncertainty quantification methods in an effort to promote appropriate trust in AI use. Learn more Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}