{
  "id": 5,
  "date": "2024-05-18T18:23:34.904861",
  "url": "https://www.cs.jhu.edu/people/cs-affiliates/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home People Joint, Affiliate, & Research Faculty Joint, Affiliate, & Research Faculty In This Section ﻿ Close ﻿ Joint, Affiliate, & Research Faculty Navigation Joint & Secondary Faculty Research, Visiting, & Part-Time Faculty Research Scientists & Postdoctoral Fellows Play background animation Pause background animation Meet our joint, affiliate, and research faculty, staff, and postdoctoral fellows. Joint & Secondary Faculty Professors with joint and secondary appointments in the Department of Computer Science. Joint faculty join us from divisions outside of the Whiting School of Engineering, while secondary faculty have multiple appointments within the Whiting School. Joint & Secondary Faculty Research, Visiting, & Part-Time Faculty Faculty who contribute to the department's research efforts, are visiting from other institutions, or teach in a part-time capacity. Research, Visiting, & Part-Time Faculty Research Scientists & Postdoctoral Fellows Researchers who contribute to the department's mission of advancing computing technology, enabling new modes of thought, and transforming society. Research Staff & Postdoctoral Fellows Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}