{
  "id": 5,
  "date": "2024-05-18T18:23:05.043199",
  "url": "https://www.clsp.jhu.edu/human-language-technology-masters/",
  "university_name": "Johns Hopkins University",
  "title": "",
  "content": "Home About Diversity and Inclusion Health + Safety: Coronavirus Information Contact Us/Visit Us Internships Courses Apply for PhD Jelinek Fellowship Employment Opportunities Make a Donation People Faculty Affiliated Faculty Former Faculty Postdocs Current Postdocs Former Postdocs Graduate Students Staff Alumni Publications Seminars Seminar Calendar Seminar Videos Workshops HLT Masters Resources Health + Safety: Coronavirus Information Student Activities Committees Employee Self-Service Code and Data Resources HLT Masters Human Language Technology (HLT) Masters Concentration Master’s students who are already enrolled at Johns Hopkins University, please indicate your interest in this track by filling out this form ! For new students, please indicate your interest in this track in the admissions application . Human Language Technology is the science behind computer processing of human language, and is the driving force in modern software and consumer electronics. Automatic speech recognition and natural language processing underlie many technologies that are now used daily by millions of people to interact with mobile technology. Machine translation is being used more and more as its accuracy improves to translate web pages from one language to another, and our ability to extract useful information from text allows us to index and search billions of websites in fractions of a second. While HLT has grown in its use and importance, the supply of PhDs from academia has failed to keep up with industry’s growing demand for experts capable of developing and deploying needed technologies. The HLT concentration at Johns Hopkins aims to prepare students for work in industry over the course of just three or four semesters. In the HLT master’s concentration, students learn the mathematical and computational ideas behind these increasingly common technologies. You will learn how to implement these  methods using popular programming languages and open-source frameworks and how to deploy these methods at scale using cloud computing resources and high-performance graphics processing units (GPUs). Students will have the opportunity to work on group projects under the direct supervision of distinguished academic researchers in a practicum-style course. The HLT concentration requirements are intended to allow specialization in a particular technology, such as machine translation, machine learning, or automatic speech recognition. The HLT master’s concentration exists for both the Masters in Computer Science and the Masters in Electrical and Computer Engineering. Students will have to fulfill the requirements for the degree program, and take the following courses: Introduction to Human Language Technology (601.667) Natural Language Processing (601.665) Information Extraction from Speech and Text (520.666) Students will also have to complete a Master’s project/thesis related to Human Language Technology. Sample Courses Fall Semester, First Year Introduction to Human Language Technology (601.667 CSCI-APPL) Natural Language Processing (601.665 CSCI-APPL) Additional CS or ECE course Spring Semester, First Year Information Extraction from Speech and Text (520.666) Two additional CS or ECE courses Summer Semester Start Project/ Thesis/ Internship Fall Semester, Second Year Two additional CS or ECE courses Project/ Thesis (completion) Students are allowed and encouraged to select other courses from other departments that are relevant to the Human Language Technology Master’s Concentration. The HLT concentration is an intense introduction to Human Language Technology, open to those enrolled in the MSE or PhD programs in the Computer Science and Electrical and Computer Engineering departments at Johns Hopkins University. The academic year 2019-2020 will be the first year this concentration is offered. The HLT concentration is intended to prepare students  for careers in industry, though we anticipate that some of our graduates may go on to pursue PhD studies. Students in the HLT concentration will take courses alongside PhD students, especially students affiliated with the Johns Hopkins Center for Language and Speech Processing. Successful applicants will have a strong background in undergraduate-level programming and math (primarily calculus and linear algebra). The application process is handled through the university’s online graduate student application . Johns Hopkins University is home to an active group of exceptional researchers in Human Language Technology. Our PhD students have gone on to work in both academia and at leading technology companies such as Google, Apple, Facebook, Microsoft, and Amazon, and may have gone on to form their own startups. PhD programs at Johns Hopkins and similar universities are not producing graduates fast enough to meet the intense industry demand for expertise in HLT. The HLT concentration aims to prepare students for work with HLT in industry over just three or four semesters. Subscribe to the CLSP Seminars Mailing List Upcoming Seminars There are no upcoming events. View Calendar Add Add to Timely Calendar Add to Google Add to Outlook Add to Apple Calendar Add to other calendar Export to XML Seminar Videos Sequence Kernels for Speaker and Speech Recognition – Mark Gales (University of Cambridge) - 2009 Xinyi Cindy Wang: Building Data-Efficient and Reliable Applications with Large Language Models Unleashing the Potential of LLMs through Task and Data Engineering Streaming Sequence Transduction through Dynamic Compression Fighting Bias from Bias: Robust Natural Language Techniques to Promote Health Equity Load More... Subscribe Johns Hopkins University, Whiting School of Engineering Center for Language and Speech Processing Hackerman 226 3400 North Charles Street, Baltimore, MD 21218-2680 (410) 516-4237 [email protected] Whiting School of Engineering Johns Hopkins University Privacy Statement Legal © 2024 Johns Hopkins University Center for Language and Speech Processing"
}