{
  "id": 5,
  "date": "2024-05-18T18:23:37.362186",
  "url": "https://www.cs.jhu.edu/faculty/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home People People Play background animation Pause background animation Search for faculty Search Name Contact Yair Amir Professor Emeritus Email: yairamir@jhu.edu Raman Arora Associate Professor Email: rarora8@jhu.edu Vladimir Braverman Associate Professor Email: vbraver1@jhu.edu Randal Burns Bill and Lisa Stromberg Department Head and Professor Email: randal@cs.jhu.edu Yinzhi Cao Assistant Professor and Technical Director of the JHU Information Security Institute Email: yinzhi.cao@jhu.edu Anton Dahbura Executive Director of Johns Hopkins Information Security Institute and Co-Director of the Johns Hopkins Institute for Assured Autonomy Email: AntonDahbura@jhu.edu Mohammad Ali Darvish Sr. Lecturer Email: darvish@jhu.edu Michael Dinitz Associate Professor Email: mdinitz1@jhu.edu Mark Dredze Associate Head of Research and Strategic Initiatives and John C. Malone Professor Email: mdredze@cs.jhu.edu Kevin Duh Assistant Research Professor Email: kevinduh@cs.jhu.edu Jason Eisner Professor Email: eisner@jhu.edu Anjalie Field Assistant Professor Email: afield6@jhu.edu Gagan Garg Associate Teaching Professor Email: gagan@jhu.edu Soudeh Ghorbani Assistant Professor Email: sghorba1@jhu.edu Matthew Green Associate Professor Email: mgreen@cs.jhu.edu Greg Hager Mandell Bellmore Professor Email: hager@jhu.edu Susan Hohenberger-Waters Research Professor Email: shohenb2@jhu.edu David Hovemeyer Associate Teaching Professor Email: daveho@cs.jhu.edu Chien-Ming Huang John C. Malone Assistant Professor Email: chienming.huang@jhu.edu Abhishek Jain Associate Professor Email: abhishekjain@jhu.edu Craig Jones Assistant Research Professor Email: craigj@jhu.edu Peter Kazanzides Research Professor Email: pkaz@jhu.edu Misha Kazhdan Professor Email: mkazhda1@jhu.edu Daniel Khashabi Assistant Professor Email: danielk@jhu.edu Philipp Koehn Professor Email: phi@jhu.edu S. Rao Kosaraju Edward J. Schaefer Professor Emeritus Email: skosara1@jhu.edu Benjamin Langmead Associate Professor Email: blangme2@jhu.edu Xiangyang Li MSSI Program Director and Associate Teaching Professor Email: xyli@jhu.edu Xin Li Associate Professor Email: xli113@jhu.edu Tom Lippincott Associate Research Professor Email: tom@cs.jhu.edu Anqi Liu Assistant Professor Email: aliu@cs.jhu.edu Ali Madooei Associate Teaching Professor Email: madooei@jhu.edu Alex Marder Assistant Professor Email: amarder@jhu.edu Alejandro Martin-Gomez Assistant Research Professor Email: alejandro.martin@jhu.edu Sara Miner More Associate Teaching Professor Email: more@cs.jhu.edu Eric Nalisnick Assistant Professor Email: nalisnick@jhu.edu Michael Oberst Assistant Research Professor Email: moberst@jhu.edu Aviel Rubin Professor Emeritus Email: rubin@jhu.edu Krishan Sabnani Homewood Professor of Computer Science Email: ksabnan2@jhu.edu Steven Salzberg Bloomberg Distinguished Professor Email: salzberg@jhu.edu Suchi Saria John C. Malone Associate Professor Email: ssaria1@jhu.edu Michael Schatz Bloomberg Distinguished Professor Email: mschatz@jhu.edu Joanne Selinski Associate Teaching Professor, Associate Chair for Education, and Director of Undergraduate Studies Email: joanne@cs.jhu.edu Ilya Shpitser John C. Malone Associate Professor Email: ishpits1@jhu.edu Tianmin Shu Assistant Professor Email: tianmin.shu@jhu.edu Patricio Simari Sr. Lecturer Scott Smith Professor, Director of Graduate Studies Email: scott@cs.jhu.edu Alexander Szalay Bloomberg Distinguished Professor Email: szalay@jhu.edu Russell Taylor John C. Malone Professor Email: rht@jhu.edu Mathias Unberath Assistant Professor Email: mathias@jhu.edu Benjamin Van Durme Associate Professor Email: vandurme@jhu.edu Ziang Xiao Assistant Professor Email: ziang.xiao@jhu.edu David Yarowsky Professor Email: yarowsky@cs.jhu.edu Alan Yuille Bloomberg Distinguished Professor Email: ayuille1@jhu.edu Renjie Zhao Assistant Professor Email: rjzhao@jhu.edu Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}