{
  "id": 5,
  "date": "2024-05-18T18:22:58.999025",
  "url": "https://engineering.jhu.edu/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation About Engineering Departments Faculty Directory News Events JHU Engineering Magazine Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation Current Students Faculty & Staff Media Partners Faculty & PostDoc Careers ﻿ Staff Careers ﻿ Johns Hopkins University, Whiting School of Engineering Utility Navigation Apply Request Information Give ﻿ Site Navigation Vision ﻿ Education Doctor of Engineering ABET Accreditation Academic Departments Find Your Degree Undergraduate Studies Graduate Studies Combined Degrees Lifelong Learning Student Entrepreneurs Academic Catalogue Corporate Engagement Research Centers & Institutes Office of Research and Translation Corporate Engagement ASPIRE Postdoctoral Training Program SPUR@APL Undergraduate Research Global Initiatives Resources, Policies & Forms Major Faculty Awards and Honors Translation Pava Marie LaPere Center for Entrepreneurship Johns Hopkins Technology Ventures Corporate Engagement Cohen Translational Engineering Fund STEM Outreach Johns Hopkins Technology Innovation Center Admissions Undergraduate Admissions Graduate Admissions Visit Us Contact Us Student Life Undergraduate Student Affairs Graduate/LLL Student Affairs Career Services: Life Design Lab Living in Baltimore Beyond the Classroom Engineering Student Groups Opportunities Abroad Student Initiatives Fund University Policies Alumni Get Involved Ways to Give Named Professorships Keep in Touch Alumni Stories Alumni Lectures and Events Alumni Association Contact Diversity About Us Initiatives Recruitment Explore Hopkins Resources Fellowships Hopkins Engineering PROPEL PFTL: Passport to Future Technology Leadership Search ﻿ Info For ﻿ Close ﻿ Info For Navigation Current Students Faculty & Staff Media Partners Faculty & PostDoc Careers ﻿ Staff Careers ﻿ Design Day Recap! 200+ student teams showed off their cutting-edge solutions to real-world challenges. Johns Hopkins University, Whiting School of Engineering Create a Better Future. Muyinatu Bell Receives 2024 Alan T. Waterman Award Regarded as the nation’s highest honor for early career scientists and engineers. Read more engineering education. Creating Leaders Through pioneering research. Transforming Society With meaningful translation. Making Impact Through Here, you won’t just take in knowledge. You’ll create it. 20+ Degree Programs We prepare visionary leaders, combining comprehensive excellence and collaboration across engineering disciplines. Undergraduate programs Full-time graduate programs Part-time and online graduate programs ﻿ 10 Academic Departments Blurring the lines between education and research, our academic programs combine theory with practical experience to address real-world problems. View all engineering departments 230+ Centers, Institutes & Labs Get hands-on experience through our interdisciplinary centers and institutes and labs, backed by the extensive resources and global connections of Johns Hopkins University. View centers and institutes Seeking Bold, Interdisciplinary Leaders Redefining Their Fields A new Data Science and AI Institute will bring together experts from a wide range of disciplines to capitalize on the rapidly emerging potential of data to fuel discovery across the university. Read About the Institute Our Vision Experience Hopkins Engineering Hopkins Engineers are addressing today’s universal societal challenges to ensure a better tomorrow. Realizing the Power and Promise of AI - Hopkins engineers are using AI to extend human capabilities, ensure equity in healthcare, enable a new age of space exploration, and more. Part-time and online graduate education - Johns Hopkins top-ranked Engineering for Professionals program delivers challenging part-time, online courses in more than 22 disciplines that address the most current engineering technologies, In the Magazine: Material Matters - Inside the historic Stieff Silver Building, Johns Hopkins has built the world’s top facility for studying the atomic structures of materials . Researchers across the Whiting School are using it to reshape fields from energy to oncology. In the Magazine: Innovation at the Crossroads - Biomedical engineer Jennifer Elisseeff is known for asking bold questions and pursuing seemingly “outlandish” ideas that pay off big . Her latest cross-disciplinary pursuit? Unlocking the mysteries of aging. Hopkins Engineering News View All News Natalia Trayanova's Cardiac \"Digital Twins\" Featured in Wall Street Journal Categories Expertise Murray B. Sachs Professor in Biomedical Engineering leading clinical trial on cardiac arrythmias. Hopkins to Establish RNA Innovation Center in Collaboration with TriLink Biotechnologies Categories Corporate Engagement Research The center, anchored in the Institute for NanoBioTechnology, will speed the cycle of RNA innovation in pursuit of advanced therapies. HopStart Challenge Showcases Johns Hopkins Student Start-Ups Categories Student Entrepreneurship Cross-disciplinary teams pitched plans for an at-home glaucoma sensor, a hub for music-related services, biodegradable fishing nets, and more. “ Hopkins has an altruistic focus that pervades all through the university … everything at Hopkins is very human-centric and people were very front-and-center. It was mission-focused. ” Carol Reiley, MS '07 Co-founder and former president of Drive.ai; named to Forbes’ Top 50 Women in Tech in 2018 Pava Center Serving first-year students to post-docs from across Johns Hopkins, Pava Center offers student entrepreneurs mentorship, programming, space, and funding support. Student Entrepreneurs Stay Connected OneHop Facebook Twitter Instagram YouTube LinkedIn Open site alert Johns Hopkins University, Whiting School of Engineering Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Footer Navigation Apply ABET Accreditation Johns Hopkins University ﻿ Engineering for Professionals ﻿ Visit ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Search Submit Site Navigation Vision ﻿ Education Doctor of Engineering ABET Accreditation Academic Departments Find Your Degree Undergraduate Studies Graduate Studies Combined Degrees Lifelong Learning Student Entrepreneurs Academic Catalogue Corporate Engagement Research Centers & Institutes Office of Research and Translation Corporate Engagement ASPIRE Postdoctoral Training Program SPUR@APL Undergraduate Research Global Initiatives Resources, Policies & Forms Major Faculty Awards and Honors Translation Pava Marie LaPere Center for Entrepreneurship Johns Hopkins Technology Ventures Corporate Engagement Cohen Translational Engineering Fund STEM Outreach Johns Hopkins Technology Innovation Center Admissions Undergraduate Admissions Graduate Admissions Visit Us Contact Us Student Life Undergraduate Student Affairs Graduate/LLL Student Affairs Career Services: Life Design Lab Living in Baltimore Beyond the Classroom Engineering Student Groups Opportunities Abroad Student Initiatives Fund University Policies Alumni Get Involved Ways to Give Named Professorships Keep in Touch Alumni Stories Alumni Lectures and Events Alumni Association Contact Diversity About Us Initiatives Recruitment Explore Hopkins Resources Fellowships Hopkins Engineering PROPEL PFTL: Passport to Future Technology Leadership Utility Navigation Apply Request Information Give ﻿ Secondary Navigation About Engineering Departments Faculty Directory News Events JHU Engineering Magazine Close ﻿"
}