{
  "id": 5,
  "date": "2024-05-18T18:23:03.708746",
  "url": "https://www.cs.jhu.edu/academic-programs/graduate-studies/mse-programs/mse-faqs/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Graduate Studies Master of Science in Engineering in Computer Science (MSE) MSE Admissions FAQ MSE Admissions FAQ Frequently asked questions for prospective MSE graduate students. Play background animation Pause background animation Application Materials Can I submit copies of transcripts? You will be required to upload a copy of your transcript into your admissions portal, but an official transcript will be requested if you are admitted to the program. When it is received, you will be enrolled. What is the application fee? A $75 fee is typically required alongside your application, but we do offer waivers. If you are a first-generation college student, have participated in a program such as NNE or SACNAS ( among many others ), or are unable to apply because of the fee, please contact us at admissions@cs.jhu.edu . How many letters of recommendation do I need? The MSE application requires two letters of recommendation. Your recommenders will submit their recommendations via the online application. Can my letters of recommendation come from contacts outside of academia? If you have worked for several years, it is expected that some of your recommendations will come from non-academic sources. What should be avoided is having mostly non-academic recommendations when your last several years have been in academia, and vice versa. Can I have recommenders send letters by fax or email? We require the use of the online application recommendation section for recommenders’ submissions. Choosing this option in the application will trigger an email to your recommender with explicit instructions on how to submit their recommendation. Do you require that your official form be used for letters of recommendation? The official form is a part of the online recommendation. Comments will be accepted even if the official form is not used. However, we strongly encourage the form to be used because it includes a table that provides us with additional information. ETS, GRE, and TOEFL Exams What are the institution/department codes for the GRE and TOEFL exams? Our institution code is (4655) for the GRE and (C559) for the TOEFL exam. Our department code is (0402) for the GRE and (78) for the TOEFL exam. How do I find out where I can take the GRE exam? The Graduate Record Examination (GRE) is the world’s most widely used admissions test for graduate and professional schools. Visit the Education Testing Service (ETS) website to view current updates for testing available in your country. What are the departmental requirements for the GRE exams? The Whiting School of Engineering requires GRE General Test scores for applications to all master’s programs. However, the Department of Computer Science does not review the scores nor do they have any impact on the outcome of its decision during the application review process. UPDATE: Effective for the Fall 2024 term only applicants to the MSE CS program are not required to submit GRE scores. It is an optional material to submit with your application. What are the departmental requirements for the TOEFL/TWE exams? All non-native English speakers must take either the TOEFL or IELTS exam. Neither the TWE nor the TSE is required, but it is recommended. Requirements: TOEFL: 100 or above IELTS: 7 or above Do you accept the IELTS test? The Department of Computer Science does accept IELTS. Can I submit copies of GRE or TOEFL score reports with my application and avoid the fees ETS charges? Copies will be accepted, although it is best to have your GRE scores sent through ETS . Applicants should request recent GRE scores from ETS and submit them to Johns Hopkins University before the application deadline. In order for your application to be reviewed, you must include the university’s institution code in your request to ETS . The Johns Hopkins University Whiting School of Engineering’s institution code is 4655. TOEFL results should be sent directly to the Engineering Graduate Admissions Office by either the IELTS Global Recognition System or ETS, which also administers TOEFL. If admitted, you will be required to submit your official final documents directly to the WSE Graduate Admissions Office. How long ago can I have taken the GRE or TOEFL for the scores to still be acceptable? The scores must be new enough that ETS still considers them valid and will provide an official score report. Currently, the ETS sets this limit at five years. TOEFL exam scores are valid for two years from your test date. Is there a minimum score required on the TOEFL or IELTS exam in order to apply for the MSE program? The minimum scores are as follows: TOEFL: 100 or above IELTS: 7 or above Getting Accepted What do you look for in letters of recommendation? First, we consider the source of the letter. A letter from your cousin who happens to teach at a two-year college is weighed significantly less than a letter from a researcher at a top computer science school! Next, we look for evidence of research potential. In particular, evidence of outstanding performance in past projects is of high importance. Somewhat less important is evidence of outstanding ability in the classroom. A good recommender should know you well and be able to rank you very favorably in comparison with your peers. Do you look at my transcripts? Yes, we do. Both your grades and courses are important—primarily your grades in CS courses during your last two years of undergraduate study. How do you weigh other experience, such as research, projects, or employment? Previous research experience is the easiest way to be placed on the top of the applicant interest list. For this reason, we encourage you to send a link to detailed information on your past research experience, if applicable. Projects performed for classes, as part of a job, or on your own are also important, particularly if the projects are research-related. Make sure to include a description of these projects with your application—better yet, link to an online file. Previous teaching experience also improves your chances. What role does the statement of purpose play? Statements of purpose are very important, as they allow us to better form a picture of each applicant and convince us that you have the attitude needed to succeed in a graduate program. The Graduate Affairs and Admissions Office does not accept paper copies of statements of purpose as applicants are expected to submit this document through the online application. The uploaded file cannot exceed 500KB in size. The document must also adhere to 1-inch margins. With regards to a Sample of Work (if your department requires this or its applicants have a habit of submitting it anyway), the online application can only accept samples of work up to 500KB in size. The document must also adhere to 1-inch margins. Please do not send duplicates of documents that were successfully uploaded to the online system. Can I include extra information with my application? We encourage you to include any information that you think will help us make a more accurate assessment of your abilities. However, it is generally better to give short abstracts of papers or projects (links to online versions are even better) rather than full papers or reports. What financial aid will I receive if admitted to the MSE program? The department regrets that we are unable to give financial aid to MSE students. Once you are here, you can apply for part-time student work as a course assistant or for other types of work; however, we cannot grant tuition waivers for this work. MSE students are never given a stipend of any form, but may be hired on an hourly basis. What is the application fee? A $75 fee is typically required alongside your application. If I am admitted only to the MSE program but wish to get a PhD, what can I do? If you satisfy all the qualifying requirements for the PhD program and a professor wishes to serve as your PhD thesis advisor and secure financial support for your research, you can become a PhD candidate. You will still have to apply for admission into the program and be approved by the Admissions Committee and the Department Chair. Do you accept students from other disciplines? Entering students are expected to have completed a program of study equivalent to that required by the BS in computer science. Applicants from other disciplines are required to have coursework (or equivalent experience) in intermediate programming (C++ and Java), data structures, automata theory, computer systems fundamentals, and algorithms. I work full-time in the Baltimore area. How can I get a master’s degree through Hopkins? Full-time working professionals should apply to JHU’s Engineering for Professionals program. This is a completely separate program from the day school and offers a large number of computer science courses online, in the evening, and during the summer at several locations in the Baltimore-Washington area that lead to an MS degree or post-master’s certificate. No PhD degrees are offered online. For more information, and visit Engineering for Professionals website or email jhep@jhu.edu . Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}