{
  "id": 5,
  "date": "2024-05-18T18:23:01.392221",
  "url": "https://accessibility.jhu.edu/",
  "university_name": "Johns Hopkins University",
  "title": "Digital Accessibility at JHU",
  "content": "Digital Accessibility Search Contact Menu Getting Started Techniques Training Events FAQ Procurement . Sub menu is available. Go to the button next to this link to open sub menu. Open menu Close menu Vendors of Accessibility Services Accommodations Initiatives Tools Search Contact Digital Accessibility at JHU Digital Accessibility Site Summary This site contains information on training, resources and details on digital accessibility designed to assist JHU faculty and staff in making their digital materials accessible to all.  Digital accessibility means that websites, web applications and digital content are usable and readable by the widest range of users, including those with disabilities.  At Johns Hopkins University, we use the WCAG (Web Content Accessibility Guidelines) 2.1 standard at Level AA. Learn More JHU Commitment to Accessibility Johns Hopkins University is committed to providing equal access to websites, web-based content, and other electronic and information technology (EIT) for people with disabilities in accordance with applicable laws, including Section 504 of the Rehabilitation Act of 1973 and the Americans with Disabilities Act as amended.  As Johns Hopkins University works to foster diversity and build a campus culture of inclusion, it is committed to ensuring people with disabilities enjoy full participation in the university’s programs, services, and benefits. Johns Hopkins seeks the continuous improvement of accessibility on its campuses and in its activities, and prohibits unlawful discrimination on the basis of disability. Learn More Report an Accessibility Barrier If you are having difficulty accessing a university website, or content located on a university website (video, document, etc.), please use our Contact Page to report it. Learn More Learn More IT@ Johns Hopkins 5801 Smith Avenue Davis Building, Suite 110A Baltimore MD 21209 [email protected] Copyright @ 2024 The Johns Hopkins University. All rights reserved."
}