{
  "id": 5,
  "date": "2024-05-18T18:22:58.684575",
  "url": "https://www.cs.jhu.edu/academic-programs/graduate-studies/ms-in-security-informatics/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home Academic Programs Graduate Studies Master of Science in Security Informatics (MSSI) Master of Science in Security Informatics (MSSI) The full-time MSSI program is an immersive, three-semester program providing educational, research, and professional opportunities that are simply unparalleled in this rapidly expanding field. In This Section ﻿ Close ﻿ Master of Science in Security Informatics (MSSI) Navigation Admissions Program Requirements Faculty and Lecturers Course Distribution Dual Degree Opportunities Scholarships Play background animation Pause background animation The flagship educational experience offered by the Johns Hopkins University in the area of information security and assurance is represented by the Master of Science in Security Informatics (MSSI) degree. While being mentored by recognized leaders in the field, you will combine applied disciplines—including computer science, computer engineering, information technology, and management and policy—while you benefit from our proximity to Washington, D.C. and our deep connections with federal agencies, key R&D institutions, and diverse industrial sectors. We offer core courses in the most current topics in information security, such as Security and Privacy in Computing, Modern Cryptography, Computer Forensics, Software Vulnerability Analysis, Computer Intrusion Detection, Cloud Computing Security, Rights in the Digital Age, and Financial Issues in Managing a Secure Operation. In addition to our core course requirements, students have the opportunity to pursue one of two tracks of study : Technology & Research or Policy & Management. We offer unparalleled dual degree and joint program opportunities in computer science, applied mathematics, health science, and national security. Supported by the research and educational programs at Johns Hopkins’ renowned School of Medicine , we are the nation’s first information security program to focus on healthcare information security. We offer many opportunities for paid research, teaching, and work experience on our campuses and qualified students may benefit from unique scholarship opportunities , including the National Science Foundation CyberCorps®: Scholarship for Service and the Department of Defense Cyber Scholarship Program. Our technology and recruitment seminar series provides direct access to technical and business leaders in the field and to the latest trends and challenges in the rapidly changing sector of information security. Schedule a time to talk with one of our faculty members directly by sending an email to JHUISI-MSSI@jhu.edu . About the MSSI Program Everything you need to know about the Master of Science in Security Informatics (MSSI) program at Johns Hopkins University. MSSI Admissions Program Requirements Faculty and Lecturers MSSI Course Distribution Dual Degree Opportunities Scholarships News National Science Foundation CyberCorps®: Scholarship for Service Program CyberCorps®: Scholarship For Service (SFS) is a unique, fully-funded scholarship program designed to increase and strengthen the cadre of federal information assurance professionals that protect the government’s critical information infrastructure. This program provides scholarships that may fully fund the typical costs incurred by full-time students, including tuition and education-related fees; participating graduate students currently receive additional annual stipends of $34,000. After graduation, participants must fulfill a government service obligation for a period equivalent to the length of their scholarship (up to two years, odd-semester programs are rounded up). Scholarships are funded through grants awarded by the National Science Foundation. Learn More Looking for part-time and online programs? Consistently rated as one of the best online master’s degrees in cybersecurity, the Johns Hopkins Engineering for Professionals cybersecurity program combines knowledge from instructors who are working to fight cybersecurity threats on the front lines with relevant courses designed to put you ahead. Johns Hopkins Engineering for Professionals Cybersecurity Program Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}