{
  "id": 5,
  "date": "2024-05-18T18:22:55.540209",
  "url": "https://engineering.jhu.edu/admissions/graduate-admissions/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation About Engineering Departments Faculty Directory News Events JHU Engineering Magazine Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation Current Students Faculty & Staff Media Partners Faculty & PostDoc Careers ﻿ Staff Careers ﻿ Johns Hopkins University, Whiting School of Engineering Utility Navigation Apply Request Information Give ﻿ Site Navigation Vision ﻿ Education Doctor of Engineering ABET Accreditation Academic Departments Find Your Degree Undergraduate Studies Graduate Studies Combined Degrees Lifelong Learning Student Entrepreneurs Academic Catalogue Corporate Engagement Research Centers & Institutes Office of Research and Translation Corporate Engagement ASPIRE Postdoctoral Training Program SPUR@APL Undergraduate Research Global Initiatives Resources, Policies & Forms Major Faculty Awards and Honors Translation Pava Marie LaPere Center for Entrepreneurship Johns Hopkins Technology Ventures Corporate Engagement Cohen Translational Engineering Fund STEM Outreach Johns Hopkins Technology Innovation Center Admissions Undergraduate Admissions Graduate Admissions Visit Us Contact Us Student Life Undergraduate Student Affairs Graduate/LLL Student Affairs Career Services: Life Design Lab Living in Baltimore Beyond the Classroom Engineering Student Groups Opportunities Abroad Student Initiatives Fund University Policies Alumni Get Involved Ways to Give Named Professorships Keep in Touch Alumni Stories Alumni Lectures and Events Alumni Association Contact Diversity About Us Initiatives Recruitment Explore Hopkins Resources Fellowships Hopkins Engineering PROPEL PFTL: Passport to Future Technology Leadership Search ﻿ Info For ﻿ Close ﻿ Info For Navigation Current Students Faculty & Staff Media Partners Faculty & PostDoc Careers ﻿ Staff Careers ﻿ You are here: Home Admissions Graduate Admissions Graduate Admissions Johns Hopkins Engineering offers a tradition of excellence in teaching, expansive academic offerings, and access to the resources and expertise of the nation’s leading research university. In This Section ﻿ Close ﻿ Graduate Admissions Navigation HEEP - Hopkins Engineering Exploratory Program 2023 Full-Time Programs Part-Time and Online Programs Cost of Attendance Information Sessions Admission & Privacy Policy Play background animation Pause background animation Our commitment to discovery and to making a difference in the world defines our graduate programs. A graduate degree from Hopkins Engineering prepares you for professional success no matter what career you choose—from launching your own startup to leadership in industry, academia, or the public sector. Find the Program That's Right for You Master’s and PhD Programs: Full-Time, Residential Our full-time degree options include master’s and doctoral programs in each of our academic departments, as well as professional master’s programs in areas including information security, financial mathematics, engineering management, and human language technology. Explore Full-Time Master’s and PhD Programs Learn How to Apply to Full-Time Graduate Engineering Programs Master’s and Certificate Programs: Part-Time and Online With more than 20 degree and certificate offerings, our Engineering for Professionals programs are taught by practicing engineers, whose teaching is informed by their expertise and knowledge of their fields’ most current practices and applications. Explore Part-Time and Online Programs Learn How to Apply to Part-Time and Online Graduate Engineering Programs Doctor of Engineering Program The DEng program provides professional engineers with the advanced technical expertise they need to succeed in industry and the public sector, and emphasizes creative problem solving and the innovative application of technical knowledge. Explore the Program Learn How to Apply to the Doctor of Engineering program Funding Your Graduate Education Learn more about fellowships, grants, financial aid, and other support for your graduate education. Full-Time Graduate Fellowships & Grants Financial Aid: Full-Time Graduate Programs Financial Aid: Part-Time and Online Graduate Programs Vivien Thomas Scholars Initiative The Vivien Thomas Scholars Initiative (VTSI) is an endowed fellowship program at Johns Hopkins for PhD students in STEM fields. It provides full tuition, stipend, and benefits while also providing targeted mentoring, networking, community, and professional development opportunities. Students who have attended a historically black college and university (HBCU) or other minority serving institution (MSI) for undergraduate study are eligible to apply. Learn more about the Vivien Thomas Scholars Initiative “ If you are interested in the medical robotics field, I would say that Hopkins can’t be beat. ” Jeremy Brown John C. Malone Assistant Professor, Mechanical Engineering Stay Connected OneHop Facebook Twitter Instagram YouTube LinkedIn Open site alert Johns Hopkins University, Whiting School of Engineering Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Footer Navigation Apply ABET Accreditation Johns Hopkins University ﻿ Engineering for Professionals ﻿ Visit ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Search Submit Site Navigation Vision ﻿ Education Doctor of Engineering ABET Accreditation Academic Departments Find Your Degree Undergraduate Studies Graduate Studies Combined Degrees Lifelong Learning Student Entrepreneurs Academic Catalogue Corporate Engagement Research Centers & Institutes Office of Research and Translation Corporate Engagement ASPIRE Postdoctoral Training Program SPUR@APL Undergraduate Research Global Initiatives Resources, Policies & Forms Major Faculty Awards and Honors Translation Pava Marie LaPere Center for Entrepreneurship Johns Hopkins Technology Ventures Corporate Engagement Cohen Translational Engineering Fund STEM Outreach Johns Hopkins Technology Innovation Center Admissions Undergraduate Admissions Graduate Admissions Visit Us Contact Us Student Life Undergraduate Student Affairs Graduate/LLL Student Affairs Career Services: Life Design Lab Living in Baltimore Beyond the Classroom Engineering Student Groups Opportunities Abroad Student Initiatives Fund University Policies Alumni Get Involved Ways to Give Named Professorships Keep in Touch Alumni Stories Alumni Lectures and Events Alumni Association Contact Diversity About Us Initiatives Recruitment Explore Hopkins Resources Fellowships Hopkins Engineering PROPEL PFTL: Passport to Future Technology Leadership Utility Navigation Apply Request Information Give ﻿ Secondary Navigation About Engineering Departments Faculty Directory News Events JHU Engineering Magazine Close ﻿"
}