{
  "id": 5,
  "date": "2024-05-18T18:06:28.129851",
  "url": "https://www.cs.jhu.edu/it-support/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home CS IT Support CS IT Support Play background animation Pause background animation New to CS?  Please check out our Onboarding document at: https://support.cs.jhu.edu/wiki/Onboarding Have a question regarding CS IT services? Check our CS IT Support Wiki online documentation. If you still have questions or need to submit an IT support request, please email support@cs.jhu.edu . We are available 8:30 a.m. to 5 p.m. Monday through Friday. Please note that the Computer Science Department’s IT Support Group is not the computer support group for the JHU campus at large. If you are in need of technical services outside of the CS Department, please contact JHU’s IT Services group (also reachable by phone at 410-516-HELP) or contact Whiting School of Engineering’s IT Services group . CS IT Staff Steve Rifkin Manager, IT Services Malone G55 410-516-6281 steve410@cs.jhu.edu support@cs.jhu.edu (for CS computer-related issues) support.cs.jhu.edu (CS IT Support Wiki) Steve DeBlasio LAN Systems Specialist Assistant Systems Administrator Malone G37 (G61A from 12:30 p.m. to 2:30 p.m.) 410-516-6259 steve@cs.jhu.edu support@cs.jhu.edu (for CS computer-related issues) support.cs.jhu.edu (CS IT Support Wiki) Piper Gold Sr. Systems Engineer Malone G37 410-516-5249 pip@cs.jhu.edu support@cs.jhu.edu (for CS computer-related issues) support.cs.jhu.edu (CS IT Support Wiki) PGP Key ID: D7EAF92B PGP Key Fingerprint: 6A69 98CB ABF2 84FB C75E B767 A745 8F09 D7EA F92B Christopher Venghaus Sr. Systems Engineer, JHU Information Security Institute Malone 358 410-516-4898 cvenghaus@jhu.edu (for JHUISI computer-related issues) support@cs.jhu.edu (for CS computer-related issues) Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}