{
  "id": 5,
  "date": "2024-05-18T18:23:45.584453",
  "url": "https://www.cs.jhu.edu/about/diversity-and-inclusion/",
  "university_name": "Johns Hopkins University",
  "title": "Secondary Navigation",
  "content": "Skip to main content Skip to site alert Secondary Navigation CS IT Support Menu ﻿ Close ﻿ Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ Department of Computer Science Department of Computer Science Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Search ﻿ Info For ﻿ Close ﻿ Info For Navigation CS IT Support Resources for Undergrads Resources for Graduate Students Employers ﻿ You are here: Home About Diversity and Inclusion Diversity and Inclusion Play background animation Pause background animation We believe that a diverse and inclusive community is critical to the success of our educational and research missions. A diverse department is necessary for making our educational programs accessible to a wide range of students, bringing multiple perspectives to our research program, and creating a supportive and welcoming culture that is critical to student success. Awareness of the need for diversity and inclusion is especially critical in computer science, a discipline with a long track record of underrepresenting women and minorities. Diversity initiatives at Johns Hopkins University and the Whiting School of Engineering: Diversity at JHU Johns Hopkins University’s Roadmap on Diversity and Inclusion Diversity and Inclusion at the Whiting School of Engineering Homewood Council on Inclusive Excellence Faculty Diversity Initiatives Funding Opportunity: Vivien Thomas PhD Scholars The Vivien Thomas Scholars Initiative is dedicated to nurturing, mentoring, and connecting the exceptional diverse talent that exists at historically black colleges and universities and other minority serving institutions to STEM graduate education and future leadership in STEM careers. Interested students must apply directly to their desired PhD program and submit a supplemental application for the scholarship. Please note the December 1 deadline for scholarship applications. Learn more about the Vivien Thomas Scholars Initiative Diversity- and inclusion-related organizations The Department of Computer Science and the Whiting School of Engineering have a variety of organizations related to diversity and supporting the success of women and underrepresented minorities. Graduate Association of Women in Computer Science and Engineering Graduate Queer/Straight Alliance National Society of Black Engineers, JHU chapter Society of Hispanic Professional Engineers, JHU chapter Women Faculty Forum at Homewood Women in Computer Science (undergraduate students) Women of Whiting (grad students and postdocs) Funding Opportunity: Google’s Award for Inclusion Research Program Google’s Award for Inclusion Research Program is an ongoing effort to support innovative research and professors working to create positive societal impact in the areas of accessibility, algorithmic fairness, higher education and collaboration, and participatory ML. Learn more about the Award for Inclusion Research Program Engineering Outreach Programs WSE’s Center for Educational Outreach provides: STEM curricular support to Baltimore City schools, including a partnership with Barclay Elementary/Middle School, Engineering Innovation Pre-College Programs , and college-level STEM educational programs for students from across the country aimed at increasing representation of women and minorities in STEM education and careers. The Whiting Internships in Science & Engineering (WISE) Program, which provides hands-on research opportunities in WSE faculty labs and mentorship for students in Baltimore City schools. Department of Computer Science Outreach The department participates in North American Computational Linguistics Olympiad (NACLO), a competition for students in grades 6–12 that introduces them to challenges in the field of computational linguistics. Students and faculty attend diversity-focused computing conferences, including the Grace Hopper Celebration of Women in Computing and the CMD-IT/ACM Richard Tapia Celebration of Diversity in Computing . Graduate Admissions Diversity Initiatives We are committed to creating greater diversity in our doctoral programs and have adopted an admissions process that seeks the most talented students with the highest potential for research success and that emphasizes achievement relative to available opportunity. We waive GRE requirements for students who are unable to take the GRE and have low application fees, which can also be waived for first-generation college students or participants in programs such as NNE or SACNAS. We offer EHOP (Explore Hopkins Program) each fall, a program that brings prospective doctoral students from underrepresented backgrounds to campus for an intimate opportunity to learn more about our programs. Diversity Committee In fall 2020, the Department of Computer Science launched its first Diversity and Inclusion Committee. The committee embodies two principles: it is representative—members are drawn from all constituencies, including undergraduate students, graduate students, staff, and faculty—and it has independent authority to execute its policy and oversight mission. The mission of the Diversity and Inclusion Committee is to guide the Department to develop and implement research-grounded initiatives that will ensure a safe space for all in our community, to foster inclusivity, and to ensure that we succeed as individuals and together. The committee will review the implementation of diversity and inclusion in all department functions and report to the faculty on the successes and shortcomings of the implementation in an action plan. To contact the committee, email diversityandinclusion@cs.jhu.edu . To submit anonymous feedback on your experience in the department, use this form . Racial diversity surged at Johns Hopkins in the last decade. Will it last? - The university dropped “legacy” preferences for children of alumni while boosting financial aid and outreach . (Image Credit: Bill O’Leary/The Washington Post) $1.8 billion Bloomberg gift eliminates undergraduate student loans - A historic $1.8 billion gift from Hopkins Engineering alum Michael Bloomberg in support of undergraduate financial aid makes a Hopkins education within reach for qualified students, regardless of their financial means. Hopkins engineer joins call to fund Black scientists - JHU Engineering’s Muyinatu Bell, who has a secondary appointment in the Department of Computer Science, co-authored a commentary with women colleagues from institutions across the U.S. to shine light on funding disparities . Stay Connected Facebook Twitter Instagram YouTube LinkedIn Open site alert Department of Computer Science Address 3400 North Charles Street Baltimore , MD 21218 Get Directions Contact Email: contactus@cs.jhu.edu Footer Navigation Apply Now! ﻿ Whiting School of Engineering ﻿ Johns Hopkins University ﻿ Legal Navigation Privacy Statement ﻿ Accessibility ﻿ University Policies ﻿ Copyright Compliance Policy ﻿ 2024 Johns Hopkins University . All rights reserved. Site Menu Site Navigation About Message from the Department Head Diversity and Inclusion Employment Opportunities Academic Programs Accreditation & Enrollment Undergraduate Studies Graduate Studies Combined Bachelor’s/Master’s Academic Integrity Code Research Theory & Programming Languages Systems & Networking Computational Biology & Medicine Information Security Natural Language Processing Machine Learning, AI, & Data Science Robotics, Vision, & Graphics Human-Computer Interaction Computer-Assisted Medicine People Faculty Joint, Affiliate, & Research Faculty Staff PhD Students External Advisory Board News CS Newsletter Events Department Seminars Join our Seminar Listserv CS Distinguished Lecture Series Alumni & Giving Utility Navigation Request Info ﻿ Apply ﻿ Give ﻿ Secondary Navigation CS IT Support Close ﻿"
}