{
  "id": 7,
  "date": "2024-05-18T18:17:23.329212",
  "url": "https://rochester.edu/admissions/",
  "university_name": "University of Rochester",
  "title": "Admissions at Rochester",
  "content": "Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Admissions at Rochester Apply to the University of Rochester We seek and embrace the most tenacious and unconventional\n                applicants from around the world to join our community of doers\n                and disrupters. 7 SCHOOLS See why weâre unique 77% UNDERGRADUATES Engage in student research 200+ ACADEMIC PROGRAMS Find majors and minors Admissions: How to apply Below, you will find details about the University of Rochester\n              admissions process. This includes how to apply to each of our\n              schools, tuition and financial aid information, and advice on the college application process. Arts, Sciences & Engineering (AS&E) Home of the School of Arts & Sciences and the Hajim School of Engineering & Applied Sciences , AS&E is the largest academic division at Rochester with\n                several highly ranked programs, including physics, political\n                science, economics, and engineering. Undergraduate admissions (first-year students, transfer students, DACA/Dreamers, etc.) Graduate education and postdoctoral affairs (each program or department has its own admissions\n                  requirements) Continuing studies (part-time students) Financial aid and scholarships Tuition and fees Contact admissions Eastman School of Music The Eastman School of Music is among the worldâs leaders in musical composition,\n                performance, and education. Admissions overview Undergraduate admissions Graduate admissions Financial aid Tuition and fees (undergraduate) Tuition and fees (graduate) Contact admissions School of Medicine and Dentistry Housed in one of the nationâs leading academic medical centers,\n                the School of Medicine and Dentistry offers programs in medical and graduate education,\n                residency/fellowships, and postdoctoral positions. Admissions (MD) Admissions (graduate) Financial aid Tuition and fees (MD) Tuition and fees (graduate) Contact admissions (MD) Contact admissions (graduate) School of Nursing The School of Nursing has undergraduate, graduate, and certificate programs that meet\n                the needs of a broad spectrum of nursing and health care\n                professionals. Admissions and aid Tuition and fees Contact admissions Eastman Institute for Oral Health Part of the Universityâs Medical Center, the Eastman Institute for Oral Health offers advanced postdoctoral dental education and residency\n                programs. Admissions and aid Tuition and fees Contact admissions: Email eiohadmissionsoffice@urmc.rochester.edu. Simon Business School The Simon Business School offers nationally recognized degree programs that go beyond\n                business as usual by embracing data analytics to drive\n                decision-making. Graduate admissions Tuition and financial aid (full-time MBA) Contact admissions Warner School of Education The Warner Schoolâs graduate degrees and advanced certificates in education and\n                human development help learners meet their professional goals\n                while making the organizations and people they serve ever\n                better. Graduate admissions International admissions Scholarships Tuition and fees Contact admissions Degree programs Our 200-plus programs of study run the gamut, from the\n                  traditional to the self-designed. In addition to bachelorâs,\n                  masterâs, and doctoral degrees, we offer several dual degrees\n                  and certificates. View our degree programs College application advice Check out these articles with tips and best practices for\n              preparing to apply to college, as well as the college application\n              process. How to write your best college application essay Advice for choosing high school electives Tips for high school juniors: Considering your options How to get into your dream school Need more information? THRIVE Explore campus life Students have many options for housing, dining, and recreation\n                  on and off campus. STUDY View our academic programs We have many degree and certificate options, including\n                  undergraduate and graduate programs. VISIT US Plan your visit Sign up for a tour of the University of Rochesterâs campuses.Â Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff"
}