{
  "id": 7,
  "date": "2024-05-18T18:17:21.879371",
  "url": "https://www.rochester.edu/diversity/eoc/nondiscrimination-statement/",
  "university_name": "University of Rochester",
  "title": "",
  "content": "Skip to content Search Office of Equity and Inclusion EXPLORE MORE Office of Equity and Inclusion Get Help University Resources Harassment and Discrimination Sexual Misconduct Affirmative Action Education and Training Faculty and Staff Students and Alumni Community Engagement Recognition and Celebrations Programming and Events 21-Day Equity Challenge 2024 Daily Challenges 2024 Speakers Annual Diversity Conference Celebrating Juneteenth Presidential Stronger As One Diversity Awards REAL Conversations Tana Grady-Weliky Lecture Series Quick Links Policies Reports Events Calendar Diversity Dashboards 2020 Celebration Contact us Office of Equity and Inclusion Get Help University Resources Harassment and Discrimination Sexual Misconduct Affirmative Action Education and Training Faculty and Staff Students and Alumni Community Engagement Recognition and Celebrations Programming and Events 21-Day Equity Challenge 2024 Daily Challenges 2024 Speakers Annual Diversity Conference Celebrating Juneteenth Presidential Stronger As One Diversity Awards REAL Conversations Tana Grady-Weliky Lecture Series Quick Links Policies Reports Events Calendar Diversity Dashboards 2020 Celebration Contact us Nondiscrimination Statement The University of Rochester prohibits and will not engage in discrimination and harassment on the basis of age, color, disability, domestic violence victim status, ethnicity, gender identity or expression, genetic information, marital status, familial status or an individual’s reproductive health decision making, military/veteran status, national origin, race (including hair style), religion/creed (including religious attire and facial hair), sex, sexual orientation, citizenship status, or any other status protected by law (anyone individually, a “Protected Class”). Discrimination or harassment (including hostile work environment harassment) based on protected status is illegal, will not be tolerated, and is considered misconduct that will be subject to discipline. The University is committed to fostering, cultivating, and preserving a culture of diversity, equity, and inclusion, a central tenet of our institutional vision and values . This commitment extends to policies and practices for admissions, recruitment, and employment in accordance with the principles of equal opportunity and Affirmative Action and in compliance with applicable law. The University complies with all federal and state laws that prohibit discrimination based on the protected categories listed above, including Title IX of the Education Amendments of 1972, which prohibits sex discrimination (including sexual harassment and violence based on sex) in the University’s educational programs and activities, and Section 504 of the Rehabilitation Act of 1973, which prohibits discrimination on the basis of disability. Inquiries concerning the application of Title IX and sex-based complaints should be referred to the University’s Title IX staff by emailing titleix@rochester.edu or contacting the Title IX Coordinator or a deputy coordinator ). Julia Green, associate vice president for civil rights compliance and Title IX coordinator, can be reached at julia.green@rochester.edu or by calling (585) 275-1654. Her office is located in 147A Wallis Hall on the River Campus. Questions about compliance with Section 504 can be addressed to the University’s Office of Disability Services and Support , by emailing disability@rochester.edu or contacting the Director of Disability Compliance . Questions regarding the application of Title IX and Section 504 can also be directed to the U.S. Department of Education’s Office of Civil Rights (OCR) at its New York office at (646) 428-3800 or its national headquarters at (800) 421-3481; TTY: (800)-877-8339, or www.ed.gov/ocr/ . Boundless Possibility Explore our 2030 Strategic Plan See maps and directions Rochester, NY 14627 Search rochester.edu Accessibility Nondiscrimination Copyright Emergency Information Vision & Values © University of Rochester 1996-2024 Search Office of Equity and Inclusion Search"
}