{
  "id": 7,
  "date": "2024-05-18T18:17:04.491708",
  "url": "https://rochester.edu/college/",
  "university_name": "University of Rochester",
  "title": "Site Navigation",
  "content": "Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff Arts, Sciences & Engineering Menu Site Navigation Close Home About Us Our Organization The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Meet the Deans Our Faculty Diversity Restorative Practices National Council Giving Contact Us Departments Academic Department Directory Research Centers Libraries Undergraduate Contact Rochester Curriculum Majors & Minors Degree Requirements Research Student Essentials Graduate Contact Admissions Academics Costs & Financial Support Graduate Calendar Registration Fellowships Postdocs Admissions Contact Undergraduate Summer Sessions Part-time Studies Graduate Financial Aid Offices Registrar Bursar Dean of Students Advising Services Learning Center Education Abroad View All Student Life Athletics Housing (ResLife) Dining Services Disability Resources Health Services Counseling Center View All Research Homepage Majors & Minors Search for a degree or related subjects in arts and humanities, engineering, natural sciences, or social sciences. Subject Search Graduate Studies Nationally recognized programs characterized by close contact between students and faculty. Learn More Research Embracing creativity, broadening our understanding of how the world works, and gaining insights into society. Learn More Making Their Mark The Class of 2024 As the University’s Commencement Weekend begins, we’re spotlighting the stories, accomplishments, and perspectives of some members of the Class of 2024 . View the Spotlights Campus Life Rochester students aim to ‘level the field’ for high schoolers applying to college A trio of undergraduates teamed up to bring accessible, high-quality education consulting services to the community. Now, they’re branching out beyond Rochester. More Campus Life News Rochester Curriculum Learn what you love At Rochester, you build your own curriculum with your own unique strengths and interests. There are no required subjects. You study only what you’re passionate about, choosing a major in one of the three divisions of learning and taking thematic three-course clusters in other areas. Learn More In the News More News Meliora University symbols and traditions The University’s symbols—including our motto, mascot, and official flower—have embodied the uniquely Rochester spirit of determination and perseverance. We also cherish our many long-held customs while embracing opportunities to build new traditions that unite us. Learn More Resources For: Current Students > International Students > Graduate Students > Parents > Alumni > AS&E Intranet Users > AS&E Staff > AS&E Faculty > 376 full-time faculty Through innovative research and dedication to professional excellence, our award-winning faculty is the foundation of our university, and our students’ successes. 77 percent of students Are involved in undergraduate research. Students can assist a faculty member on an existing research project, or create a project based on their own ideas. Culture of Respect At the University of Rochester, we are united by a commitment to be ever better—Meliora. It is our guiding principle and it informs our shared values. We put those values into action by ensuring that all members of our community feel safe, respected, included, and valued. In support of that mission, the University is taking a number of important steps to strengthen policies, clarify processes, and expand resources to support diversity, equity, and inclusion efforts. Learn More The College The School of Arts & Sciences The Hajim School of Engineering & Applied Sciences Need help or more information? Contact us . Report a Digital Accessibility Barrier Arts, Sciences & Engineering Location Deans' Office 317 Lattimore Hall University of Rochester P.O. Box 270401 Phone (585) 273-5000 Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996â2022"
}