{
  "id": 7,
  "date": "2024-05-18T18:16:55.091630",
  "url": "https://www.rochester.edu/emergency/",
  "university_name": "University of Rochester",
  "title": "To report an emergency:",
  "content": "Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Emergency Information To report an emergency: Pick up a Blue Light Emergency Phone; or Dial 13 from any other University phone; or From a cellphone or other non-University phone, dial (585) 275-3333; or Dial #413 from AT&T/Cingular or Verizon cell phones. Cancellations Call (585) 275-6111 for a recorded message on cancellations and special events. AlertUR The Universityâs emergency notification system allows for the mass dissemination of critical information via voice, text, and email to undergraduate students during a major emergency. Students, staff, and faculty across all University schools and divisions can input or edit your contact information in the AlertUR system. Text messages are delivered more quickly than voice messages. Adverse weather conditions It is the policy of the University of Rochester to remain in operation and to continue regular services and schedules regardless of adverse weather conditions, transportation or utility problems, or general emergency situations. Exceptions to the policy may be made on a case-by-case basis and can include decisions to reduce services and/or staff. More on winter weather procedures Be prepared: What should you do? Active shooter Medical emergency Severe weather Bomb threat Fire Hazardous materials Shelter-in-place Power failure Important numbers Public Safety Public Safety/Fire/Ambulance Emergency 911 (585) 275-3333 Administrative and Patrol Operations Staff (585) 275-3340 General Information (email) PublicSafety@rochester.edu Special Events (585) 275-3437 Lost/Found Property (585) 275-2552 University Health Service (Recorded message on phone for after-hours care) River Campus Office (585) 275-2662 Medical Center Office (585) 275-2662 Eastman School Office (585) 274-1230 Health Promotion Office (585) 273-5775 University Counseling Center (Recorded message on phone for after-hours care) (585) 275-3113 Employee Assistance Program (585) 475-0432 Environmental Health and Safety (585) 275-3241 Lifeline (Monroe Mobile Crises Team) (585) 275-5151 Sexual Assault Hotline (585) 275-RAPE (275-7273) Rochester Area Rape Crisis Service (585) 546-2777 Alternatives for Battered Women (585) 232-7353 Department of Psychiatry (Alcohol and Drug Dependency Program) (585) 275-3161 Office of the Dean of Students Arts, Sciences and Engineering (585) 275-4085 Medical School (585) 275-4537 Eastman School of Music (585) 274-1106 Simon School (585) 275-8163 School of Nursing (585) 276-4190 Warner School (585) 275-0880 Parking Services River Campus (585) 275-3983 Medical Center (585) 275-4524 Eastman School of Music (585) 274-1170 Medical Center Parking Garage (585) 273-4226 Facilities Customer Service Center (585) 273-4567 University Ombud Office (585) 275-5931 Sexual Harassment for River Campus/Eastman (585) 275-9125 Sexual Harassment for Medical Center (585) 275-4354 Racial Harassment (585) 275-2867 Security Advisory Committee Chair (585) 275-6649 Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff"
}