{
  "id": 7,
  "date": "2024-05-18T18:17:02.753628",
  "url": "https://www.rochester.edu/contact/",
  "university_name": "University of Rochester",
  "title": "Campus mailing addresses",
  "content": "Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Contact us Top resources for contacting the University of Rochester. Campus mailing addresses River Campus (mailing address) University of Rochester 500 Joseph C. Wilson Blvd. Rochester, NY 14627 Medical Center mailing address University of Rochester 601 Elmwood Avenue Rochester, NY 14642 Eastman School of Music mailing address 26 Gibbs St. Rochester, NY 14604 University operator (585) 275-2121 (within the University dial â0â) Emergency information To contact Public Safety : Dial 13 on any campus phone or call (585) 275-3333. How to report an emergency Adverse weather information Maps Search University Maps by campus, location, and keyword. You may also download printable maps. Directory Find contact information for students, faculty, and staff in the online directory . Admissions: How to apply Learn how to apply to our schools . Youâll also find information on tuition and expenses, and contact information for each admissions office. Employment opportunities Explore job opportunities and find top resources for current faculty and staff. Alumni relations Stay connected to the University. Share your feedback on our website Let us know how weâre doing. Send feedback and suggestions . Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff"
}