{
  "id": 7,
  "date": "2024-05-18T18:17:12.294772",
  "url": "https://www.hajim.rochester.edu/",
  "university_name": "University of Rochester",
  "title": "Site Navigation",
  "content": "Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff Hajim School of Engineering & Applied Sciences Menu Site Navigation Close Home About Us About the Hajim School Message from the Dean Departments History Alumni Faculty and Staff Awards Giving Contact Us Undergraduate Overview Programs Special Programs Experiential Learning Prospective Students Apply Graduate Overview Programs Research Apply Research Overview Research Centers Sponsor a Design Project Diversity News & Events Recent News Upcoming Events Commencement Newsletters Build a better world through engineering Majors and Minors From certificates to PhDs, explore the degree program offerings from one of the nation’s top engineering schools. Learn More Undergraduate Education We prepare students to thrive as problem solvers and act as good stewards of our future. Learn More Graduate Education Alongside award-winning faculty, our students use state-of-the-art technology to support their unique and self-driven research and education. Learn More Transformational research Across multiple departments and centers, Hajim faculty, students, and staff are developing technological innovations with the capacity to transform our world. Our strong ties and proximity to the University of Rochester Medical Center and the Laboratory for Laser Energetics make opportunities for interdisciplinary research boundless. Discover our research capabilities Experiential learning Active, experiential learning is at the heart of the Hajim School education. We believe the skills and knowledge you gain outside the classroom are as important as what you learn within it. With endless opportunities through research, study abroad programs, internships, and entrepreneurship, you can pursue your own unique and fulfilling path. Explore whatâs beyond the classroom Diversity, equity, and inclusion At the Hajim School of Engineering & Applied Sciences, we strive to ensure every individual is respected and valued for the contributions that they bring to our academic mission. Diversity, equity, and inclusion are central to our core values. Find out why you belong here Meliora Making the World Ever Better Engineering is key to solving some of our most difficult societal problems and to developing innovations that will transform society in the years to come. Our students share how the Hajim School is preparing them to change the world for the better. Watch on YouTube Hajim students  by the numbers Our undergraduate students are heavily involved in experiential learning opportunities that we feel lead to successful graduates. 92% Participate in a club or student organization 95% Complete at least one internship 96% Are either employed or continuing studies after graduation Letâs keep in touch Want more information about the Hajim School? Follow us on social media or contact us! Facebook YouTube Instagram Contact Us Report a Digital Accessibility Barrier Hajim School of Engineering & Applied Sciences Location University of Rochester 303-309 Lattimore Hall P.O. Box 270076 Rochester, NY 14627 Phone (585) 275-4151 Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996â2022"
}