{
  "id": 7,
  "date": "2024-05-18T18:17:10.074297",
  "url": "https://admissions.rochester.edu/applying/how-to-apply/",
  "university_name": "University of Rochester",
  "title": "Be a Yellowjacket",
  "content": "Skip to content Search Undergraduate Admissions Connect Apply Visit MyROC Connect Apply Visit MyROC Home Applying How to Apply First-Year Students Transfer Students International Students Dates & Deadlines Interviewing Testing Policies Veteran Resources Visit Campus Visits Virtual Visits Rochester in Your Area Contact Your Counselor ROCemmendations Admitted Students Research Rochester Academics & Research The Rochester Curriculum Majors and Minors Student Research Combined Degree Programs Research & Innovation Grants Academic Opportunities Campus Life Our Campus Student Groups University Facts City of Rochester Student Resources Financial Aid Pre-College Programs Admitted Students Close Search Undergraduate Admissions Search How to Apply Home Applying How to Apply Be a Yellowjacket We invite you—the curious, the capable, and the engaged—to apply to our diverse and talented community of doers and disrupters. Our promise to you is a holistic, integrated review of your unique academic ability, extracurricular engagement, and ethical character. We strive to admit students who’ll work to make each other, the University, and the world ever better. Rochester’s quest for Meliora As one of the world’s leading research universities, Rochester’s mission is to help our students and scholars learn, discover, heal, create, and make the world ever better . Embedded in that ideal are the values we share: equity, leadership, integrity, openness, respect, and accountability. What we look for in a Yellowjacket As a charter member of the Character Collaborative , we evaluate applicants within the unique context of their environment and their opportunities inside and outside of school. Highly trained admission professionals assess their academic achievement, extracurricular engagement, and ethical character, in order to admit a diverse group of students who will work to make each other, the University, and the world ever better in alignment with Rochester’s mission and values. Our holistic review process for undergraduate applicants includes, but intentionally goes beyond, numerical representations of academic performance, though we certainly expect strong performance in challenging academic coursework. We hope to understand much more about each applicant than simply their grades and standardized test scores. The students for whom Rochester is the best fit are driven by their intellectual curiosity and seek out opportunities for growth. Our admission criteria connect directly to our students’ undergraduate experiences and outcomes through the College Competencies , Rochester’s framework for students to tell their story and serve as leaders in our shared future. They were created to ensure Rochester students are prepared with the skills employers and society seek in 21st Century college graduates. Show us who you are We value the individuality of our students and the ways they have already, or intend to customize their educational experiences to explore broadly AND dig deeply into specific academic areas. As students prepare to apply or interview for admission, we encourage them to consider the following: What are you interested in? What makes you interesting? What are your values? How have you improved yourself and your community? How will you make the world better? Supplemental Essay Prompts for 2023-24 Application Cycle Both parts must be completed as part of the application process. Part 1 – 250 word limit The University of Rochester motto of Meliora – or “ever better” – deeply integrates critical core values into all that we do. These core values of equity, leadership, integrity, openness, respect and accountability define not only who we are, but also who we hope to become. Please use the space below to highlight a time, creative idea or research experience when you put into action one or more of these characteristics in order to make yourself, your community or the world ever better. Part 2 (choose 1) – 200 word limit American social reformer, abolitionist, writer and statesman Frederick Douglass said, “Some know the value of education by having it. I knew its value by not having it.” Explain ways in which your background, educational experience, and opportunities have directly influenced you and your ability to do good in the world. What specific moments of growth, lessons learned, and resilience in your life have prepared you to promote positive change for your community and the world? Dr. Donna Strickland, University of Rochester alum and 2018 Nobel Prize winner in Physics said, “There’s no point in me being anything other than me.” The University of Rochester encourages each student to embrace the intersectionality of their identity and create their own individual curricular path and experience. What qualities and experiences make you the best version of yourself? What unique elements of your background, perspectives, and experiences will you bring to our community? Susan B. Anthony, champion of abolition and women’s rights, once said “Organize, agitate, educate must be our war cry.” As you look to join our community of doers and disruptors, in what ways do you envision using both the curricular flexibility and co-curricular opportunities to invoke change for marginalized groups? How has your unique lived experience shaped you and prepared you to be a changemaker here? The University of Rochester benefactor, entrepreneur, photography pioneer and philanthropist George Eastman said, “What we do during our working hours determines what we have; what we do in our leisure hours determines what we are.” How have the ways you’ve spent your time enabled you to grow as a person? What challenges have helped define you and your role within your community(s)? First-year applicants Apply online for early or regular decision using either the Common Application or Coalition for College Application. Transfer applicants We accept transfer students for both the fall and spring semesters, with applications reviewed on a rolling basis. International applicants Not a US citizen or permanent resident? Apply as an international student, which may mean some additional steps. Check your application status Once you have submitted your application, use MyROC, our online undergraduate admissions portal, to monitor your application status, upload materials, see admissions decisions, get merit scholarship notifications, and more. Log in to MyROC Helpful links Dates & Deadlines Interviewing Testing Policies Veteran Resources Financial Aid Contact Us Connect with us to get to know us Follow On Facebook Follow on Facebook X/Twitter Follow on X/Twitter Instagram Follow on Instagram YouTube Follow on Youtube Return to the top of the page Boundless Possibility Explore our 2030 Strategic Plan See maps and directions Rochester, NY 14627 Search rochester.edu Contact Us Admissions Blog Join Our Mailing List Online Publications Accessibility Nondiscrimination Policy Copyright Emergency Information Vision & Values Local & National Partners Parents & Families Counselors Alumni Volunteers © University of Rochester 1996-2024"
}