{
  "id": 7,
  "date": "2024-05-18T18:17:16.101770",
  "url": "https://rochester.edu/visit/",
  "university_name": "University of Rochester",
  "title": "Visit the University of Rochester",
  "content": "Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Visit the University of Rochester Discover Rochester for yourself The University of Rochester is a special place to study, live,\n                work, and, of course, visit. 170 miles from Toronto 330 miles from New York City 390 miles from Boston Campus and virtual visits On-campus tour and visit opportunities have returned for\n                prospective students. In addition, virtual tour options are\n                still available. Learn about visiting options Campus Visits: Office of Admissions on River Campus Virtual Visits: Office of Admissions on River Campus Eastman School of Music Getting here Weâre closer to Toronto than New York City, so plan your\n                  travels accordingly. The Rochester metro area is easily\n                  navigable and our main campuses are a short drive or rideshare\n                  from the Greater Rochester International Airport, train\n                  station, or bus station. Find us on the map Our campuses Youâll find the Universityâs main campus, the River Campus, and\n              the Medical Center located about two miles south of downtown\n              Rochester. The Eastman School of Music and the Memorial Art\n              Gallery are pillars of the arts scene and festival circuit in the\n              cityâs East End and Neighborhood of the Arts. River Campus The 154-acre River Campusâthe Universityâs main academic campus\n                and the home of the River Campus Librariesâis located about two\n                miles south of downtown Rochester by a bend in the Genesee\n                River. MAILING ADDRESS 500 Joseph C. Wilson Boulevard Rochester, NY 14627 GPS/MAPS ADDRESS 252 Elmwood Avenue Rochester, NY River Campus Parking Medical Center A nucleus of medical research, education, and patient care, the\n                Medical Center includes the School of Medicine and Dentistry,\n                the School of Nursing, Strong Memorial Hospital, Golisano\n                Childrenâs Hospital (the areaâs only childrenâs hospital),\n                Wilmot Cancer Institute, and Eastman Institute for Oral Health. 601 Elmwood Avenue Rochester, NY 14624 Medical Center Parking Directions to Medical Center Locations Eastman School of Music The Eastman Schoolâs downtown campus anchors the cityâs cultural\n                district, known as the East End. Expect to find musiciansâand\n                music fansâof all stripes in and around this architectural gem\n                for classes, festivals, jam sessions, kaffeeklatsches, and more. 26 Gibbs Street Rochester, NY 14604 Eastman School Parking Memorial Art Gallery Memorial Art Gallery attracts nearly 300,000 visitors a year.\n                Known locally as âMAG,â the galleryâs permanent collection of\n                10,000-plus works spans 50 centuries of world art, from\n                antiquities to the avant-garde. 500 University Avenue Rochester, NY 14607 MAG Directions and Parking Laboratory for Laser Energetics (South Campus) The quest to unlock controlled nuclear fusion is happening right\n                here at the Laboratory for Laser Energetics, the largest\n                university-based US Department of Energy program in the nation.\n                Tours of the Laser Lab, as itâs colloquially known, are\n                available to the public. 250 East River Road Rochester, NY 14623 LLE Map and Tours Want to learn more before you visit? ADMISSIONS How to apply Find more information about how to apply to our graduate and\n                  undergraduate programs, and get details about financial aid\n                  and tuition. OUR CITY Discover our community Thereâs much to love about Rochester. Explore the city we call\n                  home. RESEARCH Explore our research Our students, faculty, and staff are at the forefront of\n                  cutting-edge work. Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff"
}