{
  "id": 7,
  "date": "2024-05-18T18:17:17.855552",
  "url": "https://www.rochester.edu/newscenter/",
  "university_name": "University of Rochester",
  "title": "Rochester News",
  "content": "Skip to content Search News Center University Marketing and Communications Menu Science & Technology Society & Culture Campus Life University News Arts For the media Contact Close Search News Center Search Rochester News Science & Technology Society & Culture Campus Life University News Arts New surface acoustic wave techniques could lead to surfing a quantum internet Researchers develop new methods to couple light to sound waves that glide on surfaces. Making waves Campus Life May 14, 2024 |\n\t\t\t\t\t11:42 am Students, alumni receive national merit-based awards for study, research, and teaching Undergraduates and alumni will travel the world as teachers, students, and researchers after receiving merit-based national awards during the 2023–24 academic year. Read more topics: awards, global engagement, Hajim School of Engineering and Applied Sciences, School of Arts and Sciences, Science & Technology May 10, 2024 |\n\t\t\t\t\t11:02 am Rochester and Albany launch new Center of Excellence in RNA research The joint venture between the University of Rochester and University at Albany will drive economic development through research and training. Read more topics: Center for RNA Biology, Department of Biology, Lynne Maquat, Medical Center, research funding, School of Arts and Sciences, School of Medicine and Dentistry, Society & Culture May 8, 2024 |\n\t\t\t\t\t08:35 pm NATO at 75—powerful and necessary, or costly and obsolete? Created as a counterweight to the Soviet Union and Eastern Bloc, the military alliance may be more important now than ever. Political scientist Randall Stones explains why. Read more topics: Department of Political Science, global engagement, Randall Stone, School of Arts and Sciences, The Arts May 8, 2024 |\n\t\t\t\t\t01:49 pm Musical documentary with Rochester roots gets a Pulitzer Prize nod Paper Pianos , a live-performance musical documentary written and co-created by the International Theatre Program’s Nigel Maister, tells the story of an Afghan musician and refugee Milad Yousufi. Read more topics: alumni, awards, Department of English, Eastman School of Music, Humanities Center, International Theatre Program, Nigel Maister, School of Arts and Sciences, Campus Life May 1, 2024 |\n\t\t\t\t\t07:56 am Rochester students aim to ‘level the field’ for high schoolers applying to college A trio of undergraduates teamed up to bring accessible, high-quality education consulting services to the community. Now, they’re branching out beyond Rochester. Read more topics: admissions, community engagement, Science & Technology May 2, 2024 |\n\t\t\t\t\t01:24 pm Did a magnetic field collapse trigger the emergence of animals? Evidence suggests a weak magnetic field millions of years ago may have fueled the proliferation of life. Read more topics: Department of Earth and Environmental Sciences, John Tarduno, research finding, School of Arts and Sciences, Campus Life May 3, 2024 |\n\t\t\t\t\t07:59 am Coursework: Engineering students put their skills to the test in design capstones Rochester students invent solutions for project sponsors ranging from major league sports teams to researchers in Costa Rica. Read more topics: Class of 2024, Department of Biomedical Engineering, Department of Mechanical Engineering, global engagement, Goergen Institute for Data Science, Hajim School of Engineering and Applied Sciences, School of Nursing, undergraduate research, Society & Culture April 25, 2024 |\n\t\t\t\t\t07:12 am That’s not Native American art. Or is it? A Rochester art historian on the proliferation of indigenous fakes and replicas—and the blurry line between appropriation and admiration. Read more topics: Department of Art and Art History, Graduate Program in Visual and Cultural Studies, Janet Berlo, research finding, School of Arts and Sciences, In Photos April 30, 2024 |\n\t\t\t\t\t12:56 pm April 2024 in Photos From totality to Springfest and everything in between, here’s how we spent April at the University of Rochester. Read more topics: Eastman School of Music, events, Hajim School of Engineering and Applied Sciences, River Campus Libraries, School of Arts and Sciences, sustainability, University news University News May 17, 2024 |\n\t\t\t\t\t09:49 pm University community celebrates the remarkable Class of 2024 On May 17, the University conferred academic degrees to more than 3,500 undergraduate and graduate students at the 174th Commencement ceremony. Read more topics: alumni, Class of 2024, commencement, events, University News April 30, 2024 |\n\t\t\t\t\t08:31 am Awards and honors highlight accomplishments of Rochester’s faculty University of Rochester faculty regularly earn accolades for their contributions to research, scholarship, education, and community engagement. Read more topics: awards, Eastman School of Music, faculty, global engagement, Hajim School of Engineering and Applied Sciences, Laboratory for Laser Energetics, Medical Center, School of Arts and Sciences, School of Nursing, University News April 21, 2024 |\n\t\t\t\t\t08:11 pm Kate Sheeran named Eastman School of Music Dean Sheeran, who is a graduate of Eastman, will be the school’s eighth dean and the first woman to hold the role. Read more topics: alumni, appointments, Eastman School of Music, staff, Return to the top of the page Boundless Possibility Explore our 2030 Strategic Plan See maps and directions Rochester, NY 14627 Search rochester.edu Accessibility Nondiscrimination Copyright Emergency Information Vision & Values © University of Rochester 1996-2024"
}