{
  "id": 7,
  "date": "2024-05-18T18:16:57.343362",
  "url": "https://rochester.edu/college/webcomm/",
  "university_name": "University of Rochester",
  "title": "Site Navigation",
  "content": "Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff Arts, Sciences & Engineering Web Communications Menu Site Navigation Close Home People Recommendations Overview Website Elements Content Strategies Web Accessibility Best Practices Web Style Guide How to Submit Edits Article Series Service Request Homepage What information are your site's visitors seeking? Content Strategies What do you want people to do on your site? Content Strategies Who is the most important audience for your site? Content Strategies Web Services We provide web services free of charge for AS&E academic departments, administrative units, and research centers. Learn More Content Development Our team is available to assist you with all of your web content development needs. Learn More Trends and Technologies We provide expert direction and guidance concerning web trends and technologies. Learn More About Us Who We Are As part of AS&E's Deans' Office, the web communications team provides strategic planning for and implementation of AS&E's web presence. We view AS&E's web presence as an evolving, strategic communications program—not simply a series of individual websites. By placing a priority on knowing our business, knowing our users, and effectively leveraging the web as a medium, we can meet user's needs in a way that also achieves AS&E's strategic goals. Our services include: Web strategy consultation and process analysis Web content strategy, including content development and content audits Content editing, coordination, and writing Information architecture Mobile-friendly website design and development Web application development Traffic analysis and user testing Web Content Management System development Training on web-writing best practices Support for approved CMS tools Need help with your website? Please use our service request form or email aseweb@rochester.edu . Report a Digital Accessibility Barrier Web Communications Location University of Rochester Deans' Office Rochester, NY 14627 Email aseweb@rochester.edu Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996â2022"
}