{
  "id": 7,
  "date": "2024-05-18T18:17:58.155481",
  "url": "https://www.rochester.edu/advancement/",
  "university_name": "University of Rochester",
  "title": "Supporting families with palliative care",
  "content": "University of Rochester For Alumni Give How to give What to support Programs Contact Make a Gift For Alumni Give How to give What to support Programs Contact Make a Gift Search: Congratulations, Class of 2024! Learn more about this year’s Commencement activities, May 17–19 Congratulations, Class of 2024! Learn more about this year’s Commencement activities, May 17–19 Supporting families with palliative care The Cummins family turned to Highland Hospital’s palliative care team for support as they navigated difficult medical decisions for two important family members. With donor support, Highland plans to expand its palliative care unit to offer dedicated space to help families during life’s most challenging moments. Supporting families with palliative care The Cummins family turned to Highland Hospital’s palliative care team for support as they navigated difficult medical decisions for two important family members. With donor support, Highland plans to expand its palliative care unit to offer dedicated space to help families during life’s most challenging moments. Featured stories Show us your town Tokyo entrepreneur Yohay Wakabayashi ’10, ’11S (MS) shares some of his favorite things to do in one of the world’s top destinations for culture and cuisine. Navigating the first-gen experience The First-Generation Network connects students with alumni who have walked a similar path. Nurturing minds, transforming lives Natalie Lewis ’22N and Evelyn Santos ’23N (MS) are nursing champions for their communities. Inspiring and supporting nurses Jessica Tambe ’22N (MS), RN, SCRN, receives the Excellence in Neuroscience Education Award. Nursing student spotlight Victoria Thomas, former dental hygienist, finds a new path in health care leadership. Q&A with Ethan King ’27 This optics major, a capella performer, and scholarship recipient excels in and out of the classroom. Read more stories Celebration of Scholarships On April 21, 2024, our 15th annual event brought together students, donors, and University of Rochester leaders. Scholarship recipients shared their stories. Donors talked about why they give. University leaders discussed why scholarship support is so essential—now and forever. Learn more and be inspired. Upcoming events Explore more events May–June ENGAGEMENT Dandelion Days Various locations See event details May 22 PROFESSIONAL DEVELOPMENT Panel on debt capital markets with the Real Estate Network 8:30 – 10:30 a.m. (ET) Polsinelli Law Firm See event details June 14 RESEARCH The Rochester Forum 9 a.m. - 1:30 p.m. (ET) Memorial Art Gallery See event details Experience Rochester events Explore all events The Sloan Performing Arts Center The 30,000-square-foot Sloan Performing Arts Center had its soft opening at the end of August, adding a much-anticipated new building to the University of Rochester’s River Campus in time for the fall semester. The building will be fully functional by the end of the calendar year. The Sloan Center is made possible thanks to the generosity of University Life Trustee Thomas Sloan ’65, ’67 (MS) and Linda Sloan ’67 and other lead donors. Read more about the Sloan Center and get a behind-the-scenes look at artist Jay Yan’s installation of a specially commissioned mosaic that will span most of the building’s interior. Read more The Sloan Performing Arts Center The 30,000-square-foot Sloan Performing Arts Center had its soft opening at the end of August, adding a much-anticipated new building to the University of Rochester’s River Campus in time for the fall semester. The building will be fully functional by the end of the calendar year. The Sloan Center is made possible thanks to the generosity of University Life Trustee Thomas Sloan ’65, ’67 (MS) and Linda Sloan ’67 and other lead donors. Read more about the Sloan Center and get a behind-the-scenes look at artist Jay Yan’s installation of a specially commissioned mosaic that will span most of the building’s interior. Read more Catch us on social Catch us on social Contact advcomm@rochester.edu giftoffice@admin.rochester.edu (585) 273-2700 Larry and Cindy Bloch Alumni and Advancement Center 300 East River Road Rochester, NY 14627 Explore Alumni website Careers and internships Schools and programs How to give Helpful links Advancement executive team Advancement intranet University of Rochester home URMC home Diversity, equity & inclusion Nondiscrimination & Title IX © University of Rochester 1999-2023 WordPress PopUp Plugin"
}