{
  "id": 7,
  "date": "2024-05-18T18:17:09.010570",
  "url": "https://rochester.edu/working/",
  "university_name": "University of Rochester",
  "title": "Working at",
  "content": "Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Working at Rochester United by a commitment to be ever better Our faculty and staff are vital to our success. Their ingenuity,\n                optimism, and talents are on display every day. Professional success From your job search to retirement, we are here to support you\n              through all phases of your career at Rochester. Career opportunities If youâre looking for a career in higher education or health\n                care, the University of Rochester may offer the perfect\n                opportunity for your background and goals. Search jobs New employees Welcome to the team! Our Employee Orientation website provides\n                you with more details and helpful resources to get you started. Visit the Orientation website Benefits: Total Rewards We offer our employees a comprehensive benefits package–we\n                call it Total Rewards. Explore benefits Work/life balance The University created Well-U to help you live a more balanced\n                life. Telehealth and other online support options are\n                available.` Get support Learning and development The Office of Human Resources and partners across our campuses\n                offer training programs and resources designed to help employees\n                keep their skills current, expand their knowledge, and work\n                better together. Learn and grow A people-centered work cultureânow and into the future As part of our Boundless Possibility strategic plan, weâre committed to cultivating an inclusive culture that prioritizes the well-being, development, engagement, success, and diversity of our community. Committed to faculty and staff success Resources for all employees Explore many of the vital resources available for faculty and\n              staff. For faculty and staff Explore resources to help you thrive in your professional and\n                personal life. TOP RESOURCES HRMS (payroll and time entry) MyPath (training and education) Human Resources Parking and transportation Diversity and inclusion University-wide support services COVID-19 resource center For faculty Support programs, funding opportunities, and services are\n                available to support our faculty. TOP RESOURCES Professional development Diversity programs Our commitment to diversity, equity, and inclusion At the University of Rochester, we are united by a commitment\n                  to be ever betterâMeliora. It is an ideal that informs our\n                  shared mission to ensure all members of our community feel\n                  safe, respected, included, and valued. View our nondiscrimination statement Explore more resources FIND A JOB Search jobs Explore open positions to see where you might fit. Contact Us Have a question? If you have questions, weâre here to help. See Rochester Discover our city Explore the city we call home. Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff"
}