{
  "id": 7,
  "date": "2024-05-18T18:20:17.229326",
  "url": "https://rochester.edu/",
  "university_name": "University of Rochester",
  "title": "Your education, your way",
  "content": "Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Commencement Weekend 2024 Join the celebration Your education, your way Students at Rochester forge their own path. Whether itâs through\n\t\t\t\t\t\tresearch opportunities, our flexible curriculum, or rich campus\n\t\t\t\t\t\tculture, thereâs plenty of ways to take your education to the next\n\t\t\t\t\t\tlevel. Majors and programs Flexible curriculum Research in action Tradition, ever better Class of 2024: Congratulations on your accomplishments! Commencement Weekend kicks off May 17 with a\n\t\t\t\t\t\t\tdistinctly Rochester ceremony for all graduates. Celebrations continue through May 19. #UR2024 Discover Commencement News and updates Design capstones let students create real-world solutions Each year, our engineering students work on a final project, which gives them hands-on opportunities to\n\t\t\t\t\t\t\twork with real clients, conduct interdisciplinary research, and engage in global experiences. Engineering greatness Rochester and Albany launch new Center of Excellence in RNA research Did a magnetic field collapse trigger the emergence of animals? University guidance: Well-being, safety, and campus events Explore more news Keeping a Rochester education affordable 30th in the nation as a 2023 Best Value School (U.S. News & World\n\t\t\t\t\t\tReport) 71% of undergraduates receive financial aid $300M in scholarships and grants awarded annually 49% of students graduated in 2022 with no loan debt Explore financial aid & scholarships Upcoming events May 17â19 TRADITIONS Commencement Weekend Multiple ceremonies Campus-wide Event details May 19 DIVERSITY Asian Pacific American Heritage Celebration Day 12 p.m. Memorial Art Gallery Event details May 20 RESEARCH Hearing and Balance Research Collective 1 p.m. School of Medicine and Dentistry Event details Explore more events Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination &\n                  Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X /\n                Twitter TikTok Instagram LinkedIn Threads Follow\n                Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2024 Helpful links Commencement Weekend Directory Academic Calendar Blackboard Libraries Events Emergency information IT services Human Resources MyPath HRMS Parking Contact us Resources for Prospective students Current students Faculty and staff"
}