{
  "id": 7,
  "date": "2024-05-18T18:16:59.084253",
  "url": "https://www.rochester.edu/accessibility.html",
  "university_name": "University of Rochester",
  "title": "Resources and support",
  "content": "Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Accessibility at Rochester Committed to equal access for allâin person and online. Resources and support The lists below offer quick access to top resources related to campus, workplace, and digital access. Campus accessibility If a building or other physical space on our campuses is inaccessible, please let the Facilities and Services team know so we can make it right. TOP RESOURCES Disability Services and Support Parking Accessibility Eastman Theatre Accessibility Memorial Art Gallery Accessibility Academic and workplace accessibility The University has a team of dedicated professionals to ensure that members of our community with disabilities have equal access, reasonable accommodation, and full participation in the Rochester experience. TOP RESOURCES Disability Services and Support Access Coordinators Digital accessibility Weâre continually working to make our website and other digital spaces as accessible, easy to use, and helpful as possible. Share your feedback and suggestions, or report a barrier to our Digital Accessibility team. TOP RESOURCES Digital and web accessibility Social media accessibility AS&E website accessibility Web Governance Council Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff"
}