{
  "id": 7,
  "date": "2024-05-18T18:17:25.267246",
  "url": "https://www.sas.rochester.edu/",
  "university_name": "University of Rochester",
  "title": "Site Navigation",
  "content": "Skip to main content University of Rochester Apply Visit Give Search Search Rochester.edu Search text Search Popular Searches Directory News Programs Resources for Prospective students Current students Faculty and staff School of Arts & Sciences Menu Site Navigation Close Home About Us About the School of Arts & Sciences Defining the Future Dean's Corner Giving Contact Us Academics Departments & Programs Centers Degree Options Entrepreneurship Research News Events Sloan Performing Arts Center Overview Location & Accessibility Calendar of Events Ground Plans, Templates & Inventories Homepage Rochester students aim to âlevel the fieldâ for high schoolers applying to college A trio of undergraduates teamed up to bring accessible, high-quality education consulting services to the community. Continue Reading Thatâs not Native American art. Or is it? A Rochester art historian on the proliferation of indigenous fakes and replicasâand the blurry line between appropriation and admiration. Continue Reading Why do we blink so much? Researchers find that blinking plays a pivotal role in processing visual informationâadding to a growing body of evidence revising our conventional views of vision. Continue Reading Pablo Sierra Silva: Using primary sources to immerse students in the past The history professor leads his class back in time to analyze events that shaped todayâs world. Continue Reading Art History Professor Peter Christensen Awarded Berlin Prize Peter Christensen, the Arthur Satz Professor of Humanities, has been named a recipient of the prestigious Berlin Prize, an annual award intended to foster transatlantic dialogue in the arts, humanities, and public policy. Continue Reading Majors & Minors Pursue a degree or take courses in arts and humanities, natural sciences, or social sciences. Learn More Graduate Studies Nationally recognized programs characterized by close contact between students and faculty. Learn More Research Embracing creativity, broadening our understanding of how the world works, and gaining insights into society. Learn More Feature Story Faculty lauded for research and service contributions The US Department of Energy and the European Academy of Sciences are among the organizations recognizing Rochester faculty. More SAS News Announcement Nicole S. Sampson named as new Dean of the School of Arts & Sciences Sampson brings an impressive background in academia and a commitment to excellence in higher education and student success to the role of the Robert L. and Mary L. Sproull Dean of the School of Arts & Sciences. Continue Reading Language, art, culture, and history of Italy Lisio Program in Italian Studies The Arnold Lisio ’56, ’60M (MD) and Anne Moore Lisio Italian Studies Program supports University of Rochester students and faculty in their understanding of and appreciation for the language, art, culture, and history of Italy. The Lisio program funds: Student scholarship prizes Summer fellowships Faculty and program grants Learn More Arts & Humanities Research Natural Sciences Research Social Sciences Research Want more information about the School of Arts and Sciences? Contact us . Report a Digital Accessibility Barrier School of Arts & Sciences Location University of Rochester 317 Lattimore Hall P.O. Box 270401 Rochester, NY 14627 Phone (585) 275-2121 Schools & Divisions The College School of Arts & Sciences Hajim School of Engineering & Applied Sciences Helpful Links Intranet Directory Web Communications Follow Rochester Facebook Twitter YouTube Instagram LinkedIn University of Rochester Phone Contact us (585) 275-2121 Location See maps and directions Rochester, NY Search Rochester.edu Search text Search Accessibility Nondiscrimination Statement Copyright Emergency Information © University of Rochester 1996â2022"
}