{
  "id": 7,
  "date": "2024-05-18T18:17:00.426846",
  "url": "https://www.rochester.edu/copyright.html",
  "university_name": "University of Rochester",
  "title": "",
  "content": "Skip to content Search Close Menu Close Academics Research Admissions Campus Life Medicine About Work Here Visit Give SEARCH Copyright information © 1996-2024 • University of Rochester All rights reserved. All content on these Web pages (including but not limited to text, graphics, photos, and multimedia files) unless otherwise noted is copyrighted by the University of Rochester. Reproduction, distribution, or commercial use without written permission of the University is prohibited.  To request permission, please contact University Communications . These pages may contain material that is owned and copyrighted by others. Any person wishing to make use of such materials must seek permission to do so directly from the copyright holder. Questions about who owns the copyright for particular content on this site should be addressed to the site author or webmaster. For more information on copyright law and fair use, contact the Copyright Clearance Center or visit the US Copyright Office website at www.copyright.gov . Reporting copyright infringement Boundless Possibility Explore our 2030 Strategic Plan News Events Athletics Arts Resources for Prospective students Current students Parents & families Faculty & staff Alumni Helpful links Contact Directory Human resources UR Mobile (app) Parking & shuttles Information technology Blackboard HRMS MyPath Libraries & collections University Libraries Memorial Art Gallery Ever better Global engagement Accessibility Vision & Values Diversity, equity & inclusion Nondiscrimination & Title IX Schools & divisions School of Arts & Sciences Hajim School of Engineering Eastman School of Music School of Medicine & Dentistry School of Nursing Simon Business School Warner School of Education Laboratory for Laser Energetics Facebook YouTube X / Twitter TikTok Instagram LinkedIn Threads Follow Rochester Contact us (585) 275-2121 See maps and directions Rochester, NY 14627 Copyright | Emergency information © University of Rochester 1996-2023 Helpful links Coronavirus updates Blackboard Calendar Contact us Directory Email/IT HRMS Human Resources Libraries Resources for Prospective students Current students Faculty and staff"
}