{
  "id": 2,
  "date": "2024-05-18T18:22:50.732800",
  "url": "https://gradfutures.princeton.edu/Forum",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Section Menu Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Star Lessons in Leadership The Annual GradFUTURES Forum Professional Development Conference Thank You for Joining us at the 2024 GradFUTURES Forum! 2024 GradFUTURES Forum: Building Clarity, Confidence, and Connections With more than a dozen engaging speakers, skill-building workshops, alumni panels, and networking sessions, the GradFUTURES Forum offers sessions with real-time relevance to success in graduate school and provide s a glimpse into a world of possibilities beyond. Visit the GradFUTURES YouTube Channel to view recordings from this year's forum. Thank you to our Sponsors! 8 Days of engaging workshops, panels, and networking events! 20+ Events with virtual and in-person attendance options! 30+ Speakers, presenters, and facilitators! 3600+ Registrants from all over the globe! Forum 2024 Speakers, Presenters, and Panelists Include: Rodney D. Priestley Dean of the Graduate School Pomeroy and Betty Perry Smith Professor of Chemical and Biological Engineering Clio Hall Award Recipient Genevieve Allotey-Pappoe, GS, MUS University Administrative Fellow Social Impact Fellow Desiree Barron-Callaci Senior Program Officer at the American Council of Learned Societies Carin Berkowitz Executive Director, NJ Council for the Humanities Jessica Calarco Professor of Sociology, University of Wisconsin-Madison Leonard Cassuto American Higher Education Learning Cohort Convener Inaugural GRADitude Award for Advancing Graduate Professional Development Recipient Chris Crawford, *22, SPIA AAAS Science & Technology Policy Fellow, USDA Amy Cuddy, *05, PSY Social psychologist, NYT-bestselling author, and award-winning Harvard lecturer Gadi Dechter Vice President for Communications and Government Affairs, Princeton University Janellen Duffy, *03, MPA Senior Vice President, River Crossing Strategy Group Austin Edwards, *23, MPP, SPIA Senior Policy Counsel at Salvation and Social Justice Ruth Gotian Speaker, Business Skills for PhDs in Academia and Beyond Chief Learning Officer; Associate Professor of Education in Anesthesiology, Weill Cornell Medicine. Julie Groeninger Assistant Vice President, Office of Government Affairs, Princeton University Ian Gunady, GS, MAE University Administrative Fellow Facilitator, Structured Problem Solving like Consultants Learning Cohort Michael Hotchkiss Assistant Vice President for Communications, Princeton University Sargun Kaur Lalia Digital Engagement and Programming Specialist, Strategic Intelligence, World Economic Forum Ann Kirschner *78, ENG Educator, Author, Entrepreneur Acting President, Hunter College Clio Hall Award Recipient Peter Krause Assistant Director/Career Coach, Dartmouth Martin Lercher Professor of Computer Science and Biology, Heinrich Heine University Camila Llerena-Olivera, GS, CEE Professional Development Associate 2023-24 Emily Miller Deputy Vice President of the AAU Jennifer Morrill Director of Media Relations, Princeton University Michelle Nedashkovskaya Policy Lead, YouTube Pablo Oyler-Castrillo, GS, QCB Professional Development Associate 2023-24 Breanne Pitt Project Research Fellow, Strategic Intelligence, World Economic Forum Adam Rosenberg, *03, PPPL Democratic Staff Director for the Energy Subcommittee of the U.S. House Committee on Science, Space, and Technology Benjamin Sacks *18, HIS Policy Researcher; Professor, Pardee RAND Graduate School Shyam Sharma Associate Professor and Graduate Program Director Program in Writing and Rhetoric, Stony Brook University Achinthya Sivalingam GS, MPA, SPIA Moderator, 2024 GradFUTURES Forum Jason Sullivan Data Analyst at Academic Analytics Future Faculty Workshop Speaker Paul M. Sutter, Ph.D. Research Professor, Institute for Advanced Computational Science, Stony Brook University Skill-Building Workshop Speaker Hansen Tjo, GS, CBE Professional Development Associate 2023-24 Robert Townsend Director of Humanities, Arts, and Culture Programs, American Academy of Arts and Sciences Itai Yanai Professor of Biochemistry and Molecular Pharmacology, NYU Grossman School of Medicine Qiqi Yang, GS, EEB Professional Development Associate 2023-24 Elizabeth Zeitler, *14 CHM Associate Board Director, Energy and Environmental Systems, National Academies of Sciences, Engineering and Medicine Past GradFUTURES Forums Resources, Recordings, and Information from the 2023 GradFUTURES Forum Resources, Recordings, and Information from the 2022 GradFUTURES Forum Resources, Recordings, and Information from the 2021 GradFUTURES Forum Resources, Recordings, and Information from the 2020 GradFUTURES Forum “I want to thank GradFUTURES for pulling together this event because there are so many issues right now in public policy that have a nexus with science and technology. We really need more students, postdocs, and faculty members to bring their advice to policymakers on these issues. Not only that, but this event is helpful for students to pursue a career path from academia to public policy. GradFUTURES has done a terrific job of building that ecosystem and community here at Princeton in order to help support those efforts.” –– Ali Nouri, *06 (MOL) , Deputy Assistant to the President and Deputy Director of the Office of Legislative Affairs, The White House Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}