{
  "id": 2,
  "date": "2024-05-18T18:22:51.061494",
  "url": "https://gradfutures.princeton.edu/sharpen-skills",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Photo: Sameer A. Khan / Fotobuddy Section Menu Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Star Lessons in Leadership Sharpen Skills Professional development is integral to graduate education at Princeton University. It involves the systematic learning, acquisition, and application of skills and competencies that support your scholarly goals while preparing you for professional success in diverse roles within the academic, government, nonprofit, and private sectors. These competencies are in-demand in the Ph.D. labor market across all disciplines, career fields, and position types. Many are also interrelated and may be explored in any order based on your unique interests and goals. Throughout your time here, a range of programs helps you build competence and confidence in each of these highly transferable skills. Our Professional Competency Model Research & Data Analysis Writing & Public Speaking Teaching & Mentoring Leadership & Collaboration Diversity, Equity, & Inclusion Personal Well-being & Effectiveness Innovation & Entrepreneurship Career Management Progressive Acquisition & Mastery of Skills Creates Career Optionality Alongside the development of strong foundational and discipline-specific skills, we emphasize distinguishing skills that translate universally across an array of leadership environments. This sets our Ph.D.s apart on the academic job market and prepares them for success in diverse fields—including entrepreneurship. We curate, integrate, and cross-promote professional development programs offered by dozens of partners on and off campus to help graduate students build and hone these skills. In addition, we deliver more than 150+ programs including skill-building, interdisciplinary learning cohorts, mentorship, and experiential opportunities. Learn more about our professional competency model . Featured Programs Interdisciplinary Learning Cohorts Explore interdisciplinary seminars and co-curricular opportunities that bring together students, alums, faculty, and industry partners. The Annual GradFUTURES Forum Professional Development Conference (External Guests and Alums) Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. Science Policy Reflect on and identify your professional interests and future possibilities using ideation, group problem-solving, and design-thinking methods. 2024 GradFUTURES Wintersession Events Join us during this campus-wide, two-week experience that offers engaging, active, and intriguing non-graded learning and growth opportunities for the entire University community! Princeton Startup Bootcamp, Powered by VentureWell Take on an entrepreneurial mindset, collaborate across disciplines, and learn what it takes to bring an idea to market. Focus on Future You(s) Reflect on and identify your professional interests and future possibilities using ideation, group problem-solving, and design-thinking methods. Creativity Workshops Embrace innovative thinking and apply an entrepreneurial mindset toward bold, disruptive research ideas of interest to all audiences. Skill-building Workshops Participate in events and skill-building workshops throughout the year across that span key competencies and sharpen in-demand skills. 2023 GradFUTURES Wintersession Events Join us during this campus-wide, two-week experience that offers engaging, active, and intriguing non-graded learning and growth opportunities for the entire University community! The Annual GradFUTURES Forum Professional Development Conference Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. “I always imagine I'm a tree and different skills are branches and leaves that could grow in the future. My professional development is a process of knowing myself and the world, and growing those branches and leaves. Connecting with alumni in my department opened my eyes to the career choices I could have as an EEB PhD and what skillsets I could aim to develop during graduate school. By doing what I want to try, I learn what I'm passionate about and what skills I'm already good at and what skills I'd need to learn more.” – Qiqi Yang , GS, EEB Additional Programs to Explore Graduate Alum Mentorship Program Benefit from ongoing access to a network of Princeton graduate alum mentors, who offer guidance and advice across a broad range of fields. Research and Career Resources Access a range of free resources that are designed to support you in your development, progression, and career outcomes. “Many brilliant people apply to graduate school and then find that graduate school is not quite what they expected. Rather than being a retreat from the world, it is in fact a training ground for a complicated, very public job, one that requires many of the same skills as other high level positions. These include networking, scheduling time efficiently, managing multiple forms of technology, following a plethora of policies, and leading people from diverse backgrounds to accomplish a common goal while simultaneously writing, researching, and teaching. Fortunately, the graduate student professional development program at Princeton University provides training in just these types of skills and thus is an essential part of graduate student success now and in the future.\" – Wendy Laura Belcher , Professor of African Literature, Princeton University, Department of Comparative Literature and Department of African American Studies Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}