{
  "id": 2,
  "date": "2024-05-18T18:22:50.107639",
  "url": "https://gradfutures.princeton.edu/forge-connections",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Photo: Sameer A. Khan / Fotobuddy Section Menu Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Forge Connections Build a strong network of mentors, advocates, and professionals within and beyond your discipline as a source of advice, inspiration, and possible referrals. When GradFUTURES launched, we immediately received an outpouring of support from graduate alums, many of whom said they wished there was a professional development program like this when they were at Princeton. Across our programming, we help you build connections and community—and develop the same kinds of multigenerational networks that have existed for decades among Princeton’s undergraduate alums. With countless opportunities to align with fellow graduate students, graduate alums, professionals, and trailblazers, you will develop a deep roster of connections who can illuminate possibility now and as you envision your future(s). Featured Programs Graduate Alum-in-Residence Program Schedule 1:1 consultations with graduate alums working in a variety of roles across the academic, government, nonprofit, and private sectors. Graduate Alum Mentorship Program Benefit from ongoing access to a network of Princeton graduate alum mentors, who offer guidance and advice across a broad range of fields. GradFUTURES LinkedIn Group Find community and connections among and between current graduate students and those within the broader University community. “There are *a lot* of resources here in Princeton dedicated to helping students at every stage of their career exploration and planning – it can be a bit overwhelming at first! If you don't know where to begin when thinking about your future plans (I certainly didn't), just start by attending one or two events organized by GradFUTURES and chat with us about what's on your mind. We are more than happy to put you in touch with people who can best help you, and gradually you will build a network that will make the career planning process an overall exciting and empowering experience.” – Pablo Oyler-Castrillo , GS, QCB Additional Programs to Explore The Annual GradFUTURES Forum Professional Development Conference Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. The GradFUTURES Podcast Listen to the professional development stories of graduate students, graduate alums, and those who partner and collaborate with them! Trailblazers Beyond the Tenure Track: Graduate Alum Stories & Profiles Develop a vision of the journey ahead by exploring the experiences of trailblazers who have pursued careers beyond the tenure track. “When I was a graduate student at Princeton, I knew I wanted to be a librarian, but I had to figure out how to get library work experience and learn more about the library world. Most of my successes, whether in finding work at the library or gaining a better understanding of various library fields, came from reaching out to librarians, asking them about their career journeys, and learning from their advice. This outreach approach prepared me to be better equipped as a librarian candidate, and it can work for other professional fields as well.\" – Deborah Schlein, *19, NES , Near Eastern Studies Librarian, Princeton University Library “To this day, my Grad School classmates and colleagues form a central core within my professional network. Engage with those around you—not only within your discipline, but more broadly. Conversations and ideas shared with faculty members, visiting scholars, and fellow students will remain with you, a constellation of thoughts and perspectives by which to chart your professional course.\" – Natalka Pavlovsky *88, *01, MUS , Professor of Music, Rowan College of South Jersey Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}