{
  "id": 2,
  "date": "2024-05-18T18:22:54.289590",
  "url": "https://gradfutures.princeton.edu/sharpen-skills/professional-competency-model",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Home Sharpen Skills Professional Competency Model Progressive Acquisition & Mastery of Skills Creates Career Optionality We emphasize skills that bridge graduate research & graduate future(s). Inspired leaders emerge at the intersection of graduate education and professional development—which is why a comprehensive learning framework underpins our work. Alongside the development of strong foundational and discipline-specific skills, we emphasize distinguishing skills that translate universally across an array of leadership environments. This sets our Ph.D.s apart on the academic job market and prepares them for success in diverse fields—including entrepreneurship. We curate, integrate, and cross-promote professional development programs offered by dozens of partners on and off campus to help graduate students build and hone these skills. In addition, we deliver more than 150 programs including: Skill-building Interdisciplinary learning cohorts Mentorship Experiential opportunities The Foundation: Eight Core Competencies Informed by labor market research, peer benchmarking, graduate alumni feedback, and Princeton’s institutional priorities, these eight core competencies span essential skills. Career Management Exploring diverse career paths, developing job search skills and materials, and building relationships that enable you to achieve your current and future professional goals. Innovation & Entrepreneurship Applying innovative, inclusive, creative, and entrepreneurial approaches and mindsets to accelerate discovery and catalyze solutions to complex problems– whether within the context of the academic research enterprise and/or new venture creation. Personal Well-being & Effectiveness Maximizing your overall well-being allows you to perform at peak effectiveness in all aspects of your academic, personal, and professional life by fostering resilience, social connectedness, balance, and a growth mindset. Diversity, Equity, & Inclusion Engaging in lifelong learning to understand and apply strategies that foster inclusion and intercultural fluency while advancing equity within various professional, institutional, organizational, and community contexts. Leadership & Collaboration Managing complex projects and working collaboratively in diverse, multidisciplinary teams to achieve mutual goals and realize a sense of shared accomplishment. Teaching & Mentoring Applying instructional pedagogies, assessment methods, and effective teaching practices to promote inclusive learning environments whether within a formal classroom setting or online, for student mentoring and tutoring, or facilitation of training programs within other organizational settings. Writing & Public Speaking Developing strong written communication and public speaking skills to effectively communicate complex topics and demonstrate your expertise and research to diverse audiences. Research & Data Analysis Conducting original and independent research within and beyond your discipline using methods that will advance knowledge and enhance understanding across many fields. “What I sense is that when you're a graduate student, you feel overwhelmed by all the things on your 'I have to do this' list. However, if you really want to prepare for your future, the skills imparted through [GradFUTURES] workshops are essential. People need to think about it that way instead of thinking, 'Oh, I don't have time for it.' I've spent decades in industry, and the people who make a bigger impact are the ones who learned those vital skills, which in the past were considered ‘soft.' They're not soft, they're essential.” – Amy Aines , CEO, Damianakes Communications. Author, Championing Science Program Highlight: GradFUTURES Learning Cohorts Established: 2019 Members: Graduate students, alumni, faculty, postdocs, industry experts Skillbuilding across interests. Exploration in community. GradFUTURES Learning Cohorts bring graduate students together with members of our professional development ecosystem to explore diverse professional options and societal, industry, and/or global trends. Rooted in a series of interdisciplinary seminars and co-curricular learning opportunities, most cohorts also offer an experiential component that makes the theoretical tangible. “It’s exciting to see how many new initiatives and opportunities for graduate student professional development are emerging here on campus, in communication, teaching, leadership, wellness, career management, and other crucial areas. I very much hope this programming will continue to grow.\" – William A. Gleason , Hughes-Rogers Professor of English and American Studies “I have made two large transitions in my career: from academia to business, and from large corporations to start-ups. Being open to new opportunities and always looking to build on my knowledge and skills have helped me tremendously with my career progression... Developing a breadth of skills (including soft skills) will help prepare one to be able to take on a wider range of opportunities that present themselves. More choices mean more possibilities for career advancement.” – Kin Chung *97, MAT , Head of Credit, Zolve Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}