{
  "id": 2,
  "date": "2024-05-18T18:23:04.321200",
  "url": "https://www.princeton.edu/",
  "university_name": "Princeton University",
  "title": "",
  "content": "Skip to main content Princeton University Menu Search Search Sites & People × Living Our Ethos of Service Matthew Desmond's 'Poverty, by America' ProCES course field-tests promising solutions, in collaboration with community partners. History and Sense of Place A new portrait of the pathbreaking actor and director José Ferrer '33 joins a series illuminating the University's broad diversity. Pursuing Excellence Genrietta Churbanova has been selected as Princeton Class of 2024 valedictorian. John Freeman is salutatorian. University News View All News Princeton graduate students honored for excellence in teaching Jamie Chiu, Katherine Sniezek, Laura Nelson, Ravin Raj, Casey Lewry, Pasquale Toscano, Jasante’ Howard, Filippo Palomba, Marie-Louise James, and Katie VanderKam have been recognized for their outstanding abilities as instructors. Four outstanding N.J. secondary school teachers to be honored at Princeton Commencement This year’s recipients of the Princeton Prize for Distinguished Secondary School Teaching are Ahmed Hassanein of Joseph H. Brensinger Elementary School, P.S. #17, in Jersey City, Sandra Keel-Huff of Orange High School, Bess Spero Li of Crossroads South Middle School in South Brunswick, and Theresa Riccardi of High Point Regional High School in Sussex. Eight seniors win 2024 Spirit of Princeton Award for service, contributions to campus life The award recognizes students who have demonstrated a strong commitment to the undergraduate experience through efforts in student organizations, athletics, community service, religious life, residential life and the arts. View All News The Quantum Future: Meeting the Moment Princeton’s quantum scientists and engineers are working to manipulate the strange behaviors of particles — mindbending realities like quantum entanglement and superposition — to advance knowledge and produce technologies in fields as far-ranging as computing, communications, medicine, energy, finance and cryptography. Our expanded Quantum Initiative and new Ph.D. program carry forward a spirit of discovery on our campus that reaches back to Einstein. Follow our latest breakthroughs and meet our Forward Thinkers Exceptional Faculty Princeton faculty members are all exceptional scholars in their disciplines who are expected to teach as well as engage in research. Faculty work closely with undergraduates in the supervision of junior year independent work and senior theses. Arvind Narayanan Computer Science and the Center for Information Technology Policy Narayanan studies the societal impact of artificial intelligence and machine learning. Sigrid Adriaenssens Civil and Environmental Engineering Adriaenssens is an engineering innovator, designing lightweight, elegant and resilient structures for sustainable buildings, bridges and other infrastructure. Leonard Wantchekon Politics 2023 Global Economy Prize winner Wantchekon came of age as a pro-democracy student activist in Benin. Marina Rustow Near Eastern Studies and History Rustow uses machine learning to decipher thousands of Arabic and Hebrew fragments preserved in a medieval Cairo synagogue that open a new window onto premodern history. Ruha Benjamin African American Studies Benjamin’s scholarship explores the relationship between technological innovation and social equity. She is the author of 2022’s “Viral Justice” and the new “Imagination: A Manifesto.” Janet Currie Princeton School of Public and International Affairs Currie applies economics expertise to children’s health, development and well-being. Princeton In the News PPPL breaks ground on $100M innovative fusion research hub (link is external) Featured: Steve Cowley NJ Biz May. 10, 2024 Scientists Reveal Cancer's Atomic Secrets—'Whole New Layer to Medicine' (link is external) Featured: Ashley Maloney Newsweek May. 07, 2024 Let’s All Take a Deep Breath About China (link is external) By Rory Truex The New York Times May. 06, 2024 #VentureForward Through the Venture Forward campaign, Princeton is making audacious bets on talent and potential that will have a transformative impact on the future of humanity. Dare to Venture Student Life at Princeton Princeton brings together undergraduate and graduate students from all backgrounds, and every corner of the earth, to share their experiences and perspectives with one another. Make your mark as part of our vibrant community. LEARN MORE Upcoming Events View All Chapel Worship Service by ORL May 19 Chapel 11:00 a.m. Flight/Air/Fire: An Installation of Paper Pulp Banners by Daniel Heyman May 20 CoLab, Lewis Arts complex, 122 Alexander Street 10:00 a.m. Flight/Air/Fire: An Installation of Paper Pulp Banners by Daniel Heyman May 21 CoLab, Lewis Arts complex, 122 Alexander Street 10:00 a.m. View all Events Study at Princeton Our approach to learning combines the best aspects of a great research university and an outstanding liberal arts college. Areas of Study Learning Abroad Undergraduate Admission Graduate Admission Work at Princeton Every employee has the opportunity to make an impact supporting our mission of teaching and research. Faculty and Academic Positions Staff Positions Princeton University Main navigation Meet Princeton Submenu for Meet Princeton In Service of Humanity Facts & Figures History Honors & Awards Contact Us Visit Us Our Faculty Our Students Our Alumni Our Staff Our Leadership Academic Freedom and Free Expression Strategic Planning Framework Academics Submenu for Academics Studying at Princeton Library Areas of Study Humanities Social Sciences Engineering Natural Sciences Advising Academic Calendar Course Tools Learning Abroad Career Development Continuing Education Innovative Learning Research Submenu for Research Engineering & Applied Science Humanities Natural Sciences Social Sciences Dean for Research Office Interdisciplinary Approach External Partnerships Facilities & Labs One Community Submenu for One Community Lifelong Connections Student Life Arts & Culture Athletics Living in Princeton, N.J. Housing & Dining Activities & Organizations Cultural & Affinity Groups Health & Wellness Religious Life Serving the Public Good Families Admission & Aid Submenu for Admission & Aid Affordable for All About Financial Aid Current Undergraduate Financial Aid Undergraduate Admission Graduate Admission For International Students Dare to Venture . From the Present to the Possible Athletics . Go Princeton Tigers Utility menu News Events Work at Princeton Student Links Alumni Giving Inside Princeton Contact links Contact Us Accessibility Help Directory Visiting links Plan a Visit Maps & Shuttles Varsity Athletics Giving to Princeton Academic links Library Academic Calendar Student Links Faculty & Staff Links Footer social media Facebook Twitter Instagram Snapchat LinkedIn YouTube Social Media Directory Equal Opportunity and Nondiscrimination at Princeton University: Princeton University believes that commitment to principles of fairness and respect for all is favorable to the free and open exchange of ideas, and the University seeks to reach out as widely as possible in order to attract the ablest individuals as students, faculty, and staff. In applying this policy, the University is committed to nondiscrimination on the basis of personal beliefs or characteristics such as political views, religion, national origin, ancestry, race, color, sex, sexual orientation, gender identity or expression, pregnancy/childbirth, age, marital or domestic partnership status, veteran status, disability, genetic information and/or other characteristics protected by applicable law in any phase of its education or employment programs or activities. In addition, pursuant to Title IX of the Education Amendments of 1972 and supporting regulations, Princeton does not discriminate on the basis of sex in the education programs or activities that it operates; this extends to admission and employment. Inquiries about the application of Title IX and its supporting regulations may be directed to the Assistant Secretary for Civil Rights, Office for Civil Rights, U.S. Department of Education or to the University’s Sexual Misconduct/Title IX Coordinator. See Princeton’s full Equal Opportunity Policy and Nondiscrimination Statement . Princeton University Princeton, NJ 08544 Operator: (609) 258-3000 © 2024 The Trustees of Princeton University Subfooter links Copyright Infringement Privacy Notice"
}