{
  "id": 2,
  "date": "2024-05-18T18:22:53.917515",
  "url": "https://gradfutures.princeton.edu/partner-us",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Section Menu Academic Departments & Faculty Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award Partner with Us The success of the GradFUTURES campus-wide initiative relies on the collective expertise and commitment of faculty, staff, alums, industry, and community partners. GradFUTURES exists to empower all graduate students with the professional competencies and skills they need. The Office of the Dean of the Graduate School gratefully acknowledges the outstanding contributions of all of our partners in delivering transformative programs, resources, and experiences that prepare graduate students to pursue a diverse array of professional opportunities. Interested in partnering with us? Please email us at [email protected] . Our Partners Academic Departments & Faculty Create discipline-specific professional development programs and resources in partnership with the GradFUTURES team. Graduate Student Professional Development Associates Co-create programs and events that reflect graduate students' unique interests, input, and innovative ideas. Higher Ed Partners Work with us to offer opportunities for Princeton doctoral students to gain substantive experience in diverse educational settings. Graduate Alums Provide meaningful advice, referrals to opportunities, and inspiration as an advocate and mentor to to current graduate students. Industry Partners Partner with us to expand the range of experiential opportunities for our doctoral students to gain progressive exposure to different industries. Campus Partners Collaborate with a coalition of staff across campus who have a shared goal to expand programs, resources, and opportunities. Collaborative by Design Professional Development Working Group Launched in 2019, the Professional Development Working Group (PDWG) is a collaborative, cross-functional coalition that convenes regularly to integrate, assess, and promote all of the robust professional development programs, opportunities, and resources offered for graduate students across campus. This group’s shared mission is to expand the availability and visibility of graduate student professional development and to support this strategic priority of the Graduate School. Learn more and join us > Awards & Recognition The GRADitude Award for Advancing Graduate Professional Development The GradFUTURES GRADitude Award for Advancing Graduate Professional Development recognizes national leaders who have influenced the field of graduate professional development in profound and substantial ways. Awardees—either individuals or organizations—are recognized at the annual GradFUTURES Forum. The GradFUTURES Clio Hall Award Each year, the GradFUTURES Clio Hall Awards are presented by the Graduate School's professional development team to faculty, staff, graduate alums, and graduate students in recognition of significant contributions to the professional development of Princeton graduate students. “Partnering with the Graduate School in promoting our Education, Training and Outreach program has significantly raised awareness and increased participation from graduate students across campus.\" – Ma. Florevel (Floe) Fusin-Wischusen , Institute Manager, Princeton Institute for Computational Science & Engineering (PICSciE) We empower graduate students to create their future(s) -- on their terms. Established by the Graduate School in fall of 2019, GradFUTURES ® serves as Princeton’s professional development hub for empowering graduate student futures through a broad spectrum of skills training, mentorship, bespoke experiential opportunities and interdisciplinary learning programs. Learn more about our approach . Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}