{
  "id": 2,
  "date": "2024-05-18T18:22:49.812437",
  "url": "https://library.princeton.edu/special-collections/policies/masters-theses-and-phd-dissertations-submission-guidelines",
  "university_name": "Princeton University",
  "title": "",
  "content": "Skip to main content Princeton University Library SPECIAL COLLECTIONS All Search Box * Search MENU Explore Exhibitions Digital Highlights New & Notable For Children Publications Digital Humanities Guide to Topics Collections Cotsen Children's Library Graphic Arts Collection Historic Maps Collection Manuscripts Division Numismatic Collection Public Policy Papers Rare Book Division Scheide Library University Archives Western Americana Collection Conducting Research Catalogs & Databases Library Services Ask Us! Research Account Access Visit Us Instruction Harvey S. Firestone Library Seeley G. Mudd Manuscript Library Ask Us! Special Collections Schedule - Summer 2024 The Special Collections reading rooms in Firestone and Mudd Libraries will be closed on the following upcoming holidays: Monday, May 27 (Memorial Day), Wednesday, June 19 (Juneteenth), Thursday, July 4 (Independence Day), and Monday, September 2 (Labor Day). We will be closing at 12:00pm on Friday, June 14. We will also begin our Summer Hours, 9am-4:15pm, on Monday, June 3. During this time we stop paging at 3:45pm. You are here Home Conducting Research Services & Policies Theses & Dissertations Master's Theses and Ph.D. Dissertations: Submission Guidelines Master's Theses and Ph.D. Dissertations: Submission Guidelines Master's Theses and Ph.D. Dissertations: Submission Guidelines Senior Thesis Submission Information for Students Senior Thesis Submission Information for Academic Departments The Princeton University Archives at the Mudd Manuscript Library is the repository for Ph.D. dissertations and Master’s theses. The Princeton University Archives partners with ProQuest to publish and distribute Princeton University dissertations beyond the campus community. Below you will find instructions on the submission process and the formatting requirements for your Ph.D. dissertation or Master's thesis. If you have questions about this process, please use our Ask Us form or visit the Mudd Manuscript Library during our open hours. Ph.D Dissertation Process Overview of the Ph.D. Dissertation Submission Process Publishing Options Embargoes Embargo Renewals Formatting your Dissertation Fees Deadlines A ccess to Dissertations and Theses The Master’s Thesis Submission Process Ph.D Dissertation Submission Process Overview of the Ph.D. Dissertation Submission Process Step 1) Near the time of the final public oral examination (FPO) (shortly before or immediately after) the student must complete the online submission of their dissertation via the ProQuest UMI ETD Administrator website ( www.etdadmin.com/princeton ). Students are required to upload a PDF of their dissertation, choose publishing options, enter subject categories and keywords, and make payment to ProQuest (if fees apply). This step will take roughly 20-25 minutes. Step 2) After the FPO the student should log on to TigerHub and complete the checkout process. When this step is complete, Mudd Library will be notified for processing. This step will occur M-F during business hours. The Mudd Library staff member will review, apply the embargo (when applicable), and approve the dissertation submission in ProQuest. You will receive an email notification of the approval from ProQuest when it has been approved or needs revisions. Step 3) The vast majority of students will not be required to submit a bound copy of their dissertation to the library. Only students who have removed content from the PDF to avoid copyright infringement are required to submit a bound copy to the library. This unredacted, bound version of the dissertation must be formatted according to the Dissertation Formatting Guidelines , and delivered by hand, mail, or delivery service to the Mudd Manuscript Library by the degree date deadline in order to be placed on the degree list. Address the bound copy to: Attn: Dissertations, Mudd Manuscript Library, 65 Olden Street, Princeton, NJ 08540. Publishing Options ProQuest Publishing Options When you submit your dissertation to the ProQuest ETD Administrator site, you will be given two options: Traditional Publishing or Open Access Publishing Plus. ProQuest compares the two options in their Open Access Overview document . Full details will be presented in the ProQuest ETD Administrator site. Traditional Publishing No fee is paid to ProQuest; your dissertation will be available in full text to subscribing institutions only through the ProQuest Dissertations & Theses: Full Text database ; If you have an embargo, your dissertation will be unavailable for viewing or purchase through the subscription database during the embargo period. Open Access Publishing Plus $95 fee to ProQuest; your dissertation will be available in full text through the Internet to anyone via the ProQuest Database ; if you have an embargo, your dissertation will be unavailable for viewing through the open access database during the embargo period. Optional Service: Copyright Registration $75 fee to ProQuest; ProQuest offers the optional service of registering your copyright on your behalf. The dissertation author owns the copyright to their dissertation regardless of copyright registration. Registering your copyright makes a public record of your copyright claim and may entitle you to additional compensation should your copyright be infringed upon. For a full discussion of your dissertation and copyright, see ProQuest’s Copyright and Your Dissertation . If you have questions regarding the ProQuest publishing options, contact their Author and School Relations team at 1-800-521-0600 ext. 77020 or via email at disspub@proquest.com . Princeton’s Institutional Repository, DataSpace Each Princeton University dissertation is deposited in Princeton’s Institutional Repository, DataSpace . Dissertations will be freely available on the Internet except during an embargo period. If your dissertation is embargoed, the PDF will be completely restricted during the embargo period. The bound copy, however, will be available for viewing in the Mudd Manuscript Library reading room during the embargo. Embargoes According to the Graduate School’s embargo policy , students can request up to a two-year embargo on their dissertation, with the potential for renewal by petition. If approved, the embargo would apply to the dissertation in ProQuest, as well as in Princeton’s digital repository, DataSpace . Students in the sciences and engineering seeking patents or pursuing journal articles may be approved for a shorter embargo period. Students must apply for the embargo during the Advanced Degree Application process . More information can be found on the Graduate School's Ph.D. Publication, Access and Embargoing webpage . Those who have been approved for the embargo can choose \"Traditional Publishing\" or \"Open Access Plus\" publishing when they complete their online submission to ProQuest. Mudd Manuscript Library staff will apply the embargo in the ProQuest ETD system at the time of submission of materials to the Library. In the case of Open Access Plus, the dissertation would become freely available on the ProQuest open access site when the embargo expires. The embargo in ProQuest will also apply to the embargo in Princeton’s digital repository, DataSpace Embargo Renewals Those who wish to request a renewal of an existing embargo must email Assistant Dean Geoffrey Hill and provide the reason for the extension. An embargo renewal must be requested in writing at least one month before the original embargo has expired, but may not be requested more than three months prior to the embargo expiration date. Embargoes cannot be reinstituted after having expired. Embargoes are set to expire two years from the date on which the Ph.D. was awarded (degrees are awarded five times per year at Board of Trustee meetings); this date will coincide with the degree date (month and year) on the title page of your dissertation. Please note: You, the student, are responsible for keeping track of the embargo period--notifications will not be sent. To find the exact date of an embargo expiration, individuals can find their dissertation in DataSpace , and view the box at the bottom of the record, which will indicate the embargo expiration date. The Graduate School will inform the Mudd Library of all renewals and Mudd Library staff will institute the extensions in ProQuest and DataSpace . Formatting your Dissertation Princeton University Archives' Dissertation Formatting Requirements (PDF download) document provides detailed information on how to prepare the dissertation PDF and bound volume (if you are required to submit a bound volume). Please take special note of how to format the title page (a title page example is downloadable from the upper-right-hand side of this webpage). The title page must list your adviser’s name. ProQuest's Preparing Your Manuscript guide offers additional information on formatting the PDF. Where there are discrepancies with the Princeton University Archives Dissertation Formatting Requirements document, the Princeton University Archives requirements should be followed. Special consideration should be paid to embedding fonts in the PDF. ProQuest ETD Administrator Resources and Guidelines web page offers several guides to assist you in preparing your PDF, choosing publishing options, learning about copyright considerations, and more. ProQuest's Support and Training Department can assist with issues related to creating and uploading PDFs and any questions regarding technical issues with the online submission site. Fees Whether a student pays fees to ProQuest in the ETD Administrator Site depends on the publishing option they choose, and if they opt to register their copyright (if a student selects Traditional Publishing, and does not register their copyright, no charges are incurred). Fees are to be submitted via the UMI ETD Administrator Site. Publishing and copyright registration fees are payable by Visa, MasterCard, or American Express and a small service tax may be added to the total. The options listed below will be fully explained in the ETD Administrator site. Traditional without copyright registration: $0 to ProQuest (online) Traditional with copyright registration: $75 to ProQuest (online) Open Access without copyright registration: $95 to ProQuest (online) Open Access ($95) with copyright registration ($55): $150 to ProQuest (online) Deadlines Degrees are granted five times per year at Board of Trustee meetings. Deadlines for materials to be submitted to the Mudd Manuscript Library are set by the Office of the Graduate School . The title page of your dissertation must state the month and year of the board meeting at which you will be granted your degree, for example “April 2023.” Academic Year 2023-2024 Tuesday, October 31, 2023, degree date \"November 2023\" Friday, December 29, 2023, degree date \"January 2024\" Thursday, February 29, 2024, degree date \"March 2024\" Thursday, May 9, 2024, degree date \"May 2024\" Academic Year 2024-2025 Friday, August 30, 2024, degree date \"September 2024\" Thursday, October 31, 2024, degree date \"November 2024\" Tuesday, December 31, 2024, degree date \"January 2025\" Friday, February 28, 2025, degree date \"March 2025\" Thursday, May 8, 2025, degree date \"May 2025\" Please note: If a student is granted an extension for submission of their materials after a deadline has passed, the Mudd Manuscript Library must have written confirmation of the extension from the Office of the Graduate School in the form of an email to specialcollections@princeton.libanswers.com . Access to Ph.D. Dissertations Bound Copy : One non-circulating , bound copy of each dissertation produced until and including the January 2022 degree list is held in the collection of the University Archives. For dissertations submitted prior to September 2011, a circulating , bound copy of each dissertation may also be available. Information about these dissertations can be found in Princeton University Library's main catalog . Electronic Copy (PDF) in ProQuest: ProQuest Dissertation Publishing distributes Princeton University dissertations. Members of the Princeton University community can access most dissertations through the ProQuest Dissertations and Theses subscription database, which is made available through the Princeton University Library. For students that choose \"Open Access Plus publishing,\" their dissertations are available freely on the internet via ProQuest Dissertations and Theses . Dissertations are available for purchase through ProQuest Dissertation Express . Once the dissertation has been accepted by the Mudd Library it will be released to ProQuest following the Board of Trustee meeting on which your degree is conferred.Bound copies ordered from ProQuest will be printed following release. Please note, dissertations under embargo are not available in full text through the ProQuest Dissertations and Theses subscription database or for sale via ProQuest Dissertation Express during the embargo period. Electronic Copy (PDF) in Princeton's Institutional Repository, DataSpace : Beginning in the fall of 2011, dissertations will be available through the internet in full-text via Princeton's digital repository, DataSpace . (Embargoed dissertations become available to the world once the embargo expires.) Interlibrary Loan : Dissertations that have bound copies and are not under embargo are available through Interlibrary Loan (ILL) to libraries in the United States and Canada, either through hard copy or PDF. If PDFs are available, they can be sent internationally. Submitting Your Master’s Thesis to the Mudd Manuscript Library Students who are enrolled in a thesis-based Master’s degree program must upload a PDF of their thesis to Princeton's ETD Administrator site (ProQuest) just prior to completing the final paperwork for the Graduate School. These programs currently include: The Department of Chemical and Biological Engineering (M.S.E.) The Department of Civil and Environmental Engineering (M.S.E.) The Department of Computer Science (M.S.E.) The Department of Electrical and Computer Engineering (M.S.E.) The Department of Mechanical and Aerospace Engineering (M.S.E.) The Department of Operations Research and Financial Engineering (M.S.E.) The Department of Near Eastern Studies (M.A.) The PDF should be formatted according to our Dissertation Formatting Requirements (PDF download) . The Mudd Library will review and approve the submission upon notification from the Graduate School that your final paperwork is ready for this step. Bound copies are no longer required or accepted for Master's theses. Students who are not in a thesis-based Master's degree program do not need to make a submission to the library upon graduation. If you have questions, please contact the Mudd Manuscript Library using our Ask Us form. Downloadable Documents Download Title Page Format.pdf (122.22 KB) Download Dissertation Formatting Requirements__v23.1.pdf (293.05 KB) Locations Firestone Library One Washington Road Princeton , NJ 08540 609-258-3184 Seeley G. Mudd Manuscript Library 65 Olden Street Princeton , NJ 08540 609-258-6345 Calendars: RBSC | Mudd Where to Access Your Account Ask Us! Find Material Order Images Learn About Theses & Dissertations Review Grant Opportunities Schedule a Class Visit Visit Us About Special Collections Collections and Divisions Exhibitions For Children Friends of the Library Publications Staff Directory Staff Workflows Staff Login Princeton University Library © 2024 The Trustees of Princeton University. All rights reserved. Accessibility Top"
}