{
  "id": 2,
  "date": "2024-05-18T18:22:46.899616",
  "url": "https://www.cs.princeton.edu",
  "university_name": "Princeton University",
  "title": "Home",
  "content": "Skip to main content Quick links CS Guide Directory Contact Department of Computer Science Menu Search Undergraduate Program Advisers & Contacts Becoming a CS Major Bachelor of Arts & Bachelor of Science in Engineering Prerequisites Declaring Computer Science for AB Students Declaring Computer Science for BSE Students Class of '25, '26 & '27 - Departmental Requirements Class of 2024 - Departmental Requirements COS126 Information Independent Work & Theses Important Steps and Deadlines Independent Work Seminars Guidelines and Useful Information Undergraduate Research Topics AB Junior Research Workshops Undergraduate Program FAQ Certificate Program Overview How to Enroll Requirements Policies Certificate Program FAQ Interdepartmental Committee Minor Program Funding for Student Group Activities Student Life Mailing Lists and Policies Study Abroad Jobs & Careers Graduate Program Admissions Requirements Doctoral Degree Breadth Requirements Pre-FPO Checklist FPO Checklist Master’s Degree M.S.E. Track M.Eng. Track Departmental Internship Policy (for Master's students) FAQ Funding General Examination Fellowship Opportunities Travel Reimbursement Policy Communication Skills Courses Course Schedule Course Catalog Research Research Areas Interdisciplinary Programs Technical Reports Computing Facilities People Faculty Researchers Technical Staff Administrative Staff Graduate Students Undergraduate Students Graduate Alumni Diversity & Outreach Climate and Inclusion Committee Resources for Undergraduate & Graduate Students Outreach Initiatives Resources for Faculty & Staff About Contact Us Visit Us News and Events News Events Spotlight Stories Directory Job Openings Home Spotlight Brian Kernighan recognized by Princeton Engineering for outstanding service Read More Huacheng Yu wins NSF CAREER award Read More Science has an AI problem. This group says they can fix it. Read More Parastoo Abtahi, expert in human-computer interaction, joins the faculty Read More Holographic displays offer a glimpse into an immersive future Read More Marcel Dall’Agnol joins the department as teaching faculty Read More Grad alum Avi Wigderson wins Turing Award for groundbreaking insights in computer science Read More Welcome Welcome to the Department of Computer Science at Princeton University. Princeton has been at the forefront of computing since Alan Turing, Alonzo Church and John von Neumann were among its residents. Our department is home to about 60 faculty members, with strong groups in theory, networks/systems, vision/graphics, architecture/compilers, programming languages, security/policy, machine learning, natural language processing, human-computer interaction, robotics, and computational biology. Research Computational Biology Computer Architecture Economics & Computation Human-Computer Interaction Machine Learning Natural Language Processing Programming Languages & Compilers Public Law & Policy Robotics Security & Privacy Systems & Networking Theory Vision & Graphics News May 16th, 2024 Brian Kernighan recognized by Princeton Engineering for outstanding service May 9th, 2024 Huacheng Yu wins CAREER award, supporting research on data structures and streaming algorithms May 1st, 2024 Science has an AI problem. This group says they can fix it. News archive Events 7 Aug Srikar Kasi FPO (CS 301 & Zoom) Full calendar and archive Follow us: Undergraduate Program Advisers & Contacts Becoming a CS Major Independent Work & Theses Undergraduate Program FAQ Certificate Program Minor Program Funding for Student Group Activities Student Life Jobs & Careers Graduate Program Admissions Requirements Doctoral Degree Master’s Degree FAQ Funding General Examination Fellowship Opportunities Travel Reimbursement Policy Communication Skills Courses Course Schedule Course Catalog Research Research Areas Interdisciplinary Programs Technical Reports Computing Facilities People Faculty Researchers Technical Staff Administrative Staff Graduate Students Undergraduate Students Graduate Alumni Diversity & Outreach Climate and Inclusion Committee Resources for Undergraduate & Graduate Students Outreach Initiatives Resources for Faculty & Staff About Contact Us Visit Us News and Events Directory Job Openings © 2024 The Trustees of Princeton University. Terms of Use | Privacy Policy | Site Map"
}