{
  "id": 2,
  "date": "2024-05-18T18:22:53.607992",
  "url": "https://gradfutures.princeton.edu/explore-pathways/podcast",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Home Explore Pathways Section Menu Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Career Outcomes The GradFUTURES Podcast All Episodes [GradFUTURES Podcast] America's Graduate Adviser: A Conversation with Leonard Cassuto Join Leonard Cassuto (author of Academic Writing as if Readers Matte r (forthcoming), The New PhD and The Graduate School Mess, among many other books) and Ph.D. student Hellen Wainaina to discuss graduate education's past, present, and future. Their wide-ranging conversation touches on graduate student-centered graduate education, mentorship, academic employment, teaching in a global context, writing for the public, tenure, PhDs as \"information specialists,\" academic freedom (and academic responsibility), how universities can help prepare graduate students for a range of careers, and much more! [GradFUTURES Podcast] Finding Fulfillment in France: A Conversation with Natalie Berkman Join Natalie Berkman *18 and Ph.D. student Hellen Wainaina for an engaging and personal conversation about how priorities can shift during graduate school, and how a supposed plan \"B\" can turn out to be a plan A. You'll hear about how a Ph.D. in French prepared Natalie well for a management level position, and the ways her post-Ph.D. life has included a continuation of her research agenda, as well as advocacy for career diversity. [GradFUTURES Podcast] New Philosophies for Graduate Education: A Conversation with Barry Lam *07 Join Barry Lam *07 and Ph.D. student Hellen Wainaina for an engaging and personal conversation about the ways they are rethinking what a Ph.D. can be. You'll be encouraged to center your own strengths, values, and preferences, and you'll hear firsthand about how the ways academia values public scholarship is changing--and why it must! [GradFUTURES Podcast] Telling the Scientific Story: A Conversation with Jason McSheene *15 Hellen Wainaina (GS, ENG) talks with Jason McSheene, *15 , a Medical Science Communications Specialist at Meditech Media. Jason earned his PhD from Princeton’s Department of Molecular Biology. While at Princeton, he created and co-hosted a podcast, “PhD in Progress” with his peers to  have honest, authentic conversations about their professional perspectives and aspirations. Jason talks about fulling his purpose, to champion education, equity, and empathy, through a myriad of  professional and personal opportunities. [GradFUTURES Podcast] 21st Century Graduate Education: A Conversation with Sarah-Jane Leslie *07 Hellen Wainaina (GS, ENG) talks with Sarah-Jane Leslie *07 , Class of 1943 Professor of Philosophy. Sarah-Jane has previously served as Dean of the Graduate School and Vice Dean for Faculty Development in the Office of the Dean of the Faculty. (n.b. This interview was recorded prior to Rodney D. Priestley’s appointment as the current Dean of the Graduate School.) Leslie is an affiliated faculty in the Department of Psychology and various other centers and programs across Princeton. The conversation opens up with the founding vision behind GradFUTURES, with Sarah-Jane addressing the misconception that doctoral training is only about preparing students for academic positions in universities. It is essential for both faculty and members of the administration to, she says, “recognize the imperative to prepare Ph.D. students to feel equipped and empowered to explore the entire range of career possibilities available to them.” [GradFUTURES Podcast] Unexpected Career Turns: A Conversation with Ann Kirschner *78 In the inaugural episode, Hellen Wainaina (GS, ENG) talks to Ann Kirschner *78 , University Professor at The City University of New York, author, and entrepreneur. Ann reflects on the unexpected turns her career has taken since earning a Ph.D. in English at Princeton. From working in the early days of cable television to becoming the first digital strategist for the National Football League, where she launched NFL.COM and SUPERBOWL.COM, Ann weighs in on the value of \"knowing what you know,\" understanding the value of graduate education beyond the academy, the adjunct system and the future professoriate, and the dignity of work. [GradFUTURES Podcast] Season 1 Trailer: \"Broadening the Impact of the PhD Within and Beyond the Academy\" The trailer for the GradFUTURES Podcast was premiered live at the 2022 GradFUTURES Forum! Enjoy a sampling of conversations from our first two guests: Sarah-Jane Leslie *07 (Philosophy) and Ann Kirschner *78 (English), who have both been instrumental in the creation and expansion of GradFUTURES, and both are at the heart of graduate student professional development efforts at Princeton. Our Team Hellen Wainaina, GS, ENG University Administrative Fellow Host & Executive Producer, GradFUTURES Podcast Francine Henry Audio Engineer, GradFUTURES Podcast Rebekah Haigh, GS, REL Community College Teaching Fellow University Administrative Fellow Social Impact Fellow Genevieve Allotey-Pappoe, GS, MUS University Administrative Fellow Social Impact Fellow GradFUTURES Podcast: Our Why Our podcast centers on the futures of PhDs: both those in training at Princeton, and Princeton graduate alums who are in and beyond academia. We tell the professional development stories of graduate students, graduate alums, and those who partner and collaborate with them! Find us on Apple Podcasts , Google Podcasts , Spotify , Audible , and Pocket Casts , and more. Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}