{
  "id": 2,
  "date": "2024-05-18T18:22:41.302927",
  "url": "https://gradschool.princeton.edu/admission-onboarding/prepare/required-tests",
  "university_name": "Princeton University",
  "title": "Graduate School",
  "content": "Graduate School Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Admission & Onboarding Submenu Admission & Onboarding Explore Prepare Submenu Deadlines and Fees Statement of Academic Purpose Resume / Curriculum Vitae Letters of Recommendation Transcripts Personal Essay Fall Semester Grades Required Tests Writing Sample Statement of Financial Resources Apply Review Admission Decision Onboard & Arrive Submenu Final Transcripts Immunizations & University Health Services Forms I-9: Employment Eligibility Verification Nondegree Programs Submenu Research Collaborators Submenu Visiting Student Research Collaborators (VSRC) Ecole Normale Superieure Paris (ENS) Exchange Freie Universität Berlin Trailing Nondegree Students Exchange Students Submenu BGSAS Berlin DAAD-German Sciences Po HUJI Jerusalem Princeton-Humboldt SNS Pisa U. Tokyo Visiting Students Submenu Daniel M. Sachs Scholarship Procter Visiting Fellowships Fleet Fellowship Graduate Visiting Student Qualifying Nondegree Students Review Admission Decision & Onboard Academics Submenu Academics Degrees & Requirements Submenu Fields of Study Submenu Program Offerings Standard Requirements Advising Requirements General Exam Submenu Incidental Master’s Degree Dissertation & FPO Advanced Degree Application Process Submenu Degree Deadlines Final Master's Degree Requirements Enrollment, Status & Progress Submenu Semester Sign-In Enrollment Statuses Submenu Degree-Seeking Statuses Former Degree-Seeking Statuses Status Changes and End of Student Benefits Reenrollment Courses, Research & Teaching Submenu Course Information Submenu Curriculum Management Teaching Submenu Collaborative Teaching Initiative in the Humanities and Social Sciences Academic & Research Integrity Opportunities, Resources & Support Submenu Partnerships, Exchanges & Cross-Registration Submenu IUDC Princeton-Rutgers IvyPlus Exchange ENS Paris Freie Univ. Berlin BGSAS Berlin DAAD Sciences Po HUJI Jerusalem Humboldt Exchange SNS Pisa U. Tokyo External Opportunities Learning, Teaching & Research Support Submenu Learning Support Teaching Support Research Support Time Off Advising & Mentoring Submenu Resources for Students Resources for Faculty Graduate Student Mentoring Report Academic Grievance Process Financial Support Submenu Financial Support Financial Support Model Submenu Funding Calendar, University Rates & Costs Ph.D. Funding: Humanities & Social Sciences Ph.D. Funding: Natural Sciences & Engineering Dissertation Completion Funding Submenu Dean's Completion Fellowship / PGRA Master’s Degree Funding Nondegree Students Fellowships Submenu Princeton Fellowships External Fellowships Fellowship Coordination NSF Fellowships Assistantships Graduate Student Employment Submenu Policies & Guidelines Additional Funding & Support Submenu Student Activity Funding Loans & Work-Study Submenu Federal Student Loans Federal Work Study Private Student Loans Code of Conduct Assistance Programs Military-Connected Students Submenu Financial Shopping Sheet AmeriCorps Understand Your Finances Submenu My Financials Student Taxes Financial Literacy Financial Wellness Fellows Program Tiger Cents Chronicles Professional Development Submenu Professional Development About GradFUTURES Submenu Meet the Team Professional Competencies For Current Students Submenu Sharpen Skills Forge Connections Gain Experience Explore Pathways Partner with Us Professional Development Events GradFUTURES Forum GradFUTURES Podcast Diversity Student Experience Submenu Student Experience Residential Life Submenu The Graduate College Submenu Facilities Porter's Lodge Lawrence Apartments Lakeside Apartments Dining Student Life Submenu Orientation Hooding and Recognition Ceremony Submenu Faculty Info Regalia Frequently Asked Questions Special Events High Tables Get Involved Submenu Student Organizations Plan an Event Student Govt & Advocacy Affinity Groups Other Ways to Engage Meet the Team Support & Resources Submenu Family-Focused Submenu Childbirth & Adoption Child Assistance Program Health/Wellness Submenu Graduate Advance Medical Expense Assistance Safety Resources Crisis Support Transportation/Travel Books/Technology Conduct & Standards Alumni About SubMenu Dean's Welcome Our Mission Program Metrics SubMenu Admission Statistics Enrollment Statistics Degree Counts and Time to Degree Analysis Ph.D. Completion and Cohort Analysis Ph.D. Long-term Career Outcomes Governance SubMenu Faculty Roles & Graduate Committee Requirements Our History SubMenu Architectural Tour Carillon Honorific Recipients Teaching Awards Information about Graduate Student Unionization SubMenu Communications from the Graduate School Student Support and Benefit Highlights Peer Institution Collective Bargaining Agreements FAQs about Graduate Student Unionization News Events Policies Admin Portal Apply Log in Search Search Home Admission and Onboarding Prepare Your Application Section Menu Explore Prepare Submenu Prepare Deadlines and Fees Statement of Academic Purpose Resume / Curriculum Vitae Letters of Recommendation Transcripts Personal Essay Fall Semester Grades Required Tests Writing Sample Statement of Financial Resources Apply Review Admission Decision Onboard & Arrive Nondegree Programs Required Tests Degree programs may require Graduate School applicants, including master’s students and those not applying directly out of college, to submit valid test scores to be considered for admission. If your native language is not English, you must meet English language proficiency requirements and may be required to submit TOEFL, IELTS, or DET test scores. The Graduate School does not have a minimum score requirement; each department or program may set its own. The Graduate School does not have average GRE scores, however, departments or programs may. Send test scores no later than three weeks before the degree program application deadline to ensure receipt of the official score report. Test scores received after the deadline will still be matched to your application; however, faculty may have already begun their review of your application without your test scores. No offers of admission will be made if required scores are not in the application. You do not need to wait on test scores to submit your application. If your application is on file when scores are received, we will match them to your application within seven business days. GRE Applicants may be required to submit valid General Test scores from Educational Testing Service (ETS). Other than the GMAT exception noted below, no other test scores (including the LSAT) may be submitted in their place. For more information about the GRE , contact ETS . GRE Requirements: General & Subject Tests Refer to the GRE table to determine if the GRE General Test is required. If the department or program to which you wish to apply requires GRE scores, they may not be waived. Required : Applicants need to submit GRE scores as part of the application requirements for the department or program to which they are applying.  Scores will be reviewed as part of the admission review process. Required GRE scores cannot be waived. Optional/Not Required : Applicants are not required to submit GRE scores as part of the application requirements for the department or program to which they are applying.  If scores are submitted by an applicant, they may be reviewed as part of the admission review process.  Applicants who do not submit scores will not be put at a disadvantage. Not Accepted : Applicants do not need to submit GRE scores as part of the application requirements for the department or program to which they are applying.  If scores are submitted by an applicant, they will not be reviewed as part of the admission review process. GRE Table: Requirements for Fall 2024 Admission Graduate School Department GRE General Test Required? Subject Test Required? Anthropology Not Accepted for fall 2024 admission Atmospheric and Oceanic Sciences Optional/Not required for fall 2024 admission Applied and Computational Math Optional/Not required for fall 2024 Subject test in Mathematics, Physics, or related field - Optional/Not required for fall 2024 admission School of Architecture - Ph.D. Optional/Not required for fall 2024 admission School of Architecture - Master's Optional/Not required for fall 2024 admission Art and Archaeology Optional/Not required for fall 2024 admission Astrophysical Sciences Optional/Not required for fall 2024 admission Subject test in Physics - Optional/Not required for fall 2024 admission Bioengineering Optional/Not required for fall 2024 admission Biophysics Optional/Not required for fall 2024 admission Subject test in Physics or Biology - Optional/Not required for fall 2024 admission Chemical & Biological Engineering Not Accepted for fall 2024 admission Civil and Environmental Engineering Optional/Not required for fall 2024 admission Chemistry Optional/Not required for fall 2024 admission Subject test in Chemistry or Physics - Optional/Not required for fall 2024 Classics Optional/Not required for fall 2024 admission Comparative Literature Optional/Not required for fall 2024 admission Computer Science Not Accepted for fall 2024 admission East Asian Studies Optional/Not required for fall 2024 admission Economics Required for fall 2024 admission Ecology and Evolutionary Biology Optional/Not required for fall 2024 admission Subject test in Biology - Optional/Not required for fall 2024 admission Electrical and Computer Engineering Optional/Not required for fall 2024 admission English Optional/Not required for fall 2024 admission Finance Optional/Not required for fall 2024 admission - (will also accept GMAT) French and Italian Not Accepted for fall 2024 admission Geosciences Not Accepted for fall 2024 admission German Optional/Not required for fall 2024 admission History Optional/Not required for fall 2024 admission History of Science Optional/Not required for fall 2024 admission Mechanical and Aerospace Engineering Not Accepted for fall 2024 admission Mathematics Not Accepted for fall 2024 admission Subject test in Mathematics - Not accepted for fall 2024 admission Molecular Biology Optional/Not required for fall 2024 admission Music Composition Not accepted for fall 2024 admission Musicology Not accepted for fall 2024 admission Near Eastern Studies Optional/not required for fall 2024 admission Neuroscience Optional/not required for fall 2024 admission Operations Research and Financial Engineering Optional/Not required for fall 2024 admission Subject test in Mathematics - Optional/Not required for fall 2024 admission Philosophy Optional/Not required for fall 2024 admission Physics Optional/Not required for fall 2024 admission Subject test in Physics - Optional/Not required for fall 2024 admission Politics Required for fall 2024 admission Population Studies Required for fall 2024 admission Princeton Plasma Physics Optional/Not required for fall 2024 admission Subject test in Physics - Optional/Not required for fall 2024 Princeton School of Public and International Affairs - Ph.D. Optional/Not required for fall 2024 admission Princeton School of Public and International Affairs -  MPP Not accepted for fall 2024 admission Princeton School of Public and International Affairs - MPA and MPA/JD Required for fall 2024 admission Psychology Optional/Not required for fall 2024 admission Quantitative & Computational Biology Not Accepted for fall 2024 admission Quantum Science and Engineering Optional/Not required for fall 2024 admission Subject test in Physics, Chemistry,  or Math - Optional/Not required for fall 2024 Religion Not Accepted for fall 2024 admission Slavic Languages and Literatures Optional/Not required for fall 2024 admission Sociology Optional/Not required for fall 2024 admission Spanish and Portuguese Optional/Not required for fall 2024 admission GRE Planning and Deadlines Visit the ETS website for upcoming test dates. Please have all scores sent by the deadline for fullest consideration. GRE Home Testing The Graduate School will accept the GRE General Test at Home version. Currently, ETS has no plans to change the GRE Subject tests, which are only offered in September, October, and April. Valid GRE Scores & Reporting We consider the highest score from each section, but the department or program has the ability to see all scores and components. GRE scores are valid for five years from the test date. For questions about the validity of GRE scores, please contact ETS. If ETS is able to send valid scores, we will accept them. Partial test scores are not accepted as a student who chooses to respond to only one section of the test per sitting is testing under different circumstances than those who took all three sections of the test on one test date. GMAT Applicants applying to the Department of Finance may submit valid GMAT scores in place of GRE scores. No other department or program accepts GMAT. GMAT is offered on a monthly basis. For more information, visit GMAT . GMAT Online The GMAT™ Online exam is an online remote proctored solution developed to support candidates during the disruption to test center-based delivery during the COVID-19 pandemic. Learn more . Valid GMAT Scores & Reporting GMAT scores are valid for five years. For questions about the validity of GMAT scores, please contact GMAT. If GMAT is able to send valid scores, we will accept them. When registering to take the GMAT, please request that scores are sent to Princeton University. Graduate Admission will update the submitted application checklist when the scores are received. It can take up to two weeks for us to receive the official score report from the administrator plus an additional seven days for scores to match them  to the submitted application. Please monitor the submitted application checklist to confirm scores have been received. English Language Tests Graduate students must demonstrate a level of oral proficiency in the English language sufficient to participate successfully in the various activities that comprise a graduate education, including classwork, research, research presentations, group meetings, project teamwork, and teaching undergraduates. Please view our English Language Proficiency Policy for more information. The three internationally recognized tests of English language proficiency which we accept are the Test of English as a Foreign Language (TOEFL), the International English Language Testing System (IELTS), and Duolingo English Test (DET). The following applicants are not required to submit English language test scores: Applicants whose primary language is English. Primary language is defined as the language that someone communicates in most frequently and in most situations when speaking, reading, and writing. Applicants whose undergraduate instruction is entirely in English as certified by the institution and for whom the degree will be awarded prior to anticipated enrollment at Princeton. Applicants whose graduate study was on a full-time basis for at least one year where instruction is entirely in English as certified by the institution. All other applicants must submit valid TOEFL, IELTS or DET scores. TOEFL Educational Testing Service administers the internet-based TOEFL. The Graduate School prefers scores from the iBT TOEFL. Applicants who take the test in a country which does not offer the iBT TOEFL should take the TOEFL Paper-delivered Test. For more information contact contact ETS . TOEFL iBT Home Edition We will accept the TOEFL iBT Home Edition. For more information, please visit the ETS website . TOEFL Scores & Reporting English language proficiency tests are a Graduate School requirement and although the Graduate School does not have a minimum score requirement to submit an application, please check with the department to which you wish to apply to see if they do. We are currently not accepting MyBest scores. If multiple score reports are sent to us, we consider the highest score from each section of score reports which we have received. TOEFL scores expire after two years from the original test date and will not be available from ETS. Please contact ETS if there are questions about the validity of the TOEFL scores. If ETS is able to send valid scores, we will accept them. TOEFL Scores and Princeton’s English Placement Test Admitted students may be assigned the English Language Program (ELP) code based on their TOEFL score, meaning they will be required to be tested here and may have to take courses with the ELP depending on how they do with that testing. IELTS IELTS Academic is administered jointly by the British Council, IDP Education Australia, and the University of Cambridge ESOL Examinations (Cambridge ESOL) . IELTS Online We will accept IELTS Online . IELTS Indicator is not accepted. IELTS Scores & Reporting English language proficiency tests are a Graduate School requirement and although the Graduate School does not have a minimum score requirement to submit an application, please check with the department to which you wish to apply to see if they do. We consider the highest score from each section, but the department or program has the ability to see all scores and components. IELTS scores expire two years after the original test date. For questions about the validity of the IELTS scores, please contact the test administrator. Please do not have tests mailed to us. Have IELTS Academic scores sent electronically through e-delivery. No institution code is required. The address, for identification purposes only, is: Princeton University, Graduate Admission, One Clio Hall, Princeton, NJ 08544. We do NOT verify Test Report Forms (TRF’s). IELTS Scores and Princeton’s English Placement Test Admitted students may be assigned the English Language Program (ELP) code based on their IELTS score, meaning they will be required to be tested here and may have to take courses with the ELP depending on how they do with that testing. DET Duolingo administers DET which is entirely computer-based and can be taken from any location with an internet connection. DET Scores & Reporting English language proficiency tests are a Graduate School requirement and although the Graduate School does not have a minimum score requirement to submit an application, please check with the department to which you wish to apply to see if they do. If multiple score reports are sent to us, we consider the highest score from each section of score reports which we have received. DET scores expire after two years from the original test date. Please contact Duolingo if there are questions about the validity of the DET scores. DET Scores and Princeton’s English Placement Test Admitted students may be assigned the English Language Program (ELP) code based on their DET score, meaning they will be required to be tested here and may have to take courses with the ELP depending on how they do with that testing. Tracking Your Scores What are Princeton’s institution and department codes? For GRE or TOEFL, the institution code for Princeton is 2672 and no department code is required. Graduate Admission will receive all score reports with this code regardless of whether a department code is selected or not. It can take up to two weeks for us to receive official score reports plus an additional seven days for scores to match to the submitted application. Please monitor your submitted application checklist to confirm scores have been received. Can I submit expired, partial, or self-reported scores? The University will not accept expired, self-reported, copies of, or partial test scores. There is no place in the application to self-report scores. We only accept the official score reports sent to us from the test administrator. Do I need to resubmit scores sent previously? If your test scores have not expired, you do not need to send them again. You will see the test dates on your submitted application checklist within seven business days. If you do not, please email [email protected] . How do I know if you received my test scores? If you have submitted your application, you will see the test dates on the submitted application checklist if the scores have matched. You will not see the test scores. If you see a date, it means the scores have been received. I see a test date on my checklist, but it is not the date I took the test. What should I do? Send an email to [email protected] . Include your name as it appears on your application, name as it appears on the test report if different, the test date, your date of birth, and the email you used for the exam. What do I do if there is a discrepancy in my name between my test and application? If the name entered on the test report is different than the name on the application, the test scores may not match. If the applicant has only one name, please enter it in the last name field and a period (.) in the first name field. If there is a name discrepancy, please email [email protected] . I had my scores sent and submitted my application but still do not see the test dates on my application checklist. What should I do? If it has been more than three weeks since you took your test or had your scores sent AND more than seven business days since you submitted your application, you can email [email protected] . Include your name as it appears on your application, name as it appears on the test report if different, the test date, your date of birth, and the email address you used for the exam. Back to Top Footer Princeton University Graduate School Clio Hall, Princeton, NJ, 08544 Contact: [email protected] Twitter Instagram Facebook Digital Accessibility © 2024 The Trustees of Princeton University"
}