{
  "id": 2,
  "date": "2024-05-18T18:22:54.573457",
  "url": "https://gradfutures.princeton.edu/gradfutures-professional-development-hub",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search GradFUTURES: The Professional Development Hub We empower graduate students to create their future(s)—on their terms. : Learn More about Our Work Learn More about Our Work In a fast-changing professional landscape, graduate students are uniquely situated to engage their futures with creativity, insight, and in-demand skills that reveal multiple options within the academic, government, nonprofit, and private sectors. At Princeton, we believe professional development belongs at the foundation of a modern graduate education. Graduate-student centered by design, GradFUTURES is a dynamic hub that empowers graduate scholars, researchers, and leaders to succeed in graduate school and craft futures that are fully their own. Vision, Mission & Values Find both context and inspiration in the shared vision for professional development at Princeton that unites us in all that we do. Five Pillars of GradFUTURES Strategy Learn about our professional development model, which emphasizes transferable skills, individualized pathways, and lifelong career optionality. An integrative approach that activates possibilities Professional development at Princeton is as diverse and multifaceted as our scholarly community—and it begins on day one. A broad range of programming emphasizes the in-demand skills and insights that open doors and create optionality within and beyond the academy. Recognizing the unique needs of graduate students, GradFUTURES programs and experiences are also designed to enhance one’s research and teaching while at Princeton. Our Focus: Progressive learning and the acquisition of professional skills and interdisciplinary competencies Exposure to diverse Ph.D. pathways , emerging fields, and trends across fields Bespoke immersive experiences and experiential opportunities Transformative connections between graduate students, alumni, and industry leaders Learn more about the framework “Graduate student professional development helps students build important professional skills which serve as a catalyst for interdisciplinary collaboration, creativity, and innovation. By cultivating connections between our graduate students, faculty, alumni, and partners within Princeton’s Innovation Ecosystem, we are building on-ramps to a diverse array of career paths including entrepreneurship.\" – Rodney D. Priestley , Dean of the Graduate School, Pomeroy and Betty Perry Smith Professor of Chemical and Biological Engineering “My advice for graduate students at Princeton is to take advantage of the university's extensive resources and network. There are many offices on campus, such as GradFUTURES, that are dedicated to developing students' academic, professional, and personal development skills. The knowledge that you gain from their programs can clarify and complement your intended career path. GradFUTURES has helped me build confidence in my soft skills, learn about various career paths, and connect me to some amazing individuals.” – Camila Llerena-Olivera , GS, CEE Calls to Action on Graduate Student Professional Development A Drive for Transformation Nearly all scholarly and professional associations—including the Council of Graduate Schools (CGS) and the Association of American Universities (AAU)—have called for a transformation in graduate student professional development, focusing on career diversity. Princeton's efforts to reimagine graduate student professional development have been informed by national trends as well as a comprehensive self-study described in Task Force on the Future of the Graduate School Report, 2015 . Key Recommendations: Shifting institutional culture to expose graduate students to the diverse array of pathways within and beyond the academy Increasing the transparency of outcomes data and relabeling categories to equitably recognize the range of Ph.D. outcomes across industries Improving curricular and co-curricular efforts that build professional competencies and support successful progression across fields “Some may believe that graduate school is great to advance one’s knowledge and personal growth, but that the expertise it fosters verges on the kind of specialization that might prove too narrow in the professional world. This sort of credence is especially widespread when it pertains to certain fields, like the Humanities. More than mere ‘mythbusters', the leadership and opportunities promoted by GradFUTURES provide students with invaluable practical tools that will help them magnify their professional potential.\" – André Benhaïm , Professor, Director of Graduate Studies, Department of French & Italian Let’s Connect Have an idea? Interesting in collaborating with GradFUTURES to create programs and experiences for graduate students? We are always interested in connecting with like-minded champions of gradute professional development! Reach out Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}