{
  "id": 2,
  "date": "2024-05-18T18:22:51.343099",
  "url": "https://gradfutures.princeton.edu/gain-experience",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Photo: Sameer A. Khan / Fotobuddy Section Menu Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Gain Experience Pursue opportunities for personal and professional growth—and experience where your strengths and interests align. GradFUTURES experiential opportunities help you gain vital experience while exploring professional paths within the academic, government, nonprofit, and private sectors. Through highly customized fellowships, internships, and special projects, you can apply discipline-specific skills, build interdisciplinary team experience, and receive one-on-one mentoring. These experiences are: Flexible & part-time: Up to 10 hours / week during the summer or academic year Paid*: Nearly all opportunities are funded through GradFUTURES Open to International Students*: Most fellowships do not require work authorization Fellowship & Internship Programs GradFUTURES Micro-Internships in Industry Participate in a unique applied learning experience and hone professional skills and competencies while working under the direction of an industry mentor. GradFUTURES Pre-Matriculation Internships Prior to beginning your first semester of doctoral study, gain valuable professional experience and industry mentorship. GradFUTURES Higher Education Leadership Fellowships Get a behind-the-scenes look at leadership roles within higher education administration, participate in a meaningful project, and receive mentorship from a senior leader. GradFUTURES Social Impact Fellowships Gain interdisciplinary project team experience and receive 1:1 mentoring while contributing to an organization’s social impact mission. Graduate Student Professional Development Associates Co-create programs and events that reflect graduate students' unique interests, input, and innovative ideas. Community College Teaching Fellowships Shadow and receive mentoring from a tenured community college faculty member one semester, and design and teach a course of your own the next. University Administrative Fellowships Gain a deeper understanding and appreciation for university administration via staff mentorship, shadowing, and immersive projects. Additional Programs to Explore The Annual GradFUTURES Forum Professional Development Conference Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. “The press on this fellowship online led to some tenure-track job offers; people were headhunting me because of this diversity work. I’m negotiating a job offer right now. I’m grateful for the platform that gradFUTURES created for graduate students to realize projects and initiatives that we otherwise would not be able to find and participate in.\" – Joyce Chen , GS, MUS Create a Graduate Student Experience! Email Us to Learn More About Partnership View Fellowship & Internship Information for Nonprofit & Public Sector Partners Fellowship and Internship News & Updates University Administrative Fellowship Spotlight: Lindsay Griffiths (GS, English) GradFUTURES Social Impact Fellowship Spotlight: Noel Park (GS, Molecular Biology) GradFUTURES Social Impact Fellowship Spotlight: Isla Xi Han (GS, Architecture) GradFUTURES Social Impact Fellowship Spotlight: Elaine Tsui (GS, Chemistry) GradFUTURES Social Impact Fellowship Spotlight: Margaret Kurkoski (GS, Art & Archeology) GradFUTURES Summer Pre-matriculation Fellowship Spotlight: Anna Hancock (GS, Spanish & Portuguese) GradFUTURES Social Impact Fellowship Spotlight: Jonathan Aguirre (GS, Spanish & Portuguese) GradFUTURES Social Impact Fellowship Spotlight: Yuzhou Bai (GS, East Asian Studies) Funding Note and Graduate Student Employment Disclaimer All graduate students must adhere to the Graduate Student Employment policy when participating in an opportunity that is compensated or funded by an external entity. This includes participating in internships and receiving compensation from private sector organizations, paid positions at national government labs or research institutes, and research assistantships funded by institutions outside of Princeton. Graduate students must obtain approval from their faculty adviser prior to acceptance of a position and must also complete an External Opportunity Application Form (link found on this site). Faculty advisers may submit a note of support using this form . Additionally, all international graduate students must review and comply with guidelines on the Davis International Center’s Employment Page so as not to risk violating their visa immigration status. *Micro-Internships in Industry with partner organizations in the private sector may require work authorization. Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}