{
  "id": 2,
  "date": "2024-05-18T18:22:48.791620",
  "url": "https://gradfutures.princeton.edu/explore-pathways",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search Photo: Sameer A. Khan / Fotobuddy Section Menu Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Career Outcomes Explore Pathways Sharpen your vision of the future and build awareness of in-demand roles, industries, and skills through research and exploration of diverse professional pathways. Graduate school is both a career launch point and an ideal time for personal and professional exploration. We invite you to invest time in considering the multiple pathways that are open to you, and the many ways in which your graduate education will serve as a career differentiator within the academy and beyond. By engaging the insights shared by our graduate alums and partners and pursuing hands-on opportunities across fields, you can set your sights forward while deepening the impact of your graduate research. Here, we have gathered a wide range of resources that speak to the diverse interests and talents of Princeton’s graduate student cohorts. Long-Term Career Outcomes Nearly half of Princeton’s doctoral students pursue opportunities in fields beyond academia. We provide a supportive climate, resources, and professional development opportunities to enhance graduate student outcomes both within and outside of the academy, and take a transparent approach to reporting long-term career outcomes. Explore outcomes by division on the Graduate School Website . Featured Programs Humanities Expedition & Lab Explore the many ways in which a graduate degree in the humanities and social sciences can have an impact in the academy and beyond. Fellowship Spotlight Series Find out what Princeton graduate students have to say, in their own words, as they share their experiences in one of the GradFUTURES Fellowship programs. The GradFUTURES Podcast Listen to the professional development stories of graduate students, graduate alums, and those who partner and collaborate with them! Trailblazers Beyond the Tenure Track: Graduate Alum Stories & Profiles Develop a vision of the journey ahead by exploring the experiences of trailblazers who have pursued careers beyond the tenure track. Research and Career Resources Access a range of free resources that are designed to support you in your development, progression, and career outcomes. GradStories Read graduate student and alum stories that showcase the impact of professional development, and the ways in which they have applied their skills and competencies. “Most graduate students spend most of their time in their departments. But if they do that, they’ll miss the huge range of support services, professional training and experiential opportunities that the Graduate School offers! GradFUTURES, in particular, broadens graduate students’ horizons to look not only at tenure-track jobs after the PhD but also at a whole range of other career possibilities. In these challenging times, it is good to know that someone with a PhD can launch many different types of careers—and that the Graduate School can launch many different types of graduate students.\" – Kim Lane Scheppele , Laurance S. Rockefeller Professor of Sociology and International Affairs in the Princeton School of Public and International Affairs and the University Center for Human Values Additional Programs to Explore Interdisciplinary Learning Cohorts Explore interdisciplinary seminars and co-curricular opportunities that bring together students, alums, faculty, and industry partners. Future Faculty Workshops Learn about the professional lives of faculty and the landscape of faculty roles within diverse higher education institutions in the U.S. The Annual GradFUTURES Forum Professional Development Conference Prepare for multiple futures through sessions with real-time relevance to graduate school that provide a glimpse into a world of possibilities beyond. Community College Teaching Fellowships Shadow and receive mentoring from a tenured community college faculty member one semester, and design and teach a course of your own the next. University Administrative Fellowships Gain a deeper understanding and appreciation for university administration via staff mentorship, shadowing, and immersive projects. GradFUTURES Micro-Internships in Industry Participate in a unique applied learning experience and hone professional skills and competencies while working under the direction of an industry mentor. GradFUTURES Pre-Matriculation Internships Prior to beginning your first semester of doctoral study, gain valuable professional experience and industry mentorship. Graduate Student Professional Development Associates Co-create programs and events that reflect graduate students' unique interests, input, and innovative ideas. “Research is very time consuming, but I think pausing briefly to consider what you would like to do after graduate school, and how to acquire the skills needed to get there, can make an especially big difference.” – Hansen Tjo , GS, CBE Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}