{
  "id": 2,
  "date": "2024-05-18T18:22:51.708478",
  "url": "https://gradfutures.princeton.edu",
  "university_name": "Princeton University",
  "title": "GradFUTURES",
  "content": "GradFUTURES Off screen link: Skip to content Off screen link: Skip to search Main Menu Menu Sharpen Skills Submenu Sharpen Skills Professional Competency Model Interdisciplinary Learning Cohorts GradFUTURES Forum Skill-building Workshops Submenu Future Faculty Workshops Creativity Workshops Focus on Future You(s) Princeton Startup Bootcamp Science & Arts Collaboration for Research Communication Science Policy Star Lessons in Leadership Forge Connections Submenu Forge Connections Graduate Alum Mentorship Program Graduate Alum-in-Residence Program GradFUTURES LinkedIn Group Gain Experience Submenu Gain Experience Social Impact Fellowships Community College Teaching Fellowships University Administrative Fellowships Higher Education Leadership Fellowships Micro-Internships in Industry Pre-Matriculation Internships Professional Development Associate Program Explore Pathways Submenu Explore Pathways Research and Career Resources Humanities Expedition & Lab GradFUTURES Podcast GradStories Submenu Fellowship Spotlight Series Trailblazers Beyond the Tenure Track Career Outcomes Partner with Us Submenu Partner with Us Academic Departments & Faculty Submenu Faculty Fellows in Professional Development Innovation Graduate Students Higher Ed Partners Graduate Alums Industry Partners Campus Partners Professional Development Working Group GradFUTURES Clio Hall Award GradFUTURES GRADitude Award About SubMenu Vision, Mission & Values Five Pillars of the GradFUTURES Strategy Professional Development Learning Framework Impact Reports Contact Us Events News GradFUTURES Forum Podcast Graduate School Log in Search Search GradFUTURES Create your future(s) . On your terms. 2024 GradFUTURES Forum Highlights & Recordings Thank you for joining us at the 2024 GradFUTURES Forum! Check out our YouTube Channel for recordings of select events! Graduate student centered. Sharpen Skills: Professional Competency Model> Aligned with your research. Explore Together: Interdisciplinary Learning Cohorts > Practical and experiential. Gain Experience: Fellowships and internships > Princeton University's Graduate Student Professional Development Hub GradFUTURES empowers graduate scholars to succeed in graduate school and create futures that are fully their own. Our programs are strategically designed to complement the Graduate School’s holistic support of graduate students, helping them explore, thrive, and find a sense of belonging while at Princeton.  In a fast-changing professional landscape, graduate students are uniquely situated to engage their futures with creativity, insight, and in-demand skills that reveal multiple options within the academy and beyond. Upcoming Events May 23 Bootcamp on Effective Research Mentorship: Part 2 of 3 May 23, 2024 , 10:30 am May 23 GradShares: \"Romantic Rocks, Indigenous Traces: Poetry, Geology, and Empire in Early America\" May 23, 2024 , 3:00 pm May 24 Special Collections Showcase May 24, 2024 , 2:00 pm May 28 Guided tour of \"Ulises Carrión: Bookworks and Beyond\" May 28, 2024 , 12:30 pm View All Events Check out the GradFUTURES Podcast! Visit our podcast page for a list of episodes, transcripts, and more! Watch 2023 GradFUTURES Forum Recordings! Revisit key moments from this year's forum, or enjoy an opportunity to experience them for the first time. With dozens of speakers, skill-building workshops, alumni panels, and networking sessions, the GradFUTURES Forum offered sessions with real-time relevance to success in graduate school and provide a glimpse into a world of possibilities beyond. Access the Videos Countless ways to engage! 8 Essential career skills that build competence and confidence ! 14 Learning cohorts focused on societal, industry, and/or global trends 150+ Professional development events per year 1,000+ GradFUTURES Professional LinkedIn group members News 2024 Clio Hall Awardees to be honored at GradFUTURES Forum April 2, 2024 Internship-Fellowship Fair To Connect Graduate Students with Mentors, Opportunities March 28, 2024 AAU leader to be recognized at GradFUTURES Forum March 28, 2024 [GradFUTURES Podcast] America's Graduate Adviser: A Conversation with Leonard Cassuto March 26, 2024 View All Footer Clio Hall, Princeton, NJ 08544 Contact: [email protected] GradFUTURES® logo by Kevin Fleming YouTube Facebook Twitter Instagram Join the GradFUTURES LinkedIn Group Digital Accessibility © 2024 The Trustees of Princeton University"
}