{
  "id": 6,
  "date": "2024-05-18T18:21:35.620055",
  "url": "https://www.washington.edu/admissions/undocumented/",
  "university_name": "University of Washington",
  "title": "Undocumented student resources",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academics at the UW Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Research at the UW Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving Admissions Admissions Undocumented student resources Undocumented student resources We are proud to be a university that wholeheartedly welcomes and supports undocumented students of all ethnicities and nationalities. We invite you to explore the services, opportunities and resources available to you throughout the various stages of your Husky Experience. Undocumented students are immigrants who entered the United States without inspection or overstayed their visas and are present in the United States with or without their parents. They face unique legal uncertainties and limitations within the U.S. educational system. The majority of undocumented students are characterized as youth that were brought to the United States by their parents at an early age and have lived in this country for a significant portion of their lives, learning the language and adapting to the same American customs taught to other students in schools. Many undocumented students are resilient individuals who have gone through the K-12 system, excel academically in high schools and wish to pursue a college education. Undergraduate Applying to the UW Get answers to the most frequently asked questions about the application process. FAQ Financial aid Find out what funding options are available to you. Learn more Campus Resources Explore resources available to support undocumented students at the University of Washington. Learn more Leadership Without Borders The Leadership Without Borders Center (LWB) is devoted to offering resources, support and guidance to undocumented students at the UW. Some of the LWB services include: Husky Dream Lending Library Access to College Success Foundation Navigators Leadership workshops and resources Community building and connections Learn more Finding Allies At the University of Washington we are committed to working with and for undocumented students. This is why at the Leadership Without Borders Center we work to connect undocumented students with allies across campus who can provide them with additional support and resources. Learn more Campus support If you’re considering applying to the University of Washington or just started as a new student, there are a range of campus resources available to help you at each UW campus. Seattle Bothell Tacoma Additional resources Graduate School Learn more about resources and funding options that are available to undocumented graduate students. Learn more Important laws and policies Review the state and federal laws and policies that directly impact undocumented students. Learn more Office of Minority Affairs & Diversity An even larger community of support is available to students through programs and services offered by OMA&D. Learn more University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}