{
  "id": 6,
  "date": "2024-05-18T18:22:11.680920",
  "url": "https://www.washington.edu/leadership/",
  "university_name": "University of Washington",
  "title": "Leadership at the UW",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu UW Leadership Regents President President Vice presidents Invite the president Provost Provost Vice provosts Deans and chancellors Invite the provost Foundation Initiatives University initiatives Population health Race & equity Innovation imperative Future of Teaching & Learning Husky experience Teaching & learning in the 21st century Transforming administration program Institutional assessment effort Community engagement Tri-campus Leadership at the UW President and executive vice presidents The president of the University of Washington is appointed by the UW Board of Regents to lead the University in advancing its mission as one of the world’s leading public research universities. The president is assisted in this effort by a range of leaders across the institution, including two executive vice presidents. University of Washington President Ana Mari Cauce is the 33rd president of the UW. A professor of psychology and member of the UW faculty since 1986, she was named president in October 2015. Under her leadership, the UW is advancing all areas of its academic, research and service missions, with initiatives focused on innovation, race and equity, and population health. Office of the President Provost and Executive Vice President for Academic Affairs Tricia Serio joined the University of Washington as provost and executive vice president for academic affairs in 2023. A biochemist, she also holds a faculty appointment in the UW School of Medicine’s Department of Biochemistry. As the University’s academic and budget officer, Dr. Serio leads the faculty and allocates resources to promote each student’s academic experience and success. Office of the Provost Executive Vice President for Medical Affairs Timothy H. Dellit , MD, was named CEO of UW Medicine, executive vice president for medical affairs and Paul G. Ramsey Endowed Dean of the UW School of Medicine on November 28, 2023. He held these same roles on an interim basis since July 1, 2022. He served previously as chief medical officer for UW Medicine, executive vice dean for clinical affairs for the School of Medicine, vice president for medical affairs and president of UW Physicians (UWP), a faculty practice plan with more than 2,800 members. UW Medicine University of Washington leadership directory Deans and chancellors Vice presidents Vice provosts UW Medicine College of Arts & Sciences Dianne Harris Dean of the College of Arts & Sciences dsh1@uw.edu 206-543-5340 Assistant: Julianna Jones juj@uw.edu 206-616-2106 College of Built Environments Renée Cheng Dean of the College of Built Environments rycheng@uw.edu 206-616-0634 Assistant: Brittany Faulkner bfaulk@uw.edu 206-221-3451 School of Dentistry André Ritter Dean of the School of Dentistry avritter@uw.edu 206-543-5982 Assistant: Gissela Baker gisselab@uw.edu 206-543-5980 College of Education Mia Tuan Dean of the College of Education mtuan@uw.edu 206-616-7854 Assistant: Melanie Mihara melsee@uw.edu 206-616-7854 College of Engineering Nancy Allbritton Dean of the College of Engineering nlallbr@uw.edu 206-543-1829 Assistant: Lucia Ersfeld luciap@uw.edu 206-543-1829 College of the Environment Maya Tolstoy Dean of the College of the Environment envdean@uw.edu 206-221-0908 Assistant: Jennie Paxson jpaxson4@uw.edu 206-221-0908 Continuum College Rovy Branon Vice Provost of Continuum College rbranon@uw.edu 206-685-6313 Assistant: Aviva Reuben Aviva Reuben 206-685-6306 Evans School of Public Policy and Governance Jodi Sandfort Dean of the Evans School of Public Policy and Governance jrs1@uw.edu 206-685-6886 Assistant: Julianne Slate Jslate5@uw.edu 206-406-7369 Foster School of Business Frank Hodge Dean of the Foster School of Business fhodge@uw.edu 206-221-5749 Assistant: Corinne Goellnitz goell@uw.edu 206-221-5749 The Graduate School Joy Williamson-Lott Dean of the Graduate School graddean@uw.edu 206-543-7468 Assistant: Jerry Pangilinan jlpang@uw.edu 206-543-7468 Information School Anind Dey Dean of the Information School anind@uw.edu 206-616-0985 Assistant: Kelli Jo Fullan kjfullan@uw.edu 206-616-7213 School of Law Tamara F. Lawson Dean of the School of Law lawdean@uw.edu 206-543-2586 Assistant: Nikole Blue nblue@uw.edu 206-616-5356 UW Libraries Simon Neame Dean of UW Libraries sneame@uw.edu 206-543-1763 Assistant: Linda Ambre lambre@uw.edu 206-543-1763 School of Medicine Timothy H. Dellit Dean of the School of Medicine thdellit@uw.edu 206-543-7718 Assistant: Michelle Fleming flemingm@uw.edu 206-543-7718 School of Nursing Allison Webel Interim Executive Dean of the School of Nursing awebel@uw.edu 206-221-2472 Assistant: April McMorris aprilmcm@uw.edu 206-221-2472 School of Pharmacy Jay Panyam Dean of the School of Pharmacy jpanyam@uw.edu 206-616-9953 Assistant: Trish Respalie respalie@uw.edu 206-543-5050 School of Public Health Hilary Godwin Dean of the School of Public Health hgodwin@uw.edu 206-685-7430 Assistant: JeShawna Schmidt jacs1007@uw.edu 206-685-6643 School of Social Work Michael Spencer Dean of the School of Social Work mspenc@uw.edu 206-685-2480 Assistant: Chantal Reynolds chantalr@uw.edu 206-685-1661 Undergraduate Academic Affairs Ed Taylor Vice Provost and Dean of Undergraduate Academic Affairs edtaylor@uw.edu 206-616-7175 Assistant: Fiona Starr Fstarr33@uw.edu 206-543-5011 Divisional deans for the College of Arts & Sciences Andrea Woody Divisional Dean, Social Sciences awoody@uw.edu 206-685-2663 Assistant: Elizabeth Hummer ehummer@uw.edu 206-616-2128 Dan Pollack Divisional Dean, Natural Sciences pollack@uw.edu 206 543-7045 Assistant: Scott Devenny sdevenny@uw.edu 206-543-7045 Brian Reed Divisional Dean, Humanities bmreed@uw.edu 206-543-5340 Assistant: Elizabeth Hummer ehummer@uw.edu 206-616-2128 Gabriel Solis Divisional Dean, Arts gpsolis@uw.edu Assistant: Scott Devenny sdevenny@uw.edu 206-543-7045 UW Bothell Kristin Esterberg Chancellor of UW Bothell uwbchlr@uw.edu 425-352-5220 Assistant: Mary Mahon mamahon@uw.edu 425-352-5220 Sharon Jones Vice Chancellor of UW Bothell Sjones23@uw.edu 425 352-3575 Assistant: Kathryn Rich Kathryn8@uw.edu 425-352-3276 UW Tacoma Sheila Edwards Lange Chancellor of UW Tacoma sredward@uw.edu 253-692-5646 Assistant: Noreen Slease nslease@uw.edu 253-692-4642 Andrew Harris Executive Vice Chancellor for Academic Affairs atharris@uw.edu 253-692-5646 Assistant: Heather Porter hlp3@uw.edu 253 692-4889 Academic Affairs Tricia R. Serio Provost and Executive Vice President for Academic Affairs provost@uw.edu 206-543-7632 Assistant: Rachel Northquist rachelno@uw.edu 206-221-3962 Visit the Office of the Provost Campus Community Safety Sally Clark Vice President of Campus Community Safety salclark@uw.edu 206-616-8401 Assistant: Cindy Adams cadams26@uw.edu 206-221-1403 Learn more about Campus Community Safety External Affairs Randy Hodgins Vice President of External Affairs rhodgins@uw.edu 206-616-8965 Assistant: Catherine Opie opiec@uw.edu 206-543-2562 Visit the Office of External Affairs Facilities Lou Cariello Vice President of UW Facilities cariello@uw.edu 206-543-5361 Assistant: Stephanie Parker parker8@uw.edu 206-616-1547 Learn more about UW Facilities Human Resources Mindy Kornberg Vice President of UW Human Resources mindyk@uw.edu 206-685-4730 Assistant: Hannah Barnett barnetth@uw.edu 206-685-4776 Learn more about UW Human Resources Information Technology Andreas Bohman Vice President and Chief Information Officer for UW Information Technology abohman@uw.edu Assistant: Millie Elliott milliee@uw.edu Learn more about UW Information Technology Minority Affairs and Diversity Rickey Hall Vice President and University Diversity Officer, Minority Affairs and Diversity rickey1@uw.edu 206-543-2441 Assistant: Melanie Buenavista meltru82@uw.edu 206-685-9355 Visit the Office of Minority Affairs and Diversity Student Life Denzil Suite Vice President for Student Life SLVP@uw.edu 206-543-4972 Assistant: Ruben Rodriguez ruben5@uw.edu 206-543-9462 Learn more about Student Life University Advancement Mary Gresch Senior Vice President for University Advancement and President, UW Foundation mgresch@uw.edu Assistant: Melissa Kreptul mkreptul@uw.edu 206-543-8222 Tamara M. Josserand Vice President for Development, University Advancement tmiche@uw.edu Assistant: Sajara Stark sajara@uw.edu Jack Martin Vice President for Marketing & Communications vpmc@uw.edu 206-616-2334 Assistant: Kim Mapes kimmapes@uw.edu Paul Rucker Vice President for Alumni & Stakeholder Engagement and Executive Director of the UW Alumni Association, University Advancement prucker@uw.edu Interim Assistant: Virginia Lerer vlerer@uw.edu Learn more about University Advancement UW Finance, Planning and Budgeting Sarah Norris Hall Senior Vice President and Chief Financial Officer sahall@uw.edu 206-543-4972 Assistant: Carole Davison cardm@uw.edu 206-543-8840 Jessica Bertram Vice President for University Business Services soderljm@uw.edu 206-543-4993 Jason Campbell Vice President for Finance & Budget Strategy and Deputy Chief Financial Officer jasonc26@uw.edu 206-685-9961 Learn more about UW Finance, Planning and Budgeting Academic and Student Affairs Philip J. Reid Vice Provost of Academic and Student Affairs pjreid@uw.edu 206-543-6147 Assistant: Lauren Stubbers last711@uw.edu 206-221-3821 Learn more Academic Personnel Frederick Nafukho Vice Provost of Academic Personnel fnafukho@uw.edu 206-616-2753 Assistant: Laura Hager laurakh@uw.edu 206-221-1405 Learn more Continuum College Rovy Branon Vice Provost of Continuum College rbranon@uw.edu 206-685-6313 Assistant: Rives Robertson rivesr@uw.edu 206-685-6306 Learn more Global Affairs Gayle Christensen Interim Vice Provost of Global Affairs vpglobalaffairs@uw.edu 206-543-1839 Assistant: Maddie Macmath m84261wc@uw.edu 206-543-1839 Learn more Innovation François Baneyx Vice Provost of Innovation and Director of CoMotion baneyx@uw.edu 206-543-3970 Assistant: Shoko Saji sbagwell@uw.edu 206-543-4387 Learn more Research Mari Ostendorf Vice Provost for Research vpresearch@uw.edu 206-685-1751 Assistant: Heather Herrera herrerah@uw.edu 206-685-1751 Learn more Undergraduate Academic Affairs Ed Taylor Vice Provost and Dean of Undergraduate Academic Affairs edtaylor@uw.edu 206-616-7175 Assistant: Fiona Starr micahlt@uw.edu 206-543-5011 Learn more Timothy H. Dellit, MD CEO, UW Medicine, Executive Vice President for Medical Affairs and Paul G. Ramsey Endowed Dean of the School of Medicine, University of Washington thdellit@uw.edu 206-543-7718 Assistant: Michelle Fleming flemingm@uw.edu 206-543-8085 Brad Simmons President, UW Medicine Hospitals & Clinics and Senior Vice President for Medical Affairs, University of Washington brad12@uw.edu 206-616-8277 Assistant: Pam Stern pamstern@uw.edu 206-685-5020 Jacqueline Cabe Chief Financial Officer, UW Medicine and Vice President for Medical Affairs, University of Washington jlcabe@uw.edu 206-616-9886 Assistant: Jason Rudd ruddj@uw.edu 206-616-9886 Becca Kelly Chief Advancement Officer, UW Medicine and Vice President for Medical Affairs, University of Washington rrkelly2@uw.edu 206-543-2661 Assistant: Cathy Sanford csanfo@uw.edu 206-221-1067 Anneliese Schleyer, MD, MHA Chief Medical Officer, UW Medicine and Vice President for Medical Affairs, University of Washington schleyer@uw.eduu 206-744-3000 Assistant: Angelica Perales asjp@uw.edu 206-543-6310 University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}