{
  "id": 6,
  "date": "2024-05-18T18:22:16.705448",
  "url": "https://www.washington.edu/diversity/",
  "university_name": "University of Washington",
  "title": "Explore Diversity",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu Explore Diversity Antiracist Leadership Institute Business Diversity and Equity Curriculum Transformation offered by CTL Disability Resources Diversity Blueprint Diversity Council Office of Minority Affairs & Diversity UW Race & Equity Initiative Resources Administrators Alumni & community Current students Faculty & staff Future students Schools & colleges Native Life & Tribal Relations Diversity at UW Bothell Diversity at UW Tacoma Support diversity University Diversity Officer Explore Diversity At the University of Washington, diversity, equity, inclusion and belonging are integral to excellence. We value and honor diverse identities, experiences, and perspectives, strive to create accessible, welcoming, and respectful learning environments, and promote access, opportunity, and justice for all. The Jackson School of International Studies Outreach Centers Build community at events organized by the centers, including East Asia Center, Middle East Center, South Asia Center, and Center for Southeast Asia and its Diasporas. Learn More Equity Focus Students, faculty and staff across our three campuses are working hard to advance the values of diversity, equity and inclusion at the UW. This site features some of the stories about our community members who are making a difference. Read the Blog Diversity Blueprint The Blueprint presents the framework that guides the University of Washington towards its goals of diversity, equity, inclusion and belonging. The academic and administrative units are expected to align their DEI plans with the Blueprint. Read the Blueprint Leadership Rickey Hall is the vice president for Minority Affairs & Diversity and university diversity officer at the University of Washington. Diversity Leadership Resources Access diversity resources for alumni, administrators, students, faculty, and staff. Learn More Learning about difference The study of diversity fosters an understanding of cultural traditions, histories and influences. Learn More Making change, transforming lives Students, faculty and staff strive to improve the well-being of our communities. Learn More World changing research Through research, UW faculty demonstrates that diversity leads to innovation and innovation leads to discovery. Learn More Diversity at UW Bothell Explore diversity resources specific to the UW Bothell campus. Explore Bothell Diversity at UW Tacoma Explore diversity resources specific to the UW Tacoma campus. Explore Tacoma DACA FAQ Access information on the rescission of the DACA program. Learn More University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}