{
  "id": 6,
  "date": "2024-05-18T18:20:57.856472",
  "url": "https://www.washington.edu/safety/",
  "university_name": "University of Washington",
  "title": "Campus Community Safety",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu Home About Us Resources for Visitors UW Alert Clery reports News and information Contact us Campus Community Safety Campus Community Safety The University of Washington is dedicated to a safe learning, teaching, research and visitor environment in a diverse community that values compassion and belonging. The Division of Campus Community Safety leads planning, prevention, response and recovery for the UW through three key emergency and safety response units: UW Emergency Management , UW SafeCampus , and UW Police (in Seattle). Under the leadership of Sally Clark, Vice President for Campus Community Safety, the Division provides strategic and operational support for its units, seeks opportunities to innovate with alternative response models, develops common standards across UW and advocates across UW for preparedness. SafeCampus Contact SafeCampus — no matter where you work or study — to discuss safety and well-being concerns for yourself or others. Anonymous calls welcome. Learn more Emergency Management The Emergency Management team provides technical and consulting services for the Seattle campus, acts as a liaison to other UW locations and activates relevant plan steps in the event of an emergency. Learn more UW Police UWPD has a singular focus on the needs of the campus community, including being responsive to expectations for the safety and security of students, faculty, and staff. Learn more Contact Us Give us your feedback on how we are doing or how your experience interacting with the Division or campus community safety units went. Contact Us Need help now? If this is an emergency, call 911 or text 911 . Call 911 Text 911 Reimagining safety at the University of Washington Creating learning, working and living environments that enable each of us to be successful requires a holistic approach to safety and well-being that brings together a range of resources in a coordinated, accountable manner. Learn more Recent news Inside UW Alert and UW Advisory messages May 8, 2024 Update on activities on May 7 May 7, 2024 Update on tent encampments in the Quad May 1, 2024 Important resources UW Police Department (Seattle Campus) 206-685-UWPD (8973) UW Bothell Campus Safety 425-352-5359 UW Tacoma Campus Safety 253-692-4416 SafeCampus 206-685-7233 UW Global Emergency 001-206-632-0153 UW Medicine UW Medical Center - Montlake 206-598-3300 UW Medical Center - Northwest 877-694-4677 Harborview Medical Center 206-744-3000 Valley Medical Center 425-690-1000 UW Emergency Management Title IX Student Conduct EH&S Hall Health (Seattle) Counseling Center (Seattle) LiveWell (Seattle) Student Care Report Form (Seattle) Bias Incident Reporting tool (Seattle) Office of Youth Protection Coordinator UW Medicine South Lake Union Security 206-616-1461 University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}