{
  "id": 6,
  "date": "2024-05-18T18:22:34.303839",
  "url": "https://lib.uw.edu/?utm_source=quicklinks&utm_medium=click&utm_campaign=quicklinks&utm_term=libraries",
  "university_name": "University of Washington",
  "title": "University of Washington Libraries",
  "content": "University of Washington Libraries Skip to primary content University of Washington University Libraries My UW Calendar Maps Directories Toggle navigation Start Your Research Articles & Research Databases Literature on your research topic and direct access to articles online, when available at UW. Journal Search Search or browse journal titles held at UW. Encyclopedias & Dictionaries Resources for looking up quick facts and background information. E-Newspapers, Media, Maps & More Recommendations for finding news, audio/video, images, government publications, data sets and other types. Evaluating Information Learn how to choose the best and most reliable information that meets your research needs. Citation Styles & Tools Quick MLA, APA, and Chicago style guides for bibliographies; tools for storing and organizing sources. Course Reserves Library materials reserved for your classes. Collections & Archives Unique online and physical collections on specific subjects, in distinct formats, and in special archives. Mobile Search Tools Mobile-optimized research databases and library-related mobile apps. Research Guides Librarian recommended resources & research tips tailored to your topic. Undergraduate Researcher Tutorial Self-paced online tutorial that introduces students to research skills and UW Libraries resources and services. more on research Use the Libraries Your Library Account Log in to renew borrowed materials, check on items you have requested, and pay fines. Study & Meeting Spaces Study, conference, event, and meeting spaces, and how to reserve them. Computers & Printing Computers, printers, and scanners in the Libraries. Accessibility We are committed to providing equal access to library collections, services, and facilities for all library users. Interlibrary Loan & Scanning Services Get PDFs of print articles delivered via email and borrow items not held at UW. Borrowing & Access What you can check out from the Libraries, how long, renewals, and returns. more on using the Libraries Help & Support FAQ Short, simple how-to and demos of frequently asked questions about using the Libraries and information resources. Graduate Funding Info Service Assistance with locating funding for research, tuition, travel, and other graduate school-related expenses. Off-Campus Access & Technical Support Using library resources from off-campus and other technical tips. Open Scholarship Commons One-stop shop for knowledge creation and dissemination services. Resources for Writing Campus writing help and links to online resources. Scholarly Publishing & Open Access Info and tools for scholarly publishing and open-access publishing alternatives. Subject Librarians Talk to a librarian with expertise in your subject area for help with your research. Teaching Support Collaborative library instructional services that can improve the research and information skills of your students. more help About Libraries & Hours Contact info, map location, and hours for all library branches. News Events Exhibits What's going on at the Libraries: announcements, upcoming events, and current exhibits. Organization At-a-Glance Staff directory and info about the Office of the Dean and other library departments. Support the Libraries Give to the Libraries! Join the Friends of the Libraries. Our Blog News, views and impact stories from the UW Libraries. Jobs Student, staff, and librarian job opportunities at the Libraries. Policies Libraries policies governing use of library resources, space, and services. Strategic Plan Current Libraries strategic goals and initiatives. Equity, Diversity, Inclusion and Anti-Racism Position statement, goals, working groups, community engagement. more about the Libraries Libraries Art Library Built Environments Library Drama Library Engineering Library Foster Business Library Friday Harbor Library Government Publications, Maps, Microforms & Newspapers Health Sciences Library Li Lu Library Mathematics Research Library Music Library Odegaard Undergraduate Library Research Commons Special Collections Suzzallo and Allen Libraries Tateuchi East Asia Library UW Bothell/Cascadia Library UW Tacoma Library Give Ask Us! Get help 24/7 with this real-time chat service. Email Get answers to less-urgent questions and comments via email. Consultations Make an appointment and get specialized help from a librarian. more ways to contact us ask us! Info UW Libraries Search Articles, books + more: Advanced Search UW Libraries Search Tips | Known Issues Site Search Search this Site for: Check out these research resources! Articles & Research Databases | Research Guides | VIEW MORE > How do I know if my sources are credible/reliable? | Which citation style should I use? | MORE FAQs > UW Libraries Operations Updates Libraries & Hours View a list of hours for each library Study Spaces Find a place to study Borrowing & Returns Learn about using and returning physical and digital items Computers & Printing Learn what's available in the Libraries Chat 24/7 Use chat for immediate help Consultations Schedule a help session with a librarian or expert Teaching Support Multimodal resources for UW Seattle instructors Your Library Account Access your library account to stay up-to-date News & Blog Applications due May 20th - submit your mapping project! News & Blog Special Collections Book Talks: discussing the texts of the Medium exhibit News & Blog Our monthly update - events, resources and news for all! MORE NEWS Start Your Research Online Online Resources Articles & Research Databases Journal Search Encyclopedias & Dictionaries E-Newspapers, Media, Maps & More Course Reserves Collections & Archives Mobile Search Tools Video & Streaming Video Research Help Research Guides Undergraduate Researcher Tutorial Citation Styles & Tools Evaluating Information Off-Campus Access & Technical Support Open Scholarship Commons Research Data Services Upcoming Events May 21 Going Public: OpEd Writing Workshop Learn how to write and pitch compelling, research-based op-eds. May 30 GIS Symposium 2024 Present, connect, and learn about Geographic Information Systems (GIS), remote sensing, and data visualization technologies. VIEW THE CALENDAR Featured Resources, Collections Undergraduate Researcher Tutorial Online tutorial that introduces undergraduate students to research skills and UW Libraries resources and services. Featured Resources, Collections Israel-Hamas War Research Guide Tools and sources for learning about the Israel-Hamas war, representing a variety of academic and political perspectives. Featured Resources, Collections New Online Resource: Planet.com Planet provides daily satellite imagery of Earth's land surfaces and coastal areas, and captures over 300 million square kilometers of imagery each data. MORE DIGITAL COLLECTIONS Stay Connected Our Blog Facebook Instagram Twitter YouTube more ways to connect University of Washington Libraries Box 352900 Seattle, WA 98195-2900 USA phone: 206-543-0242 - Contact Us UW Home / Privacy / Terms Text on this page created by UW Libraries is licensed under a CC BY-NC 4.0 license. Images and video are not included. See details ."
}