{
  "id": 6,
  "date": "2024-05-18T18:21:40.273488",
  "url": "https://www.washington.edu/news/",
  "university_name": "University of Washington",
  "title": "",
  "content": "Skip to main content MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links About Stories All stories News releases UW News blog UW Notebook For Washington Official notices UW in the media Multimedia Video stories Podcasts Soundbites/b-roll Interactives Experts Directory Expert quotes COVID-19 experts Speakers Bureau Media contacts For Journalists For researchers Media Training UW News Menu About Stories All stories News releases UW News blog UW Notebook For Washington Official notices UW in the media Multimedia Video stories Podcasts Soundbites/b-roll Interactives Experts Directory Expert quotes COVID-19 experts Speakers Bureau Media contacts For Journalists For researchers Media Training UW News Navy Growler jet noise over Whidbey Island could impact 74,000 people’s health As often as four days a week, Boeing EA-18G Growler electronic attack aircraft based at Naval Air Station Whidbey Island fly loops overhead as pilots practice touch-and-go landings. The noise is immense. New research from the University of Washington shows that the noise isn’t just disruptive — it presents a substantial risk to public health. UW NEWS UW-led project to study ozone, atmospheric layers a finalist for next-generation NASA satellite UW NEWS Q&A: How did the COVID-19 pandemic affect older adults’ technology use? UW NEWS Scientists want to know how the smells of nature benefit our health UW NEWS Latest news video Navy Growler jet noise over Whidbey Island could impact 74,000 people’s health 1 week ago More UW IN THE MEDIA News mentions of the UW Not too wet to burn | Hakai Magazine 1 day ago AI helps scientists create ultimate noise-cancelling headphones | KNDO 1 day ago How early and often should women get mammograms? | KUOW 1 day ago More OPINION AND ANALYSIS Written by UW researchers, faculty and graduate students Navy jet noise could mean long-term health impacts for Whidbey Island | The Seattle Times 3 days ago Opinion: Navy must turn down the volume on Whidbey ‘Growler’ operations | The Seattle Times 5 days ago Analysis: Everyday life and its variability influenced human evolution at least as much as rare activities like big-game hunting | The Conversation 1 week ago More For Washington The UW's RIDE program trains dentists to treat patients from rural and underserved communities. More than 80% of graduates go on to work in dental offices in small towns and communities. RIDE students study dentistry in Spokane and Seattle, as well as hands-on training in clinics in rural towns across Washington. Feature stories Be Boundless Learn how the UW community is taking on the challenges of today — and preparing to tackle those of tomorrow. Feature stories UW News blog UW atmospheric scientist participating in field campaign to improve Western snowfall, drought forecasts 1 day ago Thirteen UW students receive Fulbright exchange awards for study, research and teaching positions around the world 3 days ago UW files Unfair Labor Practice Complaint following ASE union’s harassment of Dean and staff 1 week ago More UW Notebook ArtSci Roundup: Global Sport Lab, Art Honors Graduation Exhibition, Interconnected Worlds with Henry Yeung and more 2 days ago ArtSci Roundup: Katz Distinguished Lecture, DXARTS Spring Concert, MFA Dance Concert and more 1 week ago ArtSci Roundup: Frontiers of Physics Lecture, “Influencers, Platforms and the Rise of the Follower Economy”, Cie Hervé KOUBI Performance and more 2 weeks ago More UW Athletics Forward Chris Conway Signs With Washington 1 day ago Alvarez Walks Off Game One Of Columbia Regional 1 day ago Huskies Ink KC Ibekwe 1 day ago Andy Powell Wins Second-Straight Coach Of The Year 1 day ago More Twitter Tweets by uwnews Search UW News Search for: UW Experts Weather Artificial intelligence Wildfires and Smoke Full directory Categories Browse Administrative affairs Arts and entertainment Buildings and grounds Education Engineering Environment For UW employees Health and medicine Honors and awards Interactive Learning News releases News roundups Official notices Politics and government Population Health Profiles Research Science Social science Technology UW and the community UW Notebook UW Today blog Latest news releases Scientists want to know how the smells of nature benefit our health 3 days ago Q&A: How did the COVID-19 pandemic affect older adults’ technology use? 3 days ago UW-led project to study ozone, atmospheric layers a finalist for next-generation NASA satellite 4 days ago More Connect Campus publications A&S Perspectives College of Education University of Washington Magazine The Daily UW Press More publications Evans School Foster School of Business UW Medicine Newsroom Information School IT Connect News Jackson School Law School News President's blog School of Dentistry School of Nursing School of Pharmacy School of Public Health School of Social Work The Trend in Engineering UW Libraries: News & Events UW Video Washington Engineer UW Today Newsletter Subscribe UW Today Daily UW Today Week in Review For UW employees Submission guidelines Submission form University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}