{
  "id": 6,
  "date": "2024-05-18T18:22:08.195135",
  "url": "https://www.washington.edu/visit/",
  "university_name": "University of Washington",
  "title": "Visitor Center",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academics at the UW Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Research at the UW Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving Visitor Center Welcome to the University of Washington! We’re here to help you find the information you need. Whether you’re a prospective student, a UW graduate, a tourist or a Seattle local, connect with the Visitor Center to learn more about the UW. About the UW Visitor Center Address : Odegaard Library: 022 Odegaard, Seattle, WA 98195-5502 ( Find on campus map ) Office hours : Monday-Friday, 9 a.m.-4:30 p.m. Closed on UW holidays . Phone : 206-543-9198 Email : uwvic@uw.edu Before you stop by, please review our office policies. Visitor Center Guide Visitor resources Learn about the UW Getting to campus Parking on campus Eating on campus Student-led tours What’s it really like to attend the UW? Our guides will show you campus from the student’s perspective. Take a tour Campus highlights Explore noteworthy campus locations. View Guide Arts UW Explore contemporary art at the Henry Art Gallery and Jacob Lawrence Gallery. Interact with natural and cultural collections at the Burke Museum. Or attend a performance at Meany Hall to enjoy dance, drama and music. Make plans Husky Athletics From football to crew, the Dawgs run — and row — circles around the competition. Our Division I athletes host their rivals in the Pac-12 conference and beyond at Husky Stadium and nearby Athletics Village, as well as on the Montlake Cut. Cheer on the Huskies Hidden gems Explore Campus General resources Future students Apply to the UW Living on campus Transfer Thursday Parents and families Learn more about our Parent & Family Programs ! General visitors Learn more about some popular spots on and near campus! Public events calendar Accessibility Accessible parking, routes, building entrances and other accommodations Printable resources Campus map (PDF) Welcome Guide brochure (PDF) Campus accessibility map (PDF) UW Fast Facts (PDF) Other contacts UW offices and departments People finder Office finder Questions? We’re happy to help! Connect with us at uwvic@uw.edu or 206-543-9198. Note: Each photograph above was taken following the appropriate safety protocols at the time. University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}