{
  "id": 6,
  "date": "2024-05-18T18:21:04.386756",
  "url": "https://grad.uw.edu/prospective-students/finding-your-path/",
  "university_name": "University of Washington",
  "title": "Finding Your Path",
  "content": "Skip to content Enter search text Current site All the UW Search scope Current site All the UW University of Washington University of Washington Calendars Contact Us Policies Public Lectures Faculty & Staff Site >> Menu Prospective Students Finding Your Path Find a Program Requirements How to Apply Apply Now Requirements International Applicants Application Fee Waivers Paying for Graduate School After You Apply Explore Our Campuses Get to Know the Pacific Northwest Find Funding International Students Information Current Students Arrival through Graduation Graduation Requirements Thesis/Dissertation Academic Dates & Deadlines Student Success Student Advice Knowledge Base Planning Your Path Programming & Events Mentoring First-Generation Graduate Students Campus Resources Beyond Graduation Three Minute Thesis (3MT) U501: Graduate School Orientation￼ International Student Information Post-Docs Post-Docs at the UW Office of Postdoctoral Affairs Awards & Funding Resources for Postdocs Equity & Justice Equity & Justice in Graduate Education Office of Equity and Justice Holistic Admissions GSEE: Graduate Student Equity & Excellence 50 Years of GSEE Outreaching Grads (OG) Program Sign Up For the GSEE Newsletter Contact GSEE Programming & Events GSEE/Equity & Justice Calendar Diversity Funding Opportunities Undocumented Students Funding How do I pay for graduate school? Helpful Funding Videos Assistantships Fellowships Finding Fellowships Applying for Fellowships List of Fellowships Funding Events & Deadlines Programs Find a Program Graduate Certificate Programs Interdisciplinary Programs Find Graduate Faculty Log in to MyGrad >> Finding Your Path Maybe you’ve got a specific program in mind, or perhaps you are just interested in what is available at the UW and how to go about finding a program, applying, and paying for school. Know that the Graduate School accepts applications from U.S. citizens, permanent residents (green card holders), immigrants and international applicants . Undocumented individuals are eligible for admission to any graduate program at the University of Washington. Graduate School admission requirements and application procedures are the same for all applicants regardless of citizenship and visa status. Our Commitment to Equity & Justice Is Graduate School Right for You? Going through the process of earning a graduate degree is expensive, time consuming, and asks a lot of you and the people around you. But it can also be a rewarding and enlightening part of moving to the next step in your life. When considering whether to apply, ask yourself some questions: Why do I want to go to graduate school? What is my end goal? Is graduate school necessary to meet that goal? If so, what is the right program for me? Does UW have a program that fits my needs? If you’ve decided to continue to the next step, you’ll want to find a good program… Find a Program Your graduate school program should be tailored to fit you and your style. It should be comfortable, flexible while remaining supportive, and help you reach the finish line. Use our Search Tool The Application Process How to Apply In graduate school, students apply directly to the programs they are interested in. Learn more about the process of submitting your application. Learn More After You Apply You’ve submitted your application to a UW graduate program and now it’s time to wait, so… What happens next? Learn More After You Are Accepted You’ve gotten in! What steps can you take to prepare yourself and ease your transition into grad school. Learn More Funding Paying for School Graduate school can be an expensive endeavor. Fortunately, there are lots of resources to help you learn how to pay for school and find assistance. Visit our Funding Information Section Home Prospective Students Finding Your Path Grad School 200: Preparing for Graduate Education How to Apply Apply Now Requirements Application Fee Waivers International Applicants Paying for Graduate School After You Apply Explore Our Campuses Get to Know the Pacific Northwest Grad School Directory Need assistance? Want to make an appointment with one of our offices? Just have a simple question? Our searchable and filterable directory will help you get to the office or person you need. Complete Directory Support the Graduate School Grad School Staff Intranet Accessibility My UW Privacy Terms Connect with the Graduate School Facebook Twitter Instagram University of Washington Be boundless © 2024 University of Washington  |  Seattle, WA"
}