{
  "id": 6,
  "date": "2024-05-18T18:21:28.839567",
  "url": "https://www.washington.edu/newsletter/",
  "university_name": "University of Washington",
  "title": "Subscribe to  UW Current",
  "content": "Skip to main content MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving Subscribe to  UW Current UW Current Menu About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving Home UW Current Discovery is at the heart of our university. Do you wonder whether Pacific Northwesterners have an accent? Are you curious what your eyes reveal about your risk of Alzheimer’s? Do you know what your car’s worn tires mean for coho salmon? UW’s community of experts, researchers, artists, students and talented individuals are driven by the same curiosity and a need to channel their knowledge for good. Subscribe to UW Current, our monthly newsletter, to discover the latest on new innovations, useful tips and information, and eye-opening stories coming out of the UW community. Featured stories in the latest issue Meeting the demand for rural dentists in Washington More patients in Washington will have access to dental care, thanks to a program that prepares dentists to practice in rural areas. SEE WHERE THEY PRACTICE Kids on the go An easy-to-use tool helps kids with mobility issues to spend more time playing outdoors. READ ABOUT HOW Uncovering the voices of ancient Rome The history of marginalized people in ancient Rome opens new windows into how we view the past and present. TAKE A LOOK University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}