{
  "id": 6,
  "date": "2024-05-18T18:21:08.357665",
  "url": "https://www.washington.edu/giving/how-to-give/",
  "university_name": "University of Washington",
  "title": "Ways to give",
  "content": "Skip to main content MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Home Ways to give Get involved Alumni and friends Students Parents Faculty and staff Corporations and foundations Recognition Be Boundless Campaign The President’s Circle Cumulative Giving Recognition Henry Suzzallo Society Gates Volunteer Service Award Report to Contributors Contacts Giving FAQs Give now My UW Giving Give to the UW Menu Home Ways to give Get involved Alumni and friends Students Parents Faculty and staff Corporations and foundations Recognition Be Boundless Campaign The President’s Circle Cumulative Giving Recognition Henry Suzzallo Society Gates Volunteer Service Award Report to Contributors Contacts Giving FAQs Give now My UW Giving Home Give to the UW Ways to give Ways to give Close Menu Home Ways to give Henry Suzzallo Society Thank you for investing in the work of University of Washington students, faculty and staff! Give online Find a fund online. Give by phone 877-UW-GIFTS (877-894-4387) Give by mail Box 359505 Seattle, WA 98195-9505 Explore ways to give Together UW Invest directly in our students, staff and faculty through one of our current crowdfunding projects. Find a project that inspires you Planned giving Planned gifts offer creative, flexible strategies for your estate and charitable planning. Plan your estate Tribute gifts A meaningful way to convey sympathy to the bereaved, memorialize a loved one, commemorate a special occasion or honor a person’s life and accomplishments. Learn more Securities Gifts of appreciated securities provide great benefits to your favorite department or program and have tangible tax benefits. Learn more Endowments Support your favorite department, school, college or campus with an endowed gift that will provide a lasting and reliable source of income in perpetuity. Create your legacy In-kind gifts The UW appreciates gifts-in-kind, such as equipment, works of art, books and other tangible personal property that help to provide a world-class experience for students. Learn more Real estate The UW began with a gift of 10 acres of land in 1861. Your gift of real estate can have a lasting impact on UW students for generations to come. Learn more Donor advised funds Recommending a gift to the UW through your donor advised fund (DAF) is a simple way to give back and diversify your philanthropy. Learn more Payroll deduction Support your passion with an easy, bi-weekly, payroll deduction gift. Your recurring payroll gift can truly make an impact on our students, programs and departments! Sign up today International wire transfers To execute a wire transfer, please complete our form. Instructions will be emailed to you. View form Innovator’s Pledge You can fuel discovery and entrepreneurship by pledging to invest in innovation at the UW. Make the pledge University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}