{
  "id": 6,
  "date": "2024-05-18T18:22:12.906875",
  "url": "https://www.washington.edu/innovation/",
  "university_name": "University of Washington",
  "title": "The Innovation Imperative",
  "content": "Skip to main content MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Home About The Innovation Imperative FAQ Funding opportunities Roundtable Contacts Programs Buerk Center for Entrepreneurship CoMotion Global Innovation Exchange Colleges and schools UW Medicine Incubators and accelerators Internships and fellowships Find a mentor Classes and clubs Events UW Innovation Month Upcoming events Autumn Quarter Winter Quarter Spring Quarter Ongoing events Spaces Makerspaces CoMotion Labs GIX Prototyping Labs Other facilities Startups Startup portfolio Success stories Investment and licensing opportunities Work with UW The Innovation Imperative The Innovation Imperative Menu Home About The Innovation Imperative FAQ Funding opportunities Roundtable Contacts Programs Buerk Center for Entrepreneurship CoMotion Global Innovation Exchange Colleges and schools UW Medicine Incubators and accelerators Internships and fellowships Find a mentor Classes and clubs Events UW Innovation Month Upcoming events Autumn Quarter Winter Quarter Spring Quarter Ongoing events Spaces Makerspaces CoMotion Labs GIX Prototyping Labs Other facilities Startups Startup portfolio Success stories Investment and licensing opportunities Work with UW Home The Innovation Imperative The impact of innovation at the UW Throughout more than 150 years of history, the UW has demonstrated an extraordinary track record of inventions and discoveries with impact across the globe. Consistently ranked the most innovative public university in the world, there is no limit to what we can achieve. Celebrate innovation at UW This May is the first-ever UW Innovation Month, featuring a full slate of programs and events that celebrate the spirit of innovation at UW. The Spark of Intention In a marketplace transformed by emerging technology and plagued by systemic underrepresentation, three academic entrepreneurs share how personal experiences and perspectives guide their work to build better businesses and a better world. A New Carbon Removal Startup Is Powered by Sunlight and Seawater Cutting energy use is a key carbon cleanup challenge. Two University of Washington professors think they’ve cracked it. From biotech to 3D printing, here are 7 startups that recently spun out of the Univ. of Washington The startup spinout machine at the University of Washington keeps on humming. According to CoMotion, seven startups have emerged from UW-related research since July of last year. Univ. of Washington set to break ground on 69-acre redevelopment to create Seattle innovation hub The University of Washington this year expects to break ground on a new building that will anchor an ambitious, innovation-focused redevelopment called Portage Bay Crossing. AstraZeneca will pay up to $1.1B to acquire Icosavax, a Univ. of Washington biotech spinout Seattle-based Icosavax, a spinout from the University of Washington’s Institute for Protein Design, will be acquired by biotech giant AstraZeneca for up to $1.1 billion. ‘Forever chemicals’ are eternal no more thanks to a pollution destroying device from Tacoma startup UW spinoff Aquagga and a handful of others are slashing the lifespan of forever chemicals. Startups and spinoffs Every UW college and school has launched startups and created spinoffs. Since 1984, the UW has spun out over 280 companies. Since 1992, UW spinoffs have raised over $8.7 billion in funding with $4.1 billion secured over the past five years alone. Startup portfolio 26 innovations that changed the world Explore a selection of innovations developed wholly or in part at the University of Washington. We invite you to share in the UW’s rich history through these fundamental and groundbreaking innovations. Learn more Innovation happens everywhere at the UW Getting started: Whether you are a student, entrepreneur, investor, or other community member, these Frequently Asked Questions will guide you in the right direction. FAQ “Insights I developed at UW are what carried me forward towards running my own businesses.” – Keisha Credit, Master of Science in Entrepreneurship ’18 The innovation ecosystem The UW Innovation Imperative empowers students and researchers to learn, discover and build solutions to tomorrow’s challenges. It encourages innovation by providing the space and opportunity for people from all backgrounds — from the humanities to the sciences, the poetic and the pragmatic — to connect, imagine and discover. Learn the skills The UW offers a wide variety of educational and learning opportunities to build students’ skills in innovation and entrepreneurship. Explore programs Find a class Get hands-on experience Innovation happens in every corner of the UW — and there’s no better way to expand your skill set than to participate in a hands-on kind of way. Competitions and hackathons Makerspaces Student clubs Bring ideas to life A strong community is critical for entrepreneurs to bring new ideas to life. Important milestones along the journey include mentorship, lessons from industry leaders and alumni, and pursuing funding opportunities. Find a mentor Accelerators and incubators Funding opportunities Build your network Join us for events that will open your eyes, push your boundaries, and grow your network. Some are open to the public. Explore events University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}