{
  "id": 6,
  "date": "2024-05-18T18:21:31.311188",
  "url": "https://admit.washington.edu/",
  "university_name": "University of Washington",
  "title": "Welcome",
  "content": "Skip to content Enter search text Current site All the UW Search scope Current site All the UW MyUW Calendar Directories Libraries UW Medicine Maps UW Today Helpful Links Computing/IT Employee Self Service Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu Academics Majors Research Study Abroad Honors Careers Apply Freshman Running Start Transfer Postbaccalaureate Military Parents & Families Visit Tours and information sessions Events On demand videos COVID-19 FAQs Costs & Financial Aid Cost of attendance Applying for aid Scholarships Husky Promise Student Life Housing & Dining Resources Seattle Contact Join the email list Find your counselor For high school counselors Connect Virtual Tour Students admitted to the UW now have until June 1 to commit, a result of FAFSA delays. We anticipate that financial aid offers will be sent in late April or early May. × Welcome This is the University of Washington: a stunning campus in the heart of an energetic, forward-thinking city. Our students are dreamers and doers, and together we tackle big issues with curiosity, compassion and optimism. As a public university, our mission goes far beyond our campus — and you can help take us in new directions. Come here to explore, create, discover and be part of something bigger. Because what you care about can change the world. Congrats NEW HUSKIES! Learn more PRIDE POINTS # 3 U.S. Public University Academic Ranking of World Universities, 2023 # 1 Undergraduate School in the West for Entrepreneurship Entrepreneur Magazine, 2023 # 1 #1 Most diverse college in Washington Niche, 2023 Top 10 A Top 10 'Best Buy' Among Public Colleges & Universities Fiske Guide to Colleges, 2023 Freshman Viewbook Kick off your Husky Experience! Explore highlights of the UW, Seattle and the Pacific Northwest with this guide. Download viewbook Academics At the UW, we see things differently. That goes for majors, too. What ignites your love for learning? Learn more about majors Cost We believe everyone should have the opportunity to attend the UW. Finances should not be a barrier to getting a world-class education. Financial aid Belonging We strive to create a home away from home for students of all backgrounds. Our large, diverse Husky family has a place for you! The Multicultural Outreach & Recruitment (MOR) team can be your partner and champion throughout the application process and beyond. MOR website Student life Your Husky Experience doesn’t end when you leave the classroom. The time you spend outside of class can be just as transformative. Learn more about Student Life JOIN THE EMAIL LIST Get tips from our Admissions team on: How to submit the strongest application Important deadlines Majors and academic programs Campus tours and UW events in your area Join email list University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}