{
  "id": 6,
  "date": "2024-05-18T18:06:16.910520",
  "url": "https://www.washington.edu/admissions/",
  "university_name": "University of Washington",
  "title": "Apply to the University of Washington",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academics at the UW Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Research at the UW Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving Apply to the University of Washington You’re undaunted by challenges. In fact, you seek them out. You believe that a world of good starts with one person. One step. We believe that too. So what are you waiting for? Start the journey to become a Husky today. Undergraduate admissions Seattle When you come to the UW’s Seattle campus, you’re part of more than the innovative city that’s brought us everything from legendary music to lifesaving cures. You’re part of something bigger, too. You’re part of a globally connected community that loves to innovate, to explore, to create. Here, you’re part of Seattle’s vibrant history — and the world’s promising future. Learn more Bothell Our mission at UW Bothell is to make an exceptional college education accessible to more students — people just like you. No matter your background or future aspirations, if you are a strong, committed student, we want to help make your dream of a UW degree possible. We are a student-centered, right-sized campus with 6,000 students, more than 350 faculty, five schools, more than 50 undergraduate and master’s degree programs, and direct access to the big-school resources of the tri-campus University of Washington. Learn more Tacoma At UW Tacoma, students become engines of change for themselves, their families and their communities. Set in beautiful historic downtown Tacoma, the campus melds classic urban architecture with modern technology. Faculty and students work together in small classes striving for academic excellence, personal growth and professional expertise. Learn more Graduate admissions Graduate programs The University of Washington offers more than 370 graduate programs across all three UW campuses and online, from master’s to doctoral programs for people who are launching or continuing academic, research or professional careers. To explore or to apply to a graduate program, start with the Graduate School. Learn more Professional programs School of Law The UW School of Law is one of the nation’s top public law schools and one of the world’s most respected centers for interdisciplinary legal scholarship and study. Our innovative, student-focused learning environment prepares our students to succeed in the evolving legal profession and to go on to be leaders for the global common good. Learn more School of Medicine The UW School of Medicine, renowned for its pioneering research, is recognized as one of the nation’s top medical schools. Its unique community-based medical education program, WWAMI, serves a five-state region and emphasizes training clinicians to serve in rural areas. Learn more School of Dentistry The School of Dentistry, a global leader in oral health research, prepares students to be true 21st-century dentists with evidence-based training grounded in the latest advances of biological and materials science. Learn more School of Pharmacy Nationally and globally ranked, the School of Pharmacy educates the next generation of pharmacy and research leaders and trains students for a career that combines a love of science and patient-centered health care. Learn more Certificates, degrees and courses for busy adults Continuing Education Choose from more than 130 certificate programs, 70 degrees and hundreds of courses with part-time options in the evening, on weekends and online. Finish your bachelor’s online Learn more Online programs Choose from 50 certificate programs, 20 degrees and hundreds of courses. Online master’s degrees Learn more University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}