{
  "id": 6,
  "date": "2024-05-18T18:21:47.303476",
  "url": "https://www.uwb.edu/admissions/",
  "university_name": "University of Washington",
  "title": "Quick Links",
  "content": "Skip To Content Search keywords Search Undergraduate Admissions Open mobile menu Close mobile menu Quick Links Close mobile menu Search keywords Search Why UW Bothell Expand Navigation Academics Student Life Career Connections Viewbook Apply Expand Navigation Application Dates & Deadlines First-year Students Expand Navigation How to Apply Admissions Requirements Advanced Coursework Homeschool Students Transfer Students Expand Navigation How to Apply Admission Requirements Transfer Planning Worksheets Transfer Credit Policies International Students Expand Navigation First-year International Students Transfer/Post-Baccalaureate International Students Veteran Students Other Student Types English Language Proficiency Application Review I Applied. Now What? FAQ Costs & Aid Visit Us Expand Navigation Virtual Campus Tour Calendar Admitted Students Expand Navigation First-year admitted students Transfer admitted students Post-baccalaureate admitted students FAQ Contact Us UW Bothell Home Quick Links MyUW Canvas Directory Library Workday Give Apply As Undergraduate More Links Information Technology Commuter Services Facilities Human Resources Campus Safety Alumni Why UW Bothell Expand Navigation Academics Student Life Career Connections Viewbook Apply Expand Navigation Application Dates & Deadlines First-year Students Transfer Students International Students Veteran Students Other Student Types English Language Proficiency Application Review I Applied. Now What? FAQ Costs & Aid Visit Us Expand Navigation Virtual Campus Tour Calendar Admitted Students Expand Navigation First-year admitted students Transfer admitted students Post-baccalaureate admitted students FAQ Contact Us Notice | First-year admitted students now have until June 1 to commit, a result of FAFSA delays. Close mobile menu FIND YOUR PLACE Explore Why UW Bothell Take a Virtual Tour Customize Viewbook Apply Now Visit Us Graduate Admissions At UW Bothell, you’ll earn your University of Washington degree with an emphasis on experiential learning, hands-on undergraduate research and community engagement. Discover your passion Turn one of our 50+ majors into an exciting career. BROWSE DEGREES READY TO APPLY? Whether you’re new to college, a transfer student or an international student, we can help you through the application process, each step of the way. First-year students First-year students have not attended a college or university following the summer of their high school graduation or obtaining their GED. HOW TO APPLY START YOUR APPLICATION Transfer students Transfer students have completed (or will complete) college coursework from a regionally-accredited college or university before applying to UW Bothell. HOW TO APPLY START YOUR APPLICATION International students International students live in countries other than the United States but wish to earn their undergraduate degree in the United States. FIRST-YEAR INTERNATIONAL STUDENTS TRANSFER INTERNATIONAL STUDENTS BY THE NUMBERS UW Bothell ranks No. 2 in the state of Washington for best value colleges. In 2022-23, 70% of undergraduate students and 66% of graduate students graduated debt-free. The average undergraduate class size is 30 , with a faculty to student ratio of 15:1 . DISCOVER YOUR FUTURE Interested in real-world experiences during college? Want to develop career skills? Prepare for graduate school? At UW Bothell, you can make it happen. Academics UW Bothell combines the best of both worlds — providing a small campus feel and small class sizes while offering the resources of a large university. EXPLORE ACADEMICS Student life Embark on your college journey at UW Bothell, where you’ll experience a vibrant and engaging student life while being supported by a dedicated community of learners. EXPLORE STUDENT LIFE Career connections Unleash your potential at UW Bothell, where your transformative education opens doors to limitless career connections and opportunities to make an impact. EXPLORE CAREER CONNECTIONS We are constantly striving for greater equity and inclusion, on and off campus UW Bothell is committed to creating a community that advances equity, social justice, affirmation and excellence for all. 40% of incoming first-year and 41% of incoming transfer students would be first in their immediate families to earn a four-year degree. 28% of incoming first-year students and 32% of incoming transfer students are eligible for federal Pell Grants. 400+ students at UW Bothell are eligible for veterans benefits. HUSKY VOICES Hear from Huskies about their experiences at UW Bothell and how they made a place for themselves on campus. Previous Next Eleanor Wort Class of 2015 B.A. in Applied Computing My first few weeks at UW Bothell, l felt like I was at home. The sense of community I felt with the professors and other students was something I hadn’t experienced at other institutions, mostly due to smaller class sizes. Eleanor Wort Class of 2015, B.A. in Applied Computing A glimpse of student life at Bothell View Gallery Bothell, Washington View our location on Google maps. Contact us by phone at: 425.352.5000 Visit us Maps & Directions Accessibility Jobs Contact Privacy Terms UW Seattle UW Tacoma Go to University of Washington: Bothell instagram page Go to University of Washington: Bothell facebook page Go to University of Washington: Bothell twitter page Go to University of Washington: Bothell youtube page © 2024 University of Washington Bothell Go to University of Washington: Bothell instagram page Go to University of Washington: Bothell facebook page Go to University of Washington: Bothell twitter page Go to University of Washington: Bothell youtube page"
}