{
  "id": 6,
  "date": "2024-05-18T18:22:28.943629",
  "url": "https://hfs.uw.edu/Husky-Card-Services/?utm_source=quicklinks&utm_medium=click&utm_campaign=quicklinks&utm_term=huskycard",
  "university_name": "University of Washington",
  "title": "Housing & Food Services",
  "content": "Skip to main content Search HFS Live Experience Eat Explore Serach HFS Live Eat Experience Explore Make a difference! We want your feedback on this HFS website. Complete our brief survey for a chance to win a $50 Amazon gift card. Service Updates Please see our Husky Card Operations Updates page for the most current information regarding operating hours, location and adjusted card services. The Husky Card Office has open walk-in hours (no appointment needed), Monday–Friday, 9 am–noon and 1 pm–4 pm. Staff are available by phone and email Monday–Friday, 8 am–5 pm. We are closed for lunch from noon–1 pm. Housing & Food Services Husky Card Services Husky Card The Husky Card is the official identification card for members of the UW community. It provides access to services and opportunities, including campus libraries. Get your Husky Card Husky Card account Your Husky Card is automatically linked to a reloadable debit account that can be used for on-campus dining, vending machines, and more! Explore the services Online card office Make deposits, check your account balance and history or suspend a lost card. The Online Card Office is available 24/7! Manage your account Whether you’re an incoming student or a department administrator, Husky Card Services is here for you, and our services go well beyond providing you with your campus identification card. Here you’ll find information about all the functions and amenities your card makes available to you such as: The Husky Card Account U-PASS Program UW Discount Program Participating Locations The list of participating campus locations and services that accept the Husky Card Account is constantly expanding. ID badges Design custom ID badges for your UW department or organization! Identification badges can be ordered for your staff, students, conference attendees or event participants, and can be generic or include the Husky Card photo. Guest and Department Cards If you'll be visiting campus with a group and want to dine with us, or if you work at the UW and would like to charge printing and copy services to a budget, you might want to consider a Guest or Department card . Accessories The Husky Card Account & ID Center offers a variety of lanyards and protective holders to help keep your Husky Card handy and damage-free. We accept the Husky Card Account for payment. Questions? We are located on the ground floor level of the Odegaard Undergraduate Library building. For current operational hours and ways to request help, see our Contact Us page or visit our FAQ page . You might also be interested in Husky Card Access & Governance Council ID Center Locations Husky Card Terms & Conditions HFS Contact Us About HFS Staff Jobs Meeting Space Conference Services Intern Housing UW Husky Health & Wellbeing MyUW Student Life Disability Resources for Students Accessible Technology Sustainability CONNECT WITH US 1045 NE Campus Parkway Seattle, WA 98105 | hfsinfo@uw.edu © 2024 HOUSING & FOOD SERVICES | UNIVERSITY OF WASHINGTON PRIVACY TERMS SITE MAP"
}