{
  "id": 6,
  "date": "2024-05-18T18:21:46.173031",
  "url": "https://admit.washington.edu/apply/transfer/",
  "university_name": "University of Washington",
  "title": "Transfer",
  "content": "Skip to content Enter search text Current site All the UW Search scope Current site All the UW MyUW Calendar Directories Libraries UW Medicine Maps UW Today Helpful Links Computing/IT Employee Self Service Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu Academics Majors Research Study Abroad Honors Careers Apply Freshman Running Start Transfer Postbaccalaureate Military Parents & Families Visit Tours and information sessions Events On demand videos COVID-19 FAQs Costs & Financial Aid Cost of attendance Applying for aid Scholarships Husky Promise Student Life Housing & Dining Resources Seattle Contact Join the email list Find your counselor For high school counselors Connect Virtual Tour Students admitted to the UW now have until June 1 to commit, a result of FAFSA delays. We anticipate that financial aid offers will be sent in late April or early May. × Transfer Office of Admissions Apply Transfer Transfer students are an important part of the UW community. We look forward to learning what you will bring to our campus. How to apply Good preparation for your intended major is the best way to prepare for admission at the UW, but it’s only part of what we’ll be looking at. Learn more about how to apply What you need to know: What you need to know: Key dates & deadlines Quarter of application Quarter begins Application opens Application deadline Notification period Winter* Early January August 1 September 1 November 1 – December 15 Autumn Late September December 15 February 15 May  1 – June 30 Spring** Late March November 1 December 15 N/A Summer*** Mid-June December 15 February 15 May  1 – 31 *Winter quarter is open to U.S. transfer applicants only. International student applications not accepted. **Spring quarter is not open for general admission. Spring quarter is open only to applicants to specific departments in engineering and computer science. ***Most degree-seeking students apply for autumn quarter. If you wish to apply for summer quarter as a degree-seeking student please consult an admissions counselor . To apply for summer quarter as a non-degree student, contact Summer Quarter . Transfer information sessions Hear directly from an admissions counselor about the transfer process. Virtual or in person, check the calendar for dates, times and location. Holistic review Holistic review is a comprehensive assessment of your academic performance, personal qualities, and achievements. Transfers by the numbers At the UW, you are more than test scores and a GPA, but we know you’re curious about the numbers anyway. College Academic Distribution Requirements Admission to the UW requires completion of coursework in the subjects listed below — whether in high school, college or a combination of the two — unless you have earned 40 transferrable college quarter credits or more at the time of application. Learn more about CADRs . Subject Credits required English 4 Mathematics 3 Social Sciences/Social Studies 3 World Languages 2 Lab Science 2 Senior year Math-Based Quantitative Course 1 Fine, Visual or Performing Arts .5 Academic Elective .5 English proficiency (international students only) International students are required to submit an official TOEFL or IELTS score that meets the UW’s minimum English proficiency requirement . Transfer GPA The Office of Admissions calculates a GPA that is considered in the assessment of your application. Learn more about what is and is not included in that calculation . Exams for credit Did you participate in Advanced Placement (AP), International Baccalaureate (IB) or A Level & AS Level exams? The UW encourages and applauds participation in any of these programs. They are challenging and demanding, and we believe they provide excellent preparation for university study. Find details and useful links below. Advanced Placement (AP) International Baccalaureate (IB) A Level & AS Level exams Transfer credit policies Wondering what credits will transfer to the UW? Learn more about our transfer credit policies . Admission to majors Your admission to a major at the UW depends on the major you are interested in and your application type. Learn more about admission to majors . Transfer planning resources These online transfer planning resources will help you make a more efficient transfer to the UW. Homeschool policies We welcome applications from homeschool students. Please review our transfer homeschool guidelines so you’re ready to go. I applied. Now what? We appreciate the time and effort that you put into your application to the UW. We want to make sure what comes next is as clear and efficient as possible. Check out other transfer resources on the UW’s transfer student portal website . Home Apply Admission to majors Dates and deadlines Freshman How to apply Holistic review Freshmen by the numbers College Academic Distribution Requirement (CADRs) Freshman homeschool applicants I applied. Now what? Parents & Families Preparing for college Running Start Transfer How to apply Holistic review Transfers by the numbers College Academic Distribution Requirements (CADRs) Transfer GPA Transfer credit policies WA CC Equivalency Guide Transfer planning resources Spring quarter transfer admission I applied. Now what? Postbaccalaureate How to apply Military Transfer Guidebook Download the Transfer Student Guide University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}