{
  "id": 6,
  "date": "2024-05-18T18:22:22.362444",
  "url": "https://www.washington.edu/",
  "university_name": "University of Washington",
  "title": "University Of Washington",
  "content": "<iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-KQ6QQBT\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\" aria-hidden=\"true\"></iframe> Skip to main content MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving Menu About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving University Of Washington Featured Story Slideshow #HuskyExperience Journey of the spirit In its inaugural paddle, the UW Shell House Canoe Family joined the annual Tribal Canoe Journey, where tribal and First Nations communities reconnect and celebrate their shared heritage. Watch video #HuskyExperience HUSKY 100 Meet the Husky 100: Remarkable undergraduate and graduate students who are making the most of their time at the UW. Student profiles #UWinnovates THE BIOCHAR SOLUTION In cities around the globe, stormwater runoff leads to water pollution. UW researchers are developing an innovative solution based on recycled coffee grounds. Read story #UWinnovates ENERGIZED FOR CHANGE After living through the devastation of hurricanes in Puerto Rico, grad student Miguel González-Montijo is working on clean energy innovations for the future. Read story Be Boundless ArtsUW Maps MyUW Athletics Social Libraries UW Medicine News & Events Campus Events Innovation revealed at the 27th Annual Undergraduate Research Symposium Over 1,200 undergraduates will present cutting-edge research and scholarship today at the 27th Annual Undergraduate Research Symposium, a signature event for the University of Washington. Event info Honors and Awards 2024 Fulbright Scholars announced Thirteen UW students and recent alumni were awarded Fulbright U.S. Student Program scholarships this year, joining about 2,000 students and recent graduates from around the country to study and teach abroad. See the list President's Blog Resolution to the encampment in the Quad Through serious and constructive conversations, we have reached a resolution that will see the voluntary departure of the encampment in the Quad, writes UW President Ana Mari Cauce. Read more Fast Facts Undergrad research Did you know? Honors & Awards University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington | Seattle, WA"
}