{
  "id": 6,
  "date": "2024-05-18T18:22:36.554101",
  "url": "https://finance.uw.edu/sfs/tuition",
  "university_name": "University of Washington",
  "title": "Main navigation",
  "content": "Skip to main content All the UW Current Site MyUW Calendar Directories Libraries UW Medicine Maps UW Today Helpful Links Computing/IT Employee Self Service Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Main navigation Menu Home Tuition & Fees Tuition Overview Pay Tuition & Fees Drops, Withdrawals, Forfeitures & Refunds Registration Holds Disbursement of Financial Aid State of Washington 529 Plans Scholarships & Taxes Private Scholarships Scholarships and Sponsors Student Taxes Employees' Tuition Exemption Tax Withholding Loans & Receivables Student Loans Short-Term Loans Loan Repayment Loan Forms Delinquent Accounts Bankruptcy Notices UW Depts Departmental Scholarships and Fellowships Departmental Loan Authorizations Forms and Job Aids for Departments Invoice Receivables Red Flag Guidelines Student Account Reports Resources Information Release Gramm-Leach-Bliley Act Forms for Students Petitions Common Calendar About SFS Staff Directory Reports Contact Us Student Fiscal Services Home Tuition Overview Tuition Overview Obligations When you register for courses at the University of Washington, you are obligated to pay the associated tuition and related fees for those classes unless you officially drop your classes by the end of the first week of the quarter. You are billed tuition based on the number of credit hours (including audit courses ) that you are registered for at the beginning of the quarter. Rates Tuition rates are maintained by the Office of Planning & Budgeting and are based on your grade classification, residency status, tuition graduate tier and the total number of credit hours for which you are registered. This includes classes that you audit. Rates differ depending on which campus you attend, due to slight variations in Services & Activities fees. If a graduate student falls into two tuition tiers, they will be charged the greater of the two tier rates when producing the tuition bill. To view which tuition tier you belong to, please review the list of Programs in Each Graduate Tier (by campus) . Tuition Rates: Quarterly/Summer Tuition and Fee Schedules Current and Prior Year Tuition and Fee Schedules For questions regarding tuition and fee distribution, please visit the Office of Planning & Budgeting website for contact information. Contacts: Processing/payment of tuition and fees - Student Fiscal Services Financial Aid - Office of Student Financial Aid Residency status and definitions - Residence Classification Office Graduate service appointments - Graduate School Fee-based programs - Professional and Continuing Education Powered by Drupal Main navigation Tuition & Fees Tuition Overview Pay Tuition & Fees When Tuition is Due Academic Student Employees (ASE) Tuition Exemptions and Reductions U-Pass Fee Returned or Nonsufficient Payments Drops, Withdrawals, Forfeitures & Refunds Registration Holds Disbursement of Financial Aid State of Washington 529 Plans Support Need Help? Address: 1410 NE Campus Parkway Schmitz Hall, Room 129 Seattle, WA 98195-5870 Campus Map Email: sfshelp@uw.edu Phone: (206) 543-4694 Phone Hours: 10:00am - 4:00pm Campus Mailbox: 355870 Office Hours: M-F 12:00pm - 3:00pm Tuition Quick Links Office of Financial Aid Office of Planning and Budgeting University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Footer Accessibility Campus Safety Contact Us Contact Jobs My UW Privacy Rules Docket Terms Shibboleth login © 2024 University of Washington | Seattle, WA"
}