{
  "id": 6,
  "date": "2024-05-18T18:21:57.869332",
  "url": "https://www.law.uw.edu/",
  "university_name": "University of Washington",
  "title": "UW School of Law",
  "content": "Skip to content Directory Students Faculty/Staff Alumni Give Menu Information for: Directory Students Faculty/Staff Alumni Navigation: About History William H. Gates Hall Faculty and Staff Directory Required Disclosures Contact Us Calendar Diversity, Equity and Inclusion William H. Gates Hall Art Display Policy Academics J.D. Program LL.M. Programs M.J. Program Ph.D. in Law Experiential Learning Programs, Centers & Projects Undergraduate Student Journals Course Catalog Continuing Legal Education Admissions J.D. Admissions LL.M. Admissions M.J. Admissions Ph.D. Admissions Paying for Law School Visit and Connect Student Life Student Support Academic Success Diversity LGBTQIA Resources Student Ambassadors Student Organizations UW Law & the Military MyLaw Careers J.D. Career Development Graduate Career Development William H. Gates Public Service Law Program Gregoire Fellows Program Employment Statistics Information for Employers Professional Education Mentoring and Mock Interview Programs 12Twenty Career Development Resource Center Faculty & Scholarship Featured Faculty Scholarship Recent Scholarship Recent Presentations Visiting Scholars Program Shefelman Faculty Workshops Faculty Directory Media Guide Library Law Student Resources Faculty & Staff Resources Library Hours Legal Research Guides News & Events News UW Law in the Media Calendar Discovery Podcast UW School of Law Featured News Empathy on the Border UW Law students supported newly arrived immigrants in San Diego during spring break, gaining insights in immigration law and building empathy at the U.S.-Mexico border. Watch Now Three-Minute Legal Talks: Reclassifying Cannabis as a Schedule III Substance Professor of Law Karen Boxx covers the legal implications of cannabis’s reclassification as a Schedule III substance, including business, consumer and medical implications. News Taylor Shoecraft (2L) Receives Justice Charles Z. Smith Award UW Law hosts the annual event in conjunction with Seattle University Law, Gonzaga Law and the Washington State Minority and Justice Commission. The awards honor law students who exemplify Justice Charles Z. Smith’s legacy of demonstrated leadership for justice, equality and public service. News Two Law Dawgs Make the Husky 100 The UW named Abigail Archival Vannice (M.J. student) and Teresa Dennerlein (2L) to the Husky 100, an honor that recognizes students who are taking their education beyond the classroom and making a difference on campus, in their communities and for the future. News The Most Downloaded Paper \"Designing Islamic Constitutions is the most downloaded paper of all time in the field of comparative constitutionalism. Written by Clark Lombardi, it has been downloaded over 8800 times. It is well worth reading for its rich insights into Islamic constitutionalism.\" (Source: The Leaflet) In the Media Almost Dawg Gone Done Upcoming graduates share reflections and highlights from their time at UW Law. News International Visitor Leadership Program visits NALC On Thursday, April 18, the Native American Law Center hosted a group of distinguished visitors from around the world who were in Seattle as part of the State Department's International Visitor Leadership Program (IVLP), operated by the World Affairs Council. News Read more from UW Law: News and Events Podcast logo showing the crystals in the courtyard with a broadcasting icon. Season 6 Now Streaming The sixth season of DISCOVERY is here! Listen now to in-depth conversations about today's biggest legal topics with distinguished guests from around the globe. Enter Discovery Dive Into a Playlist Upcoming Events at UW Law See All Calendar Events Connect with us: Contact Us Privacy Policy Terms ABA Required Disclosures © Copyright 2024, All Rights Reserved University of Washington School of Law 4293 Memorial Way Northeast, Seattle, WA 98195"
}