{
  "id": 6,
  "date": "2024-05-18T18:21:55.686023",
  "url": "https://www.washington.edu/about/housing/",
  "university_name": "University of Washington",
  "title": "Student housing",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academics at the UW Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Research at the UW Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving About the UW About the UW Student housing Student housing A variety of housing options are available at the UW. Offering traditional residence halls, the newest state-of-the-art facilities, apartment-style living and fraternity and sorority housing, there is something for everyone. Undergraduates Living on campus is an out-of-class adventure with opportunities to explore who you are and what you value, develop meaningful relationships, and embark on a path of your own choosing. With on-campus housing, your life can be simplified: one-stop, one bill, one priority: you. Whether you choose to live in a residence hall or an apartment-style building, both options provide students with shared kitchens, study rooms, furniture, and a full list of other benefits and amenities. Choose a Husky Home designed to support your needs! Helpful resources: On-campus housing: UW Housing & Food Services On-campus housing photos and floor plans On-campus housing and dining rates Contact: 206-543-4059 or hfsinfo@uw.edu Graduate & professionals Our apartments are the ideal option for graduate and professional students, singles, couples and families. Designed for busy students, they provide convenience, support and plenty of opportunities for community involvement. Learn more about graduate student apartments Contact: 206-543-4059 or hfsinfo@uw.edu Fraternities & sororities For more than 100 years, fraternities and sororities have been housing UW students. Facilities accommodate from 15 to 116 members and offer numerous amenities, camaraderie and academic support. More than 1,000 freshmen a year find a home in one of our 50 houses. Fraternities Sororities Contact: 206-543-1810 or ofsl@uw.edu Helpful links Disability Accommodations Housing & Food Services Husky Health & Well-Being Safety Apply to the UW The UW has thriving campuses in Seattle, Bothell and Tacoma and robust professional and continuing education programs. Learn more UW News UW atmospheric scientist participating in field campaign to improve Western snowfall, drought forecasts ArtSci Roundup: Global Sport Lab, Art Honors Graduation Exhibition, Interconnected Worlds with Henry Yeung and more Thirteen UW students receive Fulbright exchange awards for study, research and teaching positions around the world More University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}