{
  "id": 6,
  "date": "2024-05-18T18:22:02.116780",
  "url": "https://www.washington.edu/populationhealth/",
  "university_name": "University of Washington",
  "title": "Population Health Initiative",
  "content": "Skip to main content MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Home About Overview Leadership What is population health? Our approach Hans Rosling Center Evaluation Contact us Education Undergraduate courses Let’s Talk Pop Health Pop Health Academy Graduate Certificate in Humanitarian Response Applied Research Fellowship Social Entrepreneurship Fellowship Pop health how-tos Other education and training Research Bolstering community well-being Improving vaccine equity in the U.S. Improving vaccine equity in Canada Boosting vaccination coverage Understanding vaccine hesitancy of nurses Assessing drivers of HPV vaccine hesitancy Funded pilot projects Population health research at the UW Resources COVID-19 Collaboration support Grant application support Climate change experts Disaster and humanitarian experts Other experts Mobile and digital population health Social innovation and entrepreneurship Event and room reservations Funding and awards News Latest news and updates Subscribe Journal articles Media coverage Get involved Give Partner Volunteer Events Population Health Initiative Population Health Menu Home About Overview Leadership What is population health? Our approach Hans Rosling Center Evaluation Contact us Education Undergraduate courses Let’s Talk Pop Health Pop Health Academy Graduate Certificate in Humanitarian Response Applied Research Fellowship Social Entrepreneurship Fellowship Pop health how-tos Other education and training Research Bolstering community well-being Improving vaccine equity in the U.S. Improving vaccine equity in Canada Boosting vaccination coverage Understanding vaccine hesitancy of nurses Assessing drivers of HPV vaccine hesitancy Funded pilot projects Population health research at the UW Resources COVID-19 Collaboration support Grant application support Climate change experts Disaster and humanitarian experts Other experts Mobile and digital population health Social innovation and entrepreneurship Event and room reservations Funding and awards News Latest news and updates Subscribe Journal articles Media coverage Get involved Give Partner Volunteer Events Home Population Health Healthy people, healthy planet Healthier communities make healthier people. The University of Washington is at the forefront of addressing the interconnected factors that influence how long and how well we live, from climate change and poverty to systemic inequities and access to medical care. In partnership with community organizations, the UW transforms research into concrete actions that improve and save lives across the country — and around the world. What is population health? Population health is a broad concept encompassing not only the elimination of diseases and injuries, but also the intersecting and overlapping factors that influence health. The UW’s Population Health Initiative is defined by three major pillars: human health , environmental resilience and social and economic equity . Our work addresses the challenges that arise where these pillars intersect. Latest news Initiative selects summer 2024 cohort of Applied Research Fellows May 14, 2024 Initiative selects four graduate students as summer Social Entrepreneurship Fellows May 6, 2024 Honorees announced for 2024 undergraduate research recognition awards May 2, 2024 More news Spotlight on key issues Poverty and childhood health Your early years set the stage for your life. Children who live in poverty have less access to medical care, nutrition and high-quality early education — the foundations for lifelong health. Learn how the UW is working to understand the ripple effects of childhood poverty — and using that research to create better futures for all children. Learn more Location and lifespan How long we live is affected by where we live. Learn what the UW is doing to understand why people in some regions of the United States and the world have a shorter expected lifespan, and how the University is using that research to improve the length and quality of everyone’s lives. Learn more Maternal health For many women around the world — including here in the United States — having a baby isn’t as safe as it should be. Learn what the UW is doing to better understand what causes disparities in pregnancy risks and use that research to improve the health of mothers everywhere. Learn more Spotlight issues archive The Hans Rosling Center for Population Health The Hans Rosling Center for Population Health ushers the UW into a new era of collaboration and solutions for healthier populations. With spaces for collaborative group work, active learning, offices and training for global partners and multidisciplinary work in population health across the UW, the Rosling Center is a hub for addressing critical issues like poverty, equity, health-care access, climate change and government policy. Events calendar Population Health Twitter Tweets by UW_PHI Please enable JavaScript to view this widget. University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}