{
  "id": 6,
  "date": "2024-05-18T18:22:23.568198",
  "url": "https://www.washington.edu/about/",
  "university_name": "University of Washington",
  "title": "About the UW",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academics at the UW Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Research at the UW Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving About the UW Since our founding in 1861, the University of Washington has been a hub for learning, innovation, problem solving and community building. Driven by a mission to serve the greater good, our students, faculty and staff tackle today’s most pressing challenges with courage and creativity, making a difference across Washington state — and around the world. Apply to the UW Our three campuses The UW comprises campuses in Seattle, Bothell and Tacoma, as well as a world-class medical center serving the state and the region. Each year, the UW inspires more than 60,000 students to learn from renowned experts in their fields. As a “best buy” public university , our goal is to make higher education accessible for all. Seattle The UW in Seattle features a campus renowned for its beauty in the midst of a vibrant, multicultural city. Find your community among more than 33,000 undergraduate students, learn from award-winning faculty and discover your path with more than 180 majors to choose from. Visit Seattle Bothell UW Bothell is a student-centered campus community with 6,000 students, more than 350 faculty, five schools and more than 50 undergraduate and master’s degree programs. It offers the benefits of a small campus with the resources and opportunities of a large university. Visit UW Bothell Tacoma UW Tacoma is an urban-serving university community in the heart of downtown Tacoma, closely linked with the South Puget Sound area. Choose from among 40 undergraduate degree programs and 25 minors and certificates in a wide range of fields. Visit UW Tacoma UW Medicine UW Medicine provides comprehensive, state-of-the-art, compassionate care by bringing together a top-rated medical school, an internationally recognized research organization and a large network of medical providers and facilities across the region. We’re committed to excellence in training the next generation of health professionals and researchers. And with over 1.6 million patient visits and $729 million in uncompensated care for low-income patients in need in 2021, we are dedicated to the health and well-being of Washingtonians statewide. UW Medicine World leaders in research The University of Washington has been recognized as the #1 most innovative public university in the world and is consistently ranked among the top public universities in the world. The UW receives more federal research dollars than any other U.S. public university and has been home to 7 Nobel Prize winners; 17 MacArthur Fellows; 189 members of the National Academies of Sciences, Engineering, and Medicine; and 193 fellows in the American Association for the Advancement of Science. Stories of impact Read about the people, places and programs that drive the University of Washington’s faculty, staff and students to work for a world of good. Featured stories UW News releases UW atmospheric scientist participating in field campaign to improve Western snowfall, drought forecasts 1 day ago ArtSci Roundup: Global Sport Lab, Art Honors Graduation Exhibition, Interconnected Worlds with Henry Yeung and more 2 days ago More from UW News Subscribe to our monthly newsletter Sign up for UW Current to discover the latest on new innovations, useful tips and information, and eye-opening stories coming out of the UW community. University Leadership “I’m often asked about my vision for the UW, and my answer has always been simple: to be the top public university in the world in terms of positive impact.” Ana Mari Cauce University of Washington President Professor of Psychology Learn more about the UW’s president , provost , board of regents and faculty senate . UW Leadership PRESIDENTIAL INITIATIVES Race and equity The Race & Equity Initiative challenges all of us — students, faculty, staff and University leadership — to take personal responsibility for addressing our own biases and improving our University culture. Together we commit to combating racism and inequities, both individual and institutional, that persist here and throughout our society. Learn more Population health Because we believe that healthier communities make healthier people, our Population Health Initiative sets out a 25-year vision for improving environmental resilience, social and economic equity, and the health of people here in Washington and around the globe. Under this initiative, the UW community and partners come together in interdisciplinary collaboration to address the intersecting and overlapping factors that influence health. Learn more Innovation The University of Washington’s Innovation Imperative Initiative empowers students and researchers to learn, discover and build solutions to tomorrow’s challenges. We are ranked as the #1 undergraduate school in the West for entrepreneurship , and CoMotion , the UW’s collaborative innovation hub, has helped launch 258 companies since 1990. Learn more UW AND THE COMMUNITY Global impact As one of the world’s most innovative universities, we know the importance of a global perspective. We’re proud to deliver on our mission of education, discovery and public service — with programs and research across Washington state and across every continent. Learn more Alumni association No matter where you are, if you believe in higher education, supporting students, lifelong learning or cheering on the Dawgs, the University of Washington Alumni Association connects you to what matters. Get involved UW in your community From researching in the foothills of Mount Rainier to training medical students in Seattle and Spokane, the UW is truly the University for Washington. Explore projects Take the next step! Apply to the UW Connect on social Subscribe to newsletter Visit UW: Seattle , Bothell , Tacoma University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}