{
  "id": 6,
  "date": "2024-05-18T18:22:20.802696",
  "url": "https://magazine.washington.edu/",
  "university_name": "University of Washington",
  "title": "",
  "content": "MENU People Features Hub Solutions Arts Sports Letters Finding the words Finding the words Finding the words UW Press celebrates \"Aiiieeeee!\" and a 50-year legacy of Asian American Literature. By Shin Yu Pai | Illustration by Julia Kuo | Viewpoint Magazine Alumni , Local News , Sports The replacement Braden Bishop starred in the outfield at the UW, but it’s a Mariner moment for which he’ll never be forgotten. UW Magazine Online Alumni , Solutions Backyard bliss Kris Myllenbeck couldn't find a stylish wading pool on the market, so she took the plunge and made her own. UW Magazine Online Alumni , Community , Obituaries Susie Tennant, 1962–2024 Susie Tennant was beloved for discovering and promoting bands such as Nirvana, Sonic Youth and Beck. June 2024 issue Hub × Alumni | Books | January 8, 2024 A new history Ned Blackhawk's book about Native Americans in U.S. history won the National Book Award for its enlightening take on \"rediscovering\" America. June 25, 2023 Honoring our veterans Stories of members of the UW community who have served in the armed forces. Alumni | Arts & Entertainment | Local News | April 11, 2024 The last DJ After a career of shaved turkey legs and tartar-sauce baths, Tim Hunter can’t quite turn the dial. Features | Sports | February 24, 2024 Elevated awareness In his recently released memoir, alpinist and climate advocate Graham Zimmerman reflects on what he’s learned from two decades of climbing some of the world’s highest peaks. Students | May 14, 2024 2023 MAP Scholars UW's MAP proudly presents the five outstanding student recipients of their 2023 MAP awards. Alumni | Community | Features | News | February 24, 2024 Civic and civil Husky Civic Saturdays bring people together to explore moral questions that concern all of us. Alumni | Community | Husky History | January 27, 2024 City Hall's top dawg Bruce Harrell, ’81, ’84, talks about football, family and Seattle's transformation in an exclusive Q&A. Alumni | January 25, 2024 Out of the box Pastry chef Lauren Tran, who bakes up desserts with Southeast Asian flavors, tells us how she got her start. Alumni | February 24, 2024 Clean-energy Republican Heather Reams advocates for clean energy and discusses climate change from a Republican perspective. Alumni | Books | February 24, 2024 Raves for novelist E.J. Koh’s debut novel affirms her place among powerful American storytellers. Community | Local News | April 12, 2024 Coffee and community Efrem Fesaha showcases the history of coffee in Africa through Boon Boona Coffee. Campus Life | Husky History | May 14, 2024 Nurturing new leaders Leadership Without Borders, now 10 years old, empowers and serves undocumented students on campus. Alumni | February 24, 2024 Reaching and teaching Teacher Pamela Savagaonkar saw a gap in STEM education for kids and started a venture in Snoqualmie Valley. Obituaries | February 24, 2024 Nancy Bell Evans, 1933-2024 Nancy Bell Evans was an inspiration to UW students as well as one of the University’s biggest supporters. Art | Campus News | Faculty & Staff | May 17, 2024 Art direction Jordan Jones will provide curation, programming, and leadership to the gallery. Alumni | Local News | Sports | April 24, 2024 The replacement Braden Bishop starred in the outfield at the UW, but it’s a Mariner moment for which he’ll never be forgotten. Campus Life | Community | Sports | Students | February 24, 2024 Serious horsing around Students from the big city saddle up for fun on the UW Equestrian Team. Alumni | Campus News | May 17, 2024 A new Spark Award Mariama Suwaneh, ’17, was an engaged student leader and activist on campus and continues to build community everywhere she goes. Features | Research | STEM | Students | February 24, 2024 Clean energy urgency The UW’s Clean Energy Institute is speeding the development of next-generation technology and supporting the experts who will create it. Art | Community | Husky History | March 22, 2024 Highest achievers The organization that honors Rosa Parks, Elie Wiesel and Jane Goodall has also celebrated three members of the UW community. Alumni | Art | Books | Local News | April 30, 2024 Art under cover In a city known for its literature, Tom Eykemans and Jayme Yen created a festival that celebrates the beauty of books. Alumni | Community | Students | February 24, 2024 Living laboratory Each year, some 1,200 to 1,500 Huskies find their way to the UW Farm through classes, service-learning programs, research projects and clubs. Alumni | Art | Local News | February 7, 2024 Beauty after chaos The Wing Luke Museum unveils a new mural across Canton Alley after the museum's windows and doors were vandalized in an alleged hate crime in September. Alumni | Community | Film & TV | Local News | December 13, 2023 Cinema steward Tom Mara, who helms the Seattle International Film festival, is making history by transforming the Cinerama into SIFF Cinema Downtown. Alumni | Solutions | May 13, 2024 Backyard bliss Kris Myllenbeck couldn't find a stylish wading pool on the market, so she took the plunge and made her own. Alumni | Art | Obituaries | February 27, 2024 Colleen McElroy, 1935-2023 Colleen McElroy, 1935-2024, was the first Black woman to be promoted to a full professorship at the UW. Alumni | Books | Husky History | May 3, 2024 Finding the words UW Press celebrates \"Aiiieeeee!\" and a 50-year legacy of Asian American Literature. Campus News | Community | February 23, 2024 Always identity forward Margaret Cho brings her socially and personally aware comedy to UW Graduate School's Public Lecture Series. Alumni | Art | March 15, 2024 Thermal creatures In her current Seattle exhibit, Saya Moriyasu, ’91, imagines magical mineral spirits in paper and clay. Research | February 23, 2024 Hope against peril A team of University of Washington researchers and scientists is helping coastal communities prepare for a tsunami and other associated risks. Alumni | Art | March 19, 2024 In focus Tina Dang and Miguel Laureano Damian combine their skills to create striking imagery and videos. Alumni | Letters | February 23, 2024 Beware the hollow horse Words of caution from 2,000 years ago are relevant today as our country experiences an alarming escalation in efforts to censor books. Editor's Eye | Faculty & Staff | Research | February 23, 2024 The nature of nature It’s no surprise that the federal government turned to the UW to head up an assessment of America's lands, waters and wildlife. Husky History | News | February 23, 2024 Boldt Decision echoes today The Boldt Decision, which turns 50 this year, reaffirmed tribal fishing rights in Washington and marked a turning point for tribal sovereignty. Art | Community | February 23, 2024 Dazzling display Artist Raúl de Nieves blends mystical symbols and Mexican craft in a Henry Art Gallery exhibition. Campus Life | Local News | November 9, 2023 A requiem for Burgermaster A hotspot for UW rowers and other community members, Burgermaster's flagship location has an uncertain future. Campus Life | Campus News | Faculty & Staff | Sports | February 23, 2024 Swan song Brad McDavid, the longest-serving band director in UW history, is calling it a career. Alumni | Husky History | Local News | May 9, 2024 Campus was their canvas Eddie Demmings, E.J. Brisker and Eddie Ray Walker—founding members of the UW's Black Student Union—fought for a better University. Alumni | Campus Life | Film & TV | May 9, 2024 Celebrating AAPI stories UWT Alumnus and filmmaker Nuk Suwanchote revisited his alma mater to explore the growing community of Asian American and Pacific Islander students, staff and faculty at UW Tacoma. Medicine | February 23, 2024 Alzheimer’s ‘milestone’ Doctors describe a new drug as a first step toward revolutionizing the treatment of Alzheimer's disease. Alumni | May 9, 2024 Sound advice Tiana Cole, ’21, and Brad Blackburn III, ’21, ’23, are two young alumni offering sound advice in their new podcastt. Uncategorized | May 9, 2024 Preserving the past, protecting the future Leonard Forsman's love for cultural preservation has led to a life of service. Alumni | Film & TV | Husky History | March 19, 2024 Huskies on Arrakis The UW and the Pacific Northwest played their part in the \"Dune\" universe. Campus Life | Faculty & Staff | November 29, 2023 Looking up With determination, faith and the UW’s belief in her, Square Donaldson overcame tremendous obstacles. Faculty & Staff | Research | February 23, 2024 Studying modern slavery Professor Anita Ramasastry is part of a global commission investigating the rise of forced labor. Sports | February 23, 2024 Fisch takes helm A season of stunning success brings big expectations for new Husky Coach Jedd Fisch. Art | Faculty & Staff | Features | February 23, 2024 Art in action UW Senior Artist-in-Residence Anida Yoeu Ali opens a solo show at Seattle Asian Art Museum. Alumni | Community | Obituaries | May 14, 2024 Susie Tennant, 1962–2024 Susie Tennant was beloved for discovering and promoting bands such as Nirvana, Sonic Youth and Beck. Faculty & Staff | Features | Research | Students | February 23, 2024 Mix masters At the Concrete Materials Lab, UW students are testing ways to bring concrete into a sustainable future. Art | Faculty & Staff | April 4, 2024 Buddhist Bug UW Bothell Senior Artist-in-Residence Anida Yoeu Ali donned her orange worm-like costume at a recent Seattle Asian Art Museum performance. In Print Current Issue March 2024 View PDF of the current print magazine Alumni , Books A new history Ned Blackhawk's book about Native Americans in U.S. history won the National Book Award for its enlightening take on \"rediscovering\" America. March 2024 Issue Features , Sports Elevated awareness In his recently released memoir, alpinist and climate advocate Graham Zimmerman reflects on what he’s learned from two decades of climbing some of the world’s highest peaks. March 2024 Issue Alumni , Community , Features , News Civic and civil Husky Civic Saturdays bring people together to explore moral questions that concern all of us. March 2024 Issue Alumni , Books Raves for novelist E.J. Koh’s debut novel affirms her place among powerful American storytellers. March 2024 Issue Alumni Reaching and teaching Teacher Pamela Savagaonkar saw a gap in STEM education for kids and started a venture in Snoqualmie Valley. March 2024 Issue Campus Life , Community , Sports , Students Serious horsing around Students from the big city saddle up for fun on the UW Equestrian Team. March 2024 Issue Features , Research , STEM , Students Clean energy urgency The UW’s Clean Energy Institute is speeding the development of next-generation technology and supporting the experts who will create it. March 2024 Issue Alumni , Community , Students Living laboratory Each year, some 1,200 to 1,500 Huskies find their way to the UW Farm through classes, service-learning programs, research projects and clubs. March 2024 Issue Alumni , Art , Obituaries Colleen McElroy, 1935-2023 Colleen McElroy, 1935-2024, was the first Black woman to be promoted to a full professorship at the UW. March 2024 Issue Campus News , Community Always identity forward Margaret Cho brings her socially and personally aware comedy to UW Graduate School's Public Lecture Series. March 2024 Issue Research Hope against peril A team of University of Washington researchers and scientists is helping coastal communities prepare for a tsunami and other associated risks. March 2024 Issue Editor's Eye , Faculty & Staff , Research The nature of nature It’s no surprise that the federal government turned to the UW to head up an assessment of America's lands, waters and wildlife. March 2024 Issue Alumni , Film & TV , Husky History Huskies on Arrakis The UW and the Pacific Northwest played their part in the \"Dune\" universe. UW Magazine Online Art , Faculty & Staff , Features Art in action UW Senior Artist-in-Residence Anida Yoeu Ali opens a solo show at Seattle Asian Art Museum. March 2024 Issue Faculty & Staff , Features , Research , Students Mix masters At the Concrete Materials Lab, UW students are testing ways to bring concrete into a sustainable future. March 2024 Issue People The last DJ After a career of shaved turkey legs and tartar-sauce baths, Tim Hunter can’t quite turn the dial. UW Magazine Online In focus Tina Dang and Miguel Laureano Damian combine their skills to create striking imagery and videos. UW Magazine Online Huskies on Arrakis The UW and the Pacific Northwest played their part in the \"Dune\" universe. UW Magazine Online Solutions Clean-energy Republican Heather Reams advocates for clean energy and discusses climate change from a Republican perspective. March 2024 Issue Alzheimer’s ‘milestone’ Doctors describe a new drug as a first step toward revolutionizing the treatment of Alzheimer's disease. March 2024 Issue Studying modern slavery Professor Anita Ramasastry is part of a global commission investigating the rise of forced labor. March 2024 Issue Media The Wonder of Warashina ‘One foot at a time’ Running man UW Alumni Association Instagram UW Alumni Association Facebook @UWalum Contact the magazine About Subscribe Update your info University of Washington Be boundless Connect with us: Facebook Twitter Instagram Tumblr YouTube LinkedIn Pinterest Vine Google+ Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms ©\t2024 University of Washington  |  Seattle, WA"
}