{
  "id": 6,
  "date": "2024-05-18T18:21:27.154665",
  "url": "https://www.washington.edu/research/",
  "university_name": "University of Washington",
  "title": "Featured Story Slideshow",
  "content": "Skip to main content University of Washington Research Contact Us About Office of Research Announcements UW Home Quick Links MyResearch Project Lifecycle Plan/Propose Plan/Propose Develop Hypothesis/Question Select Funding Source Conduct Literature Search Sponsor Requirements Recruit Team Budget Facilities and Resources Write Proposal Submit Proposal Tools MyResearch SAGE Zipline More Tools Setup Setup Sponsor Requirements Facilities and Resources Financials Subawards Compliance Requirements (Non-Financial) Records and Documentation Methods Collaborations Data Collection Tools MyResearch SAGE Zipline More Tools Manage Manage Financials Compliance Requirements (Non-Financial) Facilities and Resources Collect Data Analyze Data Subawards Award Changes Reporting Tools MyResearch SAGE Zipline More Tools Closeout Closeout Financials Subawards Equipment and Materials Reporting Dissemination of Results Data Sharing Records Retention Tools MyResearch SAGE Zipline More Tools Resources Popular Resources FAQs Forms and Templates Glossary Honors and Awards Institutional Facts and Rates Policies, Procedures, and Guidance Research Stats & Rankings Workday Finance & Research PI Quick Links Funding Opportunities New to UW Research PI Resources Quick Start Proposal Development Resources Collaboration Agreement Types Guidance for NIH Institutional Training Grants Research Centers and Institutes Research Expertise Shared Research Facilities and Resources Tools MyResearch SAGE Zipline More Tools Units/Partners Support Offices Human Subjects Division (HSD) Office of Animal Welfare (OAW) Office of Research Central (ORC) Office of Research Information Services (ORIS) Office of Sponsored Programs (OSP) Research Units Applied Physics Laboratory (APL-UW) Washington National Primate Research Center (WaNPRC) UW Research Partners Environmental Health and Safety (EH&S) CoMotion Corporate and Foundation Relations (CFR) Grant and Contract Accounting (GCA) Management Accounting and Analysis (MAA) Post Award Fiscal Compliance (PAFC) Compliance Office of Research Compliance Animal Welfare Human Embryo and Embryonic Stem Cell Research Oversight Export Controls Financial Conflict of Interest Foreign Interests Grants Information Memoranda (GIMs) Human Subjects/IRB Policies, Procedures, and Guidance Research Misconduct Required Research Training Responsible Conduct of Research UW Partner Compliance Biosafety (EH&S) Environmental Health and Safety (EH&S) Fire Code Hazardous Materials Post Award Fiscal Compliance (PAFC) Radiation Safety (EH&S) UW Medicine Compliance Training Research Administration All Research Administration Learning Resources Certificate in Research Administration Collaborative for Research Education (CORE) PI Resources Quick Start Research Compliance Environmental Health & Safety (EH&S) Training Financial Conflict of Interest  (FCOI) Training Grants Management for Investigators (GMI) Human Subject Division Training and Education Required Research Training Responsible Conduct of Research Featured Story Slideshow Certificate of Confidentiality Update The NEW NIH Certificate of Confidentiality (CoC) policy broadens the definition of identifiable human subjects data, applies to all active NIH funded research, and has specific requirements for when identifiable data can be shared. Does my research qualify? Delayed Revision of Human Subjects Regulations Federal agencies have delayed implementation of the revised human subjects regulations (the “Common Rule”) until July 19, 2018. Questions? Contact the Human Subjects Division at hsdinfo@uw.edu NIH Changes: January 2018 FORMS-E Application Package with New Human Subjects / Clinical Trial Form Broader NIH definition of Clinical Trials Clinical Trial Specific Funding Opportunity Announcements Single Institutional Review Board (sIRB) Learn More Research Annual Report FY17 Highlights $1,628,491,114 in sponsored grants and contracts $1,033,812,778 federal funding $594,678,336 non-federal funding 5,174 awards Stats and Rankings MyResearch Training Transcript Need to confirm that you have completed a required training, or whether or not it has expired? Visit MyResearch Training Transcript – your resource for institutional research-required training records. View transcript Research Annual Report FY18 Highlights $1,350,758,513 in sponsored grants and contracts $1,035,012,267 federal funding $315,746,246 non-federal funding 5,367 grants;186 grants over $1m View FY18 Annual Report SAGE Budget Sync Sync your SAGE Budget to Grant Runner RR Detailed Budget Read More Federal Government Shutdown We will continue to share guidance and resources from Affected Agencies as we receive them. Learn More The Revised Common Rule The human subjects regulations that govern most UW human subjects research have been revised as of January 21, 2019. See HSD’s Revised Common Rule webpage for details and resources. Revised Common Rule New Video Resource Learn about MyResearch in a new 4-minute introduction to the portal. Welcome to MyResearch Governor Signs Bill Reducing Burden of Higher Ed Records Research Governor Inslee signed bill SB 5786 that removes redundant state requirements about human subjects records research already protected by federal regulations. This reduces significant burden to research teams! HSD Director Karen Moe has worked for years in support of this bill, which takes effect on July 28, 2019. Congrats Karen! Time to renew your Faculty Grants Management Training? The newly redesigned online refresher highlights recent changes in research administration and policy. View your completed record in MyResearch Training Transcript. Visit FGM Information Guidance for Foreign Interests in Sponsored Programs Our newly published webpage, “Foreign Interests in Sponsored Programs” provides guidance and resources from our federal sponsors on this important and timely issue. We will be posting new information as it becomes available. Visit Foreign Influence on Sponsored Programs Search is Here! The MyResearch Search Alpha feature has been released. Search across the MyResearch portal for applications, awards, non-award agreements and training transcripts. Learn more New! Certificate in Research Administration We enthusiastically announce the launch of the new Certificate in Research Administration! This certificate provides coursework on research administration practices, policies and procedures, and supports UW learners in forging career pathways. Learn More Shared Research Facilities and Resources The Shared Research Facilities and Resources webpage offers an index of resources that include essential services, advanced instrumentation, and technical expertise needed for cutting-edge research. Do you have equipment, facilities or research that are available to the UW community? Contact Us! Visit Site Mitigating Impacts to Research Activities Due to COVID-19 -Research operations should continue, see guidance -Some human subjects research has been temporarily halted (see HSD COVID-19 page) -OSP & HSD standing by to facilitate SARS-CoV-2 & COVID-19 proposals Visit Page THANK YOU RESEARCH COMMUNITY The Office of Sponsored Programs recorded a heartfelt thank you for our research community. Watch the Video Redesigned SAGE Budget The newly redesigned SAGE Budget is here! Create and manage your budgets using a more streamlined, efficient, and intuitive design. View Design Highlights Research Guidance During COVID-19 Research is a CORE function of the UW. Keep up-to-date on research guidance and resources during Phase 2 of the Governor’s “Return to Work” plan. Mitigating Impacts to Research Due to COVID-19 Guidance for Returning to In-Person Research October is National Biosafety Month National Biosafety Month is a perfect time to refocus your attention on all biosafety policies, practices and procedures. Investigators and lab managers should raise biosafety awareness, and discuss the importance of safety. The focus of EH&S is to promote a culture of safety! Read More October is Cybersecurity Awareness Month Develop or expand your cyber awareness toolkit with information and training from the Office of the Chief Information Security Officer. Cybersecurity Awareness New to UW Research? Welcome! Whether you are starting out in your first position as a primary investigator, an experienced investigator new to the UW, or research administrator, our New to UW Research webpage will help you find the resources you need. More Info New Zipline Resources & Improvements for Human Subjects Research More Zipline help text; short instructional videos ; improvements & additions to the Researcher Guide How to request department administrator access to the department’s IRB applications The Strength of the UW Research Enterprise in FY2020 $1,631,239,212 in sponsored grants and contracts (up ~3.3%) $1,231,532,044 federal funding (up~.62%) $399,707,168 non-federal funding  (up ~12.6%) 5,506 Awards (up .22%) New! Foreign Influence and Sponsored Research Video & FAQs New Foreign Influence and Sponsored Research Video and FAQs provide guidance for researchers engaged in international research collaborations. Watch and review Q&A from subject matter experts. Watch Video Review the FAQs SAGE Advance Budget Requests The new SAGE Advance Budget Request process is now available! The new process includes automated eligibility checks, online approvals for campus, and a new, more intuitive design. View More Details HSD - Revisions to Restrictions COVID-related restrictions on human subjects research are significantly revised. Read the Webpage Mari Ostendorf, new UW Vice Provost for Research On September 1, 2021, Mari Ostendorf was named the UW’s fourth Vice Provost for Research September 25th is Research Administrator Day! Honoring our Research Administrators who manage the complexities and sheer workload that support $1.89B in sponsored grants and contracts for FY21. We applaud each and every one! UW Research Timeline Explore the vast history of the UW from 1852-to 2021. View groundbreaking research accomplishments and fascinating historical highlights such as our first faculty, student body, and graduate in 1876, Clara McCarty. View the Timeline Congratulations to Karen Moe! Former Human Subjects Division Director Karen Moe has been chosen as a recipient of the David B. Thorud Leadership Award. The winners will be honored from 3:30 to 5:30 p.m. on June 9 at the Meany Hall for the Performing Arts. About the Ceremony Microsoft Will Retire Internet Explorer 11 on June 15, 2022 If you use IE11 to access research systems (including the Research Website), we highly recommend switching to the latest version of Google Chrome, Microsoft Edge, or Mozilla Firefox for the best experience. Learn More Research Report in the B.I. Portal Review the Research Administration Data (RAD) report that allows you to view proposals and awards based on a specific principal investigator (PI) or keyword is now available in the B.I. Portal. Learn More About the Report Supporting Research During UW Finance Transformation Learn more about UW Finance Transformation (UWFT), the upcoming changes to research administration systems and processes, and how we will support you on our journey to Workday go-live in July 2023! UWFT for the Research Community Featuring Online Training: IRB 101 New to working with the UW IRB? Go through the basics step by step in the IRB 101 online tutorial, required for students and residents and recommended for others new to human subjects research. IRB 101 Tutorial Research Highlights FY22 $1.67B in sponsored grants and contracts $1.27B federal funding $400M non-federal funding 5,605 awards October is National Biosafety Month National Biosafety Month is a perfect time to refocus your attention on safer policies, practices and procedures. Investigators and lab managers should consider substituting potential hazards for safer alternatives. Read about safer alternatives to reduce the potential for harm. Read More NIH Data Management and Sharing Policy NIH’s new DMS Policy has significant impacts for proposals submitted for due dates on or after January 25, 2023 resources and more information… Supporting Research During UW Finance Transformation We are approaching the summit on our journey to Workday Finance go-live. With the July 6 launch just around the corner, make sure you are prepared. Visit our webpage, UWFT for the Research Community. UWFT for the Research Community Commemorating Juneteenth: A Celebration of Freedom On June 19, 1865, Union General Granger informed the enslaved African Americans of their freedom and that the Civil War had ended. This is a day that calls for respectful acknowledgment of our past and a reflection on our future. Let us all do our part to create lasting change. NewProfs@UW: Making Connections to Help Launch your Academic Career NewProfs@UW is an in-person workshop on September 11, 2023 that welcomes incoming faculty to the UW community and connects them to resources that support research, scholarship and career development. Learn More & Register Research Administrator Day September 25 Thanks to our outstanding UW Research Administrators! In a top ranked institution with over $1.8 Billion in research funding, our staff are required to have a high level of knowledge and expertise to keep up with complex requirements and heavy workloads. Join us in celebration New IRB Tools for Designing Research Consent The UW IRB has published new resources to assist researchers with designing a participant-focused consent. These tools include new web guidance, new templates, and example consent forms. UW consent templates October is National Biosafety Month National Biosafety Month is a perfect time to refocus your attention on safer policies, practices, and procedures. Investigators and lab managers are encouraged to develop written SOPs for procedures involving biohazards. Value of written procedures Washington Research Foundation – Ronald S. Howell Distinguished Faculty Fellowship Faculty selected as the inaugural cohort of the Washington Research Foundation–Ronald S. Howell Distinguished Faculty Fellowship, endowed in honor of WRF’s longtime CEO Ron Howell. Awardees are Gabe Cler, Sam Golden, and Amy Orsborn. Announcement Tips for Award Setup and Modification Requests in SAGE Visit our webpage featuring quick tips for completing Award Setup and Modification Requests in SAGE, including comments, budgets, returned items, and helpful resources. Review Tips SAGE Award Search Now Available! You can now search for Award Setup, Modification, and Advance Requests from the SAGE Awards section. Learn more The Seattle Hub for Synthetic Biology The UW Office of Research congratulates The Allen Institute, the Chan Zuckerberg Initiative, and UW Medicine on the launch of their landmark collaboration, The Seattle Hub for Synthetic Biology. Read more Task Force Outlines Strategies for Incorporating D•E•I• Approaches in Research The Office of Research Task Force on Equity in Research has released its report on supporting and growing the UW’s incorporation of diversity, equity and inclusion approaches in research. Learn more Royalty Research Fund Grants Awarded The Office of Research would like to congratulate the 25 UW researchers selected for the January 2024 Royalty Research Fund grant awards. See awardee list Xiaosong  Li  co-leads  International  Research  Team's  Attosecond  Discovery Xiaosong Li, Associate Vice Provost for Research Cyberinfrastructure, is the co-lead of an international research team behind a breakthrough discovery which isolates the movement of electrons by measuring time in attoseconds. Read the article UW Computer Science and Chemistry Faculty named Sloan Fellows The Office of Research congratulates UW faculty members Simon S. Du and Adriana Schulz in Computer Science, and Alexandra Velian in Chemistry, on being awarded early-career fellowships from the Alfred P. Sloan Foundation. Read the article New Resources for Grant Reporting The Office of Research, the Finance DATAGroup, and UW-IT Reporting & Analytics are thrilled to announce three new Grant Reporting resources for grant management: The Grant Planning and Forecasting Tool, The Post-Award Dashboard, and The Principal Investigator Dashboard. Learn more Two UW Researchers Named AAAS Fellows The Office of Research congratulates UW faculty members Brandi Cossairt in Chemistry and Andy Stergachis in Pharmacy and Global Health on being named Fellows by the American Association for the Advancement of Science. Read the article Apply for an OR-hosted Discussion on Equity in Research for Excellence The Office of Research invites UW researchers to apply to organize an OR-hosted meal and discussion of its recent Report on Equity in Research for Excellence. Apply Now UW Researchers elected to the National Academy of Sciences Qiang Fu, Calvin professor of Atmospheric Sciences, and Raymond Huey, professor emeritus of Biology, have been elected to the National Academy of Sciences in recognition of their research achievements. Read the article Explore SAGE Budget resources Review new job aids for award budgets, join weekly SAGE Office Hours, and refresh your SAGE Budget knowledge. View Resources Be Boundless Enter search text UW Research Menu MyResearch Project Lifecycle Plan/Propose Setup Manage Closeout Resources Units/Partners Compliance Training Need help navigating Workday Finance? The Office of Research maintains the Workday Finance & Research webpage, which includes information, instructions, and resources to help you navigate the transition to Workday Finance. This one-stop resource is updated with the latest information and links as they are released. Visit Web Page New Faculty at UW Working on Climate Science and Sustainability Julie Rorrer , Assistant Professor, Chemical Engineering Jungwon Choi , Assistant Professor, Electrical and Computer Engineering Zachary Sherman , Assistant Professor, Chemical Engineering Claire Willing , Assistant Professor, Environmental and Forest Sciences Kendall Valentine , Assistant Professor, Oceanography Corey Garza , Professor, Aquatic and Fishery Sciences Michelle Muth , Assistant Professor, Earth and Space Sciences Sameer H. Shah , Assistant Professor, Environmental and Forest Sciences Vikram Iyer , Assistant Professor, Computer Science & Engineering Cory Struthers , Assistant Professor, Public Policy and Governance Jeremy J. Hess , Professor, Atmospheric Sciences Shijing Sun , Assistant Professor, Mechanical Engineering June Lukuyu , Assistant Professor, Electrical and Computer Engineering Christie Hegermiller , Assistant Professor, Civil and Environmental Engineering Celina Balderas Guzmán , Assistant Professor, Landscape Architecture Bhuvana Srinivasan , Associate Professor, Aeronautics and Astronautics View More New Featured Faculty World Leaders in Research The Office of Research invests in the future, enabling research advances to sustain UW’s reputation as a preeminent public university. 7 Nobel Prizes 258 Research Centers 5,506 Awards $1.87B Sponsored Grants and Contracts Stats and Rankings Honors and Awards UW Today Featured Research Announcements May 13, 2024 Upcoming Grants.gov Downtime: Plan Ahead for Proposal Impacts May 7, 2024 May 2024 Edition of Horizons Newsletter is Online May 3, 2024 Current OSP Employment Opportunities April 30, 2024 Consequences for Late or Missing Progress Reports All Announcements UW Today: Featured Research Exciting research is taking place all over campus. Visit UW Today – Research to see what research is being featured. Visit UW Today-Research The UW Research Timeline A look through UW’s vast history of research accomplishments. Research Timeline Vision The Office of Research will create an outstanding climate of support for University of Washington researchers, broadly enabling stellar research advances. About Us University of Washington Office of Research Tools MyResearch SAGE Zipline More Tools OR Support Offices Human Subjects Division (HSD) Office of Animal Welfare (OAW) Office of Research (OR) Office of Research Information Services (ORIS) Office of Sponsored Programs (OSP) OR Research Units Applied Physics Laboratory (APL-UW) WA National Primate Research Center (WaNPRC) Research Partner Offices CoMotion Corporate and Foundation Relations (CFR) Enivronmental Health and Safety (EH&S) Grant and Contract Accounting (GCA) Institute of Translational Health Sciences (ITHS) Management Accounting and Analysis (MAA) Post Award Fiscal Compliance (PAFC) Collaboration Centers and Institutes Collaborative Proposal Development Resources About Research Fact Sheet Research Annual Report Stats and Rankings Honors and Awards Office of Research Contact Us Manage Subscriptions Gerberding Hall G80 Box 351202 Seattle, WA 98195 Accessibility Jobs Campus Safety My UW Privacy Terms © 2024 University of Washington  |  Seattle, WA"
}