{
  "id": 6,
  "date": "2024-05-18T18:20:59.031083",
  "url": "https://www.washington.edu/accessibility/",
  "university_name": "University of Washington",
  "title": "Accessibility = All of Us",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu Technology Getting around Accommodations Resources Disability inclusion Accessibility at the UW Accessibility at the UW Accessibility = All of Us Welcome to the University of Washington’s centralized accessibility website, the “digital front door” to accessibility. This website gathers information from across the University to provide students, faculty, staff, visitors, patients, and the community with a single-entry point for relevant information about access to UW programs, services, and activities. Use these webpages to explore all that is available to you. Technology Getting around Accommodations Resources Disability inclusion Accessibility at the UW At the University of Washington, diversity is one of our core values and our campus is strengthened and enriched by people with disabilities. Accessibility is an approach to communication and engagement that recognizes the intersectional identities, experiences, and needs of our entire campus community. It goes beyond legal accommodations for students, staff and faculty with disabilities. Accessibility creates a community where everyone can bring their whole self to campus and have the opportunity to thrive. Search for: Report a barrier Experiencing a physical or technological barrier to access? Learn more ADA & Accessibility News Recieve quarterly news from the Office of the ADA Coordinator on all things accessibility. Learn More Contact the ADA Coordinator Visit the ADA Coordinator’s website to contact the team. Learn More University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}