{
  "id": 6,
  "date": "2024-05-18T18:21:00.564364",
  "url": "https://www.washington.edu/contact/",
  "university_name": "University of Washington",
  "title": "Contact the University of Washington",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academics at the UW Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Research at the UW Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving Contact the University of Washington Important contact information Seattle campus Telephone 206-543-2100 Hotline / campus status 206-897-INFO (4636) 866-897-INFO (4636) Directories Faculty, staff, student directory Office directory Public safety Emergency Call 911 or Text 911 Non-emergency 206-685-UWPD (8973) uwpolice@uw.edu police.uw.edu SafeCampus 206-685-7233 uw.edu/safecampus Mapping / directions address 1410 NE Campus Parkway Seattle, WA 98195 Seattle campus maps Seattle visitor’s center Transportation services UW Bothell Telephone 425-352-5000 Email uwbinfo@uw.edu Hotline / campus status 425-352-3333 Public safety Emergency Call 911 or Text 911 Non-emergency 425-352-5359 SafeCampus 206-685-7233 uwb-safety@uw.edu uwb.edu/safety Mapping / directions address 18115 Campus Way NE Bothell, WA 98011 Bothell campus maps Visit UW Bothell's website UW Tacoma Telephone 253-692-4000 800-736-7750 Email uwtinfo@uw.edu Public safety Emergency Call 911 or Text 911 Non-emergency 253-692-4416 SafeCampus 206-685-7233 uwtsafe@uw.edu tacoma.uw.edu/fa/safety Mapping / directions address 1900 Commerce Street Tacoma, WA 98402-3100 Tacoma campus maps Visit UW Tacoma's website Ways to contact the University of Washington UW Medicine contact information General information UW Medicine homepage Make and manage appointments Urgent Care Find a provider Find a location Contact information Harborview Medical Center 206-744-3000 325 9th Ave. Seattle, WA 98104 Maps and directions More information UW Medical Center – Montlake 206-598-3300 1959 NE Pacific St. Seattle, WA 98195 Maps and directions More information UW Medical Center – Northwest Hospital 877-694-4677 400 S. 43rd St. Renton, WA 98055 Maps and directions More information Valley Medical Center 425-690-1000 400 S. 43rd St. Renton, WA 98055 Maps and directions More information Frequently accessed resources Apply to the UW Admissions Student Financial Aid Student Fiscal Services Veterans Education Benefits Office Office of the University Registrar Colleges and schools Academic departments Professional and Continuing Education Student life Housing & Food Services Parents & families Work at the UW Employment Benefits Academic jobs Careers at UW Medicine Student jobs and internships Give to the UW Give now Ways to give My UW Giving Connect with the UW News Seattle campus calendar Featured stories University of Washington Magazine Social media UW Current ARTSUW Athletics Alumni Association Retirement Association University Book Store Campus resources Faculty & Staff Insider The Whole U MyUW MyPlan ISC/WorkDay Husky Card services Libraries Computing/IT Accessible technology Disability Services Office Disability Resources for Students Addressing letters to the UW Seattle campus Address format Name, Title (or student) Department (or Hall) / University of Washington Building / Room Number Box 35XXXX Street Address (if there is one available; check the online department’s website or ask the person you are sending mail to) Seattle, WA 98195-XXXX Each department (or building, such as a residence hall) on the Seattle Campus has its own USPS campus box and ZIP+4 code. If you are sending mail or shipping packages using the USPS, you will use campus box numbers with the format above. If you are using another shipper, use the format above without the campus box number. The University of Washington, in cooperation with the USPS, uses a six-digit box number format. All UW box numbers begin with 35____. The last four digits are unique to each office and comprise the last four digits of the ZIP code. UW Box numbers for faculty and staff are listed in the UW Faculty/Staff/Student Directory . UW Box numbers for departments are listed in Departmental Box Numbers . A complete UW Seattle campus ZIP code is 98195 + the last four digits of the box number. For example, the zip code for box number 352700 would be: 98195-2700 The best way to guarantee that you have the correct address is to contact the addressee via email or telephone first and request their address. UW Bothell To address postal mail to a person or department, follow this format: Name, Title University of Washington Bothell Department Box XXXXXX 17927 113th Avenue NE Bothell, WA 98011 UW Tacoma To address postal mail to a person or department, follow this format: Name, Title University of Washington Tacoma Department Box XXXXXX 1900 Commerce Street Tacoma, WA 98402 Complaints regarding the UW At the University of Washington, we are committed to addressing and resolving problems quickly and directly and to stop any inappropriate conduct that may be taking place. The investigation and resolution process time frame will vary based on the circumstances and complexity of the matter and how quickly necessary information can be obtained.  environment for all members of our community. If you have concerns regarding the conduct of university employees or believe there has been a violation of the university’s nondiscrimination and non-retaliation policies, we encourage you to make use of the appropriate channels to file a complaint. This section provides resources and guidance to support you in addressing your concerns effectively. Civil Rights Investigation Office The Civil Rights Investigation Office investigates complaints that University employees (including faculty and other academic personnel, staff, and student employees) may have violated the University’s policies prohibiting discrimination, harassment, retaliation, sexual misconduct, and relationship conflict of interest.  This includes complaints of discrimination or harassment based on: race, color, or creed; religion; national origin or citizenship status; sex; pregnancy; age; marital status; sexual orientation; gender identity or expression; disability; and veteran status, as well as complaints against employees regarding domestic violence, relationship violence, stalking, sexual assault, retaliation, and relationship conflict of interest. This office also investigates employees alleged to have engaged in conduct that may have violated Title IX regulations issued by the U.S. Department of Education. Please note that faculty, staff and students are also free to pursue state and federal complaint processes (for example, Equal Opportunity and Affirmative Action.) https://www.washington.edu/cr-investigations/ Office of the Title IX Coordinator Office of the Title IX Coordinator investigates complaints that a University student may have engaged in conduct that violates any of the sexual misconduct provisions of the University of Washington’s Student Conduct Code (WAC 478-121), including sexual assault, sexual harassment, sexual exploitation, indecent exposure, relationship violence, stalking, and domestic violence, and retaliation. This office also investigates students alleged to have engaged in conduct that may have violated Title IX regulations issued by the U.S. Department of Education. https://www.washington.edu/titleix/ Ombud The University of Washington Office of the Ombud serves as a dedicated resource for all members of the UW community, offering information, consultation, and assistance. Collaborating annually with numerous individuals facing challenges, this office provides a secure environment for expressing concerns and devising constructive solutions. https://www.washington.edu/ombud/ Complaints by non-UW personnel Patients or family members  of UW healthcare entities may report concerns about the quality of care, safety or service to any staff member, member of the medical staff or clinic/unit manager. Patients or family members may also contact the Patient Relations Department listed below to express concerns. https://www.uwmedicine.org/patient-resources/patient-rights-and-responsibilities/patient-relations The vision of University of Washington Office of Equal Opportunity and Affirmative (EOAA) Action is to uphold the laws and respect equal opportunity in the selection and advancement of all qualified applicants and employees within the institution. Job applicants with questions or concerns regarding this process can contact UW EOAA at the link below. https://ap.washington.edu/eoaa/ University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}