{
  "id": 6,
  "date": "2024-05-18T18:21:32.074939",
  "url": "https://www.uwb.edu/",
  "university_name": "University of Washington",
  "title": "Quick Links",
  "content": "Skip To Content Search keywords Search Open mobile menu Close mobile menu Quick Links Close mobile menu Search keywords Search About Expand Navigation About UW Bothell Leadership Administrative Divisions Diversity, Equity & Inclusion Campus Sustainability Community Engagement Maps & Directions Admissions & Aid Expand Navigation Undergraduate Admissions Graduate Programs Tuition & Fees Financial Aid Orientation Schools & Pre-Major Expand Navigation First Year & Pre-Major Program School of Business School of Educational Studies School of Interdisciplinary Arts & Sciences School of Nursing & Health Studies School of STEM Academics Expand Navigation Schools and First Year & Pre-Major Program Degree Programs Register for Classes Academic Calendar Study Abroad Undergraduate Research Career Services Academic Support Programs Academic Affairs Library Campus Life Expand Navigation Student Engagement & Activities Activities & Recreation Center Health and Wellness Resources Dining Services Campus Living Student Affairs Commuter Services News & Events Expand Navigation Events Calendar News Emergency Blog Give Expand Navigation Give to UW Bothell Quick Links MyUW Canvas Directory Library Workday Give Apply As Undergraduate More Links Information Technology Commuter Services Facilities Human Resources Campus Safety Alumni About Expand Navigation About UW Bothell Leadership Administrative Divisions Diversity, Equity & Inclusion Campus Sustainability Community Engagement Maps & Directions Admissions & Aid Expand Navigation Undergraduate Admissions Graduate Programs Tuition & Fees Financial Aid Orientation Schools & Pre-Major Expand Navigation First Year & Pre-Major Program School of Business School of Educational Studies School of Interdisciplinary Arts & Sciences School of Nursing & Health Studies School of STEM Academics Expand Navigation Schools and First Year & Pre-Major Program Degree Programs Register for Classes Academic Calendar Study Abroad Undergraduate Research Career Services Academic Support Programs Academic Affairs Library Campus Life Expand Navigation Student Engagement & Activities Activities & Recreation Center Health and Wellness Resources Dining Services Campus Living Student Affairs Commuter Services News & Events Expand Navigation Events Calendar News Emergency Blog Give Expand Navigation Give to UW Bothell Close mobile menu A lineage of teaching with love Dr. Raissa DeSmet encourages her students to embrace their whole selves by creating projects that center their experiences and identities. Read about Dr. DeSmet's teaching philosophy and praxis. Read the story Read about Dr. DeSmet's teaching philosophy and praxis. Read the story Explore Why UW Bothell Take a Virtual Tour Request Information Apply Now Visit Us Graduate Admissions Stories of impact All News Our students, faculty and staff apply their knowledge and experience to address critical problems in the world. All News Care and compassion in our community As we celebrate National Nurses Month, meet some of our students and alumni who work at UW Medicine. Learn about the career paths of our nursing students and alumni. READ THE STORY A positive force for change Meet the 2024 UW Bothell Husky 100. READ THE STORY The art and practice of disability justice Learn about disability justice. READ THE STORY By the numbers We provide access to an excellent UW education — and the opportunities and resources students need to succeed. Debt-free graduation In 2022-23, 70% of undergraduate students and 66% of graduate students graduated debt-free. Education made possible About 40% of first-year and transfer students will be the first in their families to get a four-year degree. Best value in state UW Bothell is #2 on a 2023 list of best value colleges in the state of Washington. More Fast Facts Our academic distinction We are known for professors who bring research into the classroom, for elevating diverse perspectives and for project-based learning with real-world impacts. 55+ degree choices From the sciences to business, education to health care, humanities and the arts, our undergraduate and graduate programs can prepare students for any career. BROWSE OUR DEGREE PROGRAMS 5 schools and more Our schools include Business, Educational Studies, Interdisciplinary Arts & Sciences, Nursing & Health Studies and STEM. Take your pick — or check out the First Year & Pre-Major program. EXPLORE OUR SCHOOLS EXPLORE OUR PRE-MAJOR PROGRAM Hear from our community Innovative, collaborative, value-driven thinkers and doers. I’m really interested in getting a degree that allows me to pursue health policy where I can increase mental health access for communities of color, and this (Community Health & Social Justice) seemed like a great program for that. (Pictured in red sweater) Jacqueline Richards Graduate Student, Master of Science in Community Health & Social Justice We should be doing everything we can to reduce our use of natural gas from a climate perspective but also, as we now know, from a human health perspective. Gas stoves in kitchens are definitely hazardous. Dr. Dan Jaffe Professor, School of STEM I have gained many valuable skills at UW Bothell — including how to build a business plan, how to manage teams and how to predict new technology and future markets. These skills have already been tremendously valuable as they helped me turn Fireflyslime into a six-figure business. Angelina Ly Entrepreneur and Senior, School of Business Generosity, community and justice are all foundational values to me inside and outside of work. I appreciate that my work in Advancement allows me to integrate these values into what I do when I show up to work. I also appreciate how these values and core elements of who I am show up in the conversations I have with community members who support the campus. William Langevin MPA '2020/Law, Societies & Justice '18, Assistant Director of Annual Giving Learning about how research can be done in really innovative, community-based ways that aim to help people from marginalized backgrounds really inspired me to continue with that work. I want to be part of helping to understand what it means to be Asian American and to contribute to ethnic minority psychological research and practice. Dr. Jaki Yi Assistant Professor, School of Interdisciplinary Arts & Sciences Go to slide 1 Go to slide 2 Go to slide 3 Go to slide 4 Go to slide 5 Connect with us Experience UW Bothell in real time by following us on social media. Go to University of Washington: Bothell Instagram page Go to University of Washington: Bothell Facebook page Go to University of Washington: Bothell Twitter page Go to University of Washington: Bothell Youtube page Social Media Directory Connect with us Experience UW Bothell in real time by following us on social media. Go to University of Washington: Bothell Instagram page Go to University of Washington: Bothell Facebook page Go to University of Washington: Bothell Twitter page Go to University of Washington: Bothell Youtube page Social Media Directory Bothell, Washington View our location on Google maps. Contact us by phone at: 425.352.5000 Visit us Maps & Directions Accessibility Jobs Contact Privacy Terms UW Seattle UW Tacoma Go to University of Washington: Bothell instagram page Go to University of Washington: Bothell facebook page Go to University of Washington: Bothell twitter page Go to University of Washington: Bothell youtube page © 2024 University of Washington Bothell Go to University of Washington: Bothell instagram page Go to University of Washington: Bothell facebook page Go to University of Washington: Bothell twitter page Go to University of Washington: Bothell youtube page"
}