{
  "id": 6,
  "date": "2024-05-18T18:22:15.611463",
  "url": "https://www.washington.edu/about/academics/",
  "university_name": "University of Washington",
  "title": "Colleges and schools",
  "content": "Skip to content Enter search text All the UW Current site Search scope All the UW Current site MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Menu About About the UW Diversity Global Impact Innovation Leadership Maps Population Health Sustainability Visit Academics Academics at the UW Academic calendar Academic departments Colleges and schools Course descriptions Registration Student guide Time schedule Apply Admissions Financial Aid Continuing education Majors Student housing Transfer students Tuition and fees Undocumented students UW Online News & Events UW News Featured stories Arts UW Calendar UW Magazine Husky sports Newsletter Research Research at the UW Office of Research Research Lifecycle Resources Centers and Institutes Stats and rankings Campuses Bothell Seattle Tacoma Give Give now Ways to give My UW Giving About the UW About the UW Colleges and schools Colleges and schools What are you driven to discover? A lifesaving cure? An entirely new art form? A solution for greener technologies? At the UW, you’ll do more than read about change; you’ll be the catalyst making positive change happen. Explore our colleges, schools and programs. The UW has thriving campuses in Seattle, Bothell and Tacoma and robust professional and continuing education programs. Apply to the UW College of Arts & Sciences The College of Arts & Sciences provides a cutting-edge liberal arts education with rich opportunities to explore our cultural and natural worlds through its 38 departments, 71 programs and centers, and the Jackson School of International Studies . More College of Built Environments At the College of Built Environments, we focus on planning, design, construction and management of our built environments. We prepare graduates to create innovative urban infrastructure for the future. More Michael G. Foster School of Business The Michael G. Foster School of Business is a collaborative learning community of faculty, staff, students, alumni and business leaders dedicated to the creation, application and sharing of management knowledge. More Paul G. Allen School of Computer Science & Engineering Ranked among the top computer science programs in the nation, the Allen School educates tomorrow’s innovators and engages in research that advances the field of computer science and engineering. As members of the College of Engineering , Allen School students have access to all of its activities and resources. More School of Dentistry A global leader in oral health research, the School of Dentistry prepares students to be true 21st-century dentists with evidence-based training grounded in the latest advances of biological and materials science. More College of Education An effective public education system for a diverse citizenry is the cornerstone of democracy. At the College of Education, we’re dedicated to making an excellent education a daily reality for every student in every community. More College of Engineering The College of Engineering educates outstanding engineers and develops ideas that change the world. A leader in engineering education, discovery and innovation, the college includes nine departments and the Paul G. Allen School of Computer Science & Engineering . More College of the Environment Spanning the forests to the seas, from the depths of the earth to the edges of the solar system, the College of the Environment is an unrivaled constellation of environmental research, education and application. More The Graduate School The UW offers more than 370 graduate programs across all three campuses and online, from master’s to doctoral programs for people who are launching or continuing academic, research or professional careers. More Henry M. Jackson School of International Studies Combining the social sciences, humanities and professional fields, the Jackson School prepares students to become leaders with a keen understanding of our increasingly interconnected globe. It is a unit of the College of Arts & Sciences . More School of Law One of the nation’s top public law schools and one of the world’s most respected centers for interdisciplinary legal study, the School of Law prepares students to succeed as leaders for the global common good. More The Information School The Information School explores the relationship between information, technology and people. Graduates apply their expertise for the advancement of science, business, education and culture. More School of Medicine The UW School of Medicine is recognized as one of the nation’s top providers of medical education. The school is a leader in training of primary-care physicians and advancing medical knowledge through scientific research. More School of Nursing For more than 27 years, the UW School of Nursing has been a top-rated nursing school. Our mission is to advance nursing science and practice through generating knowledge and preparing future leaders in health fields. More School of Pharmacy Nationally and globally ranked, the School of Pharmacy educates the next generation of pharmacy and research leaders and trains students for a career that combines a love of science and patient-centered health care. More Daniel J. Evans School of Public Policy & Governance One of the best public policy schools in the nation, the Daniel J. Evans School of Public Policy & Governance upholds a tradition of rigorous study, innovative research and public service. More School of Public Health The School of Public Health is dedicated to fostering healthy people in sustainable communities – locally, nationally and globally. Our 10,000+ graduates have gone on to create transformative change to improve people’s lives. More School of Social Work The School of Social Work is a nationally recognized leader in solving the most demanding social issues of our day through rigorous research, academic innovation and public service. We turn powerful new ideas into lasting social change. More Apply to the UW You’re undaunted by challenges. In fact, you seek them out. So what are you waiting for? Start the journey to become a Husky today. Explore your options Undergraduate: Seattle | Bothell | Tacoma Graduate School Professional schools Online bachelor’s Online master’s Certificates, degrees and courses for busy adults All options University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}