{
  "id": 6,
  "date": "2024-05-18T18:22:10.460246",
  "url": "https://registrar.washington.edu/registration/",
  "university_name": "University of Washington",
  "title": "Registration",
  "content": "Skip to main content University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Students Staff & Faculty Registration Classrooms Curriculum Residency About OUR Office of the University Registrar Menu Students Staff & Faculty Registration Classrooms Curriculum Residency About OUR Home Office of the University Registrar Registration Registration Close Menu Home Registration ACCESS Program ACCESS Registration Course Fundamentals Policies & Procedures Prepare to Register Registration Changes Registration Errors Registration Periods Registration Resources State Employee Tuition Exemption Helping UW students with registration and academic records. The Office of the University Registrar (OUR) is here to support students with the registration process by providing guidelines and policy information. There are many online resources to help understand the UW registration process. For all other registration questions, please contact the Registrar Student Services at regoff@uw.edu . Set up and opt in to 2FA The UW will require two-factor authentication (2FA) for your UW NetID account to protect both your and the University’s information. With 2FA, you sign in first with your UW NetID and password, then use a 2FA device (such as your smartphone) to confirm your identity. If you have not set up 2FA, you may not be able to register, and you will not be able to access UW online systems, such as Canvas, Zoom, MyUW and others. Don’t wait — “lock down your login” today with the Duo Mobile app for 2FA . Academic Calendar Time Schedule Course Catalog MyPlan Registration Resources Enrollment Verification Forms for Students Home Registration ACCESS Program ACCESS Registration Course Fundamentals Policies & Procedures Prepare to Register Registration Changes Registration Errors Registration Periods Registration Resources State Employee Tuition Exemption Search OUR Search for: Email Registration regoff@uw.edu Holiday Closures Spring 2024 Mon, May 27 (Memorial Day) University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms © 2024 University of Washington  |  Seattle, WA"
}