{
  "id": 6,
  "date": "2024-05-18T18:22:31.348490",
  "url": "https://sustainability.uw.edu/",
  "university_name": "University of Washington",
  "title": "UW Sustainability",
  "content": "Current site All of the UW Skip to main content MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT ISC/Workday Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington UW Facilities Employee Portal Quick Links Campus Topics Energy Greenhouse gases Buildings Commuting Air Travel Waste Water Food Sustainability data dashboard Energy transformation UW Tacoma UW Bothell Sustainability action plan Maps Walking tour Sustainability map Century of sustainability Get involved Students Student groups Sustainability Forum Campus Sustainability Fund UW as Living Laboratory Staff & faculty Green Office program Green Laboratory certification Alumni Volunteer Take the Pledge Guides Reduce paper Green your event Connect with nature Academics UW departments and centers Courses Sustainability directory (pdf) Stay informed In Our Nature Blog Newsletters Podcast Photos, videos & more Husky Sustainability Awards Events Full calendar Earth Day About UW Sustainability office Our team Connect with us Equity, diversity & inclusion Reports, plans & policies Sustainability action plan UW's commitment Executive order Definition of sustainability Environmental Stewardship Committee Campus sustainability partners Sign up for our newsletter UW Sustainability UW Sustainability Menu Home Campus Topics Energy Greenhouse gases Buildings Commuting Air Travel Waste Water Food Sustainability data dashboard Energy transformation The history of UW's Power Plant Terminology UW Tacoma UW Bothell Sustainability action plan Maps Walking tour Sustainability map Century of sustainability Get involved Students Student groups Sustainability Forum Campus Sustainability Fund UW as Living Laboratory Staff & faculty Green Office program Green Laboratory certification Alumni Husky Green Fund Combined Fund Drive (CFD) Another Solar Array Please (ASAP) VOLT Fund Alumni for Climate Action Volunteer Take the Pledge Guides Reduce paper Green your event Connect with nature Academics UW departments and centers Courses Course List Curriculum committee Sustainability directory (pdf) Stay informed In Our Nature Blog Newsletters Podcast Photos, videos & more Brand Posters and infographics Husky Sustainability Awards 2024 winners Past winners Events Full calendar Earth Day Earth Day events Past Earth Days About UW Sustainability office Our team Connect with us Equity, diversity & inclusion Reports, plans & policies Sustainability action plan UW's commitment Executive order Definition of sustainability Environmental Stewardship Committee Meetings Members Reports Campus sustainability partners Sustainability Action Plan Energy Transformation Student Groups Events at the UW What's new 2024 Husky Sustainability Award winners Learn about the students, faculty and staff who were named 2024 Husky Sustainability Award winners. May 14, 2024 UW completes first comprehensive Greenhouse Gas inventory This is the UW’s first comprehensive inventory of its direct emissions since 2005 and the first time ever the University has quantified the emissions connected to our purchased goods and services. Mar 11, 2024 Creating a Sustainable Campus webinar series Jan 16, 2024 Watch the Greenhouse Gas webinar Watch the discussion on the UW's greenhouse gas emissions and our decarbonization efforts. Dec 14, 2023 Stay engaged and informed on decarbonization Resources to get involved across the UW. Nov 08, 2023 Read more news Diversity statement A sustainable world is an equitable world. See our statement Sustainability topics What is the UW doing to address sustainability issues across campus? What we're doing Our impact University-wide effort Sustainability is part of the fabric of our university, and our actions have a broad impact beyond our campuses. People and groups across the UW are working for a sustainable future. Learn more about sustainability in campus operations , academics and the student experience . Contact us sustainability@uw.edu Learn more Sustainability Office Environmental Stewardship Committee University of Washington Be boundless UW Facilities Jobs Accessibility Privacy Terms Employee Portal © 2024 University of Washington  |  Seattle, WA"
}