{
  "id": 6,
  "date": "2024-05-18T18:22:39.427903",
  "url": "https://itconnect.uw.edu/?utm_source=quicklinks&utm_medium=click&utm_campaign=quicklinks&utm_term=computingit",
  "university_name": "University of Washington",
  "title": "IT Connect | UW Information Technology",
  "content": "Skip to content Enter search text IT Connect All the UW Get Help Menu Tools, Services & Support Academic Planning Access & Authentication Administrative Systems Data & Reporting Email, Calendars, & Events IT Systems Infrastructure Networks & Connectivity Software & Computers Storage & Hosting Teaching & Learning Voice & Video Guides by Topic Accessibility & Usability Computers & Printing Email & Calendaring Emergency Preparedness Identity, Diversity & Inclusion IT Sourcing & Standards Online Storage & Publishing Research Security & Authentication Technology Facilities Working Remotely Getting Started Students Faculty / Instructors Staff Researchers IT / Technical Staff Retirees Visitors IT at the UW About UW-IT IT across the UW I&T Governance & Policies News & Announcements Services, Fees & Rates Get Help Get Help Tools, Services & Support Academic Planning Access & Authentication Administrative Systems Data & Reporting Email, Calendars, & Events IT Systems Infrastructure Networks & Connectivity Software & Computers Storage & Hosting Teaching & Learning Voice & Video Guides by Topic Accessibility & Usability Computers & Printing Email & Calendaring Emergency Preparedness Identity, Diversity & Inclusion IT Sourcing & Standards Online Storage & Publishing Research Security & Authentication Technology Facilities Working Remotely Getting Started Students Faculty / Instructors Staff Researchers IT / Technical Staff Retirees Visitors IT at the UW About UW-IT IT across the UW I&T Governance & Policies News & Announcements Services, Fees & Rates Get Help IT Connect | UW Information Technology Search UW Information Technology Search IT Connect for: IT Connect Common Tasks Common Tasks Workday support Workday is a cloud-based software that provides many administrative functions for the UW, including human resources and payroll, procurement and finance. Where you go for Workday help depends on what you need help with: Workday@UW: a curated hub for Workday information and support. Start here if you’re not sure where to find answers. Employee Workday Help: Documentation and support for human resources, time-tracking, payroll, and benefits processes. UW Connect Finance Portal: Self-service support for Workday Finance, including procurement, grant management, and other finance functions. UW NetIDs, access, and 2FA authentication Get a UW NetID Set UW NetID recovery options Reset your UW NetID password Can I change my UW NetID? Get a Shared UW NetID that can be used by multiple people Set up Duo two-factor authentication Get a passcode or bypass code for 2FA Provide access to UW-IT services to other UW NetIDs Software and downloads Download software Get anti-virus software for your computer or device Get help with Microsoft software such as Office 365 Get help with UW Google software, such as Gmail and Google Drive Get a license for software such as Adobe Creative Cloud and Matlab Install SharePoint Get services Get services from the UW-IT Service Catalog Learn about expiration of access to UW-IT Services Phones and videoconferencing Use the functions on your campus desk phone Install Zoom Video Conferencing Get help with Zoom Email and calendars Set up or change your email forwarding Reduce Junk, SPAM and Phishing emails Get help with Microsoft Outlook Get help with Mailman email lists Teaching, Learning & Classroom Technology Get help with Canvas Get help with Poll Everywhere Get help with Panopto Lecture Capture Connecting to the UW network Connect to Wi-Fi on campus Connect to eduroam Remotely connect to the UW Network with Husky OnNet VPN Visitors: connect to the UW network Other common tasks Access Keynes (keynes.u.washington.edu) Set up a website, blog or wiki Get Help Self-help information is on this website, IT Connect. Otherwise, here’s how to contact UW-IT: Online: Send us a question Chat: Start a chat with UW-IT Email: help@uw.edu Phone: 206-221-5000 In-person: Walk-in locations My Requests Outages & Service Status News & Featured MS Teams chats retention/deletion Starting May 1, UW is enacting a 30-day retention policy for Teams chat messages (not posts!). Learn more Did you get your email? New rules by commercial email providers are throwing email forwarding into turmoil. Did you get your mail? To forward or not ... New leadership, new ideas for UW tech Three new directors in UW-IT will help shape the future of IT at the UW. Read about them Connect with UW Information Technology Twitter YouTube Subscribe UW-IT News Connect with UW-IT: Twitter YouTube Get Help My Requests Service Status About IT Connect Sitemap UW-IT Jobs UW-IT Internal Accessibility Campus Safety Workday My UW Privacy Security Terms © 2024 University of Washington  |  Seattle, WA"
}