{
  "id": 6,
  "date": "2024-05-18T18:21:20.762115",
  "url": "https://www.tacoma.uw.edu/admissions",
  "university_name": "University of Washington",
  "title": "",
  "content": "Skip to main content Apply Canvas Map Calendar Library Directory MyUW more_vert more_vert Close Search I'm searching for... I want to search... All UW Tacoma Admissions Faculty/Staff Directory Tools 25Live Canvas Directory IT Help Library Map MyUW Office365 Panopto Scout UW Gmail Workday Zoom Search Search Request info Visit Apply Freshman Students Transfer Students Master's & PH.D. Students About UW Tacoma Tuition & Financial Aid Apply Now Admissions Home Main Content ABOUT UW TACOMA UW Tacoma is an urban-serving public university providing access to students in a way that transforms families and communities. We value diversity, and work to bring success to all our students, encouraging our campus community to contribute to the growth and prosperity of our region. We offer career-focused majors in high-demand fields with an emphasis on social responsibility. All our courses are led by faculty who love teaching and care about their students where one-on-one instruction and guidance are the rule, not the exception. COME SAY HELLO Plan your trip to UW Tacoma or reach out with an email, we’re here to help. Explore Campus EXPLORE WHAT'S HAPPENING Don’t miss out on what’s going on at UW Tacoma. Discover Tacoma Tacoma's history is evident throughout UW Tacoma's campus. Explore the region and experience what makes our campus one of a kind. Explore Upcoming School Visits UW Tacoma is coming to YOU! Check out our upcoming school visits to see if our advisors will be visiting your campus. Check Schedule Campus Tours Tuesdays, Wednesdays & Thursdays @ 12:30 PM We welcome you and your family to visit our beautiful campus in the heart of downtown Tacoma - either in-person or virtually! Learn More HOUSING OPTIONS FOR ON-CAMPUS LIVING UW Tacoma offers students the opportunity to live on-campus in a community-based living environment. As a resident in UW Tacoma’s Court 17 Residence Hall, you will have the opportunity to live with other UW Tacoma students in a vibrant and engaging community. Court 17 I WAS ADMITTED Way to go, future Husky! We have a few more things we need you to do. I'm Ready! Breadcrumb Home Admissions Admissions Home Contact Admissions uwtinfo@uw.edu 253-692-4742 Office Location Mattress Factory (MAT) 251 ACADEMICS Academic advising Academic calendar Canvas Library Schools and programs Study Abroad Teaching and Learning Center CAMPUS Campus Safety Equity & Inclusion Financial Aid Housing Information Technology Student Life University YMCA Student Center ABOUT UW TACOMA Administration Admissions Institutional Research Jobs Parking & transportation Research UWNetID login Puyallup Tribe of Indians Tribal Sponsor of UW Tacoma Learn More > Land\n                        Acknowledgement\n                        > UW Seattle | UW\n                  Bothell © 2024 University of Washington Tacoma 1900 Commerce Street, Tacoma, WA 98402-3100 Contact us | Terms of Use | Privacy\n                Policy"
}