{
  "id": 6,
  "date": "2024-05-18T18:21:02.713162",
  "url": "https://www.washington.edu/jobs/",
  "university_name": "University of Washington",
  "title": "Working at the UW",
  "content": "Skip to content Enter search text Current site All the UW Search scope Current site All the UW University of Washington University of Washington Menu Home Find a job Staff jobs Healthcare jobs Temporary jobs Academic jobs Student jobs Jobs in demand What we offer Benefits for UW staff Benefits for temporary, per diem and less than half time Benefits for student employees Signing bonuses Where you matter Belonging Career development Be uniquely you Job seeker tips Before applying How to apply UW recruiters and job fairs After applying Interviewing with us Privacy and security Working at the UW FIND STAFF AND HEALTHCARE JOBS You double you at the UW. Find a job that will change your life, and others’ lives too. At the University of Washington, you’ll discover a place where you can thrive, where all are welcome and where the focus is on the greater good. Featured jobs and career fields As a dynamic force in global research, a leader in top-ranked healthcare and the pride of Seattle, the UW offers boundless possibilities. Jobs in demand Staff jobs Discover how you can take your impact further with a career at the University of Washington. With over 1000 staff job openings, you will find rewarding opportunities in hundreds of job fields. Find a staff job UW Medicine jobs Find your place within UW’s integrated health system, with a number of award-winning hospitals and facilities located in the greater Seattle area and devoted to improving the health of all people. Explore our healthcare jobs Academic jobs Faculty, librarians, and other academics at the University of Washington serve the public good through education and discovery. Explore current academic job openings for opportunities to contribute to a vibrant intellectual community focused academic excellence and cutting-edge research. Start your search Student jobs Are you a student wanting to find on-campus work? Maybe land an internship to jumpstart your career? Check out the many ways you can seek student employment. Check it out Empower your identity Find resources and staff stories that showcase diversity and accessibility. We welcome candidates from all experiences—whether you are recent grad, transitioning from the military or returning to work after a career break. Learn more Advice when applying You found the perfect UW job for you, now all you have to do is apply. Polish your application with some advice from our recruiters. Learn more Check out UW benefits There are many perks to working for the University of Washington. Learn more about the healthcare options, retirement plans, tuition exemption and so much more that could be available to you as a UW employee. Learn more Belonging Diversity is one of UW’s core values and it is expressed, championed, and celebrated in many ways. From inspiring our students to become global citizens to faculty and staff affinity groups that meet to share common cultural experiences—the UW thrives because of the cultural richness of its community. Learn more Equal Opportunity and Disability Accommodation Equal Opportunity and Disability Accommodation: The University of Washington is an affirmative action, equal opportunity employer. The University is building a culturally diverse faculty and staff and strongly encourages applications from women, minorities, individuals with disabilities and covered veterans. View the UW’s federally required Know Your Rights poster for prohibitions in employment discrimination. As a federal contractor, the University will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. View the UW’s complete Pay Transparency Policy Statement (.pdf) . University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Jobs SafeCampus Privacy Terms Employment verification Workplace posters © 2024 University of Washington  |  Seattle, WA"
}