{
  "id": 6,
  "date": "2024-05-18T18:21:44.399579",
  "url": "https://www.washington.edu/financialaid/",
  "university_name": "University of Washington",
  "title": "Welcome to Student Financial Aid",
  "content": "Skip to main content MyUW Calendar Directories Libraries UW Medicine Maps UW News Helpful Links Computing/IT Workday HCM Husky Card UW Bothell UW Tacoma UW Facebook UW Twitter University of Washington University of Washington Students Parents Faculty & Staff Alumni Quick Links Financial Aid Home Getting started Eligibility Student Aid Index How need is determined Net price calculator Student budgets Husky Promise Applying for aid Key dates Application process Aid offer process Maintain eligibility Summer quarter Types of aid Scholarships Grants Work Study Loans Childcare Assistance Program Veterans Benefits Emergency aid Emergency Food Assistance Other assistance Emergency Relief Fund (Prior Years) Receiving aid Disbursement Appeals and special circumstances Request changes to your aid offer Satisfactory academic progress Forms & resources Forms Consumer Information Glossary of Terms for Aid Offer Notifications Loan repayment Tax benefits Withdrawal and refund Financial aid code of conduct Money management FAQs Processing and Response Timelines Contact us My Financial Aid Welcome to Student Financial Aid Menu Financial Aid Home Getting started Eligibility Student Aid Index How need is determined Net price calculator Student budgets Husky Promise Applying for aid Key dates Application process Aid offer process Maintain eligibility Summer quarter Types of aid Scholarships Grants Work Study Loans Childcare Assistance Program Veterans Benefits Emergency aid Emergency Food Assistance Other assistance Emergency Relief Fund (Prior Years) Receiving aid Disbursement Appeals and special circumstances Request changes to your aid offer Satisfactory academic progress Forms & resources Forms Consumer Information Glossary of Terms for Aid Offer Notifications Loan repayment Tax benefits Withdrawal and refund Financial aid code of conduct Money management FAQs Processing and Response Timelines Contact us My Financial Aid Home Student Financial Aid We believe students from all economic backgrounds should have the opportunity to attend the University of Washington. Finances should not be a barrier to getting a world-class education. Whether you attend our Seattle, Tacoma, or Bothell campuses, you’re in the right place to explore the many scholarship, grant, loan and work-study options available that help make paying for college as affordable as possible. Frequently Asked Questions How do I get in contact with a Financial Aid counselor ? There are multiple ways you can get in touch with us. You can get in contact with our financial aid counselors by calling 206-543-6101 during our phone service hours, or by emailing us at osfa@uw.edu. Phone service hours: Monday – Friday 11: 00 a.m. – 3:00 p.m. In-person advising (room 105 Schmitz Hall): Monday – Wednesday 1:00 p.m. – 3:00 p.m. If you have questions regarding our processing time, or email response time, please see our current processing times on this page . I am a newly admitted student - now what? We understand you and your parent(s) may have many questions about what steps are next, what type if aid you are eligible for and other questions related to the financial aid process. We have gathered useful information for newly admitted students on this page . If you are from out of state this page has some useful information. Given the 24-25 FAFSA delays, what are my options in meeting the February 28 priority target date? We understand that the Department of Education’s delays and technical issues can cause concern for you and your family. We want to assure you that we are monitoring the situation and staying informed of any other possible delays or issues with the 24-25 FAFSA. Due to these FAFSA delays, OSFA will internally adjust our priority target date to include students who were unable to start their FAFSA by February 28 and ensure you are included in our priority group.  We ask that you complete your FAFSA as soon as possible so that we can prepare an award offer for you as soon as possible. My contributor does not have SSN. Can I complete the FAFSA? Department of Education has resolved the issue for students whose family members include a parent or spouse without a Social Security Number (SSN) unable to access the FAFSA. Families should now be able to access and complete the FAFSA. If you were unable to complete the filing of your FAFSA because one or more of your contributors did not have a SSN, please attempt to file your 2024-25 FAFSA now. What can I do if my income or my family’s income has changed ? We understand this is a challenging and difficult time and there is much uncertainty right now. We are here to help. If you are experiencing a change in your or your family’s income, please let us know by providing additional information about your situation. If your parent(s) are experiencing a change in their financial situation, please have them complete the Revision Request for Change in Financial Situation. All our forms can be found on our forms page . How do I apply for Summer aid? To apply for aid during Summer Quarter you will need to complete the 2024-2025 FAFSA. You will also need to complete the Summer Application at MyUW Financial Aid Status. Any aid offered for Summer will be based on full-time enrollment (at least 12 credits for undergraduates and professional, and at least 10 credits for graduate students). If you will not be attending full-time, please contact our office to discuss your eligibility. We try to prepare aid offers for Summer the same as any other quarter as much as possible given limited funding. Husky Promise is not part of Summer Quarter. For more information please visit our Summer Quarter web page. More answers to frequently asked questions can be found here . If these FAQ’s do not help address your question, then please contact us. Prospective students Welcome New Huskies Net price calculator Student budgets Application process Husky Promise Scholarships Glossary of Terms for Aid Offer Notifications Of special interest to Non-resident students Transfer students Veterans Undocumented Students/Other Select Applicants Fee-based programs Students with dependent children Non-matriculated students International students Important information Key dates and deadlines Information release Satisfactory academic progress Withdrawal policy Loan repayment Consumer information Emergency Food Assistance News Newly Admitted Students Summer Quarter Spring Quarter Hours 2024-25 FAFSA and FAFSA Simplification Federal School Code Our Title IV federal school code is 003798. This code is used for Seattle, Bothell and Tacoma campuses. About us Our mission is to provide educational access and opportunity for all students. We promote participation in higher education by providing programs of assistance to help bridge the gap between the cost of attending the University and the family’s own resources. We believe students from all economic backgrounds should have the opportunity to attend the University of Washington. Finances should not be a barrier to getting a world-class education. College Cost Transparency Initiative The University of Washington is a partner institution in the College Cost Transparency Initiative, committed to using their Principles and Standards in our financial aid offer. Please see their website for more details. University of Washington Be boundless Connect with us: Facebook Twitter Instagram YouTube LinkedIn Pinterest Accessibility Contact Us Jobs Campus Safety My UW Rules Docket Privacy Terms Newsletter © 2024 University of Washington  |  Seattle, WA"
}