{
  "id": 6,
  "date": "2024-05-18T18:21:12.347391",
  "url": "https://www.tacoma.uw.edu/",
  "university_name": "University of Washington",
  "title": "Husky Highlights",
  "content": "Skip to main content Apply Canvas Map Calendar Library Directory MyUW more_vert more_vert Close Search I'm searching for... I want to search... All UW Tacoma About UW Tacoma Faculty/Staff Directory Tools 25Live Canvas Directory IT Help Library Map MyUW Office365 Panopto Scout UW Gmail Workday Zoom Search About UW Tacoma About expand_more About UW Tacoma Equity & Inclusion Leadership Sustainability Vision, Mission & Values Academics expand_more Academic Calendar Global Affairs Register for Classes Schools & Programs Student Resources Admissions expand_more Apply now Financial Aid & Scholarships Freshmen Graduate Students Majors & Degrees Transfer Students Tuition Visit Campus Students expand_more HuskiesCare Register for classes Student Affairs Student Resources Study Abroad Faculty & Staff expand_more Academic Calendar Administration Faculty & Staff Directory Faculty & Staff Resources Community Partnership Support Research & Grant Support Community expand_more Alumni Conference Services Husky Landing Professional Development Center UWT Downtown Guide UW Tacoma Shop News & Events expand_more Academic Calendar Events Calendar News Give MyUW Map Tools Meet Tacoma's \"Husky 100\" students Seven remarkable students who are making the most of their time at UW Tacoma. Read More Next Omari Amili: Navigating the Post-Prison Pathway Omari Amili: Navigating the Post-Prison Pathway Omari Amili, 2023-24 Distinguished Alumni Award recipient and new Husky Post Prison Pathways program director, shares his vision for welcoming and supporting previously incarcerated people like himself. Read More Next Tabitha Espina: Writing the Invitation Tabitha Espina: Writing the Invitation As UW Tacoma’s new writing director, Tabitha Espina wants to celebrate students in all their strengths. Read More Next Setting the Table Setting the Table A love of cooking inspired Dr. Kima Cargill to study the psychology of food. Read More Next Meet Tacoma's \"Husky 100\" students Husky Highlights Main Content Confirmation deadline is June 1 If you've been admitted, the confirmation deadline is June 1 this year. There's also still time to apply for Autumn 2024 for both first-year and transfer students! You Should Know Commencement 2024 UW Diversity Blueprint HuskiesCare Collaborating to End Mass Violence May 6, 2024 The Violence Prevention and Transformation Research Collaborative, led by Dr. Eric Madfis, is calling for a new approach to prevent and assess threats of school and other mass violence. School of Education Welcomes First Undergraduate Students March 22, 2024 The B.A. in Education degree begins a new era in the school’s 32-year history. UW Tacoma Joins National Engineering Network March 20, 2024 UW Tacoma has been accepted into KEEN, the Kern Entrepreneurial Engineering Network, dedicated to training engineers to have an entrepreneurial mindset. View All News You Belong Here Explore Our Majors Take a tour Apply now Request Info First Year Transfer Graduate Honors Innovation Professional Development EVENTS 22 May 2024 Global Engagement Conference 12:00 am UW Tacoma William W. Philip Hall (WPH) 100 23 May Urban Studies Annual Lecture Series: 'Racial Capitalism and the (Re)Making of Urban Spaces 12:00 am UW Tacoma Milgard Hall (MLG) Milgard Hall 110 | 1950 South C St. 28 May Alumni Speaker Series: Nuk Suwanchote (SIAS '17) Film Screening: Horizon Identities 12:00 am UW Tacoma Carwein Auditorium 29 May Affordable Housing Workshop 12:00 am View All Events All Content Contact Us University of Washington Tacoma 1900 Commerce Street Tacoma, WA 98402-3100 253-692-4400 uwtinfo@uw.edu ACADEMICS Academic advising Academic calendar Canvas Library Schools and programs Study Abroad Teaching and Learning Center CAMPUS Campus Safety Equity & Inclusion Financial Aid Housing Information Technology Student Life University YMCA Student Center ABOUT UW TACOMA Administration Admissions Institutional Research Jobs Parking & transportation Research UWNetID login Puyallup Tribe of Indians Tribal Sponsor of UW Tacoma Learn More > Land\n                        Acknowledgement\n                        > UW Seattle | UW\n                  Bothell © 2024 University of Washington Tacoma 1900 Commerce Street, Tacoma, WA 98402-3100 Contact us | Terms of Use | Privacy\n                Policy"
}