{
  "id": 3,
  "date": "2024-05-18T18:07:44.072867",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/p2s-symposium/summer-2022-pathways-to-success-symposium/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2022 Pathways to Success Symposium June 8, 2022 Part I (9:30 am to 11:00 am ET) Opening Plenary: Self-Advocacy and Assertiveness: A How-To Guide for Succeeding at Cornell and Beyond… Dr. Sharon Milgram, Director of Intramural Training and Education, National Institutes of Health View recording of plenary session Session Summary: To successfully navigate the academic structure as a graduate student and postdoc, you must learn how to become an advocate for yourself. As with most skills, understanding yourself is essential to determine what is most important to you. Equally important to being a self-advocate is to learn how to assert yourself. Regardless of where you land as a professional, self-advocacy and assertiveness are skills primed to help support you in your future career aspirations. Join us for what will be an investment of time that will help you think through your strengths and weaknesses to help you develop as a researcher/scholar in working with other people in systems of power and hierarchy. The session with Dr. Milgram will provide some background information, opportunities to learn more about yourself, and a chance for open discussion with peers. Speaker Bio: Dr. Sharon Milgram received a B.S. degree in physical therapy from Temple University and a Ph.D. in cell biology from Emory University. She completed postdoctoral training at The Johns Hopkins University before joining the faculty at The University of North Carolina at Chapel Hill. There, she rose to the rank of full professor in the Department of Cell and Developmental Biology. Dr. Milgram served as the associate director of the Medical Scientist Training Program, director of the Interdisciplinary Biomedical Sciences Graduate Program, and the director of the Summer Undergraduate Research Experience. In 2007 she joined the NIH Office of the Director as the director of the Office of Intramural Training and Education (OITE) where she directs a trans-NIH Office dedicated to the career advancement of over 5,000 trainees. Dr. Milgram lectures widely on science careers, mentorship, leadership, management, wellness, and resilience in research environments. She lives in Silver Spring, Maryland with her wife and son. Part II (11:30 am to 1:30 pm ET) Interactive Keynote Session: Claim Your Space – Transformative Communication Skills for Academia and Beyond Eliza VanCort, Best-Selling Author, Speaker, Thought Leader, and Teacher Session Summary: The story your physicality and voice tells can clearly project confidence and strength, or send messages which undermine your effectiveness at work and in life. Eliza’s proprietary methodology empowers people to claim space through enhanced actionable communication skills. This results in more equitable collaborations, and confident, innovative thought leadership. Speaker Bio: Eliza VanCort is a best-selling author, speaker, thought leader, and teacher. Her b est-selling book (#1 on Amazon’s Best Sellers List), “ A Woman’s Guide To Claiming Space: Stand Tall, Raise Your Voice, Be Heard “ offers a “how-to” for a fuller life with actionable tools – from posture to imposter syndrome, interruptions to mansplaining, anti-mentors to cheerleaders, and everything in between! Eliza’s speaking engagements and workshops cover a wide variety of topics, including voice, body language, intersectionality, claiming space, whiteness, allyship, and more to create an environment where folks can talk authentically and build community within and outside of their respective organizations. Part III (2:00 pm to 3:30 pm ET) Workshop: Resilience in Writing – The Key to Graduate Writer Wellbeing and Success Dr. Lisa Russell-Pinson, Associate Teaching Professor of Writing, Center for Graduate Life, the Graduate School, UNC Charlotte Session Summary: When graduate students think about improving their writing, their attention typically turns to ensuring that their texts have well-supported arguments, clear organization, and logical transitions. While these are essential components of effective academic texts, another aspect of writing is just as—or perhaps even more—vital to graduate writing success: writer well-being. Writer well-being includes the “long-term, optimal social and emotional health” of writers (Cochran & Miller-Cochran, 2019), and recent studies point to writer well-being as integral to academic achievement and satisfaction. One hallmark of writer well-being is the ability to respond resiliently to challenges in writing (Russell-Pinson & Harris, 2019; Russell-Pinson, forthcoming). Drawing from the research on writing and well-being, this interactive session will introduce writers to concrete ways of building resilience in their own academic writing processes to bolster their academic achievement and satisfaction in graduate school. Speaker Bio: Lisa Russell-Pinson, Ph.D. is associate teaching professor of writing in the Graduate School at the University of North Carolina at Charlotte. In this role, she teaches writing classes to matriculated graduate students and develops and delivers support programming for doctoral writers. Dr. Russell-Pinson’s current research focuses on doctoral students’ experiences in the dissertation process, especially factors that impede dissertation-writing progress and interventions that help writers succeed. Her most recent work on academic writing has been published in the Journal of Second Language Writing (2019), Learning from the Lived Experiences of Graduate Student Writers (2020), and Mentorship in Scholarly Publication: Narratives and Practices (forthcoming). Dr. Russell-Pinson earned her B.A. cum laude in English from the University of South Carolina at Columbia and her M.S. and Ph.D. in linguistics from Georgetown University. She has taught English in the U.S. and varied settings abroad, including the Czech Republic, Georgia, Germany, Slovakia, and Spain. Based on her professional experience and expertise, Dr. Russell-Pinson was selected as an English Language Program Specialist by the U.S. Department of State in 2022. Sponsored by the Graduate School , the English Language Support Office (ELSO) , Cornell Career Services , and the Office of Postdoctoral Studies Participating Graduate School offices: Office of Inclusion and Student Engagement , Academic and Student Affairs , Graduate Student Life , Careers Beyond Academia , and Future Faculty and Academic Careers . Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}