{
  "id": 3,
  "date": "2024-05-18T18:07:16.832963",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/three-minute-thesis/3mt-2018/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Three Minute Thesis 3MT 2018 3MT 2018 BME Graduate Student Jason Guss wins 2018 3MT Competition Jason Guss presenting his three-minute thesis “I’ve spent hundreds of hours collecting poop from mice,” began doctoral student Jason Guss in his Three Minute Thesis (3MT) presentation on his research into the relationship between the gut microbiome and bone strength. Guss, a doctoral student in biomedical engineering, had three minutes to explain his complex research and its significance to a panel of student, faculty, and staff judges from units across campus. The non-specialist panel judged the presentations on their comprehension and clarity, engagement, and communication style. From the 17 students in the preliminary rounds, Guss was one of eight to make it to the final round of the Fourth Annual Three Minute Thesis Competition. The reaction from the audience and the combined scores of the six judges signaled Guss’s first place win of $1,500. Derek Holyoak, also a doctoral student in biomedical engineering, placed second, winning $1,000 for his presentation, “OA, No Way: A Simple Approach to Treat Osteoarthritis (OA).” The 150-member audience tied Holyoak and Guss for the $500 People’s Choice Award. “The 3MT gave us an opportunity to let loose and have fun while presenting our research,” Holyoak said. “I plan to continue using the enthusiasm, humor, and actions I included in my 3MT for all of my future research and teaching presentations.” The first 3MT competitions took place in 2008 as the University of Queensland. Since that time, over 600 graduate schools in 65 countries host competitions to celebrate the innovative research of their graduate students. Cornell’s Graduate School first hosted a 3MT competition in 2012. Since that time, the event has grown steadily. This year’s winners were invited to present for Cornell’s Board of Trustees. Derek Holyoak and Jason Guss Jan Allen, associate dean of academic affairs for the Graduate School, said the competition provides an important professional development opportunity. Students are challenged to distill years of specialized research into a compelling and brief talk for general audiences, a valuable skill for students entering any future career. “We have such an enjoyable time watching our graduate students present their three-minute talks,” she said. “We are so amazed and excited by the innovative scholarship and research our students are conducting. And they each have such a supportive ‘fan club’ in the audience. It’s fun to watch their friends and colleagues urge them on, too.” According to finalist Carol-Rose Little, a doctoral student in linguistics, “it is very easy to be so involved in our research that we forget the bigger picture. The 3MT competition had tremendous value as it helped me think about how to effectively communicate my bigger-picture research results and impacts to the public. It was also a fun and rewarding challenge to present to a nonspecialized audience.” 3MT Finalists Jason Guss – My “Theces” on Feces May Make Your Bones Stronger – Biomedical Engineering Special Committee Chair: Christopher Hernandez Derek Holyoak – OA, No Way: A Simple Approach to Treat Osteoarthritis (OA) – Biomedical Engineering Special Committee Chair: Marjolein van der Meulen Hugo Milan – Cool Technologies for Happier Cows – Biological & Environmental Engineering Special Committee Chair: Kifle Gebremedhin Carol-Rose Little – What Can the Ch’ol Language Tell Us About Grammar? – Linguistics Special Committee Chairs: Miloje Despic & Sarah Murray Sabrina Solouki – Vaccines Build Armies – Immunology & Infectious Disease Special Committee Chair: Avery August Mengran Wang – Three Photon Microscopy – Seeing Deeper Inside the Brain – Graduate Field of Biophysics Special Committee Chair: Chunhui Xu Divya Shiroor – Regeneration 101: Lessons from Flatworms – Molecular & Integrative Physiology Special Committee Chair: Carolyn Adler William Pennock – Better Models Lead to Better Water Treatment Designs for the World – Civil & Environmental Engineering Special Committee Chair: Leonard Lion 3MT 2018 Finalists Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}