{
  "id": 3,
  "date": "2024-05-18T18:06:43.287068",
  "url": "https://gradschool.cornell.edu/student-experience/student-life-programs/graduate-school-primer-navigating-academia-workshop-series/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Student Experience Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Graduate School Primer: Navigating Academia Workshop Series As part of a continued orientation experience for incoming graduate and professional students, the Graduate School sponsors a special seminar series for first-year graduate and professional students. The purpose of Graduate School Primer workshops is for students to gain valuable information and skills to make a successful transition into the role of a Cornell graduate or professional student. Workshops will take place virtually mid-July through August 2024.  Session dates and times will be announced in June. 2024 Workshops Understanding and Overcoming the Imposter Experience Presenter: Jessamyn Perlus, senior associate director, Cornell Career Services Did you know that impostor feelings are normal and that most high-achieving graduate students experience these feelings at some point? Join us to better understand the impostor phenomenon; learn to recognize it and see recent research on how it can be a barrier to graduate student success. By defining it and sharing experiences, you’ll learn evidence-based tools to help combat impostor feelings. Getting the Mentoring You Need and Want Presenters: Colleen McLinn, Ph.D., associate dean for professional development, and Sara Xayarath Hernández, associate dean for inclusion and student and faculty engagement In this workshop, graduate students reflect on their mentoring experiences and needs, learn to co-construct and manage mutual expectations within their mentoring relationships, and develop strategies to establish a network of mentors to get the mentoring they need and want across multiple domains. This workshop also introduces the FAIM (Faculty Advancing Inclusive Mentoring) Resource Center , which provides a framework to support the development and advancement of inclusive and equity-minded mentoring practices within graduate and postdoctoral education. The FAIM framework is comprised of an inclusive mentoring philosophy, key principles, and practical tools and resources intended to be adapted and adopted to meet the contextual needs of mentors and mentees. Understanding Doctoral Funding at Cornell Presenter: Jason Kahabka, associate dean for administration At Cornell, almost all Ph.D. students receive funding that pays tuition and provides a living stipend through a combination of fellowships, assistantships, and external scholarships. This presentation will explain how stipends are paid, what your responsibilities are, and provides insight on how to be an active participant in your own funding plan. Maximize Your Every Minute Presenter: Janna Lamey, senior assistant dean for graduate student life While there is not a one-size-fits-all approach to best manage your most precious resource (TIME), time management is a skill that can be learned! Given the many demands for your time and attention to support your many identities, roles, and relationships, techniques can be learned to help you be able to intentionally decide what you should do when. Join us for an interactive discussion that reviews commonly used techniques, how to make strategic decisions that support the whole you, and how to maintain relationships when setting boundaries. In addition, share with others what you have found works best for you. The Basics of Mental Health and Well-Being Presenter: Janna Lamey, senior assistant dean for graduate student life Make sure that you develop your mental health support plan so that you can have the energy and reserves to support your academic success. The stressors of being a graduate student are real and understanding the research for how you can best support your mental health and well-being is key to your future success. In this session, we will define mental health, learn key concepts of resilience, and emphasize the importance of sense of belonging and self-care practices. You’ll be able to connect with others in the session. University and local resources are also provided. Creating, Building, and Maintaining Social Networks Presenters: Janna Lamey, senior assistant dean for graduate student life; and panel of esteemed students Relationships that are grounded in trust, respect, and acceptance are the strongest factor in building and maintaining resilience. And, starting a new program at a new place can be challenging to create, build, and maintain social networks.  So, what is a graduate student supposed to do? During this one-hour session, we’ll review the value of social networks, and more importantly, hear from graduate and professional students who have strategies and suggestions for how to build your social network right from the beginning. Developing as an Instructor Presenters: Colleen McLinn, Ph.D., associate dean for professional development, and Derina Samuel, Ph.D., associate director, graduate student development, Center for Teaching Innovation Will you have teaching responsibilities this fall? Are you thinking about a faculty career track and want to develop your skills as an instructor? If your answer is “yes”, or you just want to find out more about teaching, join us to explore the many resources that are available to you at Cornell. At this session we will discuss the various teaching roles graduate students experience and identify areas you could develop to ensure a successful teaching experience. Navigating Graduate School: The Good, the Grad, and the Ugly Presenter: Josephine Martell, associate dean for academics Come and learn about the top things that former graduate students wish they had known before they started their research degree programs. This session will share critical advice on setting achievable goals, creating mutual expectations with mentors, assembling an effective committee, research organization, the value of literature reviews, presenting and publishing, maintaining a healthy work-life balance, and more. In addition to a short presentation, participants will have opportunities to break into smaller groups to reflect on, and brainstorm, how to apply the guidance in their own disciplines and unique situations. Exploring Career Options In and Outside Academia: Make an Action Plan for Your Future Presenters: Susi Varvayanis, executive director of Careers Beyond Academia, and Christine Holmes, director of postdoctoral studies You might be thinking it is too early to think about the end as you are starting, but in this session you will learn how important it can be to keep your options open, how you can take advantage of your time at Cornell to gain experiences that help you rule in or rule out different career sectors based on what you value and in what environments you thrive. You will leave with three things you can do that don’t take long at all that will increase your agency. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}