{
  "id": 3,
  "date": "2024-05-18T18:14:55.819317",
  "url": "https://gradschool.cornell.edu/student-experience/help-and-support/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Student Experience Help and Support Help and Support Graduate school is a fulfilling and rewarding experience, and sometimes challenging. It can be helpful to reach out to someone. In addition to talking with your already established networks (i.e. your friends, family, or mentors), other Cornell individuals can provide valuable information and caring support. If you are in crisis, please call Cornell Health 24/7 at 607-255-5155 and identify the situation as an emergency. Cornell Health is equipped to handle crisis situations on short notice. During business hours, any student with an urgent need can walk into Cornell Health for counseling or other assistance. Students can also contact the Cornell University Police Department at 607-255-1111. Contacts for non-emergency situations: Your Director of Graduate Studies (DGS) Your Graduate Field Administrator (GFA) Janna Lamey in the Office of Graduate Student Life Sara Xayarath Hernández in the Office of Inclusion and Student Engagement Student Services Cornell Health Counseling and Psychological Services (CAPS) Your Director of Graduate Studies (DGS) Academic help, including information about academic requirements, expectations, and resources for support Guidance on handling dispute resolution Your Graduate Field Administrator (GFA) Administrative help Procedures and resources Janna Lamey in the Office of Graduate Student Life Contact Senior Assistant Dean Janna Lamey ( janna.lamey@cornell.edu) for any reason, the earlier the better, by email or at 607-255-5184 (direct line). As a first-point of contact at the Graduate School, students often meet with Janna to brainstorm options, gain support, and receive information or referrals about the following: Academic: Explore navigating academic relationships and difficulty in making academic progress Consider alternatives in your academic program (i.e. switching programs, changing career path, leaving Cornell) Health and wellness: Explore options for when health concerns are impacting academic progress Understand sources of support when not able to focus or concentrate or loss of motivation in research/scholarship Policies and procedures: Explore options in handling difficult problems or situations Understand university policies and procedures better as it relates to your concern Personal concerns: Address personal or family emergencies, such as injury, accident, or death Navigate challenging personal life situations (i.e. roommates, partner/children, visa concerns, financial, etc.) Discuss options when you have been treated unfairly, insensitively, or irresponsibly What you can expect from meeting with Janna: Confidentiality* Non-judgmental place to listen effectively to your experience Brainstorm possible solutions and evaluate alternative plans for resolution Assistance (that you want!) to help navigate your program Resources and services for academic and personal support Referrals to other services and personnel (may include other Graduate School deans) Support you as a whole person; reaffirm the value of self-care and being resilient *Meetings with Janna can be confidential, except in cases where university policy or federal law obligates me to report or address, such as situations of harm to self or others, along with situations of sexual misconduct/violence. In these situations, other campus offices (outside your program) will need to be brought into the conversation and you will be informed of this along the way. If you would like other confidential resources, please consider going to Cornell Health , Cornell United Religious Work Chaplains , the Cornell Victim Advocate , the Women’s Resource Center (WRC) , the LGBT Resource Center , or the University Ombuds . Sara Xayarath Hernández in the Office of Inclusion and Student Engagement Contact Associate Dean Sara Xayarath Hernández ( sh267@cornell.edu ) to discuss issues related to diversity and inclusion; leadership and professional development; community and alumni engagement; and incidents of bias. Common reasons: Discuss how you are experiencing the climate of Cornell and explore opportunities to further enhance the climate for graduate students Explore opportunities to collaborate with the Graduate School and graduate student organizations on initiatives focused on community engagement, diversity, and inclusion Explore the programs and resources available to support the professional and leadership development of graduate students Learn about opportunities to engage with alumni through professional development based programs Discuss options for reporting and dealing with experiences related to bias and discrimination Student Services Contact Student Services ( gradstudserv@cornell.edu ) for general inquiries about registration, enrollment, funding, leaves, exams, petitions, thesis and dissertation submission, degree completion, or other student requirements. Cornell Health Counseling and Psychological Services (CAPS) Call CAPS at 607-255-5155 to speak to staff members confidentially about academic, emotional, or social concerns. It is a sign of intelligence and strength to recognize when you may need help. CAPS supports the “ Let’s Talk ” program which provides easy access for you to receive informal confidential consultations with counselors. These are free and confidential, and no appointment is necessary. If you have questions about managing your mental health while you are away from campus, please see this resource . Mental Health at Cornell is also dedicated to providing support and resources to meet the emotional, physical, social, and spiritual needs of the university community. If you do not see what you need on this page, we encourage you to contact Janna Lamey ( janna.lamey@cornell.edu ); she can direct you to the appropriate resource. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}