{
  "id": 3,
  "date": "2024-05-18T18:11:28.939764",
  "url": "https://gradschool.cornell.edu/financial-support/tax-information/tax-preparation-faqs/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Financial Support Tax Information Tax Preparation FAQs Tax Preparation FAQs What is the deadline for filing taxes? In most years, the deadline is April 15, unless that date falls on a weekend or holiday. What is taxable income? At the graduate level, all fellowship and assistantship stipends are considered taxable income by the IRS and by New York state. For U.S. citizens, fellowship stipends do not generally have tax taken out at the time of payment. However, the IRS requires Cornell to withhold 14% in taxes from stipends paid to “non-resident aliens” (international students), unless the student is eligible for exemption under a tax treaty. All students are expected to report the stipend and taxable income on their tax return forms. For graduate student assistantship stipends, taxes are withheld at the time of disbursement and the stipend amount is reported to the IRS by Cornell. Graduate students may exclude from income monies spent for tuition and fees, books, supplies, and equipment required for courses. Tax treatment of specific items may change from year to year. It’s important to visit the IRS website for the most recent regulations. International students may or may not pay taxes on fellowship stipends depending on the specific provisions of the tax treaty between their home country and the United States. Please consult with a tax expert well in advance of the tax due date, which is generally on or around April 15. Student loans are not considered taxable income. Each student is responsible for determining how the tax law applies to his or her own situation. For more information about taxes and links to the Internal Revenue Service (IRS), please visit Cornell’s tax issues FAQ for students . What types of taxes do I need to pay? This depends on your individual circumstances and your legal residence. How do I get started? Go to Student Center to make sure your address on record is accurate. If you received any funds through the university, you will receive tax documents detailing what you received. Domestic students should have received most of them by January 31. International students will receive their documents soon. Collect your documents and any other statements you might have received. For example, your bank may have sent you a statement depending on the type of account you have and the bank’s location. How you file will depend on your residency. Domestic students: IRS Free File may be utilized if adjusted gross income (AGI) is $73,000 or less. You may want to work with a tax preparer. If so, follow the tips listed below. International students: The Office of Global Learning provides free tax preparation software for international students. (Turbo Tax and other products do not include the right forms for international students.) Where can I get help preparing taxes? For international students: Tax information for International Students –  Global Learning provides free tax preparation software for international students. (Turbo Tax and other products do not include the right forms for international students, do not use them.) Tax preparation from Alternatives Credit Union : Alternatives Federal Credit Union offers free tax preparation for those who qualify. If your income is less than $60,000, you could be eligible. If you decide to work with a tax preparer, please follow these tips: Check the preparer’s qualifications Check the preparer’s history Ask about service fees Ask to e-file Make sure the preparer is available Provide records and receipts Never sign a blank return Review before signing Ensure the preparer signs and includes their PTIN Source and more information What is the outcome after I file my taxes? There are generally two outcomes. You will need to either pay taxes if you did not pay enough during the previous calendar year. Or, if you overpaid your tax burden, you will receive a tax refund. My friends pay less tax than me. Why? Taxes are highly individualized based on many factors that vary greatly even between two people in similar circumstances. Your salary and withholding tax are only two pieces of a much bigger puzzle. Income, deductions, number of exemptions, tax credits, phase-out of exemptions, deductions, and credits, as well as withholding and estimated tax payments, are all factors in determining the amount of your refund or (gasp!) the amount you owe the government at year end. Your annual income tax calculation starts with ALL sources of taxable income for the year. In addition to your weekly paycheck, this can include a spouse’s salary, interest, dividends, capital gains or losses, unemployment, retirement distributions, social security, rental income, small business income, cancelled debts, alimony, gambling winnings, and even bribes! You also have adjustments to income. Depending on your situation, these could include deductions for traditional IRA contributions, student loan interest deduction, alimony paid, and others. Where do I learn more about taxes? See the list of websites on the Graduate School’s Tax Information page. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}