{
  "id": 3,
  "date": "2024-05-18T18:11:25.459390",
  "url": "https://gradschool.cornell.edu/financial-support/fellowships/external-fellowships/writing-your-research-statement/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Financial Support Fellowships External Fellowships Writing Your Research Statement Writing Your Research Statement Set yourself apart Most reviewers volunteer their time. Faced with a huge pile of applications, they’ll move quickly and won’t take time to search out hidden answers. In reviewing your application, the reader will scan for clear answers to three questions: What new knowledge will be generated for the discipline? Why is it valuable? How can they be assured the conclusions will be valid? You want to make sure that the reviewer will be left with something to remember: a message that will remain after reading many other proposals. Make sure your proposal is clear and has a strong opening paragraph that will grab the reader’s attention. Your statement should tell a compelling story with a beginning, a middle, and an end. Avoid jargon Always keep in mind that reviewers may not be experts in your particular research area. It is essential that you couch your proposal in language and a narrative that will be accessible to an intelligent but non-specialized reviewer. In particular, don’t use jargon. Eliminate any theoretical discourse that is only accessible to those trained in your area. Keep the spotlight on ideas Start with a subject that interests you – a research proposal or a question – and develop a good proposal around it. Don’t worry if your proposed research project isn’t the “hot” topic in the field right now. In fact, an off-the-beaten-path project may stand out among all the other applications. Show the reviewer that you are ready to take on the challenge of independent research; that you have not only a strong foundation for research as evidenced by a knowledge of the core scholarly publications in your discipline, but also that you possess the creativity, passion, and drive that will take you from more passive learning to active invention and hypothesis. Be clear about how you will undertake the research and how you will analyze the results. Argue why you think this is the best approach to the problem. Explain which approaches are standard and which are innovative. The way you formulate your questions and describe how you will address them will reveal a lot to the review committee about your thought processes. Your proposal is not the same as a final plan If you’re a first-year student, remember that you’re writing a proposal: you are not committed to following the exact path you establish in your proposal. Most funding agencies expect that your project will change as you get underway. The important thing is to show that you’ll be capable of carrying out research in the discipline area proposed given the resources available to you. Applying for dissertation-year fellowships If you’re applying for a dissertation-year fellowship, the bar has been raised. Given your breadth of experience, the reviewers will expect to see more from you than they will from a first-year student. Reviewers will want to see that you’ve taken an interest in your professional development by presenting at national conferences and by having publications accepted to peer-review journals or in process, so be sure to address those issues. Seek input Discuss your research proposal with your special committee chair, your director of graduate studies, faculty in your field, and other students. If you can identify students who have had successful proposals or faculty who have served as adjudicators, ask them. It’s okay to tailor your research statement to present the version most likely to win the fellowship. Focus on the aspects of your project that are the best fit with the sponsoring agency’s stated goals for the fellowship program. If you need inspiration, check out the reference notebooks of successful applications available in 350 Caldwell Hall. Details matter, so sweat them Your bibliography is important. This is where you will show experts in your field that you know the discipline and that you’ve done your homework. Make sure you cover the key papers in your discipline, but don’t make the bibliography too long. Reviewers want to see that you can distinguish between the most important contributions and secondary papers. A good bibliography shows you know enough about the discipline to avoid duplicating other work. Proof your work Make sure that there are no typographical or grammatical errors and follow the guidelines carefully. Your statements reflect on the level of professionalism you will bring to your research. When the competition is extreme, reviewers look for clues that differentiate one application from another. Typographical errors, grammatical errors, and inattention to guidelines will create suspicion over your attention to detail and will probably result in your application being passed over. Allow enough time You need to be exceptional in an excellent group of applicants. A good proposal may take up to three months to develop. Write a draft, seek input from others, revise, set it aside, come back to it, revise again, seek input again. Keep working until you have a polished product. If you put in the time to make your proposal as good as it can be, it will show in the end result and your application will be more competitive. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}