{
  "id": 3,
  "date": "2024-05-18T18:16:03.483323",
  "url": "https://gradschool.cornell.edu/academic-progress/faculty-guide-to-advising-research-degree-students/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Academic Progress Faculty Guides to Advising & Mentoring Research Degree Students Faculty Guides to Advising & Mentoring Research Degree Students Graduate students view effective advising, mentoring, and positive, productive relationships with faculty as important to their success in graduate school and on the job market. The importance of positive and productive faculty-graduate student relationships is supported by research literature on graduate student satisfaction, students’ publishing rates during graduate school, and degree completion support, as well as by the findings of Graduate School surveys of graduate students and alumni. Faculty Guide to Advising Research Degree Students Advising and Mentoring Advising and mentoring are often used interchangeably, and faculty may serve in both roles for a student. Advisor Responsibilities The faculty advisor is responsible for guiding students in meeting the requirements and expectations of the graduate field and the Graduate School for the degree. Help students develop a plan and timeline to meet expectations and milestones for each step of the degree program, including requirements of the special committee, the graduate field, and the Graduate School, within an appropriate timeframe for the following: Required coursework Exams required by the graduate field or the Graduate School Effective research proposals/prospectus Research projects Thesis or dissertation Along with the graduate student, completes the required annual Student Progress Review (SPR) on the timeline expected by the graduate field. Writes informed letters of recommendation for a student’s job or postdoc applications, often serving in this role for many years after a student graduates. Mentor Responsibilities A faculty advisor who also serves as a faculty mentor provides support and guidance that extends beyond the scope of advising and may include any of the following: Communicates with their mentee about the mutual expectations for their mentoring relationships Co-constructs a mutual expectations agreement plan with their mentee Demystifies the structure, culture, and unstated expectations of graduate education Supports their mentee in building out their professional and mentor network by purposefully introducing them to professional colleagues Suggests opportunities for career exploration or job applications Provides nominations for award recognitions and letters of recommendation for the job market Actively advocates for mentees within the graduate program and in the broader academic or professional community beyond Cornell May serve as a role model and source of inspiration May become a professional peer and potential collaborator, in the future Mentoring relationship may persist over time Some faculty may serve as both an advisor and mentor to particular students, or only an advisor or only a mentor to other students. Faculty can encourage graduate students who they advise and/or mentor to cultivate a network of multiple mentors with varied expertise who will provide different functions based on changing needs as graduate students progress through their programs from new students to independent scholars and researchers. Creating a Culture of Belonging and Respect Cornell students arrive here from across the world and represent a diversity of social identities, lived experiences, and academic interests. Advisors and mentors play a crucial role in helping students develop a sense of belonging and community within their degree programs, research groups, and the university more broadly. Advisors and mentors should not only be sensitive to, but also responsive to, the individual differences and experiences of graduate student advisees and mentees. Adopting culturally-aware advising and mentoring practices can help advisors and mentors become more sensitive and responsive to the individual differences and experiences of advisees and mentees. A Culturally Aware Advising and Mentoring Approach A culturally aware approach to advising and mentoring requires advisors and mentors to develop an understanding of the lived experiences and social identities of graduate student advisees and mentees. This approach requires advisors and mentors to identify and recognize their own culturally shaped beliefs, perceptions, and judgments and to be cognizant of the cultural differences and similarities between themselves and their advisees and mentees. It also requires advisors and mentors to gain both intrapersonal and interpersonal cultural awareness and skills to recognize and respond to cultural diversity related issues that may arise in their advising and mentoring relationships. Become aware of implicit biases and how to mitigate them Learn how to have meaningful conversations about identity and difference with graduate student advisees and mentees Become more familiar with the potential impact of social identity in challenging conversations, and to learn how to engage empathetically with conflicting perspectives Avoid making assumptions about the lived experiences and social identities of students by listening and learning from students about their individual experiences and needs This approach helps create an inclusive, supportive environment where graduate students have the opportunity to feel valued and respected for their individual experiences, differences, and contributions. Students feel a greater sense of belonging within their degree programs, while advisors and mentors better understand the unique backgrounds of their students, which can help inform their individualized advising and mentoring strategies. For more information, see Byars-Winston, Angela et al. “Pilot Study of an Intervention to Increase Cultural Awareness in Research Mentoring: Implications for Diversifying the Scientific Workforce.” Journal of clinical and translational science vol. 2,2 (2018): 86-94. doi:10.1017/cts.2018.25. Resources Visit the Faculty Advancing Inclusive Mentoring (FAIM) website. Center for the Improvement of Mentored Experiences in Research (CIMER) Culturally Aware Mentoring Resources The Intergroup Dialogue Project, in collaboration with the Graduate School, provides annual sessions, Intergroup Dialogue Skills in an Academic Context: Engaging in Challenging Conversations Across Difference , to help advisors and mentors practice tools for communicating across difference and to equip advisors and mentors to employ the LARA (listen, affirm, respond, and add) method within their advising and mentoring practices. Visit the Graduate School’s Implicit Bias Resources page to access tools to help understand and mitigate implicit bias. Visit the Graduate School’s Office of Inclusion and Student Engagement Faculty Resources page to access a recording of Sweeney Windchief’s talk on Culturally Attuned Mentoring Paradigms – Relationships in Community Context . Visit the Office of Faculty Development and Diversity page of Resources to Engage in Conversations About Race and Anti-Racism . See Inside Higher Ed, Sathy, V., Hogan, K. A., & Sims, C. M. (2020, July 1). A Dozen Plus Ways You Can Foster Educational Equity . Inside Higher Ed. Advising New Students The transition to graduate school for new students, and the transition to Cornell for those who may have completed some or all of a graduate degree program elsewhere, can be both an exciting and challenging time. Location, climate, culture, requirements, and expectations may be new and difficult to navigate. Even the logistics and routines that become commonplace after a short time, such as those involving housing, transportation, weather, nutrition, and wellness, might be overwhelming during the first few weeks and months. Tips and Resources Effective advising and mentoring includes knowing about and referring students to the resources they need to help manage these challenges. Graduate student handbooks, available in most fields, describe the graduate field degree requirements, the field’s expectations related to successful study and research, and the resources available to students. Peer mentoring programs, available in some graduate fields, pair new students with current students to help acclimate them to graduate study at Cornell. Encourage new students to attend the Graduate Student Orientation . The Navigating Graduate School page on the Graduate School website lists resources to help admitted and arriving students. Encourage students to use the Graduate School and other campus resources throughout their time pursuing a Cornell degree. Advising International Students International students comprise nearly half of all Graduate School students. With varying levels of English language fluency and experience with the American system of higher education, international students may need additional resources or information to acclimate. Resources The Graduate School’s FAQ for International Students provides the following information: Required Admission Supplement for International Students Financial Certification Visas: Special Topics NetIDs CertiFile Summer Program for English and Culture (SPEAC) The English Language Support Office (ELSO) The Office of Global Learning Orientation for international graduate and professional students Visa counseling Tax and employment advice Other supports for international students The Center for Teaching Innovation (CTI) International Teaching Assistant Language Assessment International Teaching Assistant (ITA) Summer Training Program International Teaching Assistant Program (ITAP) Advising First Generation and Students from Historically Underrepresented Backgrounds Students who identify with one or more identities historically underrepresented in graduate education – racial/ethnic, gender, sexual orientation, disability, first generation college students, veterans – are more likely to find themselves as being the only or one of few from their social identity groups. Consequently, positive and productive advising and mentoring relationships are especially important to supporting their progression, academic and professional development, and success. About a third of doctoral recipients identify as first generation college students whose parents do not have a college degree. Though first generation students are represented across all demographic groups, they are more likely to identify with other backgrounds historically underrepresented in the academy. They are also more likely to be from lower to modest socioeconomic backgrounds, potentially making it difficult to cover costs associated with some social and professional activities such as research conferences. Tip: Making formal and informal professionalization and socialization activities more accessible to all advisees and mentees can help mitigate these challenges. First generation and other students from backgrounds historically underrepresented in graduate education that did not have access to certain mentoring experiences may lack insights on the sociocultural norms, systems, structures, and unwritten rules of academia, potentially negatively impacting their academic acculturation and successful progression through their graduate studies. This lack of critical knowledge, which can be learned, has the potential to negatively impact their academic acculturation and successful progression through their graduate studies. Tip: Demystifying the unwritten rules, language, and norms of graduate education especially within the context of a specific graduate field can help mitigate these challenges. Advisors and mentors play a critical role in helping students identify resources within and beyond their graduate programs to support their development of a sense of belonging and community at Cornell. Regardless of a student’s background, it is essential for advisors and mentors not to make assumptions or generalizations about students based on any aspect of their social identities or lived experiences. Tip: Expressing interest in students as whole individuals, listening to what they choose to share about their experiences, and asking about their specific interests and needs help advisors and mentors make informed suggestions on which opportunities and resources might best meet the academic and professional development needs of advisees and mentees. For more information, visit the Faculty Advancing Inclusive Mentoring (FAIM) website or contact the Graduate School Office of Inclusion and Student Engagement . Advising Students with Families About 30% of Cornell’s graduate and professional students have a spouse or partner; almost 10% have one or more children. Many also have responsibility, financial or otherwise, for other family members. These students manage their time, work, and finances with a focus on their family and may ask for advice or share their challenges with faculty who provide a more supportive climate. Tips and Resources Act as a role model for work-life balance. Communicate and support flexibility in your students’ schedules, particularly around personal and holiday time. Refer students to the Cornell resources that support students with families, such as student-parent dependent care grants , the Cornell Child Care Center , health insurance for dependents, medical care for children, and the lactation rooms. Become familiar with the Students with Families website, which includes policy updates, special events, and resources for students’ spouses/partners and children. Developing Effective Advising Relationships Effective (and efficient) advising relationships begin by discussing expectations early on. Transparency about expectations and timely communication are two essential factors associated with good advising and mentoring that graduate students often mention. Cornell graduate students also note the importance of faculty approachability, support, honest and regular feedback, and a recognition that both advisor and advisee and mentor and mentee can benefit from strong, positive relationships. Developing a shared understanding of expectations A shared understanding of mutual expectations within an advising or mentoring relationship begins at the first meeting and is continually refined over time. Covering topics, like the ones listed below, will allow both of you to discuss and align expectations. Ask students about the areas where they might need support: writing, teaching, research, professional networking, etc. Discuss goals, work style preferences, and communication style – and the degree to which these are in alignment (or the degree to which flexibility and adaptation will be needed). Suggest areas where the advisor can help based on strengths, skills, knowledge, and availability. Consider other faculty and administrators who can provide support or mentoring beyond the advisor’s own expertise and/or availability. Be aware of campus resources and refer students to those resources freely and without judgement. Talk about logistics including frequency of in-person meetings and progress updates by email. Begin to make plans and set deadlines for meeting degree requirements, such as Q and A exams. Discuss funding plans. Discuss needs and expectations for presenting and publishing research, especially in fields where collaborative research and co-authorship are common. Encourage students to look for information and advice from across campus. Encourage students to develop a network of mentors. Tips for Sensitive Conversations Often, students are not comfortable speaking with their advisor about weaknesses and challenges. Sometimes it helps to refer a student to the Graduate School or another campus office. Example: “Most students experience stress at some point in graduate school. They find that the deans in the Graduate School are helpful with talking about a range of difficulties, finding community, or resolving problems…even challenges with their advisor!” “I often suggest to students that they talk to someone at Cornell Health about…motivation, procrastination, anxiety about writing, feelings of isolation, etc.” Advising for Degree Progression and Completion Effective advisors help their students understand and meet degree and other expectations for successful completion of their program. Tips and Resources Make degree requirements readily available, preferably as part of the graduate field’s online graduate student handbook. Provide students with additional requirement details pertinent to their individual needs or plans. Provide students with the unwritten rules to academic success. The expected quality of work The importance of meeting deadlines Expectation for establishing professional and social networks in graduate school and in the discipline Encouragement for attending conferences and making presentations, presenting posters and papers, writing for publication, securing funding, preparing early for the job market, etc. Provide students with important information specific to your discipline, for example: the length of time it might take to get required approvals to conduct research projects (e.g., from animal care or human participant review boards) and how to continue productivity while waiting for approval, getting timely feedback from faculty on drafts of proposals or dissertation chapters, or how to strategically engage each member of a special committee for greater support and efficiency. Providing Feedback on Academic Performance Regular and candid communications about academic progress can help a student be more productive, efficient, and confident that they are moving in an advisor-approved and supported direction for degree completion. Tips Ask students to develop an academic and research plan that includes dates for accomplishing each requirement, including: Course requirements Special committee formation Fellowship applications and feedback Field and Graduate School exams Proposal or prospectus Research and publications Thesis or dissertation Consider asking students to use a planning tool like the Individual Development Plan (IDP) in which students outline their academic, research, and professional development plans. Revisit student plans, at least annually, as part of the required Student Progress Review . Review and assess progress Recognize accomplishments Identify obstacles Promptly discuss problems and help provide options for addressing them. Supporting Student Well-being Mental health and well-being are the foundation for academic and life success. Not all stress is problematic. Some stress can increase students’ functioning, and overcoming challenges is an important part of developing resilience; however, extreme psychological distress can undermine a student’s ability to persist and impact degree completion. Nationally, graduate students report higher levels of depression or anxiety compared to the general population. This is true for Cornell graduate students as well. According to the Cornell Doctoral Experience Surveys (2019 and 2021), over half of Cornell Ph.D. degree students have reported mental health concerns as being a major or minor obstacle to their academic success. Effective advisors actively create and promote a culture of well-being. Tips Expectations and feedback Provide clear expectations , timeline and assessment criteria. Motivate through positive rather than negative reinforcement. Belonging and social connectedness Get to know your students personally, professionally, and academically. Encourage your students to get to know each other. A sense of academic and social belonging improves self-efficacy, mental health, productivity, and satisfaction. Growth mindset and motivation Demonstrate and communicate a belief in a student’s ability to grow by acquiring new knowledge and skills. Provide honest feedback that encourages self-reflection and steady progress forward. Normalize failure and help-seeking behaviors as part of the process of learning. Meaning and purpose Encourage self-reflection practices that allow students to gain greater self-awareness. Share your own professional journey. Support student career exploration (within and beyond academia) and preparation. Stress management and self-care Validate the importance of rest and self-care in relation to academic performance, mental health, and well-being. Endorse the practice of taking meaningful breaks and actively managing stress. Addressing Concerns about Students At times you may have concerns about your students’ well-being and may be unsure what to do. Cornell has resources for you to engage with to support the student’s well-being. Concerns: Safety: Cornell University Police : 607-255-1111. Students in crises: Student Support and Advocacy Services in the office of the Dean of Students focus areas include campus-wide case management and crisis response services. Case management consists of building 1-on-1 helping relationships with students while coaching them toward resources, self-care, and self-advocacy. Students experiencing non-crisis physical, psychological, safety, and patterns of academic concern should be referred to this office via this form by selecting the Student of Concern in the Report Type drop-down menu. To reach the Administrator on-Call after-hours , call the Cornell University Dispatch at 607-255-1111 and request to be connected to the Administrator on-Call. Students in distress: Cornell Health Counseling and Psychological Services (CAPS) counselors are available to assist faculty and staff members regarding students in distress. Contact them at 607-255-5155. During business hours, press 1 for urgent concerns or 2 to be connected with a CAPS receptionist. When Cornell Health is closed, your call will be answered by the answering service, and an on-call health care provider will return your call within 30 minutes. Advice: The Graduate School Office of Graduate Student Life can help determine how best to support academic and student life concerns. We can help brainstorm strategies to support difficult situations, discuss next steps, connect with other campus resources, and make action plans. Your director of graduate studies is a great resource if you are concerned about the well-being of your student and is often aware of other resources or strategies to best support you and your student. Disabilities or accommodations: If your student is asking for academic flexibility because of a particular concern (i.e. medical, disability, or experience), refer the student to the Student Disability Services (SDS) Office. SDS will make sure that the institution has fulfilled all legal obligations and provides structure and a process to support both advisor and student in negotiating what is an appropriate accommodation. There may be times that your student will be best supported through other Cornell offices; please become familiar with other available resources . Guiding Students' Professional and Career Development Students engage in professional development opportunities and begin career exploration at varying times. Perceptions about the job market both within and beyond academia can create considerable concern and anxiety, while exploring and preparing for a variety of career options can foster confidence and competence. Tips Encourage students to utilize the services and engage in the events and programs provided by the Career & Professional Development team within the Graduate School. Provide encouragement and guidance as your students prepare to enter the job market. Refer students to resources available on campus, recognizing that advisors may not have direct experience with a specific type of job. Refer students to designated faculty or career professionals in your field. Encourage students to attend professional meetings of regional groups or organizations. Assist students with preparing application materials for appropriate funding opportunities. Resources Pathways to Success , the Graduate School’s professional development framework for graduate students and postdoctoral scholars, is designed to support student success now and into their future careers. Programming is organized into the following thematic focus areas: Navigate Academia Build Your Skills Create Your Plan Prepare for Your Career Pathways to Success events and programming are organized and sponsored by the following units within and partners of the Graduate School: Academic and Student Affairs Fellowship application writing workshops Write-ins Careers Beyond Academia Information sessions LinkedIn profile workshops Communicating your research Career panels Future Faculty and Academic Careers Building Mentoring Skills NextGen Professors Program Inclusive excellence workshops Scholarship of Teaching and Learning Additional workshops as part of the CIRTL network Graduate Student Life Graduate School Primer workshop series for new students Perspectives workshop series for continuing students Weekly Walks Pause and Unplug Yoga Financial education Inclusion and Student Engagement Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates Future Professors Institute Colman Leadership Program Postdoctoral Studies Academic Jobs Search Series Postdoc Leadership Program One-on-one tutoring Individual academic job search consultations Online institutional memberships with career components Additional Pathways to Success Partners Knight Institute for Writing in the Disciplines Graduate Writing Service Cornell Writes! , a digital newsletter on writing sponsored by the Knight Institute for Writing in the Disciplines the Cornell University Graduate School. Cornell Writing Centers Ready to Write! online resources for writers Center for Teaching Innovation Get Set Program International TA Program Teaching Portfolio Program CTI Fellowship Cornell Career Services Graduate and international student career advisor Job search resources Job-search curriculum with step-by-step process for exploring careers beyond academia English Language Support Office Tutoring Workshops Speaking Groups Summer Thesis and Dissertation Writer’s Blocks Cornell Office of Research & Innovation Nature Masterclasses Responsible Conduct of Research training and resources Cornell Library Research Support Instruction Support Digitization and Copyright Current Awareness Scholarly Publishing Workshops (asynchronous and synchronous) Memberships Through Cornell’s institutional memberships with a number of organizations, graduate students also have access free individual memberships with a number of organizations, including the National Center for Faculty Diversity and Development and ImaginePh.D. . See Free Memberships for Cornell Graduate Students and Postdocs . Special Challenges in Advising Special Challenge: Avoiding Email’s Pitfalls Emails often lack nuance, and messages can appear overly demanding or aggressive. Communicating in person is often the best way to foster a positive and effective relationship. If you need to communicate by email, consider the following tips: All emails, faculty and student, should be responded to in a timely manner and within two weeks. For emails requiring a more rapid response, indicate the date by which you need a response. If students do not respond, consider appropriate next steps to determine if the student is alright or if there are problems that require other resources. Consequences for non-responsive students should be discussed with the DGS and can include a notification that funding will be withdrawn or the advisor will resign. Special Challenge: Resolving Conflict Conflict can be present in any relationship. The power dynamic created by the advisor’s supervision, evaluation, and funding roles can make students hesitant to address differences in opinion or approaches. The stakes can feel too high and the outcome too fraught with fear of losing funding or an advisor. Tips and resources Review Cornell and Graduate School policies that can help prevent and manage problems. Examples of these policies include the following: Graduate Faculty’s Code of Legislation Student Code of Conduct Policy on Academic Misconduct Research Misconduct Graduate School Grievance Policy Intellectual Property Graduate Student Assistantships (Policy 1.3) Communicate regularly and work to clarify any miscommunication. Talk to the field director of graduate studies (DGS) who can suggest a resolution and also facilitate a conversation with both parties present. Consult the Office of the University Ombuds . These Graduate School deans can assist faculty and students, individually or together, in developing strategies to resolve conflict. They can also refer advisors and students to a trained conflict resolution consultant on campus. Contacts: Associate Dean for Academics, gradacad_assoc_dean@cornell.edu Associate Dean for Inclusion and Student & Faculty Engagement, grad_assoc_dean@cornell.edu Senior Assistant Dean for Graduate Student Life, gradstudentlife@cornell.edu If the conflict can’t be resolved to the satisfaction of both parties, the advisor may choose to resign, or the student may choose to get a new advisor. Students can consult with the Graduate School Associate Dean for Academics or the Senior Assistant Dean for Graduate Student Life about changing advisors. The Graduate School’s Code of Legislation provides detailed guidance on changes to special committee membership and committee member resignations. Challenge: Working with Students Who Want to Leave Graduate School On occasion a student with whom you are working will decide to leave Cornell for another graduate program or to leave graduate study altogether. These students may find it difficult to discuss their decision. They may believe that leaving a graduate program is a sign of failure or feel guilty that they are letting others, like their advisor, down. Tips Discuss sound reasons for leaving constructively, for example, a poor fit or timing issues. Consider other personal or professional reasons, remembering that students often return for graduate study at Cornell or elsewhere. Consider whether the student will benefit from your advice, especially if there are areas in which the student truly needs to improve to be successful in graduate school. In cases where the student’s academic progress has been inadequate or where there has been conflict or unresolvable mismatch in communication or work styles between student and advisor, refer the student to the DGS or to someone in the Graduate School for this conversation and feedback. The Graduate School can help develop a supportive exit plan to the degree that is possible. (In situations where the student is leaving related to academic or research misconduct or academic integrity violations, the Graduate School will have been involved from the outset; please contact the Associate Dean for Academics if you have questions.) Special Challenge: Conflicts of Interest Conflicts of interest can impact advising and result in inappropriate decisions affecting students. The focus should always be on what is in the student’s best interest. Examples Romantic, sexual, or personal relationships with the student Intellectual conflicts of interest related to students’ freedom to publish research resulting from thesis and dissertation research Financial conflicts of interests related to outside professional activities, including those in the private sector on faculty-supported projects The American Association of University Professors (AAUP) cautions that a “conflict of interest does not entail an accusation of wrongdoing. … A conflict of interest refers to a factual circumstance wherein an impartial observer might reasonably infer that a conflict is present.” Faculty should enlist their department chair or others to help manage potential conflicts of interest. Advisors who want advice when considering whether a potential conflict of interest concerning a student exists, and whether such a conflict can be reasonably managed or should be avoided, can consult with their department chair, the Graduate School, Cornell’s Office of Policy , or the Office of the Vice Provost for Research , depending on the specific circumstance. Personal Relationships with Graduate Students and the Consensual Relationship Policy Cornell’s consensual relationship policy, Policy 6.3 (December 21, 2018) describes relationships that are prohibited as well as those that are not prohibited but that must be disclosed. Prohibited sexual or romantic relationships include (1) those where a member of the Cornell community has academic or professional authority over a student, (2) those between a faculty member and an undergraduate student, and (3) those where a faculty member holds a position of authority or is likely to do in the foreseeable future. The policy specifically addresses relationships with graduate and professional students this way: Because a graduate or professional student’s educational pursuits may evolve and that student may become academically aligned with a large number of faculty members or others who are affiliated with the same graduate field or degree program, the university discourages all intra-field/degree program relationships that are romantic or sexual in nature. When a romantic relationship develops under these circumstances that may not directly violate Provisions 1-3 above, it is nonetheless important that the faculty member or other person in authority promptly discloses the relationship to Academic HR Consensual Relationship Reporting ( acadhr_reporting@cornell.edu ). In addition, relationships that meet one or more of the following criteria must also be disclosed to Academic HR: Faculty in a position of authority over a student when the relationship existed prior to one or both parties coming to Cornell. Faculty in a position of authority where both parties are in the same graduate field or degree program (albeit without an academic or supervisory relationship). Faculty currently in a relationship that is in violation of the current policy Further, the policy notes that “if clarification is desired regarding whether a relationship requires disclosure,” faculty should contact Academic HR Consensual Relationship Reporting ( acadhr_reporting@cornell.edu ). Internal and External Educational Resources & Tools Faculty Advancing Inclusive Mentoring Cornell Graduate School Practical Steps for Addressing Inequities & Supporting Belonging Cornell Graduate School Faculty Resources for Supporting Graduate Student Diversity, Inclusion, and Well-being Cornell University Office of Faculty Development and Diversity – Resources for Mentors and Mentees University of Michigan, Rackham Graduate School – Faculty and Graduate Student Mentoring and Advising Guides National Academics – The Science of Effective Mentoring in STEMM National Center for Faculty Development and Diversity (NCFDD): Re-Thinking Mentoring: How to Build Communities of Inclusion, Support and Accountability (Focus is on mentoring faculty, but content can be adapted to be relevant to working with graduate students.) NCFDD: Creating a Harassment Free Lab NCFDD: How to Engage in Healthy Conflict (Focus is more on faculty to faculty interactions, but content can be adapted to be relevant to working with graduate students.) National Research Mentoring Network (NRMN) Resources for Faculty Mentors Clinical & Translational Science Institute: Online Mentor Training Modules (These modules are currently available at no charge to people affiliated with the University of Minnesota and external users who create a guest account with the university.) Center for the Improvement of Mentored Experiences in Research (CIMER) – Mentor Curricula and Training: Entering Mentoring University of Minnesota Mentoring Modules – External Registration Guide Duke University – Graduate School Mentor Toolkit University of Colorado Boulder – Graduate School Advising Agreement Nature – The Key to a Happy Life is in the Manual Faculty Advancing Inclusive Mentorship: FAIM Faculty Advancing Inclusive Mentoring (FAIM) is an equity-based systemic change initiative that provides a framework for inclusive mentorship applicable across graduate education and the professoriate. Bolstering this framework are resources and tools intended to be adapted and adopted to meet the contextual needs of mentors and mentees. FAIM is a collaboration of the Cornell Graduate School and Provost Office of Faculty Development and Diversity and the TRUST Alliance, which includes collaborators at Cornell, Montana State, and Purdue Universities. Learn more and access FAIM resources for supporting mentoring within graduate education on the FAIM website . Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}