{
  "id": 3,
  "date": "2024-05-18T18:09:18.478316",
  "url": "https://faculty-inclusive-mentoring.cornell.edu/",
  "university_name": "Cornell University",
  "title": "Purpose of Faculty Advancing Inclusive Mentoring (FAIM)",
  "content": "Log In Search Skip to main content Search: Submit Search Search Filters Search This Site Search Cornell Faculty Advancing Inclusive Mentoring A Collaboration of the Graduate School, Provost's Office of Faculty Development & Diversity, and TRUST Alliance Main Menu Toggle Search Form Home About Philosophy & Principles Terms & Definitions Why Does this Matter? Attributions & References FAIM Leadership Mentoring in Graduate Education Practical Toolkit Core Mutual Expectations Frequently Asked Questions Mentoring in the Professoriate Core Mutual Expectations Mentor & Mentee Development Home “Talent is equally distributed across all sociocultural groups, but access and opportunity are not.” – National Academies: The Science of Effective Mentorship in STEMM ( 2019 ) Purpose of Faculty Advancing Inclusive Mentoring (FAIM) The FAIM Resource Center provides a framework to support faculty in their development and advancement of mentee-centered and equity-minded mentoring practices within graduate education and the professoriate. The FAIM framework is comprised of an inclusive mentoring philosophy, key principles, and practical tools and resources. FAIM Definition of Inclusive Mentorship Inclusive mentorship is a co-constructed and reciprocal relationship between a mentor and mentee who take a strengths-based and identity-informed approach to working together to support their mutual growth, development and success ( NASEM, 2019 ; Windchief, 2019 ). FAIM Goals The FAIM philosophy, key principles, and core mutual expectation areas for inclusive mentorship provide a foundation for fulfilling mentoring relationships by: supporting mentors and mentees as they seek to develop an understanding of one another’s expectations, cultures, values, and sources of motivation. helping mentors and mentees develop a mentorship plan customized to their preferences and aligned to a mentor’s and mentee’s strengths, needs, and goals. providing practical resources and tools that can be adapted and adopted by mentors and mentees to be contextually relevant. Browse Additional Resources, Events, & News at Cornell Signature Inclusion and Graduate Student & Engagement Initiatives Workshops, News, & Events for Future Faculty Workshops, News, & Events for Faculty Featured External Reports & Practical Resources Advancing Antiracism, Diversity, Equity, and Inclusion in STEMM Organizations: Beyond Broadening Participation (National Academies of Sciences of Science, Engineering and Medicine [NASEM]) The report outlines actions that top leaders and gatekeepers in STEMM organizations, such as presidents and chief executive officers, can take to foster a culture and climate of antiracism, diversity, equity, and inclusion that is genuinely accessible and supportive to all. Access a summary of the report here . The Science of Effective Mentorship in STEMM (NASEM) The Science of Effective Mentoring in STEMM committee systematically compiled and analyzed current research on the characteristics, competencies, and behaviors of effective mentors and mentees in STEMM and developed a practical resource guide for mentoring practitioners to create and support viable, sustainable mentoring support systems. Resources on the site include a comprehensive report on the status of mentoring in graduate education as well as a informational tools (e.g., a podcast) to improve mentorship in STEMM. Featured External Resources Equity in Graduate Education Resource Center The Equity in Graduate Education Resource Center advances equity in graduate education by conducting and translating research that is inspired by community needs, and offering high-quality, evidence-based professional development that provides faculty and administrators with tools and resources to create and sustain institutional change. Cornell is a member of the national Equity in Graduate Education Consortium , making additional resources available to our community members. NCFDD NCFDD provides on-demand access to the mentoring, tools, and support needed to be successful in the Academy. They focus on four key areas: strategic planning, explosive productivity, healthy relationships, and work-life balance. Cornell is an institutional member of the NCFDD, making individual memberships for faculty, postdocs, graduate students, and staff available for free. Internal Partners Graduate School Office of Inclusion and Student Engagement Provost Office of Faculty Development & Diversity Graduate School Future Faculty and Academic Careers External Partners Equity in Graduate Education Consortium Office of Graduate Diversity Initiatives, Purdue University Center for Faculty Excellence, Montana State University Faculty Advancing Inclusive Mentoring Cornell University 325 Caldwell Hall Ithaca, NY 14853 FAIM@cornell.edu Follow us on: Cornell University ©2024 University Privacy Web Accessibility Assistance"
}