{
  "id": 3,
  "date": "2024-05-18T18:07:40.784674",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/p2s-symposium/winter-2020-pathways-to-success-series-sessions/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Pathways to Success Symposium Winter 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions January 27, 2021 Part I (11:00 a.m. to 12:30 p.m.) Adapting Professionally: Finding Direction in a Changing World Session Summary: Learning the skill of adaptation is foundational to our ability to find success both personally and professionally. And how we respond to change, challenge, and set-back are ultimately what creates resilience. Because we are in a dynamic, ever-changing world that has recently magnified the impact of additional external stressors, such as the double pandemic, this is the perfect time for a conversation about the intersectionality of our professional identity and strategies for how to adapt professionally. Whether you have a position secured, or are seeing fewer employment options in the future, join us for an expert-driven discussion panel. Heather Fortenberry , career exploration coach for Cornell Career Services Cornell community members can access a recording of the Adapting Professionally: Finding Direction in a Changing World . About Speaker Heather joined Cornell University’s Career Services in 2017 where she focuses on empowering students with the skills and confidence to explore their careers. As a career exploration coach, Heather manages Cornell’s CUeLINKS networking platform, develops partnerships across campus to support career development for Cornell students, and encourages exploring careers through connections with others. She also administers the strengths assessment and enjoys helping students recognize their strengths in their personal, academic, and professional experiences. Heather grew up in Ithaca and earned her B.S. in communication disorders from Pennsylvania State University. As a first-generation college student, she is passionate about connecting students with resources and community, and she is inspired and motivated by her work with higher education. Part II (1:30 p.m. to 3:00 p.m.) How to Strategically Prepare For Multiple Career Pathways Session Summary: Are you thinking about going into academia or beyond? Do you know which skillsets will be valued and how to tell your story? Whichever career pathway you are thinking of pursuing, this session will help you think about the timing and how to prepare yourself for success. Facilitators Denise DiRienzo , experiential program director for Careers Beyond Academia Christine Holmes , director for Postdoctoral Studies Colleen McLinn , executive director for Future Faculty and Academic Careers Susi Varvayanis , executive director for Careers Beyond Academia Caleb Yu, graduate and international student career advisor for Cornell Career Services January 28, 2021 Part III (11:00 a.m. to 12:30 p.m.) Exploring and Preparing for Faculty Careers with an International Lens Session Summary: Join us for a panel discussion with international and domestic Cornell postdocs, graduate students, and alumni on their experiences seeking faculty careers in the U.S. and abroad. Cornell community members can access a recording of Exploring and Preparing for Faculty Careers with an International Lens . Panelists Felix Alfonso , postdoctoral researcher in the department of chemistry and chemical biology, Cornell University Wendy Beauvais , assistant professor of epidemiology and public health at Purdue University College of Veterinary Medicine Lucy Xiaolu Wang , Ph.D. ’20 (economics), senior research fellow at Max Planck Institute for Innovation and Competition, and assistant professor, University of Massachusetts Amherst (starting fall 2021) Cathelijne Stoof , assistant professor of pyrogeography at Wageningen University and Research Part IV (1:30 p.m. to 3:00 p.m.) Getting Your Foot in the Door Session Summary: Join us for a panel discussion with alumni and other professionals who will share how they got their foot in the door to explore unexpected pathways for their career success. This discussion will also include an exploration of some of the key resources, strategies, and opportunities that helped them in their decision-making processes. Panelists Vivekinan “Vivek” Ashok , presidential postdoctoral fellow in government, Cornell University Wisler Charles , Ph.D. ’16, field application scientist at GenScript Ezen Choo, Ph.D. ’17, clinical variant curator at Natera Ronda Hamm , Ph.D. ’08, global academic relations at Corteva Agriscience and adjunct faculty in the biology department at Ball State University Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}