{
  "id": 3,
  "date": "2024-05-18T18:06:28.737358",
  "url": "https://postdocs.cornell.edu/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Office of Postdoctoral Studies Main Menu Search Home Home About Facts and Figures Quick Facts Structure of Postdoctoral Study Contacts Postdoctoral Association (PDA) Benefits Tax Information Self Funded Postdocs Cornell Resources Cornell Funded Postdocs For Faculty Forms Postdoc Achievement Awards Postdoc Salary and Benefits Postdoc Careers Networking Job Search Outside of Academia Campus Career Resources Academic Job Search Professional Development Online Career Resources Postdoc Life Information for International Postdocs Campus Resources Living in Ithaca Other Resources Essentials in Ithaca Prospective Postdocs Faculty and Research Finding a Postdoc Cornell Postdoctoral Fellowship Programs Welcome postdocs and families! The Office of Postdoctoral Studies hopes you enjoy your stay here and that you visit our office.  We are here to help you navigate Cornell, address potential challenges, and make your stay more pleasant. The Postdoc Experience at Cornell Overview The Office of Postdoctoral Studies supports and advocates for postdocs at all phases of their training. We collaborate with offices across campus, including academic departments, faculty, and administrators, to support postdocs as they prepare for their future careers. The Office of Postdoctoral Studies provides: *Information about Cornell *Information about moving to Ithaca *Information about benefits and Cornell resources *Career and professional development services *Orientation sessions *Social and community-building events News Committee to recommend final expressive activity policy More News Events May 20, 2024 Language Circle at the Barn May 20, 2024 Lets Meditate at the Barn May 17, 2024 TGIF (Tell Grads It’s Friday) More Events Affiliated Offices Graduate School Careers Beyond Academia Future Faculty and Academic Careers Office of Global Learning Campus Life and Cornell Housing Office of Human Resources Cornell University Office of Postdoctoral Studies 190A Caldwell Hall Cornell University Ithaca, NY 14850-2602 postdocs@cornell.edu 1-607-255-5823 Cornell University © 2024 Web Accessibility Assistance"
}