{
  "id": 3,
  "date": "2024-05-18T18:08:13.524069",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/prepare-for-your-career/explore-options/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Prepare for Your Career Explore Options Explore Options Career preparation both in and beyond academia: Cornell Doctoral Alumni Career Outcomes – an interactive report on the employment status and career-related perceptions of Cornell’s doctoral alumni. Do You Need a Postdoc Position? ImaginePh.D. – A free, online career exploration and planning tool for Ph.D. students and postdoctoral scholars in the disciplines of humanities and social sciences. Careers Beyond Academia – Careers Beyond Academia gives Ph.D. students and postdocs the chance to test-drive specific aspects of various careers through flexible, experiential, empowering opportunities. Careers in academia: Academic Job Search Series – Are you interested in pursuing your career in academia? Several Graduate School offices collaboratively offer workshops and events to learn about the academic job search process. Future Faculty and Academic Careers – Explore professional development opportunities on important topics in teaching, mentoring, and academic career preparation. Center for Teaching Innovation (CTI) – CTI offers a range of programs and services to support effective teaching and learning practices at Cornell. Pursuing a postdoctoral position: Office of Postdoctoral Studies – If you are interested in pursuing postdoctoral studies, contact Christine Holmes, the director of the Office of Postdoctoral Studies. National Postdoctoral Association (NPA) – The NPA is a non-profit organization dedicated to enhancing the quality of postdoctoral experience. You can find postdoctoral opportunities here. Careers beyond academia: Ph.D. Friendly Employers (Excel) – Check out the list of employers in and outside the U.S. that have hired Cornell Ph.D. alumni (the source of the data: Ph.D. Alumni Career Outcomes Survey). Professional Associations – Find the professional associations that are relevant to your field or career interest. Ph.D. at Work – Connect with Ph.D.s working across industries through their career stories. CCS Alumni Connections Program (ACP) – ACP helps you take advantage of our vast alumni network to learn about their career paths. CUeLINKS – A university-wide platform promoting connections between students and alumni or friends of Cornell who are eager to share their knowledge and experiences beyond academia. CCS Exploring Options Links CCS Monthly e-Newsletter, CU Grad Students Career Resources – Subscribe to this newsletter for career information and job opportunities for graduate students pursuing careers beyond academia. Contact Cornell Career Services (CCS) at 607-255-5296 to meet the graduate and international career advisor. Careers Beyond Academia Research Guide – Use this LibGuide to delve efficiently into various employment sectors and connect with potential mentors. Explore job opportunities: Prior to taking action, explore what types of career opportunities are available to you based on your interest and skills by visiting any of the following job search engine sites: Cornell Handshake – A great tool for exploring job/internship opportunities. You can also find upcoming career events inside and outside Cornell. USAJobs and Careers in Government – Explore federal employment opportunities across the United States and around the world. HigherEdJobs – Explore various administrative career opportunities in higher education. Idealist – Explore career opportunities in nonprofit organizations. Expand your professional network: Networking Skills and Building a Network – Learn why networking is important and how to build it to develop and prepare for your career goals. Informational Interviews – A specific networking tool for learning firsthand about a career path, employer, industry, or other career information. LinkedIn – Create a profile to manage your professional brand and join LinkedIn groups to build your professional network. CUeLINKS – A university-wide platform promoting connections between students and alumni or friends of Cornell who are eager to share their knowledge and experiences beyond academia. Additional resources: The following links provide career and professional development advice to graduate students and postdocs. Inside HigherEd Carpe Careers Beyond Academia Chronicle Vitae The Chronicle of Higher Education Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}