{
  "id": 3,
  "date": "2024-05-18T18:10:26.875188",
  "url": "https://gradschool.cornell.edu/academic-progress/thesis-dissertation/submitting-your-thesis-dissertation/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Academic Progress Thesis & Dissertation Submitting Your Thesis/Dissertation Submitting Your Thesis/Dissertation Submission of the final thesis/dissertation must be within 60 days of the final exam. Students who miss the 60 day submission deadline are ineligible to register in future terms. The Graduate School uses ProQuest to administer the electronic thesis/dissertation (ETD) submission and committee approval process that results in publication in ProQuest Dissertations and Theses (PQDT) database and Cornell’s Library Repository, eCommons. Before initiating the electronic process, students are required to complete the Survey of Earned Doctorates (for doctoral students only). A SED Certification of Completion is provided to the student when the survey has been completed. Once the survey is completed, the final ETD can then be submitted to the Graduate School using the ProQuest system. The SED Certification of Completion is required for submission to ProQuest. ProQuest Submission Steps In order to complete the submission process, you will need to have the following: A single PDF file of your thesis or dissertation Your abstract Supplemental material SED Certification of Completion Step 1: Begin Submission Process Master’s students go to Cornell Master’s ProQuest site, doctoral students go to Cornell Doctoral ProQuest site. Click on the “sign up and get started today” button and follow instructions to begin the submission process. Submission Process: Submission steps are outlined on the left menu. You will see the items checked off as you progress through the submission steps. You must click “Save & Continue” at the bottom of each page, even pages on which you do not enter any information. Using the left menu, you can return to any page and make changes until the point of final submission. Step 2: Publishing Options Traditional Publishing: “Traditional Publishing” is automatically selected and is included in the Cornell Thesis and Dissertation filing fees. Delayed Release: ProQuest provides six months, and one and two year embargoes. The Graduate School recommends you discuss the publishing options with your advisor. If your advisor is unavailable or has no opinion, the conservative approach is to choose a two-year embargo. Step 3: Read and Agree to ProQuest and University Distribution License Both ProQuest and Cornell University distribution licenses will be presented for your acceptance. Step 4: Enter Thesis/Dissertation Information In addition to the mandatory information, such as title and abstract, you will have the opportunity to select up to three categories (subject areas) and six key words that describe your ETD. This information will make it easier for others to find your work when searching the web. Step 5: Upload PDF and Supplemental Files Upload PDF: Whether you use the PDF conversion tool provided by ProQuest or you convert your document to PDF yourself, review your PDF to ensure your formatting remains as you intended after conversion. Supplementary Materials: If supplementary materials – such as audio, video, and spreadsheets – are an integral part of your ETD, you can submit them as supplementary files during the online submission process. Step 6: Upload Required Documents The SED Certification of Completion if you are a Ph.D. candidate is required for submission to ProQuest. Step 7: Register for Copyright You can complete this process through ProQuest for a fee, or you complete the process independently through the U.S. Copyright Office. Step 8: Order Copies If you would like to purchase additional copies of your thesis/dissertation for yourself, your field, or your committee members, you may order bound copies through ProQuest (Order Copies page). The required bound archival copy for the library is automatically ordered for you and included in the Cornell thesis and dissertation filing fees. Select the “Decline – do not order” option if you don’t wish to order additional copies. Bound copies can also be ordered through Cornell Print Services . Step 9: Review and Submit Once the thesis editor has reviewed the formatting of your thesis/dissertation, you will receive an email to let you know whether any corrections are required. You will then have five days to make the changes and upload the revised PDF. You will not be certified for graduation until the formatting of your ETD has been fully approved by the Graduate School. You will receive a confirmation email of final acceptance. Step 10: Submitting Revised PDF (if needed) You will receive an email describing the formatting changes needed with instructions and a link for resubmission. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}