{
  "id": 3,
  "date": "2024-05-18T18:15:54.244273",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Diversity & Inclusion The Graduate School is committed to providing an inclusive and holistic approach to graduate scholar success. Office of Inclusion and Student Engagement The Graduate School Office of Inclusion and Student Engagement (OISE) is committed to supporting excellence within graduate education, and fostering environments where all scholars, but especially those from backgrounds historically excluded from and underrepresented in the academy, can find community, experience positive mentoring relationships, and establish a sense of belonging. Our collaborative programming provides graduate students and future faculty with academic, community, and professional development opportunities critical to their success at Cornell and beyond. OISE also facilitates positive systemic change initiatives to advance diversity, access, equity, and belonging in graduate education and the academy more broadly. About OISE Contact OISE Staff Facebook X (formerly Twitter) Office of Access and Recruitment The Graduate School’s Office of Access and Recruitment is committed to promoting graduate study at Cornell. Our staff serves as the liaison to all prospective students, especially those from backgrounds historically excluded from and underrepresented in the academy. Please use the links below to learn more about what the Office of Access and Recruitment and our personnel have to offer you. Prospective Students Recruitment Events Become a Graduate Student Ambassador Signature Initiatives OISE provides specific mentoring, professional, and academic development programs to help students achieve success at Cornell and in their future. Summer Success Symposium Dean’s Scholars Program NextGen Professors Bouchet Graduate Honor Society Founded by Yale and Howard Universities in 2005, the Edward A. Bouchet Graduate Honor Society recognizes outstanding scholarly achievement and promotes diversity and excellence in doctoral education and the professoriate. The society seeks to develop a network of preeminent scholars who exemplify academic and personal excellence, foster environments of support and serve as examples of CLASS: Character, Leadership, Advocacy, Scholarship, and Service. Overview & Scholar Selection Timeline Cornell University Bouchet Society Scholars Annual Bouchet Induction Ceremony & Conference Graduate Diversity & Inclusion Awards Annual awards presented to graduate and professional degree students, faculty, staff, and community members who have demonstrated a strong commitment towards advancing efforts around diversity, inclusion, outreach, and graduate student engagement. Graduate & Professional Student Awards Faculty Awards Staff & Community Member Award Funding and Resources Cornell University provides access to a wide range of internal and external resources to help students reach their academic, professional, and personal goals. Diversity Fellowships External Resources University Support for DACA and Undocumented Students , and International Scholars Faculty Resources The Graduate School Office of Inclusion and Student Engagement and our partners, support faculty engagement in discussions and workshops on equity-based holistic admissions, diversity recruitment, and mentoring practices with the purpose of establishing more equitable and inclusive research and learning environments. The Graduate School Office of Graduate Student Life supports faculty engagement in discussions related to maintaining a healthy student life, including mental health and stress management, sense of community, life-academic balance, and support for students’ personal development. Partners throughout the university also provide programming and resources for faculty and others supporting the graduate community. Faculty Advancing Inclusive Mentoring (FAIM) Resource Center Practical Steps for Addressing Inequities and Supporting Belonging Resources for Supporting Graduate Student Diversity, Inclusion, and Mental Health Office for Faculty Development and Diversity – Faculty Resources Center for Teaching Innovation – Programming for Faculty & Instructors Cornell Health – Programming for Faculty and Staff Student Organizations There are a number of student organizations represented on the Graduate and Professional Student Diversity Council that work collaboratively with the Graduate School and other campus partners on initiatives to advance a sense of community, professional excellence, and a climate of inclusion for all graduate and professional students, but especially for those from backgrounds historically excluded from and underrepresented in the academy. Find more information on the over 1,000 student organizations found at Cornell. Belonging at Cornell Cornell’s transformative diversity and inclusion framework, Belonging at Cornell , provides a broad institutional structure for asserting the centrality of diversity and inclusion to the university’s values and excellence. Cornell’s diversity and inclusion framework is based on the recognition that education, research, knowledge production, and operational and academic pursuits are enhanced through full and reciprocal engagement among diverse perspectives, life experiences, and modes of knowledge creation and interpretation. Reporting Bias Reporting, understanding, and preventing unacceptable behaviors such as bias, sexual misconduct, and hazing are essential to maintaining our caring community. Cornell offers various avenues for reporting these incidents as well as receiving confidential care and support if you need it. Land Acknowledgement The Graduate School Office of Inclusion & Student Engagement acknowledges that Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy , an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. We encourage all who engage with the Graduate School and Cornell University to learn more about the Gayogo̱hó꞉nǫ Ɂ , their history, and people, and to take meaningful action to support Indigenous scholars and their communities. We also encourage all to learn more about the American Indian and Indigenous Studies Program‘s Project and Blog on Cornell’s Relationship to Indigenous Dispossession . Commitment to Diversity, Equity, Inclusion, Access, & Belonging The Graduate School retains a steadfast commitment to actively fostering an inclusive environment that engenders the full and safe participation of all members of our graduate and professional student community and demonstrates how their diverse perspectives, identities, ways of knowing, and lived experiences are recognized, welcomed, and valued. As part of this commitment, we continue to expand initiatives to increase diversity and access, enhance mentoring experiences, and actively address inequities so all members of our community have opportunities to feel affirmed, establish a sense of belonging, and thrive academically, personally, and professionally. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}