{
  "id": 3,
  "date": "2024-05-18T18:08:43.871329",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/graduate-diversity-inclusion-awards/graduate-diversity-inclusion-awardees-2020/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Graduate Diversity & Inclusion Awards 2020 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees Exemplary Service Awards for Early & Advanced Career Students Early Career Trevor Donadt Trevor Donadt , Ph.D. student in chemical engineering, is the recipient of the 2020 Early Career award for Exemplary Service. Trevor has had a tremendous impact on the Cornell community since he started his doctoral program. As the leader of Chemical and Biomolecular Engineering’s Diversity and Inclusion Program (DIP), Trevor led faculty, staff, and graduate students in efforts to improve the department climate for over 150 individuals on a daily basis. Trevor’s involvement was crucial for the administration of an in-house department climate survey, a departmental statement of values and inclusion, and creating an inclusive building ambience. He also played a key role in the department’s first Pride Month event in recognition of LGBTQ+ history and students. During his tenure as the leader of DIP, Trevor continuously sought out different university resources and brought them back to his own field, including, but not limited to, training with the Intergroup Dialogue Project and Future Faculty and Academic Careers (formerly CIRTL at Cornell). Trevor is a non-traditional student who founded a company that has enabled high schoolers of various backgrounds to access a college education. His advisor says, “Trevor has formed the belief that scientists themselves are uniquely positioned to drive the conversation away from fear and doubt by sharing exhilarating personal experiences and fascinating research stories.” According to his nominators, “Trevor is a tremendous advocate of diversity and inclusion efforts in higher education and will only become an increasingly valued role model, mentor, and asset as he proceeds through his degree.” Advanced Career The recipients of the 2020 Advanced Career Exemplary Service Award are Zoe Getman-Pickering, Aaron Joiner , and Marisa Rice. Zoe Getman-Pickering Zoe Getman-Pickering , Ph.D., entomology, is recognized for her extensive involvement in numerous outreach and education programs. During her time at Cornell, Zoe has taken an active role in making science education accessible to members of underserved communities. She has worked with programs like Letters to a Pre-Scientist and I’m a Scientist U.S . , and has personally led day-long courses to teach K-12 students about entomology and careers in science. She has organized and led “bug zoos” for Expanding Your Horizons, local schools, a senior center, and the New York State Fair. Zoe brings creativity and enthusiasm to her outreach and service – she has painted murals and co-created claymation videos to teach the broader public about her science. Zoe also developed an app called LeafByte for measuring leaf area and herbivory that is being used in labs and classrooms around the world. In addition to these endeavors, and many others, Zoe has been instrumental in organizing and facilitating entomology’s highly successful Insectapalooza event for six years. Within her field, Zoe has been a champion of diversity and inclusion. She worked to create a mental health task force and survey and played a key role in advocating for gender-neutral restrooms in the entomology building. She also worked with Project Biodiversify to co-lead workshops with people across the university community to make biology curricula more inclusive to the LGBTQ+ community. Zoe has also actively mentored many undergraduate students from groups historically underrepresented in the academy, helping them to strengthen their research skills and even inviting them to co-author papers with her. Zoe’s commitment to service is abundantly clear; Zoe’s advisor Jennifer Thaler states, “Her creativity and enthusiasm have allowed her to reach and inspire thousands of people.” Aaron Joiner Aaron Joiner , Ph.D. candidate in biochemistry, molecular and cell biology, has contributed extensively to the Cornell community through a wide range of efforts aimed at improving diversity, access, equity, and inclusion within academia and providing opportunities for all. Among his many contributions include the founding of a shadowing program for participants in Cornell’s NY STEP (Science and Technology Entry Program), which connects high school students from underrepresented and/or underserved backgrounds with graduate student mentors. Through this program, high school students learn about higher education and gain detailed insights on scientific research. Aaron has also been involved in the local GRASSHOPR outreach program and with Careers Beyond Academia (formerly the Cornell BEST Program), for which he serves on the advisory committee. Aaron is also a Graduate Student Ambassador and an enthusiastic recruiter for Cornell at ABRCMS and other recruitment events. He has also been engaged in outreach initiatives focused on McNair Scholars and participants in other scholar programs. As a founding member of the Molecular Biology and Genetics Department Diversity Council, Aaron has promoted efforts to increase the diversity of the graduate student population and to create a supportive campus climate for all students. Marissa Rice Marissa Rice , Ph.D. candidate in psychology, deeply cares about and has fully dedicated herself to promoting diversity, inclusion, outreach, and engagement. Marissa’s community engagement includes serving as a leader within the Black Graduate and Professional Student Association, supporting mentoring and professional development activities of the Cornell McNair program, and contributing to sessions for early career graduate students on topics including preparing a competitive NSF GRFP proposal and mastering your transition to graduate school. Marissa’s contributions to the Big Red Barn, which include hosting social and community development events, help make the Barn a welcoming and supporting environment for all graduate students. Marissa’s outreach efforts include participating the field of psychology’s Expanding Your Horizons ‘BRAINS!’ workshop, which focuses on exposing and engaging middle school girls to the many areas and opportunities within STEM. She also serves as a key member of the Department of Psychology Diversity Committee, through which she has influenced positive change within the field. Marissa also serves as a Graduate Student Ambassador and participates in national events that include a focus on engaging undergraduates in research and preparing them for graduate studies. She has participated in the TechSavvy program at her alma mater, Virginia Tech, to promote, recruit, and retain women in STEM careers. Marissa has played a role in nearly every organization or program that Cornell has that is aimed at building a stronger graduate and professional student community through peer mentorship and support, student advocacy, and support of student organizations. Regardless of the organization or program, Marissa always makes sure that the voices of members of marginalized communities are heard and respected. So much of what Marissa does to create a more inclusive community doesn’t end up on paper because her efforts aren’t part of a formal initiative or committee; rather, they are part of who she is and what she does. Excellence in Leadership Award Lauren Genova Lauren Genova , Ph.D., chemistry and chemical biology, is the recipient of the Excellence in Leadership Award for her extensive leadership activities that have touched many parts of the Cornell community. Lauren received seven nominations from students, faculty, and staff across campus and in multiple award categories this year, indicating the scope of the impact of her leadership. Several of her nominators highlight her creation of the Career-Oriented Webinar Series to help students navigate the many career options they might pursue in chemistry. This successful series has since been replicated to support career development of students in physics and sociology. Lauren has also demonstrated substantial leadership in programs that support graduate students as educators. As a graduate student representative to the Chemistry TA Training Program Evaluation Committee and as a Lead Teaching Fellow for Center for Teaching Innovation (CTI) programs, Lauren has developed and improved numerous opportunities for graduate students and postdoctoral scholars to develop teaching and mentoring skills. These efforts include organizing the 2019 Campus Wide-Teaching Conference. Most recently, Lauren led a group of CTI Fellows in writing and editing a book on the experiences of graduate student instructors, titled “Teaching Gradually”, that will be published by Stylus Publishing Company. Lauren has also demonstrated leadership in promoting educational research beyond her field of chemistry. As the only non-biologist in a course on evidence-based teaching in biology , Lauren took on the role of lead author on a manuscript describing a lesson on speciation developed by students in the course and gave a presentation of this experience at the Society for the Advancement of Biology Education Research to encourage other graduate students to publish their research on teaching and learning. Lauren also serves as mentor to undergraduate students through Graduate Students Mentoring Undergraduates (GSMU), a joint program of the Office of Academic Diversity Initiatives and the Graduate School Office of Inclusion and Student Engagement. While many graduate students serve as mentors through the GSMU program, Lauren has been described as a “shining star mentor”. In addition to serving as a mentor to undergraduates, she also led a training workshop for her fellow mentors, Building Impactful Relationships with Your Mentees, focused on actions mentors can take to make a positive difference in their mentees’ lives. Lauren also served as the outreach chair for Graduate Womxn in Science, an organizing chair for the Expanding Your Horizons Conference, and as a Graduate Student Ambassador. Her nominators state, “Lauren is clearly someone exceptional who will transform her environment wherever she goes. Her positive attitude is contagious and spreads across anyone who knows her. Her skills, willingness to help others, and dedication to our university and the broader academic and professional community make her more than deserving of the Excellence in Leadership Award.” Social Justice Award The recipients of the 2020 Social Justice Award are Stephen Kim and Chelsea Stephens. Stephen Kim Stephen Kim , Ph.D. candidate, English, has made significant contributions to social justice within the Cornell and Ithaca communities. His nominator states, “Stephen Kim embodies the values of human rights, dignity, equity, and humility. He has an unwavering commitment to center social justice in all aspects of his life and work.” Stephen’s dissertation, which focuses on the connections between race, gender, and sexuality, exemplifies his ability to balance complex, intersectional understandings of social justice. Stephen has taken on various roles during his time at Cornell including serving as a Graduate Resident Fellow at Bethe House, where he works to support student learning and to support fellow staff members to center inclusion and equity in their programming. As the Intergroup Dialogue Project Residential Community Specialist, Stephen has created training sessions for residential staff that center around social identity development and communication. He supports staff and faculty in their work and encourages ongoing learning processes which allow community members to explore current conflicts related to social identities in a collaborative learning space. Stephen believes in the power of education and the power of language to challenge systemic inequities and views education as a collaborative process; he models this through his involvement with the Cornell Prison Education Program, where he teaches English. He is a true advocate of social justice through every aspect of his practice and scholarship. Chelsea Stephens Chelsea Stephens , Ph.D. student, biomedical engineering, has been extensively involved in several social justice focused activities during her time at Cornell. She has made significant contributions through the 4-H Career Explorations program, Biomedical Engineering Society, and the Science and Technology Entry Program (STEP), organizing and leading workshops integrating engineering and life science. Chelsea is also a member of the Graduate and Professional Student Assembly (GPSA) Diversity and International Student Committee, and is a key member of the leadership team that launched the Building Allyship Series, focused on combating the historical and structural challenges faced by members of marginalized communities within and beyond Cornell. Chelsea has also worked in collaboration with the Diversity Programs in Engineering (DPE) as High School Programs Coordinator to organize and lead several activities for empowering pre-college students from historically underrepresented backgrounds. She has also developed and led a two-hour workshop promoting sexual health and responsible agency through Splash! at Cornell and has expanded this to a full semester curriculum that she taught at the New Roots Charter School as part of the GRASSHOPR program. In addition to her involvement in local and Cornell-affiliated organizations, Chelsea has also integrated entrepreneurial components into her efforts to reach and empower her community. She created Black Entrepreneurship and Reform (BEaR), a non-profit organization that advocates for at-risk youth and juvenile detainees through promoting education in entrepreneurship, mental health, and physical wellness under the tutelage of Black undergraduate, graduate, and professional students. She also started GUTSY, a firm that analyzes gut metagenomic and metabolomic information to provide client-specific nutritional recommendations for optimal infant health and development. Additionally, she created Black Monarch, a wine company catering to the palette of Black millennials. As her nominator states, “Chelsea has poured her Cornell life into her passion of engaging and empowering others and seeking justice and equity across the spectrum of society inside and outside of the university. In all of my interactions with her, inside and outside of science, this passion and her ability to generate ideas and the process to bring them to pass comes through. She embodies the level of dedication and passion we wish for all our students to have in making Cornell a model for social justice.” Community Outreach Award The recipients of the 2020 Community Outreach Award are Paige Priest and Renee Sifri. Paige Priest Paige Priest , M.P.H., is recognized for her deep engagement with local Indigenous communities. Paige rebuilt the connection between Cornell and Lafayette High School, a high school serving Indigenous students residing in the Onondaga Nation. Striving for the success of the American Indian and Indigenous Studies (AIISP) Tutoring Program at Lafayette High School, Paige tirelessly transported tutors, built a network of participants, cultivated an atmosphere of achievement, success, and trust and established a sustainable renewal process for the program. Paige has further demonstrated her leadership, commitment, and perseverance when she helped to revitalize the Indigenous Graduate Student Association (IGSA). Under one mission, Paige’s community outreach spans well beyond Cornell, connecting Tribal leadership, nonprofit organizations, state institutions, and federal policymakers alike. Her colleagues highlight that “Paige is committed to identifying and providing regionally relevant traditional food and health resources for Tribal communities and works alongside Tribal leadership to implement meaningful change.” Renee Sifri Renee Sifri , Ph.D. candidate in the field of chemistry, is recognized for coordinating and leading numerous outreach programs for the Cornell Center for Materials Research (CCMR). Renee’s outreach has provided experiences for students and teachers in Ithaca, New York City, Puerto Rico, and the Onondaga Nation. Her many activities include leading STEM enrichment activities for middle and high school students in Ithaca through after school programs at the Greater Ithaca Activities Center (GIAC) and Saturday workshops at the Tompkins County Library; leading STEM teacher workshops held at Weill Cornell Medical School and Columbia University in New York City; hosting K-12 educators in her lab for a week as part of the Research Experience for Teachers program; and chairing the Expanding Your Horizons conference. Her engagement in all of these activities exemplifies Renee’s impressive commitment to improving STEM education at every stage. Her nominators emphasize her passion, dedication, and creativity in her outreach activities, which benefit so many across the communities she works with. They state, “Renee is a truly exceptional teacher, scientist, and ambassador.” Unsung Hero Award The recipients of the 2020 Unsung Hero Award are Anitra Douglas-McCarthy, Kara Peet, and Stephanie Westmiller. Anitra Douglas-McCarthy Anitra Douglas-McCarthy , senior director of recruitment in the Graduate School, is recognized for her consistent dedication to supporting student access, well-being, and achievement. Anitra created the Graduate Student Ambassadors program, and her Ambassadors collectively nominated her for this recognition. Anitra interacts with thousands of prospective students each year, giving them attention, advice, and confidence in navigating the stressful process of graduate school admissions. Once these students enter Cornell, she puts in significant effort to help them understand what graduate school has to offer beyond educational programs, and helps to create a community where students can support one another. Anitra is critical to Cornell’s success in recruiting underrepresented and marginalized groups from across the nation. Anitra’s nominators state that Anitra has been crucial to their sense of belonging at Cornell as well as helping them become part of a larger community. She is someone who manages to remember where every single Graduate Student Ambassador comes from and what they study. She has been a champion of Cornell’s Diversity Preview Weekend since its inception and provided resources to every student advocating for holistic admissions practices within their graduate fields. She selflessly extends herself beyond her position to improve every aspect of graduate student life. One of her nominators states, “I personally do not think that I would be as confident about my work and my life if it weren’t for her. I will never forget the friendly smile and laughter that greeted me as a first-year student when I stumbled into her office for the first time.” Anitra embodies every aspect of the Unsung Hero Award. She is an invaluable resource to the graduate student community at Cornell, and she offers tremendous support that enables students to progress and prosper in their respective fields. Kara Peet Kara Peet , graduate field assistant in English, is recognized for her extraordinary efforts supporting graduate and professional degree students in the field of English. Kara’s nominator states that Kara constantly works behind the scenes to foster community, increase diversity, and positively impact the lives of students. While Kara’s official title is graduate field assistant, she goes far above and beyond fulfilling the duties of this role. Kara’s nominator shares that Kara’s extraordinary acts of support include coordinating a fundraiser for a student who was assaulted in their home country; working closely with students that faced obstacles to degree completion, such as a visa denial; and locating funds for a student in need of an emergency medical procedure. Kara also helped found a grant for students from backgrounds historically underrepresented in higher education, and promotes within the field of English teachings from the Graduate School Office of Inclusion and Student Engagement workshops on holistic admissions practices. Kara’s nominators state that “Kara has tremendous empathy and never says no to a request for help; Kara has transformed the lives of so many of our students.” Stephanie Westmiller Stephanie Westmiller , graduate field assistant in entomology, is recognized for going above and beyond in her role by promoting good mental health and a strong sense of community, as well as by recruiting students from diverse backgrounds. Among her many accomplishments include her highly praised work on the Insectapalooza Planning Committee, the Student Wellness Committee, and Diversity Preview Weekend. Stephanie learned from meetings with graduate students after their first semester that there was need for a stronger sense of community, and this drove her to organize biweekly coffee hours for the department. This proved successful in bringing faculty and students together in an informal setting and providing a “much needed break” from academic stress. Her nominators make it clear that Stephanie has worked tirelessly to foster a sense of community in the field by learning about mental health issues through numerous workshops, cultivating a safe space in her office, and coordinating with Cornell Health and the Graduate School to facilitate a mental health workshop for the whole field. Her kind and approachable demeanor and her commitment to cultivating community and supporting student well-being are all integral to helping entomology students as they navigate academia. Stephanie’s impacts extend beyond the department as well. As one nominator states, “Stephanie is the driving force and main organizer of Insectapalooza, a free one-day insect fair to teach the public about insects in a fun and accessible way… The immensity of her work on Insectapalooza alone qualifies her for this award. This event reaches thousands of people, including children and future scientists, many of whom are from historically underrepresented backgrounds.” Faculty Champion Awards for Junior & Senior Faculty Junior Faculty The recipients of the 2020 Junior Faculty Champion Awards are Professors Ifeoma Ajunwa and Sabrina Karim. Ifeoma Ajunwa Ifeoma Ajunwa , associate professor of labor relations, law, and history, is recognized for her significant contributions in cultivating diversity and equity. Through her leadership, mentorship, allyship, research, and teaching, Professor Ajunwa’s engagement with the Cornell community has directly and widely shaped the success of international students and students from backgrounds historically underrepresented in the academy. Her nominator states, “As a Keeton House Fellow on West Campus, Professor Ajunwa has worked tirelessly to initiate and drive impactful programming that creates a safe space for interaction and understanding between students of diverse cultures and backgrounds, helping them realize and appreciate the benefits of ‘difference’, and ultimately improving their network of relationships.” Professor Ajunwa makes personal connections with her students, guiding them to make tough decisions, and advocating for their success as students and post-graduates. Students have attested that their experiences at Cornell have been greatly improved by Professor Ajunwa’s selfless dedication of “time, resources, network, and great counsel.” Professor Ajunwa’s teaching instruction helps prepare students to navigate the difficult realities of social inequalities, and she inspires students to develop interest and commitment to this research. Her research on diversity in the labor market and workplace has directly helped students as they advance their careers to navigate employment issues as they relate to diversity. She also personally helps her mentees consider a spectrum of career options. Professor Ajunwa’s unwavering commitment to building equity extends beyond her students, as she advocates for diversity at all levels, including for staff and faculty. As her nominator states, “Through the Cornell Prison Education Program, Professor Ajunwa applies her scholarship towards helping shape the trajectory of persons in corrections—many of whom are from minority communities”. Professor Ajunwa builds campus networks, connects students with resources that help their academic success and well-being, and inspires those around her to continue pushing boundaries toward inclusion, diversity, and equity. Sabrina Karim Sabrina Karim , assistant professor of government, is recognized for her dedication to advising, mentoring, role modeling, and advocating for graduate and undergraduate students from historically underrepresented backgrounds—specifically students of color and first-generation students. As a junior faculty member, Professor Karim has made significant contributions to conflict, peacekeeping, domestic security, and promoting gender equality within the United Nations—but by her students she is known to be more than an academic. Professor Karim has demonstrated an unwavering commitment to fostering a diverse community and supporting students throughout each step of their academic career. She does this through actions such as sending pre-arrival welcome communications, being a proactive mentor, showing genuine interest in students’ well-being and future career choices, and identifying students’ strengths. Additionally, she provides guidance on opportunities such as prestigious fellowships and utilizes her positionality to advocate for inclusion of students in professional spaces, conferences, and in networks among scholars in the field. One of her students states that Dr. Karim’s “advice and guidance transcended into other areas of my life and now I am a much more confident, determined, and perceptive graduate student – all areas that I was struggling in during my first year.” Another student credits Professor Karim for her dedicated “individualized guidance to ensure that underrepresented students not only survive but thrive.” Senior Faculty The recipients of the 2020 Senior Faculty Champion Award are Professors Monica Geber and Jennifer Thaler. Monica Geber Monica Geber , professor of ecology and evolutionary biology (EEB), director of graduate studies, and chair of the Graduate Admissions Committee, is recognized for her significant contributions for advancing positive change within EEB. She has trained everyone to emphasize the importance of diversity in making admissions decisions and has worked tirelessly to identify ways to increase the diversity of EEB’s graduate trainees. Her efforts focus on retention of incoming students, an often-overlooked aspect of building diversity. To this end, Professor Geber leads a core course for matriculating graduate students every semester, where she helps students understand the rules of the program, teaches them skills to write effective grant proposals, mentors them through the transition to graduate work, and forges new students into a strong cohort. Professor Geber manages to be “on call” for students and helps them meet their challenges with positivity and sensitivity. Her leadership has been critical to fostering cohesiveness in her department through turbulent times that called for leadership, compassion, and swift response. One of her graduate advisees states that Professor Geber was “the first and best person she sought for advice because her deep well of compassion and patience, paired with her keen intellect, made her an incredible mentor.” Other advisees highlight Professor Geber’s ability to give them free reign to pursue their own interests while supporting their progress every step of the way. Professor Geber has also been described as a true advocate of graduate student mental health and as someone who is viewed by her students as an ally and advocate who provides them with safe space. Professor Geber’s support of diversity also includes her active participation in Cornell’s Diversity Preview Weekend, her efforts to engage high school students in science through meaningful outreach in rural communities, and strong advocacy for women in her field. One of her nominators states, “I consider Monica to be the single most important person in EEB’s graduate training efforts.” Jennifer Thaler Jennifer Thaler , professor of entomology and director of graduate studies, is recognized for her unwavering commitment to diversity and inclusion and graduate student mental health and well-being. During her tenure as director of graduate studies (DGS), Professor Thaler has implemented several initiatives aimed at promoting diversity, inclusion, and student wellness. She has been instrumental in advocating for more equitable admissions processes and was directly involved in removing the GRE requirement for the entomology graduate program. Professor Thaler has also opened up new lines of communication to better serve the needs of current students in the program. This has resulted in the implementation of one-on-one meetings with students in her role as DGS, social activities between faculty and students, and a redesign of the field’s professional development course. In addition to promoting policy changes like these, Professor Thaler also takes matters into her own hands through direct and personal support. When she learned that students were facing food insecurity, she set up and personally stocked a small food pantry for the field. Professor Thaler has also made significant strides to promote the mental health and well-being of graduate students. When entomology students started a mental health initiative, Professor Thaler helped them construct a student survey and advocated for change to her fellow faculty members, such as the implementation of new policies and initiatives, including a mental health awareness workshop. Even with these strides, she continues to advocate for expanded access, education, and training around graduate student mental health. Bryan Danforth, chair of the Department of Entomology, states, “I would say that Jennifer’s most significant impact has been through subtle changes in the culture of the graduate program. She has been a warm, supportive, nurturing mentor to our 36 graduate students. She has encouraged many faculty to rethink the student-faculty relationship for the benefit of both partners. Her work has helped students combat imposter syndrome, self-doubt, and feelings of isolation, which disproportionately affect first generation students and other underrepresented minorities. Her gentle, kind approach to graduate mentoring has trickled down to everyone in the field of entomology.” OISE Diversity & Inclusion Change Agent Award The recipient of the 2020 OISE Change Agent Award is the Building Allyship Series. This series was initiated and led by a dedicated team of graduate student members of the Graduate and Professional Student Assembly (GPSA) Diversity & International Student Committee (DISC) and involved the collaborative efforts of the other member organizations of the Graduate and Professional Student Diversity Council, the Office of Inclusion and Student Engagement, and Future Faculty and Academic Careers. This series engaged hundreds of graduate students, faculty, staff, and postdocs in thoughtful discussions around the meaning of allyship. It also provided an avenue for personal narratives to be heard and understood more broadly and for members of our community to expand their potential and capacity to serve as allies. Never has the need for such efforts within our community and the academy more broadly been more salient. The team behind this initiative were co-chair of GPSA DISC Eugene Law and GPSA DISC members Gwendolyn Beacham, Janani Hariharan, Chelsea Stephens, Xander LaCrampe, and Kara Guse. Because of their leadership, the Cornell community has benefited from an advanced understanding of what it means to be a true and empathetic ally to others. Their dedication to furthering productive community dialogue and making meaningful social change a reality help make Cornell a place where all students have the opportunity to achieve a greater sense of belonging and support. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}