{
  "id": 3,
  "date": "2024-05-18T18:09:00.308053",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/signature-initiatives/building-allyship-series-2/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Signature Initiatives Building Allyship Initiative Building Allyship Initiative The Building Allyship Initiative is a collaboration of the Graduate and Professional Student Diversity Council and the Graduate School Office of Inclusion and Student Engagement (OISE). Through panel discussion and public talks, the Building Allyship Initiative provides an opportunity for members of the Cornell community to gain insights into the depth and breadth of identities and experiences represented within our graduate community and engage in productive dialogue focused on fostering a greater understanding of the many aspects of critical allyship and its practice. Each event seeks to create a safe space for critical dialogue where we can bridge gaps in knowledge, learn from each other, and create understanding without fear of judgment. Read this article, Impact vs. Intent: Becoming Critical Allies Through Workshop Series , to learn more about this initiative. 2023 Building Allyship Keynote Supporting Trans and Nonbinary People During Turbulent Times Speaker: Dr. Leo Taylor, Entomology Ph.D. ’15 ​​​​​​​ Date: October 4, 2023 Access the recording Access a collection of the keynote slides Session Summary The current sociopolitical climate in the U.S. is having devastating impacts on trans and nonbinary people, and those who love them. So far in 2023, 567 bills have been introduced across 49 states, 83 of which have passed, for the purposes of denying trans people access to basic healthcare, education, legal recognition, and the right to simply exist in the public eye. What can aspiring non-trans allies do to uplift and protect trans and nonbinary people under such extraordinary circumstances? How can trans people engage in empowered self-allyship without becoming fatigued, or worse, desensitized to the ongoing trauma? Dr. Leo Taylor, speaker, DEI consultant, transsexual, person with a disability, aspiring ally to all minoritized groups, and entomologist will be returning to his alma mater to discuss strategies for becoming an effective ally to trans and nonbinary people at Cornell and beyond. With compelling boldness and a good dose of humor Leo will describe his experiences as a transman from a small town in Indiana who began his transition nearly a quarter of a century ago, during the early days of the internet. He’ll walk us through some of the highlights and darkest moments he experienced as a transsexual during the late 2000’s and early 2010’s from the perspectives of both an Ithaca resident and Cornell graduate student and describe major changes that have occurred at the University since. Most importantly, aspiring allies will receive tangible strategies they can use to bolster and preserve trans and nonbinary people in their lives, communities, and across the country. About Our Speaker Dr. Leo Taylor Dr. Leo Taylor (Entomology Ph.D. ’15) is a seasoned DEI educator, speaker, and consultant with a focus on transgender and nonbinary identities and LGBTQ+ culture. With over 15 years of experience, he offers customized workshops and consulting services to help organizations and individuals navigate diversity, equity, and inclusion issues. Leo’s background includes a B.S. in psychology and M.S. in biology, both from Ball State University, and a Ph.D. in entomology from Cornell University. His extensive expertise in DEI topics stems from hundreds of workshops, webinars, presentations, and keynote addresses. Leo’s unique perspective as a queer transman, who began his transition in 1999, provides rare insights into the experiences and challenges of a still very misunderstood population. As a DEI consultant who also works at The Ohio State University, Leo approaches his work with grace, humility, transparency, vulnerability, and a big dose of humor. He shares his extraordinary life experiences, having been perceived as a straight woman, lesbian, straight man, and gay man, all before the age of 40! Leo emphasizes the transformative power of trans visibility and the vital role non-trans allies play in advancing inclusion and equity. About the Building Allyship Initiative Initiated by the GPSA Diversity and International Students Committee, the Building Allyship Initiative is a collaboration of the Graduate and Professional Student Diversity Council and the Graduate School Office of Inclusion and Student Engagement (OISE). This initiative provides an opportunity for members of the Cornell community to gain insights into the depth and breadth of identities and experiences represented within our graduate community and engage in productive dialogue focused on fostering a greater understanding of the many aspects of critical allyship and its practice. Building Allyship events seek to create a safe space for critical dialogue where we can bridge gaps in knowledge, learn from each other, and create understanding without fear of judgment. Congratulations to the Building Allyship Series Committee and the Graduate & Professional Student Diversity Council for being recognized with an honorable mention for the 2021 Perkins Prize for Interracial and Intercultural Peace and Harmony ! View accessible video transcript . Accommodations We strive to make our events accessible to all community members. Individuals who would like to request accessibility accommodations should contact grad_assoc_dean@cornell.edu . We ask that requests be made at least one week in advance to help ensure they can be met. 2022 Building Allyship Session Understanding Critical Allyship: Translating Research into Practice This session aims to bridge the gap between research and practice to develop a clearer understanding of what critical allyship is and, importantly, what it is not. Centering the voices of marginalized communities, we will develop a deeper understanding of how people can be effective allies and explore the difference between critical and performative allyship, as well as when allyship becomes saviorism. Resource List View a recording of the session and copy of the presentation Practical Steps for Addressing Inequities & Supporting Belonging Resources for Supporting Graduate Student Diversity, Inclusion, and Well-being Right to Be – The 5Ds of Bystander Intervention Social Identity Wheel ( adapted from the Program on Intergroup Relations and the Spectrum Center, University of Michigan ) Video – How Microaggressions Are Like Mosquito Bites Sponsorship: This Building Allyship session was collaboratively hosted by the Graduate and Professional Student Diversity Council , Graduate School Office of Inclusion and Student Engagement and the Black Graduate and Professional Student Association . BGPSA is a network that addresses the needs and concerns of graduate and professional students of African descent at Cornell University. BGPSA involves itself in social, academic, and cultural activities deemed relevant as determined by the voting body. BGPSA works closely with faculty and staff from backgrounds historically underrepresented in academia and is involved in issues that affect Ithaca’s Black community. BGPSA will do all things necessary and appropriate to accomplish these purposes. Speakers: Chadé Darby , Ph.D. Student, Organizational Behavior, Cornell University Claire Sandman Malcomb , Ph.D. Student, Organizational Behavior, Cornell university About the Speakers Chadé Darby is a second year doctoral student in Organizational Behavior at Cornell’s ILR School. Chadé’s research interests lie in understanding the emotions and feelings of marginalized employees to better inform diversity, equity, and inclusion practices. Claire’s research focuses on allyship and how organizations can create more inclusive workplaces. In her work, she is interested in understanding whose voices are typically considered in policy decisions about allyship and inclusivity in organizations. Claire aims to center the voices of people with marginalized identities to better understand what effective allyship looks like at work. 2021-22 Building Allyship Sessions October 2021: Understanding and Combating Insidious Forms of Anti-Asian Racism This session included an invited talk and moderated panel discussion focused on developing an understanding of anti-Asian racism and the many insidious forms in which it can manifest. It also centered on sharing strategies on how those seeking to serve as allies can actively help combat anti-Asian racism including overt and covert forms of violence. This session was hosted in collaboration with the Society for Asian American Graduate Affairs (SAAGA), a graduate student organization dedicated to advocating for graduate students who identify as members and/or are allies of the Asian and/or Asian American community. SAAGA works to create a network of support to better address academic, career, and social justice issues related to the Asian and Asian American graduate student population. SAAGA strives to create a safe space for its members to socialize with others, share academic and professional advice, and discuss issues of race, ethnicity, politics, and culture as they pertain to Asians/Asian Americans. Activities include invited lectures, discussions, film screenings, collaborations with other similar groups on campus, networking events, and more. Resources View a recording and access “Key Takeaways” from this session. Featured Speaker and Moderator: Juhwan Seo, Ph.D. candidate, sociology About the Speaker Juhwan Seo is a Ph.D. candidate in sociology and a graduate resident fellow in Hans Bethe House at Cornell University, where he is affiliated with the Asian American studies, Latinx studies, and feminist, gender, and sexuality studies programs. He studies how U.S. immigration policy shapes family formation of queer immigrants and how ethnic businesses employ low-wage immigrant workers. Previously, Juhwan organized with the New York Immigration Coalition and co-founded the Harvard Ethnic Studies Coalition. His research has been funded by the National Science Foundation, National Institute of Justice, and the Social Science Research Council. At Cornell, Juhwan plays with 14Strings!, a Filipino guitar ensemble (rondalla) and mentors undergraduate students on pursuing graduate studies with Graduate Students Mentoring Undergraduates. He previously worked for the Mario Einaudi Center for International Studies. Before coming to Cornell, Juhwan worked for an immigration advocacy nonprofit, where he conducted education policy research and organized immigrant communities. At Harvard, he led the movement for ethnic studies, managed a chamber orchestra, and taught health education at high schools. Panelists: Clement Chow , Cornell Alumnus, Professor of Genetics, University of Utah Elvisha Dhamala , Ph.D. Alumnus, Postdoc, Yale University Jason C. Marvin , Ph.D. Candidate, Biomedical Engineering Kavya Krishnan , Ph.D. Candidate, Soil & Crop Sciences Vinh P. Pham , Ph.D. Candidate, Comparative Literature November 2021: The Marginalization and Racialization of International Scholar Identities within the U.S. Context This session included an invited talk and moderated panel discussion focused on developing an understanding of how international scholar identities can be racialized and marginalized within the U.S. context and how this can impact their experiences within the academy. The panelists shared what contributes to or hinders their sense of belonging and the strategies aspiring allies can employ to support international scholars who may be experiencing xenophobia alongside new aspects of marginalization. This discussion also explored what individual and collective actions we can take to validate the experiences of international scholars and create more inclusive learning, research, and social environments. This session was hosted in collaboration with Graduate and Professional Students International (GSPI), an organization dedicated to building a community for international graduate and professional students through social events, networking opportunities, an online information hub, and mentoring. GSPI seeks to demystify many of the unwritten rules and norms of graduate school and to be a source of support to international scholars as they transition into and progress through their graduate studies at Cornell. The organization is especially concerned about helping to support international scholars who may be studying in the United States for the first time. Resources View a recording of this session World Education News + Reviews: International Students and Experiences with Race in the United States Open Campus: How to Educate International Students About Race Cornell Office of Global Learning: Teaching International Students – Tips for Instruction Featured Speaker: Gustavo A. Flores-Macías, associate vice provost for international affairs and associate professor of government About the Speaker Gustavo A. Flores-Macías is associate vice provost for international affairs and associate professor of government at Cornell University. He is the author of “After Neoliberalism: The Left and Economic Reforms in Latin America” (Oxford University Press, 2012), which received the Latin American Studies Association Tomassini Book Award in 2015. He is also the editor of “The Political Economy of Taxation in Latin America” (Cambridge University Press, 2019). He holds a Ph.D. in government from Georgetown University and an M.P.P. from Duke University, where he was a Fulbright Scholar. Previously he served as director of public affairs at Mexico’s Federal Consumer Protection Agency and more recently as director of Cornell’s Latin American Studies Program. He is a faculty fellow at the Atkinson Center for a Sustainable Future and a recipient of Princeton University’s Democracy and Development Fellowship. His commentary has been featured in the New York Times, Washington Post, LA Times, The Hill, CNBC, Fox News, among others. Moderator : Natalia Lopez Barbosa , Ph.D. candidate, chemical engineering, and president of Graduate & Professional Students International Panelists: Dr Asher Williams , Presidential Postdoctoral Fellow, Smith School of Chemical and Biomolecular Engineering Janani Hariharan , Ph.D. Candidate, Soil and Crop Sciences, and Founder and Past President of Graduate and Professional Students International Motasem Kalaji , Ph.D. Candidate, Communication Nancy Ruiz Uribe , Ph.D. Candidate, Biomedical Engineering Seema Singh , Ph.D. Candidate, City and Regional Planning March 2022: Dismantling the Exclusivity of Academia Through Critical Allyship within our Neurodiverse Community This event educated attendees about what neurodiversity is and the way that negative beliefs about neurodiversity impact our community. We explored the myths around neurodiversity within the context of academia and research environments. Additionally, we discussed ways to help mitigate the stigmatization of those in our communities whom we disable by misunderstanding neurodivergence. Panelists discussed barriers that neurodivergent people face, and accommodations or structural changes that dissolve these barriers. They also discussed how aspiring allies can best and continuously support all members of our neurodiverse community regardless of bodymind. Recognition of neurodiversity brings value to Cornell University, and through critical allyship, we can all help our community thrive by embracing neurodiversity in all of its forms. This Building Allyship Series session is collaboratively hosted by the Graduate and Professional Student Diversity Council , Graduate School Office of Inclusion and Student Engagement and Disability+, the Graduate and Professional Students with Disabilities Association. Resources View a recording of this session Leigh Abbott, University of Glasgow Postgraduate Researcher (PGR) Blog , Neurodiversity & Neurodivergent: What do they mean and how do they impact me as a PGR? Dr. M. Remi Yergeau, Future Professors Institute Keynote, Un/Accommodating Structures – On Disability and Higher Education Dr. Chloe Farahar, London School of Economics Opinion Piece, How can we enable neurodivergent academics to thrive? Special Books by Special Kids (SBSK) : A 501(c)3 organization that seeks to normalize the diversity of the human condition under the pillars of honesty, respect, mindfulness, positivity, and collaboration. This multi-media movement supports the acceptance and inclusion of all members of the neurodiverse community regardless of diagnosis, age, race, religion, income, sexual orientation, gender, or gender expression. Featured Speaker: Dr. Andrew Dell’Antonio , Professor, Butler School of Music, UT Austin About the Speaker Andrew Dell’Antonio is Distinguished Teaching Professor in the musicology/ethnomusicology division of the Butler School of Music in the College of Fine Arts at the University of Texas at Austin. He is co-editor with William Cheng of the series Music and Social Justice (University of Michigan Press). His collected edition “Beyond Structural Listening? Postmodern Modes of Hearing” and “Monograph Listening as Spiritual Practice in Early Modern Italy” are both published by University of California Press. He blogs at adellantonio.com and The Avid Listener, and is co-author of “The Enjoyment of Music,” both from W. W. Norton. ​He has recently turned his focus to universal design for learning (UDL) and related approaches to anti-racism, anti-ableism, and intersectional equity/inclusion in higher education music. His commitment to UDL comes partly from his personal experience of neurodivergence. Moderator: Katie Haviland , Ph.D. Student, Natural Resources and the Environment Panelists: Dr. Dave Caudel, Associate Director of the First Center for Autism and Innovation, Vanderbilt University Dr. Florencia Ardon , Lecturer & Neurodivergent Student Support Program Manager, Learning Strategies Center, Cornell University Samantha Castillo-Davis ’00, M.H.A. ’17, Whole Person Health, Best Practices Lead/HLP Senior Advisor at Cigna Tim Luttermoser , Ph.D. Candidate, Entomology April 2022: land Acknowledgements as Metaphor: Allyship and Land Back Movements land acknowledgements are frequently given at official Cornell events, but what do they represent? During this session, we will dive into the performative aspects of land acknowledgements and how land-grant universities such as Cornell have a responsibility to move beyond these statements for Indigenous communities. Shifting the focus from acknowledgment to action, speakers will discuss ways students, non-Indigenous communities, and institutions can localize allyship. Such actions range from citing Indigenous thinkers, to supporting local Gayogo̱hó꞉nǫʼ sovereignty and centering Indigenous relationships with the Land. We hope to amplify the voices of Indigenous students at Cornell, the members of the Gayogo̱hó꞉nǫʼ , and the larger Haudenosaunee confederacy, as well as suggest actions to support Indigenous communities. * The capitalization of land vs Land is intentional in both the title and description. This is following Dr. Sandra Styres and Dr. Dawn Zinga’s syntactical practice in their writing “The community-first Land- centred theoretical framework: bringing a ‘good mind’ to Indigenous education research?” as well as Dr. Max Liboiron’s “Pollution is Colonialism.” The capitalization of Land acknowledges “the unique entity that is the combined living spirit of plants, animals, air, water, humans, histories, and events recognized by many Indigenous communities.” Whereas when land is not capitalized, we refer “to the concept from a colonial worldview whereby landscapes are common, universal, and everywhere” ( Liboiron 2021). This Building Allyship Series session is collaboratively hosted by the Graduate and Professional Student Diversity Council , Graduate School Office of Inclusion and Student Engagement , and the Indigenous Graduate Student Association . Resources View a recording of this session Cornell American Indian and Indigenous Studies Program Cornell University and Indigenous Dispossession Project High Country News, Land-grab universities: Expropriated Indigenous land is the foundation of the land-grant university system . The Conversation, Difficult Dialogues National Resource Center (DDNRC) February 2022 Webinar and Resource List: Beyond Land Acknowledgements Difficult Dialogues National Resource Center (DDNRC) September 2021 Webinar: Two-Eyed Seeing and other lessons learned within a co-learning journey of bringing together indigenous and mainstream knowledges and ways of knowing ‘Polishing the Kaswentha’: a Haudenosaunee view of environmental cooperation UNDRIP (United Nations Declaration on the Rights of Indigenous Peoples): Human, Civil, and Indigenous Rights MISSING AND MURDERED INDIGENOUS WOMEN AND GIRLS 231 Calls for Justice Thanksgiving Address: Sachem Sam George (Gayogo̱hó꞉nǫ Ɂ , Bear Clan) Featured Speaker: Dr. Jolene Rickard, (Tuscarora, Turtle Clan) Associate Professor, Departments of History of Art and Art, Cornell University About the Speaker Dr. Jolene Rickard is a visual historian, artist and curator interested in the intersection of Indigenous knowledge and contemporary art, materiality, and ecocriticism with an emphasis on Hodinöhsö:ni aesthetics. Recent exhibitions include the Minneapolis Institute of Arts national exhibition, Hearts of Our People: Native Women Artists, 2019-2021, Crystal Bridges Museum of Art, Art For a New Understanding: Native Voices, 1950’s to Now, 2018-2020. She co-curated two of the four inaugural exhibitions of the Smithsonian’s National Museum of the American Indian (2004-2014). Jolene is on the editorial board of American Art, a 2020 Fulbright Research Scholar, an Associate Professor in the departments of History of Art and Art, and the former Director of the American Indian and Indigenous Studies Program 2008-2020 (AIISP) at Cornell University, Ithaca, NY. Jolene is from the Tuscarora Nation (Turtle Clan), Hodinöhsö:ni Confederacy. Moderator: J enine Hillaire (Coastal Salish, Lummi Nation), Ph.D. student, Fiber Science and Apparel Design, President of the Indigenous Graduate Student Association, Cornell University Discussants: Abraham Francis (Mohawk Akwesasne, Deer Clan), CALS ’14, M.S. ’19, Program Manager for the Mohawk Council of Akwesasne -Environment Program Dr. Meredith Alberta Palmer, (Tuscarora, Six Nations) Presidential Postdoctoral Fellow, Science and Technology Studies Department and American Indian and Indigenous Studies Program, Cornell University Closing Thanksgiving Address: Sachem Sam George (Gayogo̱hó꞉nǫ’, Bear Clan) 2020-21 Building Allyship Sessions October 2020: The Dangers of Performative Allyship – Understanding Intent versus Impact This session focused on developing an understanding of performative allyship and its dangerous impacts. The featured speaker and panelists provided insights on their experiences with performative allyship and share strategies for demonstrating critical allyship . Featured Speaker and Moderator: Chelsea Stephens , Ph.D. student, biomedical engineering Panelist: Tiffany Agard , M.P.A. student, Cornell Institute for Public Affairs Panelist: Elvisha Dhamala , Ph.D. candidate, neuroscience Panelist: Jesse Goldberg , Ph.D. ‘18, African American literature, visiting research fellow, Auburn University Panelist: Kelly Zamudio , Ph.D., Goldwin Smith Professor of Ecology and Evolutionary Biology; faculty curator of herpetology, Cornell University Museum of Vertebrates View a recording of the October 2020 session . November 2020: Combating Anti-Blackness: A Virtual “Fireside Chat” with Cornell Bouchet Scholars November 12, 2020 | 12:00 to 1:30 p.m. ET This session focused on developing an understanding of anti-Blackness and the many forms in which it can manifest. It also centered on sharing strategies on how those seeking to serve as allies can actively help combat anti-Blackness. Moderator: Brianna Tate, Ph.D. student, animal science; president of the Black Graduate & Professional Student Association Discussant: Danielle Fuentes Morgan , Ph.D. ‘16, Cornell Bouchet Scholar, assistant professor of English, Santa Clara University Discussant: Monet Roberts , M.S. ’17, Ph.D. ’19, biomedical engineering, Cornell Bouchet Scholar, postdoctoral associate, Virginia Tech University View a recording of the November 2020 session . February 2021: Coming Out for Allyship with the LGBTQ+ Community February 24, 2021 | 12:00 to 1:30 p.m. ET This session provided us with an opportunity to understand the experiences of LGBTQ+ community members as they navigate academic spaces that often do not validate their identities. Through this session featuring student and faculty panelists, we explored what it means to be an ally to members of our LGBTQ+ community, how to validate their experiences and critical contributions to the academy, and what allies can do to help create more inclusive learning, research, and social environments. Moderator: Samantha Bosco , Ph.D. candidate, horticulture Panelist: Marguerite Pacheco , Ph.D. student, biomedical engineering Panelist: Leland Graber , Ph.D. student, entomology Panelist: Ana Witkowski , Ph.D. student, biomedical engineering Panelist: Luna Castelli ’19, program assistant for the Noise Project at the Lab of Ornithology Panelist: Masha Raskolnikov , associate professor of Literatures in English Ally Resources View a recording of the February 2021 session . March 2021: Existing and Acting at the Crossroads: Understanding Intersectionality to be Better Allies March 17, 2021 | 12:00 to 1:30 p.m. ET This session focused on developing an understanding of intersectionality within and beyond the Latina/o/x community and included a talk by Sofia Villenas , associate professor of anthropology, followed by a facilitated panel discussion. Latina/o/x identity is often discussed as a cohesive group with similar interests and considerations; However, the Latina/o/x community is a vibrant and diverse group of people from different countries, ethnicities, languages, races, religions, classes, genders, sexual orientations, abilities, citizen status, among other traits. The development of an intersectional lens enables critical allyship and advances social justice by broadening a historically unidimensional framework. Speaker: Sofia Villenas , associate professor of anthropology Moderator: Marguerite Pacheco , Ph.D. student, biomedical engineering Panelist: Angie Torres-Beltran , Ph.D. student, government Panelist: Renny John , M.P.H. ’20, academic program coordinator, Johns Hopkins School of Public Health Panelist: Luis Melecio-Zambrano , Ph.D. candidate, chemistry View a recording of the March 2021 session . 2019-20 Building Allyship Sessions October 2019: Understanding the Fundamentals of Allyship Friday, October 11, 2019 | 12 –1:00 p.m. For this session, we were joined by Luca Maurer, a nationally recognized author and speaker on topics of inclusion and allyship and the founding director of the Center for LGBT Education, Outreach, and Services at Ithaca College, to learn about and discuss the fundamentals of allyship. This session provided us with an opportunity to understand what it means to be an ally and how to use your position as an ally to support and empower each other. View a recording of this session. November 2019: The Hidden Curriculum and International Students Tuesday, November 12, 2019 | 12:00-1:00 p.m. This session provided us with an opportunity to understand the experiences of international scholars coming to a U.S. institution of higher education and what it means to serve as an ally to them as they are confronted with a new institutional landscape and cultural environment. The organizers of this event included graduate students from Graduate and Professional Students International (GPSI), a student organization that is focused on creating community and mentorship opportunities for the graduate and professional student international community. February 2020: Helping First-Generation Scholars Uncover the Hidden Curriculum February 5, 2020 | 12:00-1:00 p.m. This session featured a moderated panel discussion on how allies can help first-generation college students in graduate school uncover the “hidden curriculum” involved with navigating Cornell. This session provided us with an opportunity to understand the experiences of first-generation scholars navigating graduate education and what it means to serve as an ally as they are confronted with new institutional landscapes and sociocultural environments. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}