{
  "id": 3,
  "date": "2024-05-18T18:08:33.726012",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/faculty-resources/practical-steps/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Faculty Resources Practical Steps for Addressing Inequities & Supporting Belonging Practical Steps for Addressing Inequities & Supporting Belonging The following are practical steps Directors of Graduate Studies, Department Chairs, and other faculty and administrative leadership can take to address inequities and support sense of belonging within graduate fields and academic departments. This is not a comprehensive list, but the actions provided are ones that can help to guide progress as faculty and others seek to support meaningful and positive change. Recognize Trauma and Make Students Feel Validated Silence can be deafening; don’t avoid discussing racism, sexism, heterosexism, abelism, xenophobia, and other ‘isms and phobias, especially when central to incidents that are painful for many students. Go beyond communicating support, identify actions the field or department will take to advance diversity, equity, access, justice, and inclusion. Create space and opportunities for supportive dialogue. Practice phrases such as “I don’t know what you’re going through, but I’ll always be willing to listen and support you in any way I can.” Approach discussions with humility and humanity; actively listen and seek opportunities to demonstrate empathy and compassion. Avoid any situation in which a student might be asked to place their trauma on display for the learning benefit of others. Schedule a My Voice, My Story: Understanding the Untold Lived Experiences of Graduate and Professional Students session for focused audiences of faculty and staff, or graduate students and postdocs. My Voice, My Story sessions pair video monologues – constructed from experiences of Cornell graduate students – with facilitated discussions. The primary objectives of My Voice, My Story are to utilize the power of narrative to achieve greater understanding of the lived experiences of graduate and professional students, share stories that frequently go untold, and develop strategies on how to create more inclusive and supportive research and learning environments. Example Resources: Protecting Student Mental Health in the Face of Antisemitism and Islamophobia Communicating with Students about Racial Violence Out for Allyship Resources Bystander Intervention Training to stop anti-Asian/American and xenophobic harassment Race and Racism Across Borders How to Help Students Cope With Safety Threats Religious Bullying: How to Get Help and Cope How to Cope With Safety Threats in Your Community or the World How to Cope With Traumatic Events Resources for Leading Through Trauma and Crisis Acknowledge & Interrupt Words and Acts of Aggression Learn to recognize, acknowledge, and address when an act of aggression occurs (Though such actions are often termed micro-aggressions, recognize that they are experienced as acts of aggression by those to whom they are directed.) Tools for Recognizing Microaggressions and the Messages They Send Disarming Racial Microaggressions: Microintervention Strategies for Targets, White Allies, and Bystanders A Guide for Responding to Microaggressions How to Respond to Microaggressions Phrases for Responding to Microaggressions and Bias Right to Be Bystander Intervention Training International Students and Experiences with Race in the United States Difficult Dialogues National Resource Center – Talking Across Difference Have a plan in place of how you will respond if faculty, staff, postdocs, students, or invited speakers use language or demonstrate behaviors that are racist, sexist, homophobic, ableist, or otherwise discriminatory or oppressive. This goes beyond reporting and includes how you will address aggressors, support individuals, and respond to your community. Become comfortable with having discussions about intent versus impact – due to the influence of racism, sexism, and oppressive systems and structures, well-intended words or actions can result in negative impacts. Provide avenues through which anonymous feedback can be provided. For example through a Qualtrics survey that does not include identifying information. Cornell community members can access a number of guides from the Intergroup Dialogue Project to help prepare them to engage in and/or facilitate challenging conversations. Utilize the R.A.V.E.N. Method for Responding to Microaggressions R edirect: (intervene) (correct) (pull aside) A sk probing questions for clarity I think I heard you say… what did you mean by that? I want to make sure I understand what you were saying, were you saying that…? V alues clarification You know, in this department we work hard to create a space that is safe and welcoming for all students What you just said is not in alignment or consistent with our institutional values that prioritize equity and inclusion E mphasize your own thoughts and feelings When I hear your comment, I think/feel… Many people might take that to mean… In my experience… N ext steps for addressing microaggressions Reflect and decide the next time you encounter this situation, what you might consider doing Drs. J. Luke Wood and Frank Harriss, CORA Learning: Responding Racial Bias and Microaggressions in Online Environments Webinar Diversity Recruitment & Equity-Based Holistic Review Consult with the Graduate School Assistant Dean for Access and Recruitment in the development of your strategic diversity outreach and recruitment plans, and engage in Consider Cornell: Explore. Experience. Belong. programming. Engage in intentional recruitment activities with diversity-focused societies, associations, and graduate pathways programs (for example, McNair Scholars, Mellon Mays Undergraduate Fellows, CSTEP, LSAMP, etc.). When faculty and graduate students are invited to speak at other schools, ask if they may also have the opportunity to meet with undergraduate and/or graduate students who engaged in graduate school prep and/or future faculty programs. Focus on making this not just a recruitment activity, but a “Power Mentoring” opportunity where students have the opportunity to engage in candid discussions with faculty on professional and personal development topics of interest. Contact the Graduate School Assistant Dean for Access and Recruitment for training and recruitment materials for such sessions. Regularly evaluate your admission practices to ensure you are taking deliberate actions to mitigate bias, support equity, and fairly assess applicants within the context of their personal, professional, and academic circumstances (for example, evaluating them within the context of their current/previous institutions and what was available to them). For example, see Practical Guidance on Making and Keeping Graduate Admissions Equitable and Inclusive and Equitable Practices for Writing, Reading and Soliciting Letters of Recommendation for insights on how contextualization and equity-mindedness go hand in hand. See the Equity-Based Holistic Review Workshop & Resources for Graduate Admissions section of our Faculty Resources page. See also the AAAS & EducationCounsel Diversity and the Law Resources . Develop and utilize well-defined and mission-driven rubrics to evaluate applications. Regularly examine your application requirements – ensure you are clearly asking for what is most important to informing your selection process; and eliminate requirements for information not critical to informing selection. Utilize student prospect and degree conferral data by institution, and demographic groups to help inform the focus of diversity recruitment efforts. Cornell Graduate School Pipeline Report: Bachelor Degree Production by University, Program, Race, and Gender (Data from the National Center for Education Statistics) See also the Equity in Graduate Education Resources developed and provided by researchers with the Equity in Graduate Education Resource Center . Create a Sense of Belonging Use written and spoken language to communicate zero tolerance for racism, bias, harassment, and discrimination within all learning, research, and community environments. For example, see sample statements provided by the Center for Teaching Innovation. See also, Ten Steps for Building an Anti-Racist Lab , by Professors V. Bala Chaudhary, DePaul University, and Asmeret Asefaw Berhe, UC Merced. Provide access to resources providing strategies that address needs and concerns that might be more specific to more at-risk members of your community. For example, Safe Fieldwork Strategies for At-Risk Individuals , a fieldwork guide developed by Cornell Graduate Students, Amelia-Juliette Demery and Monique Pipkin, and Safer Science: Strategies to protect at-risk researchers when conducting fieldwork , a recorded webinar with inter-disciplinary experts in fieldwork and diversity and inclusion. See also the College of Agriculture and Life Sciences’ Inclusive Fieldwork page for additional information on the issues that can arise in the field, such as harassment, bullying, and discrimination, and strategies to adopt to ensure safe, accessible, and inclusive fieldwork experiences for all students. Use written and spoken language to signal the intentional inclusion of students who identify as Black, Latina/o/x, Indigenous, and/or with other identities historically excluded and underrepresented in academia. For example, explicating stating and striving to adhere to your field or department’s community values. See the Community Values Statement for Cornell’s Department of Astronomy as one example. Make an effort to establish connections with students who identify as Black, Latine, Indigenous and/or with other backgrounds historically excluded and underrepresented in academia such as first-generation college students (defined as neither parent having completed a bachelor’s degree). You can begin to do this by being welcoming, expressing interest in them as whole individuals, and recognizing their professional contributions to the field. Meaningful representation, not tokenism, matters. Consider how you are signaling aspects or inclusion (or exclusion) by who you invite as speakers, whose work is included in your syllabi, whose voices are missing and why, and whose work or accomplishments are recognized by awards or publications, etc. Discuss and Address Issues of Inequity & Justice in the Discipline Regardless of your discipline, find ways to address issues of racism, inequities, access, and justice within your local field or department at Cornell as well as in your discipline as a whole. (For example, see this talk on the problem with race-based medicine.) Examine your curriculum to identify whose voices and which communities have historically been excluded and why. Utilize the Intergroup Dialogue Project Curriculum Review Guide , which provides frameworks, questions, and tools to help academic units lead and engage in meaningful and productive conversations about inclusive curriculum review. Utilize the Center for Teaching Innovation consultation support for Curriculum Mapping , which offers a means of charting what happens at any given point throughout an academic program to confirm priorities and identify points of redundancy (such as duplicated instructional efforts), as well as address any potential gaps. This consultative service guides academic programs through the curriculum mapping process, with a specific focus on diversity, equity, and inclusion outcomes. Ask students for their input on whose voices are missing and whose work they would like to see included in your curriculum. As an act of justice, commit to including in your curriculum, seminars, etc. the voices of scholars who identify with historically excluded and underrepresented backgrounds. And don’t only do so in association with activities deemed as related only to diversity and inclusion. Ask speakers from historically underrepresented backgrounds if they would like to meet with any specific groups while on campus – including faculty leaders as well as graduate students from historically underrepresented backgrounds. Examine any problematic attitudes and behaviors of scholars and/or alumni who are upheld by your field or for whom awards, honors, etc. are named. For example, see Science’s “Amid protests against racism, scientists move to strip offensive names from journals, prizes, and more” and Nature’s “How Nature contributed to science’s discriminatory legacy: We want to acknowledge — and learn from — our history” . Examine whether established practices for qualifying (Q) and candidacy (A) exams are equitable and inclusive and whether expectations are transparently documented and communicated. Examine whether aspects of established practices associated with these exams threaten mental health, disproportionately lead to the attrition of students from historically underrepresented backgrounds in the field, and/or fail to substantively contribute to students’ development. For additional context and recommendations see Equity, well-being and learning all compel a re-examination of qualifying exams and the transition to Ph.D. candidacy Inclusive and Culturally Aware Advising & Mentoring Practices Identify and recognize your own culturally shaped beliefs, perceptions, and judgments. Develop both intrapersonal and interpersonal cultural awareness, and skills to recognize and respond to cultural diversity-related issues that may arise in your advising and mentoring relationships. Become aware of your own implicit biases and how to mitigate them. Regardless of a student’s background, do not make assumptions or generalizations about students based on any aspect of their social identities or lived experiences. Avoid making assumptions about the lived experiences and social identities of students by listening and learning from students about what they choose to share with you about their individual lived experiences and needs. Express interest in students as whole individuals, listening to what they choose to share about their experiences and asking about their specific interests, concerns, and goals. Use these insights to make informed suggestions on which opportunities and resources might best meet their academic and professional development interests and needs. As you learn more about your advisees and mentees as whole individuals, be cognizant of the cultural differences and similarities between yourself and them. For international students, keep in mind that their identities can frequently be racialized and marginalized in a U.S. context, which can be an unsettling experience. See this Open Campus blog post, How to Educate International Students About Race for contextual insights on speaking with international students about race within a U.S. context. Learn how to have meaningful conversations about identity and difference with graduate student advisees and mentees. For example, use the LARA method (Listen, Affirm, Respond, Add Information). LARA guides are available from the Cornell Intergroup Dialogue Project and Stanford SPARQtools . Become more familiar with the potential impact of social identity in challenging conversations, and learn how to engage productively across difference and conflicting perspectives. Help advisees and mentees identify resources within and beyond their graduate programs to support their development of a sense of belonging and community at Cornell within and beyond their graduate field. This is especially critical for students with identities that have historically been excluded from and underrepresented within the academy. Demystify the unwritten rules, language, expectations, and sociocultural norms of graduate education (especially within the context of your specific graduate field and discipline) through your field handbook, website, lab manuals, professional development seminars, and other means. Example lab manuals: Civic Laboratory for Environmental Action Research Paula Hammond Lab at MIT Mike Boots at UC Berkeley Lesley Chow Lab at Lehigh Example faculty/student mutual expectations/mentoring agreements documents: Faculty Advancing Inclusive Mentoring (FAIM) Mutual Expectations Agreement Plan University of Wisconsin Institute for Clinical and Translational Research – Mentoring Compact Examples University of Michigan Rackham Graduate School – Sample Mentoring Agreement Make formal and informal professionalization and socialization activities more accessible to all advisees and mentees. Example Resources: Faculty Advancing Inclusive Mentoring (FAIM) website. Cornell community members can access recordings of talks on Culturally Attuned Mentoring Paradigms by Dr. Sweeney Windchief, Montana State University, Equity-Minded Mentorship – Why and How Identity Matters by Dr. Kimberly Griffin, University of Maryland, and on the book Equity in Science: Representation, Culture, and the Dynamics of Change in Graduate Education by Dr. Julie Posselt, University of Southern California. Cornell community members can access a free copy of the e-book version of “Equity in Science” through the Cornell Library and a book discussion guide through the Equity in Graduate Education Resource Center website. Ongoing Learning Opportunities Create avenues for ongoing formal and informal learning opportunities for graduate students, postdocs, faculty, and staff around issues of diversity, equity, access, justice, and inclusion. Consider what levers you can use to influence faculty to engage in such opportunities. For example, embed such learning opportunities in activities in which all or most faculty participate such as faculty meetings, faculty retreats, department seminars. Incentivize and encourage faculty to engage in learning opportunities supportive of their ongoing development as mentors. The Graduate School provides workshops, individual faculty consultations, and hosts invited speakers and facilitated panel discussions that focus on advancing inclusive mentoring practices and cultures within graduate education and academia. For more information on inclusive mentoring resources visit the FAIM Resource Center website or contact Associate Deans Sara Xayarath Hernández at grad_assoc_dean@cornell.edu and Colleen McLinn at cmm252@cornell.edu . National Center for Faculty Development and Diversity: Re-Thinking Mentoring – How to build communities of inclusion, support, and accountability CIMER (Center for the Improvement of Mentored Experiences in Research): Entering Mentoring Curricula The University of Minnesota’s Optimizing the Practice of Mentoring asynchronous online self-paced research mentor training. SABER Striving Towards Inclusive Academic Biology Virtual Seminar Series (relevant content for those across the disciplines) National Academics – The Science of Effective Mentoring in STEM National Research Mentoring Network (NRMN) Resources for Faculty Mentors Duke University – Graduate School Mentor Toolkit Embed learning opportunities for graduate students into field structures such as orientation, first-year seminars, TA training, mentor training, etc. Signal to graduate students that their engagement in activities such as Consider Cornell , diversity and inclusion-focused graduate student organizations , and other related activities are important to the field. (Appreciate that engagement in such activities are often vital to the well-being and sense of belonging for students that identify with backgrounds historically excluded and underrepresented in academia.) Utilize the Any Person, Many Stories: Histories of Exclusion and Inclusion at Cornell project as a resource. This project features stories in sketch, biography, podcast, interview, and video formats that can be used as learning resources for courses, workshops, and other meaningful purposes. The stories featured delve into powerful, sometimes painful histories, many of which are not broadly known. These stories also help to bring recognition to many of those who fought for a more inclusive Cornell and how their efforts are ever more critical to informing our ongoing and future DEI efforts at Cornell and beyond. Institutionalize Structures & Action Plans Develop a committee, council, or work-group focused on advancing diversity, equity, access, justice, and inclusion in your field and/or most closely aligned department(s). Create a webpage or website where information about this group is publicly accessible. Set up the group so they have actual power and influence on policies, structures, and other activities of value and importance to the field or department. Develop a clear structure and term of commitment for service. Seek to mitigate power differentials between group members (esp. between faculty and students) and help ensure there is equity in whose ideas are heard & acted upon. Do not expect students from historically underrepresented backgrounds to lead or participate in the group. However, provide the opportunity for them to do so if they choose and ensure there are mechanisms for them and other members of your community to provide feedback. (For example, through focus group discussions and/or community dialogues.) Develop a public website where you communicate your community values as well as short and long-term action plans to advance diversity, access, equity, and inclusion. Use tools such as the following to help inform the assessment of your field (or department) on various aspects of diversity and inclusion: Graduate School Intranet – for access to field-level data from sources such as the Doctoral Experience Survey. AAS Diversity Taskforce Report (Appendix X for Departmental Self-Assessment Rubric) . UC Berkeley – Academic Unit Strategic Planning for Equity, Inclusion, and Diversity toolkit . Publicly document areas of progress as well as opportunities for improvement. (Transparency is an asset for many reasons, including in the recruitment of prospective students, postdocs, faculty, and staff.) Publicly acknowledge and highlight the contributions of graduate students and other members of your community toward the advancement of diversity, equity, access, justice, and inclusion. (Not just current contributions, but past contributions. Student advocacy and leadership have been essential to many areas of historical progress.) Make sure that work in this arena is not just the responsibility of this group, but rather ensure that aspects of this work are considered critical to other field or department committees (curriculum, academic policies, facilities/space, search committees, admissions committees, etc.). Consider creating opportunities for students to participate in faculty search committees. Recognize the additional emotional labor associated with this work and provide students with acknowledgment and support for example, via professional development or travel funds. Examine the recommendations being shared by various community stakeholders via formal and informal means and consider how any could inform short and long-term strategic action plans. Consider also how recommendations might inform how current actions need to be communicated more broadly and clearly. Use Inclusive Teaching Practices Be Reflective Create a Safe & Inclusive Learning Community Critically Examine Course Content Utilize Various Teaching Methods Be Prepared to Deal with Moments of Conflict Assess Classroom Climate For more detailed guidance on inclusive teaching practices, visit the Center for Teaching Innovation (CTI) Getting Started with Inclusive Teaching Strategies and Inclusive Teaching pages. Cornell community members can also register for the CTI Teaching & Learning in the Diverse Classroom Online Course and educators outside of Cornell can register for the CTI Teaching & Learning in the Diverse Classroom MOOC . Additional Resources For tips on teaching international and multilingual scholars, visit Global Learning’s tips page and the English Language Support Office Support for Faculty page . For guidance on supporting and teaching students with disabilities, visit the Students with Disabilities Faculty and Staff Resources page. 5 Principles as Pathways to Inclusive Teaching Columbia University Center for Teaching and Learning Guide for Inclusive Teaching and Anti-Racist Pedagogy in Action: First Steps 10 Habits to Humanize Online Classrooms : Antiracist pedagogy recognizes students as deeply complex individuals and disrupts the marginalization of those of color and others left behind, writes Amaarah DeCuir. Additional Sources & Resources Cornell Faculty Advancing Inclusive Mentoring (FAIM) Resource Center Cornell Graduate School. Faculty Guide for Advising Research Degree Students Cornell Graduate School. Resources for Faculty Supporting Graduate Student Diversity, Inclusion, and Mental Health Cornell Office for Faculty Development and Diversity. Resources to Engage in Conversations About Race and Anti-Racism Cornell Center for Teaching Innovation. Inclusive Teaching Cornell Global Learning. Teaching International Scholars. Tips for Online Instruction . Alfred P. Sloan Foundation Understanding Investments and Outcomes in STEM Higher Education DEI Efforts Council of Graduate Schools: Social Justice and Anti-Racism Resources for Graduate Education Equity in Graduate Education Resource Center The Ivy+ Faculty Advancement Network: Inclusive Leadership Workshops & Resources National Academies – The Science of Effective Mentoring in STEMM National Association of Diversity Offers in Higher Education (NADOHE) Guide: A Framework for Advancing Anti-Racism Strategy on Campus NCFDD Core Curriculum CIRTL AGEP Toolkit: Advancing Inclusion in Doctoral Education & the Professoriate AAAS & EducationCounsel Diversity and the Law Resources PEN America – Campus Free Speech Guide Domingues, E., Dukes, A., & Ivy, A. June 2020, Being Anti-Racist: Being a Better Advisor, Lab Mate, and Friend to Black Colleagues . Google Presentation. Montgomery, B. L. (2021). Lessons from plants. Cambridge, Massachusetts: Harvard University Press. ​ Posselt, J. R. (2020). Equity in science: Representation, culture, and the dynamics of change in graduate education . Stanford University Press. ​ Sathy, V., Hogan, K., & Sims, C. “A List of Practical Ways Non-Black Faculty Members Can Help Dismantle Educational Inequities” , Inside Higher Ed , July 1, 2020. Subbaraman, Nidhi. “How #BlackInTheIvory put a spotlight on racism in academia” , Nature . June 11, 2020. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}