{
  "id": 3,
  "date": "2024-05-18T18:16:25.499762",
  "url": "https://gradschool.cornell.edu/financial-support/stipend-rates/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Financial Support Stipend Rates Stipend Rates 2024-25 Graduate Student Assistantship and Fellowship Stipend Rates Effective August 21, 2024 ( View 2023-24 rates ) Stipend Rates: Fall 2024, Spring 2025, Summer 2025 Appointment and Definition Minimum Standard 9-Month Stipend Summer Stipend ¹ Average Hours/Week for Standard Appointment² Maximum Additional Hours Per Week Permitted TA - An academic appointment in support of the teaching of a course of 15 to 20 hours per week, averaging no more than 15 hours per week for the base stipend as established by the Board of Trustees. The assignment is usually in the student's major field or a closely related one. TAs are awarded full tuition credit and a stipend. $33,930 $11,310 for 13-week term or appropriately prorated 15 5 GA - An academic appointment requiring 15 to 20 hours a week, averaging no more than 15 hours per week for the base stipend as established by the Board of Trustees. Graduate assistants receive full tuition credit and a stipend. $33,930 $11,310 for 13-week term or appropriately prorated 15 5 RA - An academic appointment for research that is not directly thesis-related, 15 to 20 hours per week, averaging no more than 15 hours per week for the base stipend as established by the Board of Trustees. RAs are awarded full tuition credit and a stipend. $33,930 $11,310 for 13-week term or appropriately prorated 15 5 GRA - An academic appointment focused on thesis or other degree-related research of a type that is required from all candidates for the degree. Because a student devotes considerable time to dissertation research, the time spent on research connected with the project is expected to be significant. GRAs are awarded full tuition credit and a stipend. $33,930 $11,310 for 13-week term or appropriately prorated A student’s time spent on research connected with the project is expected to be significant. 8 University Fellowship - An arrangement in which financial support is given to a graduate student to pursue his or her degree without any obligation on the part of the student to engage in teaching and/or research in furtherance of the university's academic mission. Generally, fellowships are merit-based awards.  Continued financial support is contingent upon the student maintaining satisfactory academic progress as defined by the graduate field and Graduate School. $33,930 $7,148, if summer funding is offered with fellowship N/A 8 Cornell Tech - Funded students located at the Cornell Tech campus generally receive a higher stipend linked to cost of living in the NYC area. $42,073 TBA TA/GA/RA - 15 GRA - A student's time spent on research connected with the project is expected to be significant. TA/GA/RA - 5 GRA/Fellowship - 8 [1] Weekly hours spent on summer appointments must comply with University Policy 1.3, and stipend rates must meet the Board of Trustees mandated minimum (nine-month) stipend rate, prorated for the number of weeks of the summer appointment. The length of the summer appointment (number of weeks) is determined by the Principal Investigator, department, unit, college, or other source of funding. [2] The maximum academic-year stipend amount that a graduate student may receive when any portion of the stipend comes from any funds held at Cornell (university accounts, college accounts, department accounts, unit accounts, or Principal Investigator sponsored funds) is $52,026. The increase may be from the same funding source as the basic stipend (an “adjustment”) or from a different source (a “supplement”). The limit applies to support from any combination of fellowships or assistantships when part of the stipend is paid from funds held at Cornell. There is no restriction on summer stipends and fellowships. Prorated Stipends for Non-Standard Appointments Minimum stipend rates for non-standard appointments classified as graduate assistantships (TA, GA, RA, or GRA) must be proportional to the board-approved stipend. Examples are provided in the table below. Partial assistantships must include tuition proportional to the stipend. That is, if a student receives a partial TAship with 50% stipend for the semester, the hours must be limited to 7.5 or less per week and he or she must receive 50% tuition for that semester in addition to the stipend. Awards that do not provide tuition and stipend in amounts proportional to the hours expected of a regular assistant are not assistantships and should not be portrayed as such. Examples – Adjusted Stipend Rates for Non-Standard Appointments 2024-25 Adjusted Stipend Rates for Non-standard Appointments Duration 15 hours/week (Standard) 7.5 hours 20 hours (Maximum) One Semester $16,965.00 $8,482.50 $22,620.00 Half-Semester $8,482.50 $4,241.25 $11,310.00 One Month $3,770.00 $1,885.00 $5,026.67 Summer (three months) $11,310.00 $5,655.00 $15,080.00 Full Year (12 months) $45,240.00 $22,620.00 N/A Assistantships for Professional Degree Students Students who are enrolled in professional degree programs are generally ineligible for assistantships outside of their graduate field of study, unless the director of graduate studies for the student’s program requests an exception based on the student gaining experience directly supporting the student’s ability to teach the subject matter of the profession. Requests for exceptions must be approved in advance by both the dean of the Graduate School and the dean of the college in which the professional degree program is housed. The college that administers the professional degree in which the student is enrolled is responsible for payment of the full tuition. Professional degree students may be appointed as graduate teaching/research specialists (GTRS) (see below). They may not accept an assistantship without: A signed letter from the director of graduate studies for the student’s program requesting an exception based on the student gaining experience directly supporting the student’s ability to teach the subject matter of the profession. A signed letter from the student’s college dean or dean’s designate indicating that the college will apply a tuition credit of at least $14,750 per semester. A signed letter from the Graduate School Dean or Associate Dean of Administration, approving the assistantship appointment. Graduate Teaching/Research Specialists Students in the professional degree programs may be appointed as graduate teaching/research specialists (GTRS). The GTRS is not an assistantship; GTRSs receive a stipend in proportion to the percent time of their appointment as compared to a full-time graduate assistantship but not tuition and health insurance. Hours are limited to no more than 10 per week. Before a program may begin using the GTRS title, approval must be given by the Graduate School. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}