{
  "id": 3,
  "date": "2024-05-18T18:08:23.275644",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/build-your-skills/leadership-opportunities/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Build Your Skills Leadership Opportunities Leadership Opportunities Colman Leadership Program for Ph.D. Students In spring 2012, John and Jane Colman established the Colman Family Endowed Fund for Leadership within Diversity Programs in Engineering (DPE) to establish the Colman Leadership Program for Ph.D. students in engineering and other related STEM fields. In summer 2015, the Graduate School Office of Inclusion & Student Engagement established a partnership with DPE to launch a June offering of the Colman Leadership Program open to Ph.D. and M.F.A. students from across all graduate fields. Every January and June, the Colman Leadership Program seeks to enroll up to 30 students in an intensive four-day program focused on providing participants with skills and knowledge that will support their development as leaders in graduate school and beyond. Although students with the fellowships and affiliations listed below receive priority consideration for enrollment in the program, the Colman Leadership program has the capacity to serve a broader base of students. Therefore, students from all backgrounds ( domestic and international) and disciplines are strongly encouraged to apply. Cornell Colman Fellowship Cornell Sloan Fellowship Cornell GEM Ph.D. Fellowship Dean’s Excellence Fellowship SUNY Diversity Fellowship McNair Graduate Fellowship Mellon Mays Graduate Fellowship Provost Diversity Fellowship Bouchet Honor Society Program Goals The Colman Leadership Program introduces students to a range of practical skills, theory pertaining to leadership, and special topics relevant for application in both academic and professional contexts. With a varied format including readings, interactive group activities, case studies, discussions, student presentations, and professionally conducted workshop sessions, program participants will learn about leadership, develop practical skills for negotiation and conflict resolution, and discuss modes of translating collaborative teamwork and the positive, productive employment of the diverse perspectives and backgrounds students bring to the program. Specifically, program participants focus on the following: Self-awareness as a leadership skill Extending self-awareness to effective interpersonal dynamics Appreciating fundamental group dynamics Understanding how to create teams from groups Appreciating diversity in all contexts Differentiating between role authority and leadership in an organizational context Learning skills of integration and synthesis Program Schedule The online application for the January program opens in November while the online application for the June program opens in later April. Both offerings are open to all Ph.D. students from across all disciplines. For more information or questions about the Colman Leadership Program, contact: Sara Xayarath Hernández, Associate Dean for Inclusion & Student & Faculty Engagement, Cornell Graduate School: sh267@cornell.edu , (607) 255-5417 Jami P. Joyner, Director of Diversity Programs in Engineering: jj334@cornell.edu , (607) 255-6403 Postdoc Leadership Program Leadership involves working effectively with other people to shape social reality and achieve organizational goals. It is a critical factor in organizational and career success. Every postdoc, no matter what field of endeavor, will face a variety of difficult leadership challenges. How these challenges are met will have a significant impact on the postdoc’s career and life. Cosponsored by the Office of Postdoctoral Studies and the VP of Human Resources and Safety Services, this 10-module program is designed to introduce postdocs to some key concepts and skills of leadership in today’s complex environment. It provides a practical forum to assess and develop personal leadership skills in self-knowledge, planning and problem solving, group dynamics and team building, cultural fluency, conflict resolution, and facilitation of change. Schedule: September through March Program Objectives Explore leadership across cultures Enhance awareness of personal style Examine and practice tools for use in leadership roles Build the postdoc community Provide an opportunity to network with others and learn how to create networks to support change Content Module 1: Understanding Leadership and Personal Style Module 2: Moving from “Group” to “Team” Module 3: Where You Sit in the Organization Makes a Difference in the View—Leaders and Followers Module 4: Notice and Respond—Recognizing and Dealing with Mental Health Issues Module 5: Dealing with Challenges—Resolving Your Own Conflicts Module 6: Dealing with Challenges Module 7: Exploring Cultural Fluency Module 8: Dealing with Challenges—Considering the Nuances of Culture in Conflict Resolution Module 9: Managing Staff Performance Module 10: Understanding Organizations For more information or questions about the Postdoc Leadership Program, contact: Christine Holmes, Director of Postdoctoral Studies: ch18@cornell.edu , 607-255-5823 Leadership Development Courses for Graduate and Professional Degree Students LEAD 5100: Leadership Skills for Graduate Students Course information provided by the Courses of Study 2019-2020 . Formal training and practice of skills required for leading people in an academic or business environment. Skills include coaching, feedback, managing conflict, fostering teamwork, creating vision, and developing diversity. A significant portion is devoted to understanding one’s own strengths and weaknesses and how to recognize and use strengths in others. When Offered : Spring (10 weeks) Permission Note: Enrollment limited to Ph.D. students, or graduate and professional degree students enrolled in leadership or management programs. ILRHR 7451: Leadership Assessment for Managers Course information provided by the Courses of Study 2018-2019 . The purpose of the three and a half day course is to assess the leadership and management skills of students by providing an opportunity to gather feedback on their strengths and developmental needs. The first two days focus on self-awareness and employ several experiential exercises and self-assessment instruments, including Leadership 360 Assessment, the Myers-Briggs Type Indicator (MBTI), Thomas-Kilmann Conflict Mode Instrument (TKI), and the Fundamental Interpersonal Relations Orientation-Behavior (FIRO-B). Class members will be trained in giving and receiving feedback from team members. Activities in the last days of the course will include various leadership and team challenges. Professional feedback providers will observe students in group work on leadership cases and exercises and provide feedback on their observations and the results of individual instruments. The final day of the course students will focus on goal setting for future leadership development. When Offered: Fall, spring. Permission Note: Enrollment limited to 36 graduate and professional degree students Comments: ILR students must take for a letter grade, all others S/U only. NBA 5150: Leadership Theory and Practice Course information provided by the Courses of Study 2017-2018 . This course will focus on the challenges of effective leadership in a complex world. The course has four significant parts: 1. Exploring historical and contemporary theories and models of leadership through the required text and selected articles; 2. Examining and applying the Johnson School’s Leadership Model; 3. Analyzing the practical challenges of leadership through case studies and executive speakers; 4. Developing self-awareness of the student’s leadership strengths and weaknesses through the use of behavioral instruments and group exercises and creating a personal action plan for improvement. A critical element of this course will be the coaching and feedback students will receive on their own leadership styles and behaviors from their peers and instructor. When Offered: Fall, spring. Permission Note: Enrollment limited to: non-Johnson School students only – UG seniors and non-Johnson graduate and professional degree students. No audits permitted. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}