{
  "id": 3,
  "date": "2024-05-18T18:16:45.352256",
  "url": "https://gradschool.cornell.edu/resources/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Graduate School Resources Resources There are numerous resources on campus designed to support graduate and professional students. Below is a list of common offices and services that many of our students refer to at some point during their graduate career. Academic Resources Center for Teaching Innovation (CTI) : CTI strives to strengthen teaching across campus in a multitude of ways, from disseminating research-based best-teaching practices to ensuring that graduate student instructors have the support and resources needed to help their students learn better. Cornell Data Services (CDS): Cornell faculty, staff, and students can ask questions and work with CDS consultants on creating and implementing data management and sharing plans, applying best practices for managing research data, sharing and publishing data, and finding data-related services at any stage of the research process. David M. Einhorn Center for Community Engagement : Dedicated to advancing community-engaged learning and public service across the university, this center opens new pathways for Cornellians to embrace the university’s land-grant mission to improve lives in New York state, across the nation, and around the world. English Language Support Office (ELSO) : This office’s mission is to offer comprehensive writing and speaking support for Cornell’s multilingual graduate and professional students, including courses, tutoring, workshops, and a conversation program. Graduate Fellowships : Information about eligibility and applications for fellowships for new and continuing graduate students. Graduate Writing Service (GWS) : Cornell postgraduates (graduate students, professional students, postdocs, and faculty) can work with GWS tutors to develop and refine strategies for drafting and revising writing projects and professional materials. Libraries : Cornell is home to more than 20 libraries, many of which specialize in specific fields. Office of Research Integrity and Assurance (ORIA) : ORIA coordinates compliance measures on campus and acts as a resource for the university community’s concerns regarding compliance requirements. Student Essentials : Cornell’s academic portal. Student Center : Cornell’s registration and enrollment portal. Thesis and Dissertation Services and Guidelines : Information about what steps you need to take to complete your degree and what support is available to you along the way. Accessibility Resources Student Disability Services (SDS) : SDS is the designated office at Cornell that obtains and files disability-related documents, certifies eligibility for services, determines reasonable accommodations, and develops plans for student accommodation provisions. Map of All Gender Inclusive Restrooms on Campus : In keeping with the university’s policy of nondiscrimination and the commitment to inclusion, the university encourages students, staff, faculty, and visitors to use the restroom or facility that corresponds to their gender identity. Career Resources Pathways to Success : The Graduate School’s holistic professional development framework, with programming organized into the following thematic focus areas: Navigate Academia , Build Your Skills, Create Your Plan, and Prepare for Your Career . Career Guide : These webpages provide a step-by-step guide with detailed information about how to prepare for your future career. Careers Beyond Academia : Careers Beyond Academia gives Ph.D. students and postdocs the chance to test-drive specific aspects of various careers through flexible, experiential, empowering opportunities. Cornell Career Services for Graduate Students : Career services for graduate and professional students are provided by a network of offices and resources across campus and online. Cornell Career Services, located in Barnes Hall, serves students from across the university. Future Faculty and Academic Careers : Future Faculty and Academic Careers provides both in-person and online professional development and networking opportunities for graduate students and postdocs aspiring to careers in higher education. Diversity and Inclusion Resources Asian & Asian American Center (A3C): Information on programs and resources that focus on the rich diversity of Asian and Asian American student experiences and support an inclusive campus community. Bias Response System : Learn about the steps and procedures for reporting bias activity. Cornell’s Military Community : Cornell’s clearinghouse for information and resources for veterans among our faculty, staff, and students. Gender Equity Resource Center : This center aims to foster a vibrant and supportive campus community to help empower students to bring their full and authentic selves to every part of their lives, on campus and beyond. LGBT Resource Center : Information on programs and resources focused on supporting the lesbian, gay, bisexual, and transgender community at Cornell. LGBTQ+ Resource Guide : Guide offering best practices and tips, such as using gender-inclusive greetings in meetings and classrooms, integrating LGBTQ issues into curricula, or including statements in course syllabi and other gatherings that stimulate discussion and ensure civil discourse. Students of Color : List of affinity graduate student organizations focused on supporting the sense of belonging and community for students of color and for contributing to a more inclusive environment for all students. Student Development Diversity Initiatives : Home to several resource centers, program areas, and student organizations that center on building and maintaining community. University Diversity and Inclusion : Learn more about Cornell University’s commitment to recruiting a heterogeneous faculty, student body, and staff; fostering a climate that doesn’t just accommodate differences, but engages with them; and providing rich opportunities for learning from those differences. Cornell also shares resources on Anti-racism and addressing Antisemitism and Islamophobia. University Support of International Students : Access a portal of information and resources for those with questions and concerns about the current and future implications of U.S. Executive Orders for student, faculty, and staff, activities, and our international programs. University Support of DACA & Undocumented Students : Find general information on matters of admissions, financial aid, campus resources, privacy, legal assistance, and safety available to DACA and undocumented students. Arts and Entertainment Resources Cornell Cinema : Cornell Cinema screens close to 200 films and special film events each year in the historic Willard Straight Theater. Cornell Music : Cornell’s Music Department sponsors more than a hundred concerts and lectures on campus each year, given by faculty members, students, and distinguished visiting artists from around the world. Herbert F. Johnson Museum of Art : The Johnson Museum’s permanent collection includes 30,000 works from around the world. Schwartz Center : Home to Cornell’s Performing and Media Arts (PMA) department, which hosts dozens of professional and student-run events and performances each year in this venue. Graduate School Offices Office of Academics : Under the guidance of the associate dean for academic and student affairs, the Office of Academics sponsors academic support programs, including the Three Minute Thesis competition, Thesis and Dissertation Boot Camps, and more. Careers Beyond Academia : Careers Beyond Academia gives Ph.D. students and postdocs the chance to test-drive specific aspects of various careers through flexible, experiential, empowering opportunities. Future Faculty and Academic Careers : Future Faculty and Academic Careers provides both in-person and online professional development and networking opportunities for graduate students and postdocs aspiring to careers in higher education. Office of Graduate Student Life : The Office of Graduate Student Life provides students with resources for academic support, assistance in navigating the educational program, referrals to campus services, support for personal development, and any other concerns that are impacting a student’s ability to succeed. Office of Inclusion and Student Engagement (OISE) : OISE provides recruitment, diversity fellowships, professional and community development programming, and ongoing support for students from diverse and underrepresented backgrounds. Office of Postdoctoral Studies : The Office of Postdoctoral Studies provides information, programming, and support to Cornell’s 800+ postdoctoral scholars. Health and Wellness Resources Cornell Health Counseling and Psychological Services (CAPS) : Provides crisis intervention, individual and group counseling, psychiatric care, and referral services to Cornell students. Consultation, education, and prevention strategies are offered to individuals who have concerns about a student’s welfare. Cornell United Religious Work (CURW) : Counseling and referrals in general, religious, prenuptial, and crisis matters for individuals and couples are available from trained staff members. CURW also can provide referrals for support groups such as Alcoholics Anonymous and Overeaters Anonymous. Empathy, Assistance, and Referral Service (EARS) : EARS provides training, workshops, and outreach to promote mental health, well-being, and help-seeking among the Cornell campus community. Cornell Health : The primary medical and mental health care provider for all students, Cornell Health is guided by a model of integrated care for the whole person and for the Cornell community. The staff includes over 220 medical, counseling, and related health care professionals, with a wide range of training, expertise, and personal and professional experiences to serve our diverse community. Mental Health at Cornell : Dedicated to providing support and resources to meet the emotional, physical, social, and spiritual needs of the university community. Recreational (Fitness) Services : Cornell Fitness Centers offer exercise opportunities for the Cornell community. CFC has five fitness centers located around campus, offering an extensive variety of cardio and weight equipment, and over 95 group exercise classes each week. CFC memberships are available to students and student spouses/partners. Student Disability Services (SDS) : SDS is the designated office at Cornell that obtains and files disability-related documents, certifies eligibility for services, determines reasonable accommodations, and develops plans for student accommodation provisions. Student Support and Advocacy Services : Student Support and Advocacy Services strives to help students navigate challenging issues in all facets of their lives utilizing non-clinical, trauma-informed, and identity-conscious approaches. Map of All Gender Inclusive Restrooms on Campus : In keeping with the university’s policy of nondiscrimination and the commitment to inclusion, the university encourages students, staff, faculty, and visitors to use the restroom or facility that corresponds to their gender identity. International Student Resources International Services : International Services assists individuals and their families from all over the world, who have come to Cornell to study, teach, or conduct research. International Services provides information and advising on federal immigration, tax, and labor regulations, and counseling on personal, academic, and cultural matters. English Language Support Office (ELSO) : This office’s mission is to offer comprehensive writing and speaking support for Cornell’s multilingual graduate and professional students, including courses, tutoring, workshops, and a conversation program. Additional English Support Programs : International Services maintains a webpage on English language support programs available at Cornell, in Ithaca, and in the area available to Cornell’s students and their families. Safety Resources Cornell University Police : Cornell University Police operates 24 hours a day, every day of the year, from G-2 Barton Hall. Learn more about CU Police on the safety and security reports page . In an emergency, you can contact Cornell Police by: dialing 911 from any campus phone, calling (607) 255-1111, or picking up a Blue Light telephone. For non-emergencies or information, dial (607) 255-1111 or pick up a Blue Light telephone. Emergency Notification System : Cornell’s mass emergency notification system is used to alert you when there is a significant emergency or a dangerous situation involving an immediate threat to the health or safety of the university community. Gorge Safety : Swimming in the gorges is prohibited by Chapter 250 of the City of Ithaca code, Peace and Good Order. Please read the Gorge Trail Map and Safety Information brochure . This brochure provides a path guide and advice for safety precautions while visiting the gorges. Sexual Harassment and Assault Response and Education (SHARE) : The Sexual Harassment and Assault Response and Education website provides ready access to reporting, services, support, education, and advocacy related to all forms of sexual misconduct. Weather Emergency : In the event of an adverse weather condition such as a blizzard or ice storm, you should check the Operating Status webpage for status of university operations. Condition updates such as delayed university openings, road closings, and university closings will be available on this site. Student Life Resources Big Red Barn : An old carriage house turned student center, the Big Red Barn Graduate and Professional Student Center is located in the heart of campus and surrounded by lawns and gardens. A central place for eating and relaxing, the Big Red Barn hosts more than 200 events per year. Communities : Comprehensive list of communities that our graduate students typically join in order to encourage your active participation in the broader university community. Living in Ithaca : Information to help ease your transition to the Ithaca and Cornell community, including transportation options, housing and neighborhood information, on- and off-campus dining options, and general information about the region. Students with Families : Our Students with Families website compiles information about resources, ways to stay informed and get involved, along with valuable contact information. Office of University Ombudsman : The Ombudsman Office offers a safe, confidential place where community members may discuss problems or issues within the university. This office provides students with information regarding university policies and practices, and how to make the university aware of a particular problem. Additional Resources CU Info : CU Info provides a comprehensive page of resources and information about Cornell that includes everything from emergency information to local weather. 211 Tompkins Information Referral : 2-1-1 Tompkins Information and Referral, a program of the Human Services Coalition of Tompkins County, is a free, confidential, 24-hour helpline that maintains a comprehensive database of health and human services available to those who live and work in Tompkins County. Voter Registration & Election Information : To vote in federal, state and municipal elections, you must be a registered voter. Students and other members of the Cornell community who are not from New York State have the option to vote in NYS or in their home state. About Vision and Mission Land Acknowledgement Leadership Dean’s Statements Governance and Structure Organizational Chart General Committee Graduate Program Registration History of Graduate Study at Cornell Publications and Reports Program Metrics Graduate School News and Events Graduate School Alumni Newsletter Graduate School Original Stories Subscribe to Graduate School Newsletters Graduate School News You Belong at Cornell Safety and Security Reports Program Metrics Graduate School Mental Health & Faculty Mentor Development Initiatives Graduate and Professional Community Initiative Union Representation Contacts Staff Directory Events Calendar Resources Policies Forms Alumni Alumni Newsletter Spring 2024 Donor’s New Fund to Support Students, Mentoring Ten Inducted into Bouchet Graduate Honor Society Physics Ph.D. Candidate Wins 2024 Three Minute Thesis Competition Doctoral Candidate Selected as World Food Prize Council of Advisors Youth Representative Doctoral Alumna Selected for SUNY Chancellor Distinguished Ph.D. Graduate Dissertation Award Alumni in the News Alumni Newsletter Fall 2023 Donor-Funded Fellowship Helping Doctoral Candidate Improve Grapevines’ Climate Resilience Leveling Up: Graduate School, GPSA Provide New Air Conditioning, Other Improvements at the Big Red Barn Learning to Lead Inclusively Funding for Fluency: Grants Support Summer Language Study Alumni in the News Alumni Newsletter Spring 2023 ‘Like Having an Older Sibling’: Graduate Students Benefit from Peer Mentoring Donor-funded Scholarship Making a Difference for Ph.D. Students Ten Inducted into Bouchet Graduate Honor Society Doctoral Alumna Selected for SUNY Chancellor Distinguished Ph.D. Graduate Dissertation Award Alumni in the News Alumni Newsletter Fall 2022 Two Cornell Alumni Named Schmidt Science Fellows Travel Grants Help Graduate Students Conduct Research Across the Globe New Graduate School Program Demystifies Graduate Study for Diverse Students Alumni in the News Alumni Newsletter Spring 2022 Graduate School Dean Named Chair of Blue Ribbon Committee for National Academies Asian Literature, Religion, and Culture Ph.D. Candidate Wins Three Minute Thesis Competition Cornell Doctoral Candidate Wins National 3MT Competition First Generation Graduate Students Give Back Any Person…Any Career…Greater Impact Alumni in the News Alumni Newsletter Fall 2021 ‘Lights Along the Path’: Bouchet Alumni Give Back Grants Help Students Present Research Online Student Spotlight: Alex Ogbonna Student Spotlight: Charlotte Logan Student Spotlight: Lyrianne González Student Spotlight: Ngoc Truong Alumni in the News Alumni Newsletter Winter 2021 Nine Questions for Dean Boor Graduate School Associate Dean Wins National Leadership Award Can You Describe Your Research in Three Minutes? Multilingual Students Find Expanded Support Cornell Responds to Changing Student-Parent Needs Students’ Vaccine Videos go Viral Students, Alumni Celebrate Black Graduate Excellence Student Spotlight: Drea Darby Student Spotlight: Jason Chang Student Spotlight: David Dunham Student Spotlight: Tianyao Qu Alumnus Spotlight: Adem Efe Gencer, Ph.D. ’17 Alumna Spotlight: Malika Grayson, M.S. ’14, Ph.D. ’16 Alumni in the News Alumni Newsletter Summer 2020 Zoom Fatigue? Not for This Graduate School Staff. Degrees in Hand, New Alumni Discuss Remote Defenses Expanding Opportunities while Expanding Horizons New Group Supports First-Generation and Low-Income Students Workshops Offer Judgement-free Zone to Learn How to Be an Ally Becoming Better Mentors Through Workshop Series “Future Faculty and Academic Careers,” a New Name for a Long-Running Program Student Spotlight: Piyawat Louilarpprasert Student Spotlight: Michael Dunaway Student Spotlight: Tibra Wheeler Student Spotlight: Aditi Sahasrabuddhe Alumnus Spotlight: Javier Jaimes, Ph.D. Alumna Spotlight: Brooke Zanetell, Ph.D. ‘Speak and Be Heard’: Communication Tips from Eliza VanCort Alumni in the News Alumni Newsletter Fall 2019 New NSF GRFP Fellows Recognized Seven Graduate Students Awarded Wu Scholarships Data Transparency Expressing Gratitude at Orientation 2019 Careers Beyond Academia Expanded for All Ph.D.s Boot Camp Encourages Productivity Student Spotlight: Pichaya (Mint) Damrongpiwat Student Spotlight: Christian Posbergh Student Spotlight: Hirokazu Togo Student Spotlight: Chinasa Okolo Alumni in the News Alumni Newsletter Spring 2019 Plant Breeding Graduate Student Wins 2019 3MT Longtime Big Red Barn Manager Retires Grants Help Graduate Students Do Research Around the World Alumna Addresses Importance of Mentoring Using Stories Toward Greater Inclusion Carriage House to Student Center: The Big Red Barn Over the Years Changing Your Fixed Mindset into a Growth Mindset Alumni Newsletter Fall 2018 Alumni Newsletter Winter 2018 President Martha Pollack Q&A The Gratitude Project The Student Partner Career Fair Table of Contents Resources Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}