{
  "id": 3,
  "date": "2024-05-18T18:10:48.375379",
  "url": "https://gradschool.cornell.edu/academic-progress/thesis-dissertation/writing-your-thesis-dissertation/required-sections-guidelines-and-suggestions/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Academic Progress Thesis & Dissertation Writing from A to B Required Sections, Guidelines, and Suggestions Required Sections, Guidelines, and Suggestions Beyond those noted on the Formatting Requirements page , the Graduate School has no additional formatting requirements. The following suggestions are based on best practices and historic requirements for dissertations and theses but are not requirements for submission of the thesis or dissertation. The Graduate School recommends that each dissertation or thesis conform to the standards of leading academic journals in your field. For both master’s and doctoral students, the same basic rules apply; however, differences exist in some limited areas, particularly in producing the abstract and filing the dissertation or thesis. Information in this guide that pertains specifically to doctoral candidates and dissertations is clearly marked with the term “ dissertation ” or “ doctoral candidates .” Information pertaining specifically to master’s candidates and theses is clearly marked with the term “ thesis ” or “ master’s candidates .” All other information pertains to both. Examples of formatting suggestions for both the dissertation and thesis are available as downloadable templates . Title Page Required? Yes. Suggested numbering: Page included in overall document, but number not typed on page. The following format for your title page is suggested, but not required. The title should be written using all capital letters, centered within the left and right margins, and spaced about 1.5 inches from the top of the page. (For an example, please see the template .) Carefully select words for the title of the dissertation or thesis to represent the subject content as accurately as possible. Words in the title are important access points to researchers who may use keyword searches to identify works in various subject areas. Use word substitutes for formulas, symbols, superscripts, Greek letters, etc. Below the title, at the vertical and horizontal center of the margins, place the following five lines (all centered): Line 1: A Dissertation [or Thesis] Line 2: Presented to the Faculty of the Graduate School Line 3: of Cornell University Line 4: in Partial Fulfillment of the Requirements for the Degree of Line 5: Doctor of Philosophy [or other appropriate degree] Center the following three lines within the margins: Line 1: by Line 2: Primary or Preferred Name [as registered with the University Registrar’s Office and displayed in Student Center] Line 3: month and year of degree conferral [May, August, December; no comma between month and year] Copyright Page Required? Yes. Suggested numbering: Page included in overall document, but number not typed on page The following format for your copyright page is suggested, but not required. A notice of copyright should appear as the sole item on the page centered vertically and horizontally within the margins: © 20__ [Primary or Preferred Name [as registered with the University Registrar’s Office]. Please note that there is not usually a page heading on the copyright page. The copyright symbol is a lowercase “c,” which must be circled. (On Macs, the symbol is typed by pressing the “option” and “g” keys simultaneously. If the font does not have the © symbol, type the “c” and circle it by hand. On PCs, in the insert menu, choose “symbol,” and select the © symbol.) The date, which follows the copyright symbol, is the year of conferral of your degree. Your name follows the date. Abstract Required? Yes. Suggested numbering: Page(s) not counted, not numbered Abstract formats for the doctoral dissertation and master’s thesis differ greatly. The Graduate School recommends that you conform to the standards of leading academic journals in your field. Doctoral candidates: Usually, the heading of the abstract in a dissertation is centered between the left and right margins about 1.1 inches down from the top of the page and includes the following lines: TITLE OF DISSERTATION Student’s Primary or Preferred Name, Ph.D. [as registered with the University Registrar’s Office] Cornell University 20__ [year of conferral] Following the heading lines, begin the text of the abstract on the same page. The abstract states the problem, describes the methods and procedures used, and gives the main results or conclusions of the research. The abstract usually does not exceed 350 words in length (about one-and-one-half correctly spaced pages—but not more than two pages). Master’s candidate: In a thesis, the page heading is simply the word “ABSTRACT” in all capital letters and centered within the margins at the top of the page. (The thesis abstract does not display the thesis title, author’s name, degree, university, or date of degree conferral.) The abstract should state the problem, describe the methods and procedures used, and give the main results or conclusions. The abstract usually does not exceed 600 words in length, which is approximately two-and-one-half to three pages of correctly spaced typing. In M.F.A. theses, an abstract is not required. Biographical Sketch Required? Yes. Suggested numbering: iii (may be more than one page) Type number(s) on page(s). The following content and format are suggested: The biographical sketch is written in third-person voice and contains your educational background. Sometimes additional biographical facts are included. As a page heading, use “BIOGRAPHICAL SKETCH” in all capital letters, centered on the page. Number this page as iii. Dedication Required? Optional. Suggested numbering: iv (may be more than one page) Type number(s) on page(s). The dedication page is not required and can contain whatever text that you would like to include. Text on this page does not need to be in English. Acknowledgements Required? Yes. Suggested numbering: v (may be more than one page) Type number(s) on page(s). The following content and format are suggested, not required. The acknowledgements may be written in first-person voice. If your research has been funded by outside grants, you should check with the principal investigator of the grant regarding proper acknowledgement of the funding source. Most outside funding sources require some statement of acknowledgement of the support; some also require a disclaimer from responsibility for the results. As a page heading, use “ACKNOWLEDGEMENTS” in all capital letters, centered on the page. Table of Contents Required? Yes. Suggested numbering: vi (may be more than one page) Type number(s) on page(s). The following are suggestions. As a page heading, use “TABLE OF CONTENTS” in all capital letters and centered on the page. List the sections/chapters of the body of the dissertation or thesis. Also, list preliminary sections starting with the biographical sketch. (Title page, copyright page, and abstract are not listed.) For theses and dissertations, the conventional format for page numbers is in a column to the right of each section/chapter title. The first page of each chapter/section is stated with a single number. Table of contents usually do not include a range of page numbers, such as 7-22. The table of contents is often single-spaced. Two-Volume Theses or Dissertations Required? Optional. If the dissertation or thesis consists of two volumes, it is recommended, but not required, that you list “Volume II” as a section in the table of contents. List of Figures, Illustrations, and Tables Required? Optional. Suggested numbering: vii (may be more than one page) If included, type number(s) on page(s). As described in the formatting requirements above, figures and tables should be consecutively numbered. The Graduate School recommends that you conform to the styles set by the leading academic journals in your field. The items below are formatting suggestions based on best practices or historic precedents. Table of contents format: As a page heading, use “LIST OF FIGURES,” “LIST OF ILLUSTRATIONS,” or “LIST OF TABLES” in all capital letters, centered on the page. There should be separate pages for “LIST OF FIGURES,” “LIST OF ILLUSTRATIONS,” or “LIST OF TABLES” even if there is only one example of each. The list should contain enough of the titles or descriptions so readers can locate items using the list. (It may not be necessary to include entire figure/illustration/table captions.) The list should contain the page number on which each figure, illustration, or table is found, as in a table of contents. The list of figures/illustrations/tables may be single-spaced. Page format: Figures/illustrations/tables should be placed as close as possible to their first mention in the text. They may be placed on a page with no text above or below, or placed directly into the text. If a figure/illustration/table is placed directly into the text, text may appear above or below the figure/illustration/table; no text may wrap around the figure/illustration/table. If a figure/illustration/table appears on a page without other text, it should be centered vertically within the page margins. Figures/illustrations/tables should not be placed at the end of the chapter or at the end of the dissertation or thesis. Figure/illustration/table numbering should be either continuous throughout the dissertation or thesis, or by chapter (e.g. 1.1, 1.2; 2.1, 2.2, etc.). The word “Figure,” “Illustration,” or “Table” must be spelled out (not abbreviated), and the first letter must be capitalized. A caption for a figure/illustration should be placed at the bottom of the figure/illustration. However, a caption for a table must be placed above the table. If the figure/illustration/table, not including the caption, takes up the entire page, the figure/illustration/table caption should be placed alone on the preceding page and centered vertically and horizontally within the margins. (When the caption is on a separate page, the List of Figures or List of Illustrations or List of Tables can list the page number containing the caption.) If the figure/illustration/table, not including the caption, takes up more than two pages, it should be preceded by a page consisting of the caption only. The first page of the figure/illustration/table must include the figure/illustration/table (no caption), and the second and subsequent pages must also include, at the top of the figure/illustration/table, words that indicate its continuance—for example, “Figure 5 (Continued)”—and on these pages the caption is omitted. If figures/illustrations/tables are too large, they may be reduced slightly so as to render a satisfactory product or they must either be split into several pages or be redone. If a figure/illustration/table is reduced, all lettering must be clear, readable, and large enough to be legible. All lettering, including subscripts, must still be readable when reduced 25% beyond the final version. All page margin requirements must be maintained. Page numbers and headings must not be reduced. While there are no specific rules for the typographic format of figure/illustration/table captions, a consistent format should be used throughout the dissertation or thesis. The caption of a figure/illustration/table should be single-spaced, but then captions for all figures/illustrations/tables must be single-spaced. Horizontal figures/illustrations/tables should be positioned correctly—i.e., the top of the figure/illustration/table will be at the left margin of the vertical page of the dissertation or thesis (remember: pages are bound on the left margin). Figure/illustration/table headings/captions are placed with the same orientation as the figure/illustration/table when they are on the same page as the figure/illustration/table. When they are on a separate page, headings and captions are always placed in vertical orientation, regardless of the orientation of the figure/illustration/table. Page numbers are always placed as if the figure/illustration/table was vertical on the page. Photographs should be treated as illustrations. To be considered archival, photographs must be black-and-white. (If actual color photographs are necessary, they should be accompanied by black-and-white photographs of the same subject.) Color photos obtained digitally do not need to be accompanied by a black-and-white photograph. Make a high-resolution digital version of each photograph and insert it into your electronic document, following the guideline suggestions for positioning and margins. Optional Elements List of Abbreviations As a page heading, use “LIST OF ABBREVIATIONS” in all capital letters, centered on the page. List of Symbols As a page heading, use “LIST OF SYMBOLS” in all capital letters, centered on the page. Preface Required? Optional. Suggested numbering: xi (may be more than one page) Type number(s) on page(s). As a page heading, use “PREFACE” in all capital letters, centered on the page. Body of the Dissertation or Thesis: Text Required? Yes. Suggested numbering: Begin page number at 1 Text (required) Appendix/Appendices (optional) Bibliography, References, or Works Cited (required) Please note that smaller font size may be appropriate for footnotes or other material outside of the main text. The following suggestions are based on best practice or historic precedent, but are not required. Chapter headings may be included that conform to the standard of your academic field. Textual notes that provide supplementary information, opinions, explanations, or suggestions that are not part of the text must appear at the bottom of the page as footnotes. Lengthy footnotes may be continued on the next page. Placement of footnotes at the bottom of the page ensures they will appear as close as possible to the referenced passage. Appendix (or Appendices) Required? Optional. An appendix (-ces) is not required for your thesis or dissertation. If you choose to include one, the following suggestions are based on best practice or historic precedent. As a page heading, use “APPENDIX” in all capital letters, centered on the page. Place in an appendix any material that is peripheral, but relevant, to the main text of the dissertation or thesis. Examples could include survey instruments, additional data, computer printouts, details of a procedure or analysis, a relevant paper that you wrote, etc. The appendix may include text that does not meet the general font and spacing requirements of the other sections of the dissertation or thesis. Bibliography (or References or Works Cited) Required? Yes. A bibliography, references, or works cited is required for your thesis or dissertation. Please conform to the standards of leading academic journals in your field. As a page heading, use “BIBLIOGRAPHY” (or “REFERENCES” or “WORKS CITED”) in all capital letters, centered on the page. The bibliography should always begin on a new page. Bibliographies may be single-spaced within each entry but should include 24 points of space between entries. Glossary Required? Optional. Suggested numbering: Continue page numbering from body If you choose to include a glossary, best practices and historic precedent suggest using a page heading, use “GLOSSARY” in all capital letters, centered on the page. Index Required? Optional. Suggested numbering: Continue page numbering from glossary If you choose to include one, best practices and historic precedent suggest using a page heading, use “INDEX” in all capital letters, centered on the page. Font Samples Sample Macintosh Fonts Palatino 12 Bookman 12 Garamond 14 New Century School Book Helvetica 12 or Helvetica 14 Times New Roman 12 Times 14 (Times 12 is not acceptable) Symbol 12 is acceptable for symbols Sample TeX and LaTeX Fonts CMR 12 font Any font that meets the above specifications Sample PC Fonts Times New Roman 12 Arial 12 Bookman 12 Garamond 14 Helvetica 12 Times 14 (Times 12 is not acceptable) Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}