{
  "id": 3,
  "date": "2024-05-18T18:16:11.609355",
  "url": "https://gradschool.cornell.edu/financial-support/emergency-fund-program/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Financial Support Emergency Fund Program Emergency Fund Program The Graduate School Dean’s Emergency Fund Program assists Cornell graduate students experiencing urgent financial hardship due to unanticipated one-time expenses. This fund is intended to support the continued academic progress and well-being of students experiencing short-term financial hardship who cannot reasonably resolve their immediate financial needs through loans, aid programs, or personal resources. Only urgent needs and expenses incurred by the student directly will be considered. Grants of up to $500 are provided to help students offset necessary emergency expenses that cannot be funded by other means. Funding priority is based on the situation’s urgency, hardship level, and the student’s overall financial situation. Eligibility Requirements Students who can demonstrate need and are facing a current unexpected emergency may apply for this grant. Applicants must: Be enrolled for the semester at the time of the request. Students on a leave of absence are not eligible. Be enrolled in a degree program offered through Cornell’s Graduate School. This includes research degrees (M.A., M.S., or Ph.D.) and professional degrees administered through the Graduate School . If you are in an advanced-degree program that is administered outside of the Graduate School, you must seek emergency funding support through your college or school. Be in good academic standing with no current bursar holds. Guidelines The Graduate School Dean’s Emergency Fund was created to provide eligible students facing short-term, non-recurring emergencies with a one-time grant to alleviate the situation. Emergency funds are not intended to cover standard expenses included in the budgeted cost of attendance for the academic year (namely, tuition, fees, housing, and educational supplies); purchase of new technology or replacement of old technology; expenses incurred by someone other than the student; scholarly and professional conference attendance; fees and expenses related to post-graduation employment; costs associated with moving to or away from Ithaca; or loan repayment or credit card debt. In addition, it is not intended to provide financial support for the emergency expense in its entirety. Examples of Emergency Situations Examples of emergencies to be considered include, but are not limited to: Change in family circumstances Fire/flood in living quarters Homelessness or sudden change in housing situation Illness/death in the family Medical/dental emergencies Overdue utility bills/turn-off notice Theft of computers/books/clothing/other academic essentials Allowable Expenses Allowable expenses include but are not limited to: Travel costs related to unexpected crisis or death in the family Temporary housing for displacement due to fire, flood, or other unforeseen circumstances Replacement of items due to theft or damage Emergency medical or emergency dental expenses not covered by insurance Other unanticipated and urgent needs as appropriate Important Application Information Grants are awarded on a first-come-first-serve basis, and funds are limited. Students are only eligible for one award. The award does not require repayment. Expenses more than six months before the application date may not be covered. Grants may be taxable. The student is responsible for reporting the grant income and paying applicable taxes. Grant funds must be used for the purposes specified. Once your application has been received, decisions are typically made within seven business days. You will be notified of your application’s status at the end of that period and be informed of the next steps. Apply for the Graduate School Dean’s Emergency Fund . Other Resources Depending on your financial needs, some other programs administered outside of the Graduate School that may provide support include: Access Funds : This fund provides enrolled full-time undergraduate, graduate, and professional Cornell students with access to financial support, up to $500, to help mitigate on-campus barriers, access basic necessities, and cover emergency expenses not covered through financial aid or other university resources. CU Emergency Fund : The Office of Financial Aid and Student Employment (FASE) administers the CU Emergency Fund which assists currently enrolled students with urgent, unanticipated expenses. The fund is designed to assist with recent or upcoming emergency expenses that are above and beyond the standard cost of attendance. Costs such as technology, shipping, moving, or storage costs may be considered. Office of Global Learning Financial Emergency Support : Limited funding support may be available to international undergraduate, graduate, and professional students experiencing a health care or family emergency or unexpected expense. Food insecurity is a concern for many graduate students. A person who is food insecure has at times run out of money to buy food or run out of food before they could get more money. Additional support includes: Swipe Out Hunger Program : Cornell is a participant of the Swipe Out Hunger Program, through which students can request support or donate. Cornell Food Pantry : Cornell’s Food Pantry provides free, confidential access to food and personal care items to Cornell undergraduate and graduate students, as well as Cornell staff and faculty. For a complete listing of food resources available in Tompkins County, please consult with the Cornell Cooperative Extension of Tompkins County . Contact Janna Lamey Senior Assistant Dean for Graduate Student Life janna.lamey@cornell.edu 607-255-5184 Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}