{
  "id": 3,
  "date": "2024-05-18T18:07:54.096534",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/prepare-for-your-career/take-action/evaluate-offers/negotiate-a-salary-package/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Prepare for Your Career Take Action Evaluate Offers Negotiate a Salary Package Negotiate a Salary Package Don’t assume that you are expected to negotiate a higher salary. But it is not impolite or unprofessional to negotiate if you have legitimate reasons for requesting reconsideration of one or more terms of an offer. If the salary is fair, negotiate on other issues, such as a signing bonus. If you decide to negotiate on salary, suggest a salary range based on national salary surveys. Be prepared to accept the low end of that range for your first job. Use the following resources: The U.S. Bureau of Labor Statistics’ Occupational Outlook Handbook National Association of Colleges and Employers (NACE) Salary Survey available in the Cornell Career Services library in Barnes Hall Salary calculators, cost of living, and relocation expense estimates available through websites such as salary.com For academic jobs, other negotiable items include: starting date timeline for considering the offer teaching load lab facilities and/or office space early or delayed tenure options moving expenses assistance with spousal employment extra teaching assistant or research assistant support parking expenses What to Say or Do in Negotiations What if an employer asks for your salary requirement or history in a want ad or job posting? Here are some options: Avoid the salary issue altogether. Ignore the request for salary requirement/history. Say your salary requirement is negotiable. State your current salary and say your requirement is negotiable. Say you are earning market value for someone in your field. Or you expect to earn market value for someone with your educational background. Give a range in which the low-end figure is 10% above your current salary. If you don’t give a salary requirement, you may receive a salary-screening phone call: Politely ask what salary range they’re considering for the position: “I know we don’t want to waste each other’s time if we’re far apart on salary. May I ask you, though, what is the range you’re considering at this time for the position?” If they won’t give you a range and won’t schedule the interview unless you give your salary range, respond this way: “Depending on the management philosophy of the company, overtime hours required, training and support available, medical and dental benefits, commuting and travel time, how well it fits with my long-term career goals, and opportunity for advancement, bonuses, commissions, and other profit-sharing type compensation, my salary expectations range from $XX to $YY.” [Give a VERY WIDE range.] “I’m free [X day and time] for an interview. Which time would work for you?” How to handle the early discussion of salary and compensation in a job interview: Employer: “I assume you’ve seen our advertised salary range. Are you willing to accept a salary within that range?” Delaying tactics: “I applied for this position because I am very interested in the job and your company, and I know I can make an immediate impact once on the job, but I’d like to table salary discussions until we are both sure I’m right for the job.” Employer: “What would it take for you to accept a job offer with us?” Non-specific response: “As long as you pay a fair market value, and the responsibilities fit my skill level, we’ll have no problem.” OR “I feel my salary should be based on the responsibilities of the job and the standards of the industry.” Employer: “If you were to receive a job offer from us, would you accept it?” Throw it back to the employer: “While I’m very interested in the job and the company, it really depends on the offer. What would a person with my background, skills, and qualifications typically earn in this position with your company?” When salary is raised in the middle of the interview: thank the employer for the offer, but be non-committal. There are four possible responses based on the offer: The salary range is acceptable: “I really appreciate the confidence you have in making this job offer to me. I want to bring my talents and skills to work for this organization. Those figures you mentioned are within my expected starting range, depending on the entire salary and benefits package.” Only the top of the salary range is acceptable: “Thanks so much for asking me to be a part of your team. I know my unique mix of skills and abilities will be a great benefit to the organization. Based upon my research and/or what I’ve been discussing with other companies that are currently interested in me, I would have to say that only the upper end of that range would be acceptable.” The entire salary range is unacceptable:“Thank you so much for the offer. I want to bring my skills and talents to your organization. Based upon my research, I would anticipate a salary somewhat higher than that range and/or the other companies I am currently speaking with are considering me at a salary somewhat higher than that range. Of course, money is only one element, and I will be evaluating each overall package.” The interviewer doesn’t give a salary range, and asks what kind of salary it would take for you to accept the position: “From my research, $X is around the base level for salary for this type of position. Considering my experience or expertise in (what do you have that the company values or what can you contribute and how will that benefit the company?), I believe I’m worth mid-range, say $Y to $Z.  What can you do in that area?” When salary is raised at the end of the interview (it means the employer is very interested in hiring you), there are two options: “I’m ready to consider your best offer.” “I would encourage you to make the formal offer. What is most important is the opportunity to work for you and your company. I am confident your offer will be competitive.” When the Official Salary Offer Is Made Start with enthusiasm: “Thanks so much for asking me to be a part of your team. I know my unique mix of skills and abilities will be a great benefit to the organization.” Ask by when they need a decision; if you need more time, negotiate this immediately! Ask for the offer in writing if not offered. End with enthusiasm. Let the negotiation begin! Depending on timeline, after the initial offer call if made, call back after the initial written offer has arrived and ask questions that have not yet been answered (if not found via research, discussed in the interview, or part of the offer letter and materials) and that are of interest/concern to you. About the company: How have past market trends affected the company’s growth and progress? What decreases in productivity and employee layoffs has the company experienced within the past three years? What production and employee cutbacks do you anticipate in the future, and how will they affect this position? When did the company last reorganize, and how did that reorganization affect this position? When do you project the next reorganization of this company, and how do you believe it will affect this position? About the salary package and position: Will compensation time or pay be given for weekend responsibilities and overtime? Are performance and salary reviews based on standard raises for all employees or determined by individual performance? How often are performance and salary reviews conducted? How does the company recognize, evaluate, and reward outstanding employees? What standards will the company use to evaluate my contributions, productivity, and effectiveness? What is the salary range for this position? What is the hiring range for this position? Do you ever pay higher than that range? If so, for what reasons? What kind of salary progression would be expected in the first three to five years?  OR What is the average increase being given? After one year? Two years? Three years? What are the promotional opportunities of this position? To what position/level? OR Based on my maximum productivity, how long do you foresee me fulfilling this position, and what are the possible titles and responsibilities I might assume when my position changes? Does the company have an official policy on internal promotions? What potential career paths within the company might someone entering this position pursue? What is the complete compensation package for an employee at my level? If you decide the official offer is unacceptable: “I am still very interested in working with you and for your company, but at this point I am not able to accept the offer for the following reasons . . . If you were able to . . . I would gladly accept the position immediately. Are you in a position to help?” If you decide the offer is acceptable, but you’d like to sweeten the pot: “I would like to accept your offer, and I’m looking forward to working with you and becoming a valuable member of the team.” [Wait for positive response.] “I am committed to working with you, and since you are my future boss, I have [some] minor issues I wanted to make you aware of. I don’t know if you’re able to make changes in these areas, but I’d surely appreciate your looking into the possibility. Would it be possible to . . .?”  (Provide reasoning if possible.) If they say no, you can say: “How close can you come to my offer? Can we talk about it to figure out a way for us both to be happy?” Going back and forth: Begin and end EVERY call with enthusiasm! Take notes and summarize at the end of each encounter. When the Decision Has Been Made Once you are finished negotiating, get the offer in writing and submit your acceptance in writing highlighting the terms of your acceptance based on what was negotiated. If you don’t reach an agreement and turn down the job, send a letter of appreciation. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}