{
  "id": 3,
  "date": "2024-05-18T18:08:48.472411",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/graduate-diversity-inclusion-awards/2022-graduate-diversity-inclusion-awardees/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Graduate Diversity & Inclusion Awards 2022 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees Exemplary Service Award for Early and Advanced Career Student Early Career Student The recipients of the 2022 Early Career Exemplary Service Award are Hetvi Doshi, Breanna Green, Jesus Lopez Baltazar, and Andrea Robinson. Hetvi Doshi Hetvi Doshi, a Ph.D. student in human development, is being recognized for her efforts  in promoting diversity, inclusion, and equity through the psychology department’s DEI committee and her role as a Big Red Barn fellow and as a mentor in the MAC Peer Mentoring Program. As a first-generation international student, she recognizes the need for graduate students to feel a sense of belonging and community at Cornell, irrespective of race, gender, ethnicity, and age. She is the culture fellow at the Big Red Barn and has organized large-scale events celebrating the festivals, cultures, and accomplishments of international students from every country. The events bring joy and family to those who especially haven’t been able to go back home since the beginning of the pandemic or have been isolated during the last two years. As an early career student in her department, she has experienced the imposter syndrome and felt how it affects her work and confidence. By mentoring junior graduate students and undergraduates and helping facilitate those pair bonds, she aims to empower students with the knowledge, experience, and support system required to navigate academia and research. Hetvi has utilized the department-wide DEI committee to raise a voice and represent other students in the department, and she continues to work to increase mental health awareness and reduce the taboo in discussing it with advisors and faculty mentor has been another platform for her to. Breanna Green Breanna E. Green, an early stage Ph.D. student in information science, demonstrates a commitment to the service and support of graduate, professional, and undergraduate students across Cornell University. In her first year as a doctoral student, Breanna joined the Black Graduate and Professional Student Association (BGPSA), which highlighted her passion for community building, particularly regarding diversity, inclusion, outreach, and student engagement. Beyond her first year, she participated as a speaker on the graduate student panel for the Summer Success Symposium and was nominated to serve as the Academic Excellence Chair for BGPSA, where she has helped coordinate numerous community-building events. Breanna proudly holds the role of graduate student advisor to the National Society of Black Engineers while also serving as a peer-mentor in the Multicultural Academic Council mentoring program. Most recently, she and her friend and fellow BGPSA executive board colleague were awarded a $10,000 grant to support community building and improved mental health for marginalized students at Cornell. Last, but not least, Breanna was one of the lead organizers for the Inaugural Black Excellence Research Symposium, the first of its kind to be presented to the Cornell community which highlights and uplifts the research of both Black undergraduate and graduate students across academic disciplines. Ultimately, Breanna hopes to foster ways to connect with other organizations at Cornell that support women and people of color broadly, and especially in the STEM fields and Computing. Jesus Lopez Baltazar Jesus Lopez Baltazar, Ph.D. student in chemical and biomolecular engineering (CBE), has made significant contributions to CBE since the start of his doctoral program. As the president of the Chemical Engineering Graduate Student Association (ChEGSA) since 2020, Jesus has been a formidable student advocate, voicing the concerns of his peers to improve the graduate student experience. He worked diligently with department leadership (DGS, GFA, department chair, and presidents of other organizations) to raise awareness, advocate for changes, and propose and implement solutions to help all, especially those navigating the paths of academia for the first time. His efforts increased departmental transparency, specifically regarding the CBE department exam structure. He spearheaded the creation of “peer student office hours,” an inclusive space for students to discuss constructive and positive ways to overcome identified challenges in the student body. During his tenure as the leader of ChEGSA, Jesus led numerous virtual and in-person events to encourage student engagement, such as a talent show, scavenger hunt, and the revival of the traditional CBE coffee hours, building a stronger graduate and professional community during the COVID-19 pandemic. Beyond CBE, Jesus has participated in the Diversity Programs in Engineering Initiatives, serving as moderator of Cornell Engineering Bound for two consecutive years, which aimed to help students from minoritized background to connect with faculty and current students. His ongoing commitment to making improvements through service stems from a deep belief that all students should have a fair and equitable experience at Cornell. Andrea Robinson Andrea Robinson is a Ph.D. student in nutrition. She is being honored for her dedication for her leadership and advocacy for racial and social justice. Andrea seeks to create nurturing and supportive communities for students who have been historically marginalized in academic spaces. The Dallas, Texas native has served as treasurer for the Black Graduate and Professional Student Association and a commissioner on the Graduate and Professional Student Association Financial Commission since 2020, where she reviews and approves budgets for funding from graduate organizations across campus. Andrea also serves as the high school programs coordinator for CURIE Academy and CATALYST, specialty programs whose mission is to advance diversity in engineering and its related disciplines. With the desire to always bind together scholarship and service, Andrea has sought to create a more healthy and whole learning environment for the entire Cornell community. With funds secured from her recent $10,000 grant from the Alfred P. Sloan foundation, she along with her colleague Breanna Green have launched a health and wellness series entitled, “Curating Community: Health and Wellness Series.” This wellness series aims to equip scholars with tools to improve their overall wellness by carving out space for moments of catharsis, mental-health, and community check-ins, along with care for the environment. Advanced Career Student The recipients of the 2022 Advanced Career Exemplary Service Award are Cheyenne Peltier, Jason Chang, Jess Choi, and Mikaela Spruill. Cheyenne Peltier Cheyenne Peltier, Ph.D. candidate in chemistry and chemical biology, has contributed to diversity, equity, and inclusion efforts in the department and the broader community through the co-founding of Chemists for Outreach and Graduate Inclusion (COrGI) and involvement with Expanding Your Horizons (EYH) and the Center for Teaching Innovation (CTI). Cheyenne co-founded COrGI with a fellow graduate student in 2020 with the aim of providing opportunities within the department for community building, to facilitate conversations around DEI in STEM, and engage in STEM outreach at the K-12 and undergraduate level. As the president of COrGI she works with the committees within COrGI to produce programming with the goal of making chemistry a space that is welcoming to everyone. Since beginning her Ph.D. program, Cheyenne has been involved with EYH, a conference for middle and high school students to engage with STEM activities with female role models working in STEM fields, first as a workshop leader teaching students about polymer science, then during the COVID-19 lockdown leading a workshop on strawberry DNA extraction virtually for students across the country. She then became an event chair for two years before becoming the chair for the 2023 conference chair. As a CTI graduate fellow, she creates and facilitates workshops on teaching practices for members of the Cornell community. When teaching general and organic chemistry, she employs inclusive teaching strategies with the hope of making chemistry more accessible to students of all backgrounds. She shares this philosophy and strategies with the participants of her workshops in the hopes of them making their classrooms more inclusive so that higher education in general can be more welcoming and accessible. Jason (Chang) Marvin Jason (Chang) Marvin , Ph.D. candidate in biomedical engineering and NSF GRFP and Cornell Provost Diversity Fellow, is being recognized for their contributions to diversity, equity, and inclusion and continually uplifting their colleagues and communities. In their role as a Graduate Resident Fellow in the Cornell West Campus Housing System over the past four years and amidst the ongoing COVID-19 pandemic, Jason has tirelessly advocated for the well-being and safety of their colleagues and students in residential life as well as the broader Cornell community. As a Cornell Center for Teaching Innovation Graduate Fellow, Jason helped develop and lead workshops and institutes aimed at promoting inclusive pedagogy, equitable classroom assessment methods, and active learning strategies to support faculty and graduate student instructors transitioning to online learning. Throughout their time at Cornell, Jason has been actively involved in fostering more welcoming spaces for all students, including LGBTQIA-affirming spaces and those where students are emboldened to bring their authentic selves within their home department and on campus at large. Additionally, Jason has been deeply committed to empowering and training the next generation of scientists through service, mentorship, and K-12 outreach. Jason has served on several panels on navigating the graduate school application process, applying to predoctoral fellowship opportunities, mentorship best practices, and seeking out funding mechanisms to increase the accessibility of undergraduate research positions. To support the recruitment and retention of marginalized and minoritized scientists, Jason has participated in the Cornell Graduate Student School Outreach Program, Girl Scout Engineering Day as the Outreach Co-Chair of the Cornell Graduate Biomedical Engineering Society, Upward Bound, Expanding Your Horizons, Cornell CURIE Academy, New Visions Engineering Mentorship Program as the mentorship coordinator, and engagement of prospective graduate students at conferences as a Cornell Graduate Student Ambassador. As an aspiring faculty member, Jason hopes to continue his work and push to redefine the expectations and standards for scholarship in the academy. Jess Choi Jess Choi , a Ph.D. candidate in plant pathology and plant-microbe biology, has been involved in accessibility, diversity, equity, and inclusion initiatives in academia since the beginning of her graduate program at Cornell. From 2018-2020, she served as a co-leader for the Diversity Preview Weekend, an initiative inviting students from underrepresented backgrounds to Cornell and helping them familiarize with the graduate program application process. She was involved in admissions, fundraising, and social media and organized multiple professional development workshops and panels. Jess is a graduate member of the School of Integrative Plant Science (SIPS) D&I Council, where she is taking an active role in the Disability Awareness Committee and the Graduate Student Retention & Recruitment Committee, working on accessing areas that need to be improved for a more safe, accessible, and equitable environment for graduate students with disabilities. With the members of the Graduate Student Retention & Recruitment Committee, she co-organized “SIPS Building Mentorship Network Initiative”’ and “Connecting in SIPS” events on both Ithaca and Geneva campuses that focused on providing opportunities to everyone within and outside of SIPS to broaden and diversify their mentoring network and discuss how we can better support each other as mentors and mentees. Jess has a strong passion for advocating for Geneva-based students on the Cornell AgriTech campus. As a former member of Cornell AgriTech DEI Committee, in 2020, she was involved in conducting a campus climate survey at AgriTech, which provided insight into key areas that need to be improved to create a more safe, inclusive, accessible, and welcoming campus environment. As a Student Advocacy Committee member of the Student Association of the Geneva Experiment Station, she is currently advocating for improving course accessibility for Geneva-based students. Jess recently presented at a monthly meeting hosted by the Minority Genders in STEM group at AgriTech on the impact of hidden curriculum on minority students in higher education and emphasized the need for transparent guidelines on transitioning to higher education. Mikaela Spruill Mikaela Spruill, Ph.D. candidate in psychology, is recognized for her work in her department and the broader graduate school community for constructing spaces of support and inclusion for students that have historically been excluded from academia. Upon joining her department’s newly formed Diversity, Equity, and Inclusion Committee in her first year at Cornell, she created a large-scale mentorship program for undergraduates from minoritized backgrounds who are interested in research careers in psychology. The goal of the program is to provide students with in-depth career advice from graduate students and demystify the hidden curriculum. Since the program’s inception in 2019, almost 200 students have been matched with a mentor and the organization has hosted several large professional development events each year. She has worked with the Psychology Diversity, Equity, and Inclusion Committee all four of her years at Cornell and now works directly alongside the faculty to create long-lasting structural change for the students who will come after her. Additionally, she was elected to serve on the Black Graduate Professional Student Association (BGPSA) executive board for three consecutive years where she organized community service events, spearheaded new initiatives, and helped build a supportive environment for her community to flourish. Further, her role as a BGPSA board member allowed her to serve on the Graduate and Professional Student Diversity Council, where she played an active role in supporting fellow grad student leaders and advocating in solidarity with all of our communities for tangible institutional change. At the core of this work is Mikaela’s deep personal dedication to equity and justice for everyone. Excellence in Leadership Award The recipients of the 2022 Excellence in Leadership Award are Karina Beras, Joshua Garcia, and Andrew Scheldorf. Karina Beras Karina Beras is a Ph.D. student in anthropology with a graduate minor in Latino studies. Her involvement at Cornell extends beyond the graduate student community, to also include  undergraduate students and into the Ithaca community. Karina’s involvement began with the Graduate and Professional Student Assembly when she served as a field member for anthropology (AY 2019-2020) and then as a social sciences voting member during the fall of 2020. During the 2021-2022 academic year, she has had the opportunity to serve on the executive board for the Black Graduate and Professional Student Association and the Latinx Graduate Student Coalition, both resulting from the nominations of her peers. Karina’s commitment to creating a welcoming and inclusive environment is also evident in her role as a Graduate Resident Fellow in Flora Rose House, where she is responsible for organizing events and providing guidance and support to undergraduate student residents. As a Cornell alumna, Karina was invited to join the newly formed Alumni Advisory Board for the David M. Einhorn Center for Community Engagement. Outside of Cornell, Karina is involved with the Ithaca Alumnae Chapter of Delta Sigma Theta Sorority as the chapter vice president. Karina is also active in the academic realm. This year she has served as a Latin American and Caribbean Studies graduate fellow. Most recently, she formed part of a graduate student planning committee for the “Words Walking Without Masters”: Conversations on the Creative-Theoretical symposium, which took place in April 2022. She has also been vocal in expressing her desire for increased diversity and inclusion efforts in her department. Fittingly, one of the main areas of focus in her academic research is that of belonging. Joshua Garcia Josh Garcia is a fifth year Ph.D. candidate in the horticulture studying how soil microbiomes influence crop production. As a scholar of multiple marginalized identities, Josh strives to work in collaboration with others to foster inclusive and equitable communities both on and off campus. On campus, Josh has served as an executive board member of multiple student organizations, including the Latinx Graduate Student Coalition, where he helped facilitate a variety of events and programming meant to foster community and academic success among marginalized students at Cornell. Josh has also served as a lead fellow with the Cornell Center for Teaching Innovation, where he co-organized pedagogical trainings for graduate, postdoctoral, and faculty instructors on campus. Off-campus, Josh has been involved with multiple BIPOC-led organizations dedicated to social justice in the Ithaca area. With Black Hands Universal, Josh co-facilitated a community gardening and climate education summer camp in Ithaca’s West Village, which offered kids an inclusive and engaging environment to learn about urban agriculture and sustainability. Josh has also been involved with No Mas Lagrimas, a local organization dedicated to supporting marginalized families in the Ithaca area through a range of programming. This fall, Josh will return to his alma mater, UC Davis, as a postdoctoral scholar, where he will be collaborating with farmers across California to understand how climate-smart management practices influence soil health and build structural resiliency in almond orchards. Andrew Scheldorf Andrew Scheldorf, Ph.D. candidate in horticulture, has been an active member of the Cornell community since arriving in 2018. Their research focuses on apple breeding and genetics and interspecific hybridization. Since the beginning of their time at Cornell, Andrew has been active in student organizations and diversity and inclusion efforts at Cornell. He has been active in the Graduate and Professional Diversity Council through his work in Qgrads (LGBTQ+ graduate student association) and has served as a board member for Qgrads for the past three years, currently serving as co-president. He is also president of the Cornell Biodiversity Affiliates, a teaching group that focuses on inclusive and accurate teaching pedagogy. He served as his field’s grad student association activity coordinator and president at various times over his four years at Cornell. He helped to form the School of Integrative Plant Science Diversity and Inclusion Council in 2020 and is currently an active member of the council. He also works at the LGBT Resource Center on campus as the graduate community coordinator, where he organizes events and services for the LGBTQ+ graduate community. Andrew has also been active in the Ithaca community volunteering at Pop’d at the Cherry, Ithaca’s consent focused pop-up dance party, organizing community events, and helping lead advocacy efforts, speaking at common council meetings, and rallying support for LGBT efforts in and outside of Ithaca. Social Justice Award The recipients of the 2022 Social Justice Award are Zinah Attai, Sabrina Li, and Caitlin Miller. Zinab Attai Zinab Attai, Ph.D. student in government, is recognized for her support of incoming and newly arrived Afghan refugee students and visiting scholars to Cornell. In preparation for their arrival, Zinab worked with Catherine Cousins at the Einaudi Center to develop a peer mentorship program, recruiting and training undergraduates to serve as peer mentors for the incoming students. She also offered cultural competence training to prepare the Einaudi Center and Ithaca College housing department staff for the arrival of these students. She has made a concerted effort to support the Shia members of the group, who are minorities in Afghanistan and face higher levels of persecution. Zinab worked outwardly to prepare the university on how to support the Afghan refugee students respectfully and meaningfully. From attending their housing orientations at Ithaca college to collecting religious materials, and planning cultural celebrations, Zinab has worked to ensure that the resilient young women were given the materials and support to make them feel welcomed at Cornell. Sabrina  Li Sabrina Li, Ph.D. candidate in materials science and engineering (MSE), believes in the power of individual and collective action to improve conditions for all students.Sabrina is committed to the pursuit of social justice within and beyond Cornell. She was one of the three main graduate students in her department who led the Academic Strike for Black Lives effort that came about as a response to the murder of George Floyd and worked with students in the department over the course of several months to draft a letter to faculty on how the department can take steps towards becoming more inclusive. She wrote thoroughly about two of the five points in the letter: improving transparency for the MSE qualifying exams and improving recruitment efforts for students from historically underrepresented backgrounds. As part of the working group that formed in response to the letter, Sabrina engaged in difficult conversations about the department culture and helped kick off the MSE Justice, Equity, Diversity, and Inclusion (JEDI) Initiative. In addition to building the JEDI website, Sabrina has also collaborated to distill data from Cornell Graduate School surveys, and suggest data-driven actions the department can do to improve the well-being of all graduate students. She acknowledges that MSE JEDI would not be possible with the immense support from Graduate Student Services Assistant Marissa Porter, Professor Julia Dshemuchadse, and Department Chair Lara Estroff. Additionally, teaching is another area Sabrina cares deeply about, serving as a dedicated TA who pours time and effort into making sure students have all the resources and help they need to succeed. She has also volunteered through the Cornell Center for Materials Research Educational Programs Office as well as the Village at the Greater Ithaca Activities Center. In the words of one of her nominators, “she is someone who has put in significant effort, both formal and informal, in helping foster a community of inclusion in the MSE department.” Caitlin Miller Caitlin Miller, Ph.D student in neurobiology and behavior, is recognized for her dedication to social justice efforts both at Cornell and within the local Ithaca community. She led the creation and implementation of several DEIJ initiatives within her department, including a Cornell Diversity Preview Weekend, where students from historically underrepresented groups in the life sciences learn about, discuss the components of, and prepare for the graduate application process. She also advocated for more diverse representation among invited speakers to her department by helping form and serve on a seminar speaker committee. Caitlin applied these insights and discussions into her undergraduate teaching here at Cornell, where she created and taught the Freshman Writing Seminar, “Sex and Gender Politics in Scientific Research” in Fall 2021. In this class, students learned about the historical context of bias in studying gender and sex in science across biological fields of study. During her time at Cornell, she also sought to improve accessibility to STEM for youth within the Ithaca community. Caitlin served as an outreach fellow and committee leader for GRASSHOPR, teaching third grade students in the local area about sensory systems and animal neurobiology, including inviting students to campus for a department laboratory tour. Her passion for STEM education further led her to volunteer at EYH events, host a Kid’s Science Day booth, teach a workshop at the Ithaca Science Center, and participate in a STEM art show at the Tompkins County Public Library. Community Outreach Award The recipients of the 2022 Community Outreach Award are Jumana Badar, Chinasa T. Okolo, and Expanding Your Horizons at Cornell. Jumana Badar Jumana Badar, Ph.D. candidate in the field of biochemistry, cell and molecular biology, is recognized for her commitment to science communication and community outreach. Throughout her time as a graduate student, Jumana has contributed extensively to Cornell’s community by leading and coordinating various science outreach efforts. She has served as a teaching fellow and board member for GRASSHOPR, an organization that pairs local K-12 classrooms with enthusiastic graduate students and postdocs, allowing hundreds of school kids to experience hands-on science for the first time. In the 2021-22 academic year alone, GRASSHOPR was able to reach about 50 classrooms and build long lasting community partnerships with several schools in upstate NY. Besides GRASSHOPR, Jumana is also involved with several other organizations like GEEKS, the Sciencenter, EYH, and STEP-UP where she gets to create her own science based workshops for kids and adults alike. When asked about her commitment for outreach, Jumana says that her two favorite things about science communication are seeing the look of bewilderment on people’s faces and occasionally being stumped by the audience’s questions. Through her outreach work, she hopes to raise awareness and engage the public in important STEM related conversations. Lastly, Jumana hopes and encourages all scientists to make their science more impactful by bringing their research out of the labs and into the community. Chinasa T. Okolo Chinasa T. Okolo, Ph.D. candidate in computer science, is recognized for her dedication to mentorship, global outreach, and improving diversity, access, equity, and inclusion within academia. During her time at Cornell, she has contributed extensively to the university through a wide range of efforts including serving on the executive boards of the Black Graduate and Professional Student Association, Graduate Society of Women Engineers, Technology Entrepreneurship at Cornell, and Black Entrepreneurs in Training. Within the College of Computing and Information Sciences (CIS), Chinasa has served on a host of task forces and committees and leads Graduate Underrepresented Minorities in Computing, helping to foster community between marginalized students in CIS. Chinasa is a dedicated mentor and has spent numerous hours advising undergraduates in research projects, guiding prospective graduate school applicants, and mentoring students participating in the CU EMPower program through the Office of Diversity Programs in Engineering (DPE). Chinasa has served as a panelist for various events on and off campus and was recently invited to speak about her research to high school students at the American Museum of Natural History. Chinasa’s mentoring activities have been further exemplified through her work as a Ryan Scholars Graduate Coordinator in DPE for the past three years where she has supported the academic and professional success of dozens of underrepresented engineering students. Chinasa’s outreach engagements have extended far beyond campus,  and during the 2019-2020 Winter Break, Chinasa was awarded an Engaged Cornell grant to conduct menstrual health and personal hygiene workshops for secondary school girls in Lagos, Nigeria. Afterwards, she traveled to Ghana with CodeAfrique, an organization founded by Cornell CIS alumni to enhance access to computer programming for students across Africa. During this trip, Chinasa helped facilitate a three-day workshop in Kumasi, teaching students introductory computer science and programming concepts. These experiences have served as inspiration to center her career within Africa and aid in developing the tech and entrepreneurship ecosystem across the continent. Expanding Your Horizons at Cornell Expanding Your Horizons (EYH) is a one-day conference designed to stimulate participants’ interest in math and science through hands-on activities, provide female scientist role models, and foster awareness of opportunities in math and science-related careers. Students participate in two or three workshops organized by Cornell students and faculty, tour state-of-the-art lab facilities on Cornell’s Ithaca campus, connect with peers and mentors, and learn that anyone with a curious mind has what it takes to pursue a future in STEM! Cornell’s EYH Conference has been organized and run by (mostly) graduate student volunteers from departments all over Cornell. Since 1987, EYH has continued to reach thousands of young scientists with their annual conference and with the ongoing support of the entire Cornell community, and they look forward to serving students in the upstate NY region for many years to come. Unsung Hero Award The recipients of the 2022 Unsung Hero Award are Casey Moore, Harmony Borchardt-Wier, and Monica Carpenter. Casey, Moore Casey Moore, a graduate field assistant in the department of molecular biology and genetics, with over 20 years of experience in graduate education, is recognized for her efforts to support the graduate student communities in the three fields administered in the department: biochemistry, molecular  and cell biology; biophysics; and genetics, genomics, and development. Casey helps to administer admissions, so is generally the first contact students have with the fields/department. Casey is the first point of contact for the graduate students within these fields. She administers the admissions process, provides matriculating students with information and assistance for making their transition to Cornell and Ithaca, and keeps students apprised of important information and deadlines related to their progression through their programs. Casey is a helpful and positive communicator, developing most of the field templates used for communicating to students at different milestones. Casey is highly respected for her contributions and is known to always go “above and beyond” her formal role as the GFA. Examples of her leadership include service on the mental health task force, being designated as the “lead GFA” for graduate fields associated with CALS. Casey also serves on the Diversity & Inclusion Committee for the molecular biology and genetics department and works tirelessly to improve their climate and culture, to make the department a welcoming and inclusive place for all. In her role she endeavors to help and support students from application to matriculation and graduation. Her door is always open and she is always available to provide guidance, assistance or a shoulder/ear. She serves as a part of the MBG Diversity & Inclusion Committee and strives to make the department a welcoming and inclusive place for all. Harmony Borchardt-Wier Harmony Borchardt-Wier is a lab manager in the department of natural resources and environment. She has always felt very strongly about the positive benefits for the whole community in embracing diversity, equity, and inclusion. She was one of the inaugural members of the DNRE DEI Advisory Council, and has worked in that capacity to help gather survey data from the department and draft a strategic plan to provide guidelines for the department to further the department’s DEI goals. She is recognized by graduate students as a staunch advocate for their rights, well-being, and sense of belonging. Her nominator stated, “Harmony represents the vital bridge between students and staff in our department, and always advocates for the rights of all.” Harmony considers herself an ally to all marginalized people and groups and works to support people whenever she can. Monica Carpenter Monica Carpenter, graduate field assistant in the department of astronomy and space sciences, is recognized for going above and beyond in supporting graduate students in the field of astronomy as well as working to advance diversity, equity, access, and inclusion within the department of astronomy and Cornell community. In her department, Monica has shaped her office into a safe space where graduate students are able to ask questions, express concerns, and are willing to reach out to when in distress to receive honest and helpful advice. Behind the scenes, Monica has worked tirelessly to help adapt astronomy graduate admissions procedures and provide professional development opportunities for graduate students all with a focus on advancing diversity, equity, access, and inclusion. Recently, she spearheaded efforts to communicate with and recruit graduate students from groups that are underrepresented in the field of astronomy at Cornell, resulting in significant increases in the diversity of the admissions pool and overall demographics of the program. Monica’s nominators state that “Monica has never hesitated in putting in the time and effort needed to ensure that the Cornell astronomy graduate program remains strong and that we can attract and support students from diverse backgrounds. She recognizes that members of our community with various identities can often feel like outsiders at an Ivy League university and goes above and beyond to ensure that everyone feels included and safe in the department of astronomy.” Faculty Champion Awards for Junior & Senior Faculty Junior Faculty The recipients of the 2022 Junior Faculty Champion Award is Elizabeth Fox. Elizabeth Fox Elizabeth Fox is an assistant professor of practice with the Cornell master of public health (MPH) Program in the department of public and ecosystem health at the College of Veterinary Medicine. She is a faculty fellow with the Atkinson Center for Sustainable Future and the Center for Health Equity. Her research and teaching interests focus on better understanding the intersection between food systems and people’s lived experiences. In particular, she looks at nutrition decisions, tradeoffs, and value judgments related to what people eat and why. Elizabeth’s work, interests, and commitment to mentorship stem from a recognition that the contexts in which people live, and the resources they have access to, greatly impact their ability to thrive. She is committed to advising, mentoring, and advocating for her students for this reason. In her time as faculty at Cornell, Elizabeth has worked as an advisor for the College and Career Readiness Initiative, a group of undergraduate and graduate students supporting first-generation and low-income high school students applying for college and/or alternative career paths, and has worked with the MPH program’s Anti-Racism, Anti-Discrimination, Diversity, Equity and Inclusion (ARADDEI) Programmatic Committee to develop program-level initiatives to support students, faculty, and staff in the MPH program related to ARADDEI efforts. Prior to joining as faculty at Cornell, Elizabeth completed her Ph.D. in international nutrition from Cornell University and was involved with the Graduate Diversity Council and the leadership of the Latinx Graduate Student Coalition. Senior Faculty The recipients of the 2022 Senior Faculty Champion Award are Eve De Rosa, Ian Hewson, and  Mariana Wolfner. Eve De Rosa Eve De Rosa, dean of faculty and associate professor of psychology, co-directs the Affect & Cognition Laboratory in the department of psychology. She is a first-generation, African-American, female neuroscientist who uses a cross-species approach, in rats and humans, to examine how brains, neurochemistry, and cognitive faculties change across the lifespan. As a part of the Community Neuroscience Initiative, she is part of a team that has developed a program to deliver monthly age-appropriate neuroscience lessons to hundreds of elementary students (K-fourth grade) in the Syracuse City School District, where more than 70% of their students receive free or reduced lunch, in a student population with great racial and ethnic diversity. This Get to Know Your Brain program uses STEAM (science, technology, engineering, arts, and mathematics) to get young people to become experts in themselves (and others) by providing them with a manual on how their brain’s learn, think, and feel at an early age. The Brain Days program takes a field that is perceived as being expert and elite and shares it in a way that a child can understand and appreciate it. Professor De Rosa is recognized by graduate students as someone who values them as whole individuals, strongly advocates for their well-being, and contributes significantly to their sense of belonging and self-efficacy. Ian Hewson Ian Hewson is a professor of microbiology and director of undergraduate studies in marine biology. Since joining the faculty in the College of Agriculture and Life Sciences in 2009 he has dedicated himself to promoting diversity, equity, and inclusion in his department and across campus. He serves as the lead in diversity, equity and inclusion for the department of microbiology and is a member of the Office of Faculty Development and Diversity advisory committee and the Committee for the Support of Teaching and Learning. His drive in diversity, equity and inclusion stems from both lived experience overseas, and as part of the LGBTQI+ community in the United States. His goals are to improve recruitment and retention practices within his unit and college to better reflect the U.S. population, to recognize and reverse systemic biases that bias inclusion in microbiology and marine science, and broaden the reach of scientific outcomes to generate enthusiasm for STEM careers in pre-scientists. In his own lab, he works to affirm and support diverse students through their studies by incorporating inclusive practices, celebrating intersectionality, and recognizing the significant value of diverse perspectives and lived experiences in scientific research. Mariana Wolfner Mariana Federica Wolfner is a distinguished professor of molecular biology and genetics and Stephen H. Weiss Presidential Fellow. Born in Venezuela and raised in New York City, she researches the actions and evolution of reproductive genes with her wonderful Cornell mentees (over 41 graduate students, 30 postdoctoral scholars, and >90 undergraduate students to date). Dr. Wolfner has been dedicated to inclusiveness, equity, justice, and diversity throughout her life and career, a dedication fostered by her Holocaust-survivor/refugee family, her own experience as the first female graduate student and postdoc in those labs, the first woman faculty member in her department, and the sociological theory perspectives that she learned from her sociologist husband. Dr. Wolfner works to lower barriers of all kinds and to foster diversity and inclusion in her laboratory, classroom, department, and discipline. She is a member of her department’s student-led diversity council and her department’s DEI committee, leads workshops on inclusiveness and accessibility at scientific meetings, and is part of working groups that craft policies for inclusiveness in her discipline. In her lab, where she has mentored many students from diverse backgrounds who had no prior access to research, individual mentoring and group activities foster an inclusive culture. Dr. Wolfner is steadfast in her goal to promote and follow the best policies to support all people in doing their best scholarship in collaborative and equitable ways. OISE Diversity & Inclusion Change Agent Award The recipient of the 2022 OISE Change Agent Award is Linda Nicholson. Linda Nicholson Linda Nicholson, professor of biochemistry and biophysics in the department of molecular biology and genetics, is being recognized for her advocacy, passion, and caring approach to advancing diversity, equity and inclusion at all levels of our academic village. Her research focuses on molecular switches that regulate biological processes, with a current focus on a gene regulation circuit that initiates lateral root development in rice. Her lab has provided a training ground for young scientists from diverse groups who are dispelling stereotypes, setting new norms, and inspiring others to believe in themselves and pursue their goals. She serves as her department’s lead for diversity and inclusion, a role that has enabled her to facilitate dialog and inspire the critical work that is necessary to achieve our shared goals. She chairs her department’s DEI Committee, serves by invitation on the Graduate and Professional Student Diversity Council, advises on graduate student admissions and faculty searches, and helps to lead town hall meetings that strive to improve the department climate. She mentored Cornell’s Posse 1 cohort who graduated in 2017, and has remained involved in the Cornell Posse Scholars undergraduate community by serving as Cornell’s Posse liaison. She is also the faculty advisor for the service organization GEEKS (Graduates Employing Empathy, Knowledge, and Service) and the undergraduate organization PPAAC (Pre-Physician Assistant Association at Cornell). She has recently been selected as the next Hays and James M. Clark Director of Undergraduate Biology, an appointment that aligns beautifully with her passion for empowering students. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}