{
  "id": 3,
  "date": "2024-05-18T18:10:12.104236",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/recruitment/prospective-students/writing-your-statement-of-purpose/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Access & Recruitment Prospective Students Writing Your Academic Statement of Purpose Writing Your Academic Statement of Purpose What is it? Each applicant must submit an academic statement of purpose (ASOP). The ASOP is one of your primary opportunities to help the admissions committee understand your academic objectives and determine if you are a good match for the program you are applying to. The goal of this document is to impress upon the admissions committee that you have a solid background and experience in your area of interest and that you have the potential to be successful in graduate study. Why is it important? The ASOP is one of the most important pieces of your graduate school application because it: Gives the reviewers an understanding of your academic background and interests. Allows you to illustrate in your own words what sets you apart from other applicants. Helps them determine if you are a good match for the program to which you are applying. Shows your communication style and ability. Information to Include Introduce yourself and your academic interests Provide simple background information on your area of interest and how it became of particular interest to you. Here you can also share with them how and why you decided to pursue a graduate degree in this field. Describe your academic background, preparation, and training Skills you have learned from academic, lab, or research experiences (e.g., undergraduate coursework, research opportunities, scholarly writings, jobs in the field, presentations, etc.). Whenever possible, give specific examples and illustrate the points you are making, don’t just simply tell them. Research you conducted – project title or focus, research mentor, your specific role, what you learned and the outcome. If there were challenges, don’t be afraid to mention what you learned from them. This shows persistence and resilience in the face of adversity– these are also things they are looking for! Important papers or thesis project you completed, as well as anything scholarly beyond your academic degree requirements. Relevant work or internship experience as related to the field you are applying to. Show them you are making an informed decision Indicate what you would like to study in graduate school in enough detail to convince the faculty that you understand the scope of research in the discipline and are aware of research trends. Show them that you have thoroughly researched the program, its faculty, and research focus areas, and why you are applying to this program specifically. This will help you write a more informed essay that is relatable to the faculty who will be reviewing your application. Describe why you are a good fit for the program and why the program is a good fit for you. If there are specific faculty you are interested in working with, check the program’s ASOP instructions and determine how best to mention this in your essay. Some programs require you to name a professor(s) with whom you would like to work. Are there any aspects of the program that are of particular interest to you (immersion program, opportunities for collaboration with others outside of the institution, research centers associated with the program, etc.)? Include information that is important to you outside of the program – supportive environment for first-year students, access to amazing literary resources, opportunities to participate in professional/career development programming, etc. Professional goals – you may wish to outline what you plan to do after you complete the program as a way of underscoring the importance of your choice to pursue graduate study. Share any extracurricular opportunities you have had that show leadership, ability to work with a diverse group of people, teaching skills, etc. Research degree applicants should identify specific faculty members whose research interests align with your own interests. Important Things to Remember Details Pay attention and follow instructions very carefully – every program is different and some have specific items/topics they want you to address. Unless otherwise noted, this is an academically focused essay, not necessarily a personal essay. You will likely add some personal details here and there, but be sure to keep the focus on your academic background and future potential. Proofread and pay close attention to details – they really matter! Have others from a variety of perspectives read your essay before you submit it – they should be looking at it in terms of content, style, and grammar. Remember, those outside of your field can provide you with valuable perspective and feedback. Keep in mind that you can continue editing your ASOP after you have submitted it to programs with earlier deadlines. Length, Format and Tone Unless otherwise noted one to two pages in a standard font and size is typical. Include your full name and proposed program of study at the top of each page – if faculty are not reading an electronic version of your essay, pages can become separated. Write with confidence and in an active voice – doing this makes your sentences clear and less wordy/complicated. Language should be positive and focused. Since faculty are the ones reviewing your application, it is fine to use discipline-specific terminology, tone, and style in your ASOP. Final Checklist Have you… Described your academic background in enough detail to show your experience and preparedness in the field? Shown that you are a good fit for the program you are applying to? Defined why you want a graduate degree in this field? Demonstrated that you are self-motivated, persistent, competent, and have the skills necessary to be successful in graduate school? Followed the ASOP instructions as defined by the program you are applying to? Polished, proofread, and had others review your ASOP? Why should you consider Cornell? Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}