{
  "id": 3,
  "date": "2024-05-18T18:09:49.874217",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/signature-initiatives/summer-success-symposium/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Signature Initiatives Summer Success Symposium Summer Success Symposium The Summer Success Symposium is a professional and community development event for new and continuing doctoral students from across all graduate fields. Open to all doctoral students committed to advancing diversity, inclusion, access, and equity in academia, this symposium has a particular focus on bringing together recipients of graduate fellowships in support of diversity as well as all other doctoral students from backgrounds historically excluded from and underrepresented in the academy. This includes, but is not limited to students who identify as Black, Indigenous, Hispanic/Latine, and/or Asian American, and/or those that identify as first-generation college (FGC) students, LGBTQQ+ identified students, veterans, students with disabilities, women in STEM, students with DACA status, and others. Master’s degree students interested in pursuing doctoral studies are also welcome to this event. Through this symposium, participants have the opportunity to form connections and establish community. This symposium also provides participants with the opportunity to engage with successful alumni, faculty, and professionals with shared experiences and identities. Summer Success Symposium keynote and workshop content focuses on providing participants with access to knowledge and insights that will help them navigate their successful transition into and progression through their graduate studies. *Save the date: The 2024 Summer Success Symposium will take place on August 20. 2023 Summer Success Symposium August 15, 2023 | 10 a.m.-3:30 p.m. ET | G10 Biotechnology Building 10-10:15 a.m. ET Check-In 10:15-10:30 a.m. ET Welcoming Remarks Speaker: Sara Xayarath Hernández, Associate Dean for Inclusion and Student & Faculty Engagement, Graduate School 10:30 a.m.-12 p.m. ET Opening Plenary Session – Navigating Mentoring Relationships: Challenges, Opportunities, & Considerations Speaker: Steve Desir, Ph.D., Director of Professional Learning & Organizational Development, Consortium for Equity in Graduate Education, and Assistant Professor of Research, Rossier School of Education, University of Southern California Session Summary Student-faculty mentoring relationships can play a pivotal role in shaping the academic and career trajectories of graduate students. Strong mentoring relationships are dynamic, collaborative, student-centered, and developmental, and they require ongoing dialogue between students and their faculty mentors about what works and is not working in the mentoring relationship. In this keynote, through dialogue, vignettes, and activities, we will engage in self-reflection and develop tools and strategies for navigating the student-faculty mentoring relationship. About Dr. Steve Desir Dr. Steve Desir is an assistant research professor in the Pullias Center for Higher Education at the University of Southern California Rossier School of Education. His research interests include racial equity in college admissions, organizational change, and the use of theory-based psychological interventions to facilitate behavioral change. More specifically, Dr. Desir is interested in whether insights from social psychology, sociology, and behavioral economics can be used to improve educational experiences for minoritized groups. Dr. Desir earned his doctoral degree in higher education from USC and a master’s degree in education policy and management from Harvard. Prior to his studies at USC and HGSE, Dr. Desir completed his master’s degree in secondary education from NYU and earned his bachelor’s degree in economics and political science at Penn State. Dr. Desir is a native New Yorker, and in his spare time enjoys running, Muay-Thai kickboxing, and attending concerts. 12-12:30 p.m. ET Boxed Lunch 12:30-2 p.m. ET Alumni Keynote Session – Mentorship: Why it is Important Now and How it Sets the Course for a Successful Future Speaker: Coalton Bennett, Ph.D. ’10, Patent Agent, McCarter & Fish Session Summary The graduate school experience should be a period in your life in which you have the opportunity to explore and develop different ideas, learn about different areas of research that you think might develop into your dissertation, and hopefully learn even more about areas that you are unfamiliar with or that you think you might not be so interested in. During your tenure as a graduate student, you should try to explore different research topics and develop those interests into well-defined projects that ultimately culminate into a dissertation that is uniquely your own and helps advance the corresponding field(s) of research. While graduate school should afford you this opportunity, sometimes it’s not as straightforward and ideal as one might envision it to be. During this session, Dr. Bennett will share thoughts on how best to navigate the process of identifying what it is that you want to work on and why mentorship is so important in helping you achieve what you set out to accomplish as a graduate student. About Dr. Coalton Bennett D r. Coalton Bennett is a patent agent, assisting in the preparation and prosecution of patent applications filed with the U.S. Patent and Trademark Office (USPTO). Dr. Bennett has a significant technical background in a wide range of areas including computer networks, internet applications and software, audio signal processing, speech processing, image processing, wireless communications standards including IEEE 802.11, IEEE 802.15.4, cellular data service (knowledge of various standards including GSM, CDMA, GPRS, 3G, UMTS, etc.), mobile advertising, software, mobile payments, mapping software, retail advertising, machine learning, genetic algorithms, artificial intelligence, optical communications, blockchain, and cryptocurrency. In addition, he has experience with data security and privacy. Prior to becoming a patent agent, Dr. Bennett was a member of the technical staff at the Massachusetts Institute of Technology (MIT) Lincoln Laboratory, where he developed networking protocols for wireless handsets. Dr. Bennet earned his Ph.D. and M.S. in electrical engineering in 2010 from Cornell University and his B.S. in electrical engineering from Howard University. 2-2:15 p.m. ET Break 2:15-3:30 p.m. ET Mastering Your Transition Into & Progression Through Graduate School During this panel discussion with continuing doctoral students from across the disciplines, panelists candidly discussed their experiences and strategies for making a successful transition into graduate school. They also shared insights on their experiences navigating their ongoing progression through their graduate studies and their exploration and preparation for various postgraduate career pathways. Moderator: Drea Darby, Ph.D. Candidate, Entomology Drea Darby, Ph.D. candidate in entomology, is a Ford Foundation Fellow and McNair scholar who studies the metabolic consequences of infection and the effects of high sugar diets on infection outcome in the fruit fly Drosophila melanogaster. She is recognized for her leadership and service efforts in advancing opportunities and the well-being for historically marginalized students in academia and increasing our understanding on how science has historically been used to justify inequities in our society. Drea co-developed the Science of Bias Seminar in Fall 2020 where students learned about the historical context of bias and exploitation in science and how it persists in the present day. She served as a co-leader for the Cornell Diversity Preview Weekend, which has transformed into the institutionalized program Consider Cornell, where students from groups historically underrepresented in academia learn the ins and outs of the graduate application process. She has also served on the executive board for the Black Graduate and Professional Student Association (BGPSA) and as an active member of the Graduate and Professional Student Diversity Council (GPS-DC). Currently, she is a graduate student ambassador and a mentor in the Graduate Students Mentoring Undergraduates program within the Office of Academic Diversity Initiatives (OADI) on campus. Drea also enjoys her life as a plant and dog mom, playing video games, and watching anime. Panelists Alan Mata, Ph.D. Student, Entomology Alan Mata is a third-year Ph.D. student in the field of entomology at Cornell University. Alan serves as the SACNAS outreach chair and is a first-generation student. His research interests revolve around insect systematics (taxonomy and phylogenetics) and biogeography and studies a really cool group of flies called bee flies, which mimic bees and wasps in behavior and morphology. Furthermore, they are parasitoids of a variety of different insect groups. Given that bee flies need a lot of revisionary work, this is a good system for Alan to not only look at the biodiversity of this group but also ask some really interesting evolutionary biology questions. Alex Pasqualini, Ph.D. Candidate, Music Alex Pasqualini is a current Ph.D. candidate in music and sound studies. Their research is focused on the intersections of popular music, play, silliness, camp, activism, and queer community building, with a focus on the 1990s queer-feminist-punk music of riot grrrl and queercore. Coming from southwestern Ontario, Alex completed their bachelor’s degree in music at the University of Western Ontario and a master of arts in musicology with the collaborative sexual diversity studies program from the University of Toronto. Alex’s passion for fostering queer belonging is reflected elsewhere in their work on and off campus, such as in their work as the graduate assistant of Cornell’s LGBT Resource Center, as co-president of the QGrads and Music Graduate Student Associations, and as part of the steering committee for Transpose: Ithaca’s Queer Singer’s Alliance. Dante King, Ph.D. Student, Classics Dante is entering his third year as a Ph.D. student in interdisciplinary classics. In 2021, he earned his B.A. in classical languages magna cum laude from The College of Wooster and investigated foundation stories’ influence on and interaction with early Roman imperial society in his honors thesis, “Two Sides of the Same Coin: Vergil and Ovid’s Clashing Portrayals of Individual and Group Identity.” While Dante maintains a wide range of interests, he is most passionate about investigating visualization, the synergy of text and image, in late antique and early medieval illuminated manuscripts of the Latin west. He is currently the secretary of Cornell’s Medieval Studies Graduate Association (MSGA) and also works with Professor Emeritus Jeff Rusten on the Lexeis project, using Python to digitize single author ancient Greek lexica. Alongside his work in classics, Dante has nurtured a love of music and theatre. He has sung in various languages (including Latin), both solo and in choral environments, and acted onstage in twelve productions, including Euripides’ Medea (Jason) and Terence’s Adelphoe (Demea). Helen Stec, Ph.D. Student, Neurobiology and Behavior Helen Stec is a second-year Ph.D. student within the field of neurobiology and behavior at Cornell University. They are studying brain differences between the male morphs of Poecilia parae, a species of fish closely related to the guppy. They are the chair of the Multicultural Academic Council (MAC). Kaitlin Diggins, Ph.D. Student, Plant Pathology and Plant Microbe Biology Kaitlin Diggins is from Mondamin, Iowa, and a recent graduate of Iowa State University (2022) with a bachelor’s degree in environmental science and a minor in horticulture. Kaitlin grew up on a small, diversified hobby farm in Iowa, where a deep passion for nature, science, and sustainable, small-scale agriculture was catalyzed. From there, she made it a personal goal to participate in interdisciplinary projects that work toward a sustainable future for diverse farmers. Kaitlin’s research interests evolved as she progressed through her academic career, starting in agriculture and soil science, moving to plant biochemistry and climate change, and finally progressing to integrated pest management in organic farming systems. Kaitlin is currently a second-year Ph.D. student expanding her knowledge of fungal diseases in organic vegetable systems. She is working on a collaborative project, where she will work to increase the production of organic dry beans in the Northeast by enhancing management practices for white mold caused by the fungus, Sclerotinia sclerotiorum, that causes significant damage to bean yields in the United States and worldwide. Event Sponsors Graduate School Office of Inclusion & Student Engagement, Diversity Programs in Engineering , and the Cornell Chapter of the Bouchet Graduate Honor Society Attribution Statement This program was modeled in part after PROMISE: Maryland’s NSF AGEP Summer Success Institute . The launch and institutionalization of the Summer Success Symposium benefited from support from the 2016 ETS/CGS Award for Innovation in Promoting Success in Graduate Education and National Science Foundation under Award No. 1647094, CIRTL AGEP Transformation Alliance from 2016-2022. Any opinions, findings and conclusions or recommendations expressed in this material are those of the Cornell PI team and do not necessarily reflect the views of the National Science Foundation. Previous Summer Success Symposium View 2022 Summer Success Symposium Description and Presenters View 2021 Summer Success Symposium Description and Presenters View 2020 Summer Success Symposium Description and Presenters Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}