{
  "id": 3,
  "date": "2024-05-18T18:16:41.810810",
  "url": "https://gradschool.cornell.edu/alumni/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts About Vision and Mission Land Acknowledgement Leadership Dean’s Statements Governance and Structure Organizational Chart General Committee Graduate Program Registration History of Graduate Study at Cornell Publications and Reports Program Metrics Graduate School News and Events Graduate School Alumni Newsletter Graduate School Original Stories Subscribe to Graduate School Newsletters Graduate School News You Belong at Cornell Safety and Security Reports Program Metrics Graduate School Mental Health & Faculty Mentor Development Initiatives Graduate and Professional Community Initiative Union Representation Contacts Staff Directory Events Calendar Resources Policies Forms Alumni Alumni Newsletter Spring 2024 Donor’s New Fund to Support Students, Mentoring Ten Inducted into Bouchet Graduate Honor Society Physics Ph.D. Candidate Wins 2024 Three Minute Thesis Competition Doctoral Candidate Selected as World Food Prize Council of Advisors Youth Representative Doctoral Alumna Selected for SUNY Chancellor Distinguished Ph.D. Graduate Dissertation Award Alumni in the News Alumni Newsletter Fall 2023 Donor-Funded Fellowship Helping Doctoral Candidate Improve Grapevines’ Climate Resilience Leveling Up: Graduate School, GPSA Provide New Air Conditioning, Other Improvements at the Big Red Barn Learning to Lead Inclusively Funding for Fluency: Grants Support Summer Language Study Alumni in the News Alumni Newsletter Spring 2023 ‘Like Having an Older Sibling’: Graduate Students Benefit from Peer Mentoring Donor-funded Scholarship Making a Difference for Ph.D. Students Ten Inducted into Bouchet Graduate Honor Society Doctoral Alumna Selected for SUNY Chancellor Distinguished Ph.D. Graduate Dissertation Award Alumni in the News Alumni Newsletter Fall 2022 Two Cornell Alumni Named Schmidt Science Fellows Travel Grants Help Graduate Students Conduct Research Across the Globe New Graduate School Program Demystifies Graduate Study for Diverse Students Alumni in the News Alumni Newsletter Spring 2022 Graduate School Dean Named Chair of Blue Ribbon Committee for National Academies Asian Literature, Religion, and Culture Ph.D. Candidate Wins Three Minute Thesis Competition Cornell Doctoral Candidate Wins National 3MT Competition First Generation Graduate Students Give Back Any Person…Any Career…Greater Impact Alumni in the News Alumni Newsletter Fall 2021 ‘Lights Along the Path’: Bouchet Alumni Give Back Grants Help Students Present Research Online Student Spotlight: Alex Ogbonna Student Spotlight: Charlotte Logan Student Spotlight: Lyrianne González Student Spotlight: Ngoc Truong Alumni in the News Alumni Newsletter Winter 2021 Nine Questions for Dean Boor Graduate School Associate Dean Wins National Leadership Award Can You Describe Your Research in Three Minutes? Multilingual Students Find Expanded Support Cornell Responds to Changing Student-Parent Needs Students’ Vaccine Videos go Viral Students, Alumni Celebrate Black Graduate Excellence Student Spotlight: Drea Darby Student Spotlight: Jason Chang Student Spotlight: David Dunham Student Spotlight: Tianyao Qu Alumnus Spotlight: Adem Efe Gencer, Ph.D. ’17 Alumna Spotlight: Malika Grayson, M.S. ’14, Ph.D. ’16 Alumni in the News Alumni Newsletter Summer 2020 Zoom Fatigue? Not for This Graduate School Staff. Degrees in Hand, New Alumni Discuss Remote Defenses Expanding Opportunities while Expanding Horizons New Group Supports First-Generation and Low-Income Students Workshops Offer Judgement-free Zone to Learn How to Be an Ally Becoming Better Mentors Through Workshop Series “Future Faculty and Academic Careers,” a New Name for a Long-Running Program Student Spotlight: Piyawat Louilarpprasert Student Spotlight: Michael Dunaway Student Spotlight: Tibra Wheeler Student Spotlight: Aditi Sahasrabuddhe Alumnus Spotlight: Javier Jaimes, Ph.D. Alumna Spotlight: Brooke Zanetell, Ph.D. ‘Speak and Be Heard’: Communication Tips from Eliza VanCort Alumni in the News Alumni Newsletter Fall 2019 New NSF GRFP Fellows Recognized Seven Graduate Students Awarded Wu Scholarships Data Transparency Expressing Gratitude at Orientation 2019 Careers Beyond Academia Expanded for All Ph.D.s Boot Camp Encourages Productivity Student Spotlight: Pichaya (Mint) Damrongpiwat Student Spotlight: Christian Posbergh Student Spotlight: Hirokazu Togo Student Spotlight: Chinasa Okolo Alumni in the News Alumni Newsletter Spring 2019 Plant Breeding Graduate Student Wins 2019 3MT Longtime Big Red Barn Manager Retires Grants Help Graduate Students Do Research Around the World Alumna Addresses Importance of Mentoring Using Stories Toward Greater Inclusion Carriage House to Student Center: The Big Red Barn Over the Years Changing Your Fixed Mindset into a Growth Mindset Alumni Newsletter Fall 2018 Alumni Newsletter Winter 2018 President Martha Pollack Q&A The Gratitude Project The Student Partner Career Fair Graduate School Alumni Alumni Graduate education has been part of the university’s mission since its founding in 1865. Cornell researchers and scholars have translated discovery into meaningful and measurable advances in knowledge. They have developed technologies that have helped feed the world, invented products like Super Glue, and conducted deep scholarship. Cornell graduate students are central to these achievements. You can directly support Cornell’s graduate and professional students with your gifts to the Graduate School Annual Fund and Cornell Graduate Student Fellowships. What do gifts to the Annual Fund support? Gifts to the Annual Fund provide readily available and unrestricted funds to support academic, personal, and professional development programs. With over 6,200 graduate and professional student participants, our programs help students with their academic, personal, and professional development. What type of programs does the Annual Fund support? Academic support: Academic writing programs, such as proposal, dissertation, and thesis writing workshops Fellowship application writing workshops Responsible conduct of research and ethics programs ​Personal development and student life: ​Orientation and transitioning to graduate school Programs that support students with families Personal development and student success programs in time management, perfectionism, and stress management Professional and career development: Future faculty programs, including an inclusive teaching institute, mentoring, and classroom teaching and research Career search programs Leadership programs Opportunity funds: Research travel grants Conference travel grants What do gifts to the Cornell Graduate Student Fellowships support? Cornell’s Ph.D. students receive merit-based aid packages that are awarded as part of an admissions offer to attract the very best students. Annual giving plays a crucial role in funding this support at a level that is competitive with peer institutions. Providing competitive packages helps Cornell attract top students who help drive our intellectual productivity. Gifts to the fellowship fund directly support the most talented and diverse students. How do I give? You can give online . Be sure to indicate where you would like your gift to go by toggling “Click here to choose your gift designations” How else can I be involved? Look for programs in upcoming issues of the Graduate School Newsletter. We are developing programs to connect alumni with current students. Visit alumni.cornell.edu to become involved with Cornell’s vast network of alumni. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}