{
  "id": 3,
  "date": "2024-05-18T18:08:37.827758",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/funding-and-resources/external-resources-and-support/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Funding and Resources External Resources and Support External Resources and Support Below is a list of resources available through outside organizations. See Cornell-specific resources . Academic Diversity Search Academic Diversity Search, Inc. (ADS) is a nationwide employment resource specializing in connecting women and minorities with academic institutions that truly value diversity. American Association of University Professors The American Association for University Professors assists in assuring the freedom and standards of teaching in higher education and has listings of committees devoted to underrepresented faculty issues, articles, and news on diversifying campuses. American Association of University Women The American Association of University Women is a membership-based society promoting equal education for women and girls and professional educators. American Council on Education The American Council on Education unites 1800 colleges and universities with the objective of promoting equal opportunity within the higher education system. American Educational Research Association The American Educational Research Association (AERA), a national research society, strives to advance knowledge about education, to encourage scholarly inquiry related to education, and to promote the use of research to improve education and serve the public good. Association of American Colleges and Universities DiversityWeb is a project of AAC&U’s Office of Diversity, Equity, and Global Initiatives (ODEGI). Central to the office’s mission is the belief that diversity and global knowledge are essential elements of any effort to foster civic engagement among today’s college students. To support those goals, the office helps colleges and universities establish diversity as a comprehensive institutional commitment and educational priority. Black Doctoral Network The Black Doctoral Network (BDN) is a multidisciplinary clearinghouse for black and Latino scholars and professionals in the social sciences, STEM, and humanities. Center for Equal Opportunity The CEO addresses issues of equality across all institutions receiving government funds. Center for the Integration of Research, Teaching, and Learning The Center for the Integration of Research, Teaching, and Learning (CIRTL) maintains a discussion group for academic career and job postings, and offers cooperative programs involving more than 40 doctoral institutions and other partners interested in preparing doctoral students for future faculty roles. Diverse Issues in Higher Education Diverse seeks to be a catalyst for change, and our ultimate objective is to contribute to the building of educational, cultural, social and economic structures that will allow every individual to achieve his or her full human potential and contribute to the greater good of the community and the nation. FairTest The National Center for Fair & Open Testing (FairTest) works to end the misuses and flaws of standardized testing and to ensure that evaluation of students, teachers and schools is fair, open, valid, and educationally beneficial. Ford Fellowship Program Through its fellowship programs, the Ford Foundation seeks to increase the diversity of the nation’s college and university faculties by increasing their ethnic and racial diversity, to maximize the educational benefits of diversity, and to increase the number of professors who can and will use diversity as a resource for enriching the education of all students. Guide for Undocumented Students on Fellowships and Scholarships Up-to-date information about scholarships available for immigrant students that don’t have U.S. citizenship or legal permanent residency. Hispanic Association of Colleges and Universities The Hispanic Association of Colleges and Universities (HACU) which represents 450 colleges and universities committed to the Hispanic higher education success in the U.S., Puerto Rico, Latin America, Spain, and Portugal. Hispanic Outlook in Higher Education A biweekly publication devoted to constructive discussion of Hispanic and non-Hispanic issues in higher education. Immigrants Rising Immigrants Rising empowers undocumented young people to achieve educational and career goals through personal, institutional, and policy transformation. Institute for Broadening Participation The Institute for Broadening Participation created an online mentoring manual with the goal of highlighting the value of mentoring and to help students, faculty, and administrators be better mentees and become better mentors within the science, technology, engineering, and mathematics (STEM) fields, especially on the mentoring process for underrepresented students. Low-Income Student Guide This guide from AccreditedOnlineSchools.org details how universities are supporting low-income students and the opportunities available on and off campuses. Making College Affordable: An Online Guide for Hispanic Students While this guide contains information valuable to all current and future college students, it focuses on data and resources specific to Hispanic students looking to further their education. Mexican Legal Defense and Educational Fund Founded in 1968 in San Antonio, Texas, the Mexican American Legal Defense and Educational Fund (MALDEF) is the leading nonprofit Latino litigation, advocacy, and educational outreach institution in the United States. MinorityPostdoc.org MinorityPostdoc.org feature articles, resources, and events about career advice, professional development, jobs, funding, fellowships, mentoring, and diversity issues. National Association for Equal Opportunity in Higher Education The National Association for Equal Opportunity in Higher Education promotes the advancement of minority students and minority educators. NCFDD Cornell is an institutional member of the NCFDD, a nationally recognized, independent organization providing online career development and mentoring resources. NCFDD provides members with access to tools to increase research and writing productivity and improve work-life balance. See instructions on how to set up your free individual membership. The Black Collegian Career site/online journal targeting minority graduates seeking professional positions. UCLA GRAPES – Scholarship & Fellowship Database The Graduate School at the University of California, Los Angeles maintains one of the most extensive and up to date university databases on graduate school funding opportunities. Their database is called GRAPES and can be used to search for hundreds of funding opportunities. UNIGO An organization that provides students with access to well-organized details on thousands of funding opportunities for college and graduate studies. You can create a profile with Unigo that will help facilitate your search for scholarships for which you might be eligible to apply, or you can forgo creating a profile and explore information on funding focused on specific areas of study, interests, and/or identity groups. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}