{
  "id": 3,
  "date": "2024-05-18T18:08:46.196519",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/graduate-diversity-inclusion-awards/2021-graduate-diversity-inclusion-awardees/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Graduate Diversity & Inclusion Awards 2021 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees Watch the 2021 Graduate Diversity and Inclusion Awards & Recognition Celebration Exemplary Service Awards for Early & Advanced Career Students Early Career The recipients of the 2021 Early Career Exemplary Service Award are Taylor Brown, Andrea Darby, and Marguerite Pacheco. Taylor Brown Taylor Brown , Ph.D. student in natural resources, is recognized for her service in support of her fellow first-generation and low-income graduate and professional student peers at Cornell University. Taylor co-founded the Cornell First Generation and Low-Income Graduate Student Organization (FiGLI) in 2019, the first student organization dedicated to first-generation and low-income graduate and professional students from any field of study at Cornell. Since building the organization from the ground up, she has served as a leader within the organization with the overarching goal of cultivating community and a robust sense of belonging among FiGLI graduate students. Taylor has actively advocated for enhanced visibility of the experiences of FiGLI students at Cornell and the shared challenges they face in navigating the hidden curriculum of academia. She has continuously worked to support the FiGLI student community by organizing professional and personal development opportunities, including engaging with FiGLI professors to learn from their shared experiences in higher education and hosting workshops on managing work-life balance and financial literacy. Within her field, Taylor has advocated for increased recognition and active support of diversity, equity, inclusion, and access. She played a key role in organizing and facilitating community discussions focused on how to concretely advance DEI within the department and more broadly across the community’s various spheres of influence. She contributed to the creation of the department’s new DEI Advisory Council, which aims to create a diverse, inclusive department with equitable access to opportunities for all community members. Andrea Darby Drea Darby , Ph.D. candidate in entomology, is recognized for her efforts in advancing opportunities for historically underrepresented students and increasing education on diversity, equity, and inclusion in STEM. She is a co-leader for the Cornell Diversity Preview Weekend where students from groups historically underrepresented in the life sciences learn the ins and outs of the graduate application process. This event empowers and prepares students for applying for graduate programs through workshops, networking with Cornell faculty and students, and having open conversations on culture and identity in graduate school. Drea was a co-instructor for the Science of Bias Seminar in Fall 2020. In this class, students learned about the historical context of bias in science and how it persists in the present day. Students also discussed identifiable ways to address and move forward from these issues. Drea further serves the Cornell community as an e-board member of the Black Graduate and Professional Student Association and as a mentor to undergraduate fellows in the Cornell Institute of Host-Microbe Interactions and Disease Undergraduate Research Experience program. Marguerite Pacheco Marguerite Pacheco , Ph.D. student in biomedical engineering, is active in equity work and community building across Cornell’s campus and in the local community. As a first-year student, she became a part of the executive board of the graduate student BMES chapter as a community engagement co-chair before becoming vice president. With this organization, she worked to increase accessibility of STEM via Girl Scout Engineering Day and GRASSHOPR and served on panels to discuss graduate school applications with CURB and the undergraduate BMES chapter. In this position, she also co-led a field discussion on racism and how her field could reduce harm and uplift others. She is continuing work within BME to start its first DEI committee and push forward effective action items. She then became involved with the Latinx Graduate Student Coalition as a board member and worked to provide channels of aid during COVID and resources for those engaging in protests that summer. At this time, she began work with the GPS-DC and helped organizations work together to help incoming students find community with limited in-person activities, such as participating in the Summer Success Symposium. This past year, she has worked on the board for the Building Allyship Series as a panelist, moderator, question writer, and behind-the-scenes organizer. She is currently working with the Ithaca Tenants Union in solidarity with the Cayuga nation against land dispossession. Advanced Career The recipients of the 2021 Advanced Career Exemplary Service award are Irma Fernandez and Stephanie Tepper. Irma Fernandez Irma Fernandez , Ph.D. candidate in biochemistry, molecular and cell biology and HHMI Gilliam Fellow, has contributed extensively to the Cornell community through a wide range of efforts aimed at improving diversity, access, equity, and inclusion within academia and providing opportunities for all. As a graduate student, she is the co-president of the SACNAS chapter at Cornell. This organization has been able to help URM students from a young age to current Cornell undergraduates learn about higher education, build their social capital and network, and gain detailed insights on scientific research. Irma is also a Graduate Student Ambassador and an enthusiastic recruiter for Cornell at SACNAS and other recruitment events. As a founding member of the Molecular Biology and Genetics Department Diversity Council, Irma has promoted efforts to increase the diversity of the graduate student population and to create a supportive campus climate for all students. One of her most salient contributions is to push the department towards a targeted recruitment strategy of increasing the URM applicant pool through outreach events aimed at McNair, RISE, and LSAMP Scholars and to initiate a Life Sciences Diversity Recruitment Weekend across five fields including BMCB, GGD, biophysics, BBS, and microbiology. Stephanie Tepper Stephanie Tepper , Ph.D. candidate in psychology, is a recipient of the 2021 Advanced Career Exemplary Service Award. She is recognized for her work in community engagement and efforts to promote diversity and inclusion. Since her first year at Cornell, Stephanie has been an active leader of QGrads, the LGBTQ+ Graduate Student Association. She served as co-president of the organization for two years and continues to serve as a general board member. Stephanie cares deeply about creating opportunities for members of the queer community to come together and find spaces where they can be their full, vibrant selves, both within and outside of academia. Alongside fellow board members, she has worked to expand the reach of QGrads and develop programming to promote a strong sense of community among queer graduate students. Through this position, Stephanie also has served on the Graduate and Professional Student Diversity Council, advocating for graduate students’ needs and initiating collaborations with fellow graduate student leaders. In the field of psychology, Stephanie advocates for equity through her role as student chair of the Diversity Committee. In this role, she works alongside students and faculty to develop and implement initiatives to promote diversity and inclusion. She has been actively involved in organizing programs such as the Diversity Undergraduate Mentorship Program, diversity-centered events during recruitment weekend, the Summer Undergraduate Research Fellowship, and the Cornell Undergraduate Psychology Conference. Beyond this formal role on the Diversity Committee, Stephanie enjoys sharing resources with fellow students as often as possible, for example, by serving on panels about graduate application processes, reviewing students’ National Science Foundation fellowship statements, and mentoring students. In doing this work, Stephanie hopes to transform academia with fellow advocates in order to ensure that people from marginalized backgrounds are represented, valued, and able to flourish. She looks forward to continuing to build community and push for institutional change during the final years of her degree program. Excellence in Leadership Award The recipients of the 2021 Excellence in Leadership Award are Casey Ching, Kavya Krishnan, and Tibra Wheeler. Casey Ching Casey Ching is a Ph.D. candidate in the field of civil and environmental engineering. Her dedication to building and growing inclusive communities is evident through her effort to improve the graduate experience on a person-to-person basis, as well as on a departmental and institutional level. She has pushed to improve communication and camaraderie across research groups within her field, including creating a graduate student Slack channel and organizing social hours (virtual social hours during the COVID-19 pandemic). Recently, she designed a map of Hollister Hall’s graduate student lounge on Gather.town for a virtual social hour. She later gifted this map to the department’s Graduate Open House so that incoming graduate students could get a feel of the graduate student-designated space. In addition, she has been involved with the Civil and Environmental Engineering Graduate Student Association for three consecutive years, during which she encouraged more creative ways to engage with the staff, faculty, and student body. One notable event that she co-organized was one regarding imposter syndrome, for which she led an interactive activity that allowed participants to maintain anonymity while challenging themselves to recognize experiences they may have had that could be attributed to imposter syndrome. Outside of her field, she has led the Society for Asian American Graduate Affairs (SAAGA) as co-president during the past year. She led her executive board through rebuilding SAAGA as a community that fulfills the current needs of the graduate AAPI community at Cornell. During the COVID-19 pandemic, and during a time when the east-Asian community is highly affected by anti-Asian hate, her priority when leading the community has been to maintain a place for all members to call “home,” whether it be through discussion of current events, game nights, or check-ins. She co-led two AAPI community processing spaces in the aftermath of the Atlanta shootings to give affected community members a space to share their stories and grieve together. Casey’s unwavering commitment to build, maintain, and grow the communities that she is a part of is a testament to her dedication to fostering inclusion and a sense of belonging for all. Kavya Krishnan Kavya Krishnan is a Ph.D. candidate in the soil and crop sciences field and a Tata-Cornell Institute Scholar. Her primary research interests are studying soil health and particularly its effects on food security. Since her arrival at Cornell in Fall 2017, Kavya has been involved in diversity and inclusion efforts across campus. She has worked extensively with the Graduate and Professional Student Assembly (GPSA) in a variety of roles from a voting member, a co-chair of the Diversity and International Students Committee (DISC), and most recently finishing her term as the vice president of communications. She has also been involved with the Graduate and Professional Diversity Council through her work in various organizations from GWIS, GPSI, and QGrads. A lot of her recent work has been to advocate for international students across campus through her work in the GPSA, Graduate and Professional Students International, and her work on the English Language Support Office Advisory Committee. Kavya has also been involved in a variety of efforts to build DEI efforts in her own department. As a CTI Fellow, she has been working with another CTI Fellow, Josh Garcia, offering workshops to TAs on building inclusive classrooms. Tibra Wheeler Tibra Wheeler , a Ph.D. candidate in biomedical engineering, has been heavily involved in giving back to underrepresented minority groups through her mentoring work in various offices across Cornell’s campus working with high school, undergraduate, and graduate students. She has made significant contributions to the Black Graduate and Professional Student Association (BGPSA), serving on the executive board for three terms to ensure the continuity of the organization. Tibra also serves as a graduate student representative on the Belonging at Cornell Committee for the College of Engineering (COE) which aims to continue the progress towards making Cornell a more diverse and inclusive environment. In this effort, she has helped to develop and address responses to URM graduate student requests for improved support and resources. It is also important to Tibra that her efforts reach the undergraduate community. She serves as a mentor to undergraduate students through Graduate Students Mentoring Undergraduates (GSMU), a joint program of the Office of Academic Diversity Initiatives and the Graduate School Office of Inclusion and Student Engagement that supports the scholastic and professional development of undergraduates. Tibra’s mentoring efforts are further shown in her involvement with Cornell’s Diversity Programs in Engineering Office as the Ryan Scholar Graduate Coordinator. In this role she serves underrepresented engineering students, meeting with them monthly to set attainable goals and helping them navigate engineering by highlighting resources. Furthermore, in the National Society of Black Engineers (NSBE), she has served as the Graduate Student Representative for Cornell’s chapter, coordinating a graduate student panel for the undergraduate chapter members. Tibra hopes to continue her work to take leaps and bounds towards changing the status quo and changing what the world “thinks” an engineer should “look” like. Social Justice Award The recipients of the 2021 Social Justice Award are Samantha Bosco, the Cornell Institute of Archeology and Material Studies – Anti-Racism Anti-Colonialism Interest Group, and Inclusion, Diversity, and Equity in Earth & Atmospheric Sciences (IDEEAS) Working Group. Samantha Bosco Samantha Bosco , Ph.D. candidate in horticulture, is a Jewish, queer, transparent activist and fifth year with a minor in American Indian and Indigenous studies studying the role of temperate nut trees in both Indigenous food sovereignty and climate-smart agriculture. She has served as the co-president of QGrads, the SIPS Diversity and Inclusion Committee, a member of Project Biodiversify’s Cornell affiliation, as well as the Student Engagement Coordinator for the Society of Ethnobiology. Outside of academics she’s an outdoor adventurer, quasi-musician, part-time performer, and amateur influencer. The Cornell Institute of Archeology and Material Studies – Anti-Racism Anti-Colonialism Interest Group The Anti-racism and Anti-colonialism (ARCO) Interest Group is an organization geared toward uprooting systemic racism in archaeological practice and pedagogy by facilitating productive discussions and providing anti-racist programming for the CIAMS community, inspired by the calls to #ShutDownAcademia and #ShutDownStem on June 10th, 2020 in an effort to support the Black Lives Matter Movement. This past year they have striven to continue the dialogue through several modes, including the facilitation of follow-up discussions between students and faculty about a seminar series hosted by the Society of Black Archaeologists (SBA), Indigenous Archaeology Collective (IAC), Wenner-Gren Foundation for Anthropological Research, SAPIENS, and Cornell Institute of Archaeology and Material Studies (CIAMS) seminar series. They have organized two separate reading groups: one for all members of the CIAMS community and one for graduate students and postdoctoral associates that focus on texts that consider the historical and current role of colonialism in archaeology. In doing so, they have been able to discuss issues of importance for the CIAMS community and to create a safe space for the graduate student community to voice their thoughts and concerns. All discussions are oriented toward the overarching goal to be responsibly practicing scholars in the future. Their long-term projects include the curation of an anti-colonial and anti-racist reading list with a focus on publications in archaeology, the development of a fieldwork and laboratory code of conduct, and the improvement of their capacity for shaping pedagogy and field projects that are informed by the varying perspectives. In the coming year, they plan to develop a mentoring program between graduate and undergraduate students. ARCO is a continuing group effort only possible through the participation and support of CIAMS students, postdoctoral associates, faculty, and affiliates. Inclusion, Diversity, and Equity in Earth & Atmospheric Sciences (IDEEAS) Working Group Inclusion, Diversity, and Equity in Earth and Atmospheric Sciences , or IDEEAS, formed organically in October 2019 as a grassroots collective within earth and atmospheric sciences (EAS). IDEEAS’ mission is to foster inclusion, belonging, and community in EAS among students, administrative staff, research staff, faculty, professors emeriti, and alumni. We actively promote diversity, equity, inclusion, and access as core values. We promote these values by bringing equity, diversity, and inclusion learning opportunities to the EAS community and create frameworks to ensure equitable access to department educational, research, and professional opportunities. IDEEAS provides a space to have important conversations and then take appropriate, collective action within the context of our department. IDEEAS is a non-hierarchical group within the hierarchical setting of academia. Self-selected from the full cross-section of the EAS department, IDEEAS comprises students, staff, researchers, pre-tenure and tenured faculty, emeriti, and alumni. We formed IDEEAS to educate ourselves on inclusive practices and create a more visible, equity-focused culture in the department, with the experiences and perspectives of our personal and professional communities in mind. The IDEEAS ethos rests on the premise that leadership is a dynamic process a group can enact collectively, rather than an intrinsic quality that an appointed individual exercises over followers. This principle informs how we communicate internally as a department and how we define our priorities as a community. IDEEAS organizes events with dual goals of fostering social connection and community within the department and providing intentional learning opportunities to promote critical reflection and discussion. Past and ongoing events include a well-attended kickoff party with a facilitated conversation, a regular Justice, Equity, Diversity, and Inclusion (JEDI) Journal Discussion, community conversations about implicit bias and structural racism, and social events to foster connection, particularly during the pandemic. Community Outreach Award The recipients of the 2021 Community Outreach Award are Claire Fox, Kimberly Fuqua, and Robert Swanda. Claire Fox Claire Fox , Ph.D. in ecology and evolutionary biology, is recognized for her contributions to community outreach. During her time at Cornell she worked alongside fellow educators and community members to co-found and co-direct two impactful nonprofit organizations in Ithaca dedicated to expanding access to science. With the Physics Bus, Claire helped to bring the joys of physics to people of all ages and all walks of life. Unique physics exhibits made from junk delight everyone from senior living communities and music festivals to Title 1 schools and neighborhood block parties. With Free Science Workshop, she helped to establish a no-cost drop-in program for underserved and underrepresented youth. At Free Science Workshop participants can explore whatever aspect of science and invention interest them the most. It is an empowering environment designed to promote confidence, connectedness, and a lifelong love of learning. Claire did whatever needed doing for these dynamic programs: driving the bus, staffing drop-in hours, developing and leading activities, writing grants and reports, chairing meetings, mentoring kids, evaluating the program, developing community partnerships, and recruiting other grad students to get involved too! This past year Claire joined the board of the Global Alliance for Community Science Workshops. She is now taking what she learned from community outreach in Ithaca and applying it to program creation in Pittsburgh. Claire encourages scientists in all phases of their career to give back to their communities and promote equitable access to science enrichment for youth. Kimberly Fuqua Kimberly Fuqua , M.P.A. student with an educational policy concentration, is Native American from the Lumbee Tribe of North Carolina. She is a special education teacher, working on her M.P.A. with the goal of advocating for minorities and students with disabilities and working in policy to ensure a fair and appropriate education for students in public schools. Experienced in teaching and advocacy for over 10 years, she has a passion for fairness and equity and is skilled in organizational leadership, collaboration, and leading volunteer efforts. She is currently pursuing a master’s of public administration focused on social educational policy at the Cornell Institute of Public Affairs; she will graduate in May 2021. Her expertise is in collaboration and differentiation of instruction for a wide range of students. She is also working toward the systems thinking modeling leadership certificate and Cornell’s diversity and inclusion certificate. Kimberly is also interested in the human rights aspect of policy due to her Native roots as her tribe continues to struggle for equality in America. Being a minority female, she has had to learn to adapt to her surroundings, whether that be in rural North Carolina, Canterbury, U.K., or Cornell University. She is thankful for AIISP as it has allowed her to work as community support specialist and president of IGSA. Robert Swanda Robert Swanda is a Ph.D. candidate in the biomedical and biological sciences program at Cornell University. His research investigates understanding the movement between mRNA and protein production (a process called translation) and how mRNA can be leveraged as a therapeutic for diseases. Specifically, Rob has worked to create mRNAs that are rich in sulfur amino acids and has targeted these mRNAs to cancer cells to mitigate their growth. During his time at Cornell, Rob has been awarded an NIH Chemical Biology Interface (CBI) predoctoral fellowship and an American Heart Association predoctoral fellowship. As part of the CBI training program, Rob organized and ran the NIH CBI meeting at Cornell by identifying and selecting speakers to give research talks, seeking out professional development workshops, and hosting literature lunches for students. However, Rob’s commitments extend beyond the laboratory and enter the community. Throughout his graduate career Rob has volunteered with Cornell’s Center for Material Research, Cornell SACNAS, and has acted as a Graduate School Ambassador. He also engages in service-learning projects through the SMART program that partners individuals from Cornell in tackling issues in emerging markets. Rob has participated and led these projects in Colombia (January 2018), Kenya (January 2019), and Rwanda (January 2020). During the 2020 COVID-19 pandemic, misinformation on the COVID-19 vaccines was all over the internet. Backed with his research on mRNA, Rob sought to make short vaccine tutorials, breaking down the science for lay and professionals alike. His videos went viral, educating over 6 million people across the world and counting. Rob partnered with others in various countries to have the information translated into multiple languages to further break down the barriers of this scientific content. Unsung Hero Award Tina Nelson Tina Nelson , academic programs coordinator in the field of city and regional planning, is recognized for her extraordinary efforts to support graduate and professional degree students in the fields of city and regional planning and regional science. Tina’s consistent dedication to supporting student access, well-being, and achievement goes above and beyond that of an academic programs coordinator. Tina is always quick to respond with guidance to solve any problem, even if the question is beyond her realm. She happily reaches out to others and always follows up to ensure that issues are resolved. She creates a warm and friendly environment by always greeting students with a smile and baked goods which she brings in from home. Her strong connections to her own family help her build a sense of family in the department as well. Tina is always warm and welcoming and the students value her deeply. Tina embodies the spirit of diversity and inclusion. She understands the challenges students face as they navigate Cornell – challenges of time, differences in cultural environment, knowledge, and access. Students count on Tina to provide the information and assistance to help them get the support they need. She is described as “the heart and soul of the department.” Commitment to building an inclusive environment for diverse students as the core of how she interprets her role. Tina’s passion for student support began 35 years ago with her first position at Cornell in the AAP Undergraduate Registrar’s Office. Her dedication to students in the college shows through her care, passion, energy and by creating of a sense of belonging in the department. Faculty Champion Awards for Junior & Senior Faculty Junior Faculty The recipients of the 2021 Junior Faculty Champion Award are Amal El-Ghazaly and Neil Lewis Jr. Amal El-Ghazaly Amal El-Ghazaly , assistant professor in electrical and computer engineering, is being recognized for her devotion to motivating, training, and championing underrepresented students. She believes that the greatest impact happens at the individual level, one person at a time. As such, she has dedicated much of her time to working closely with students and seeing them through crucial parts of their careers. Her nominator states, “Such effort and initiatives in fostering diversity and inclusion from a junior faculty member right from the start of her academic career are extraordinary,” and that she was “extremely impressed by Amal El-Ghazaly’s passion for and extensive and tireless work on promoting diversity and equity.” After her first year at Cornell, Professor El-Ghazaly took the initiative to create a first-year Ph.D. seminar course geared towards building a community amongst URM students while also exposing them to the skills and resources they need to succeed in the Ph.D. program at Cornell. Titled “Succeeding in the Graduate Environment,” the course focuses on community building, development of a mentoring relationship between Professor El-Ghazaly and the students as well as among peer students, and discussing important topics ranging from managing the advisor-advisee relationship, overcoming obstacles in research, to applying for graduate fellowships. Last year, Professor El-Ghazaly also initiated a proposal for organizing college-wide recruiting events for prospective URM students, which later took the form of a spring recruiting event, the Diversity Virtual Visit Day for prospective URM students across the College of Engineering. Professor El-Ghazaly also commits a significant amount of time to mentoring young women and students of color in applying for important career-advancement opportunities, including doctoral fellowships, postdoctoral fellowships, and faculty positions. She often maintains her relationship with these students and continues to mentor them long after their direct interactions with her end. Through Professor El-Ghazaly’s close mentorship with students, she hopes to continue to advance diversity, equity, and inclusion at Cornell and more broadly. Neil Lewis Jr. Neil Lewis Jr. , assistant professor in the field of communication, division of general internal medicine, and graduate field of psychology, is committed to advising, mentoring, and advocating for students who are often on the margins of our university and broader society. He directs the Motivation and Goal Pursuit Lab that supports a diverse community of students through every step of their career and professional development as they study how people’s social contexts and identities influence meaning-making, motivation, and behavior and the implications of those processes for (in)equity in education, health, and environmental outcomes. Lewis supports students in the pursuit of their own goals in any way that he can, including mentoring them through their projects, advocating for them at the university and in the profession, and more generally being a resource they can turn to whenever they need anything. Senior Faculty The recipients of the 2021 Senior Faculty Champion Award are Hector Abruña, Corrie Moreau, and Chelsea Specht. Hector Abruña Hector D. Abruña , Emile M. Chamot Professor in the Department of Chemistry and Chemical Biology, is recognized for his indefatigable dedication, throughout his nearly 38-year career at Cornell, to enhancing and promoting diversity, both in recruiting and educating women in the chemical sciences, as well as recruiting, retaining, and mentoring underrepresented minority graduate students, particularly those from his native Puerto Rico. His efforts have had a notable impact on the field of chemistry’s (and more generally Cornell’s) ability to recruit and retain a more diverse student population. Abruña regularly recruits students from colleges and universities in Puerto Rico, including the campuses of the University of Puerto Rico at Rio Piedras (where he was a faculty member from 1982-83 prior to coming to Cornell), Cayey, Humacao, and Mayaguez, as well as to the Pontifical Catholic University of Puerto Rico. Over the last 37 years, he has recruited 25 minority graduate students into the graduate field of chemistry at Cornell University with over a 90% rate of retention and graduation. Of those, 13 have obtained a Ph.D. degree under his direct supervision (from a total of 56 to date) with an additional one currently in his group. To date, 22 women (again, from a total of 56) have obtained a Ph.D. degree under Abruña’s supervision; currently, there are seven female graduate students (in addition to one female undergrad and one female postdoc for a total of nine from a total group of 15) currently in his group. Moreover, 13 of the individuals (including seven women and three minorities) who obtained their Ph.D. degrees under Prof. Abruña’s supervision have gone on to pursue academic careers. Professor Abruña is an internationally recognized figure in the field of electrochemistry. Elected to the National Academy of Sciences in 2018, he has published over 525 papers and presented over 650 invited lectures worldwide. He considers his 56 Ph.D. students and 75 postdoctoral associates, to date, as his most important professional achievement. Corrie Moreau Corrie Moreau , professor of entomology and ecology and evolutionary biology and director and head curator of the Cornell University Insect Collection, is recognized for her significant contributions to advancing diversity, equity, and inclusion across the campus. She strives to make all spaces to which she belongs more inclusive and equitable, including her own lab group, her departments, the campus more widely, and the scientific societies she is a member of. She serves on the diversity, equity, and inclusion committees in both departments for which she is faculty and recently served on the university-wide Anti-racism Working Group committee tasked with coming up with recommendations for an anti-racism class requirement for all students at Cornell. She has also given invited data-driven presentations on the issues of racism and bias in science, technology, engineering, and mathematics (STEM), including actionable solutions to make STEM more equitable and inclusive, across campus and around the world. Professor Moreau also designed and implemented a new seminar course in fall 2019 titled “Diversity, Equity, and Inclusion: The Science Behind Bias”, which attracted undergraduates and graduate students from across colleges and campus. In the course readings/media covered the history of bias in STEM in the USA, current research showing continued racism and bias for many groups in STEM, modern misuses of research reinforcing racism and bias, and advances and solutions to overcome bias as an individual and as a department or institution. This course was very well received and was featured in the Cornell Chronicle and The Cornell Daily Sun. Chelsea Specht Dr. Chelsea Specht is the Barbara McClintock Professor of Plant Biology and the Associate Dean for Diversity and Inclusion for the College of Agriculture and Life Sciences at Cornell University. She is a faculty member in the graduate fields of plant biology and ecology and evolutionary biology and a faculty fellow of the Atkinson Center for a Sustainable Future. Chelsea’s research and teaching focuses on plant diversity and the evolution of plant form and function. She has an active lab with five current graduate students and four postdocs, all of whom engage in innovative research and demonstrate inclusive excellence through their lived experiences, actions, and commitments to fostering a diverse and inclusive academia. Dr. Specht moved from the University of California, Berkeley to join the Cornell faculty in July 2017. At UC Berkeley she was part of a University of California-wide task force on transforming graduate admissions funded by the Mellon Foundation, and with this group developed best practices for holistic graduate admissions that would support inclusive cultures for graduate programs regardless of the field and engage faculty in the process of contributing to admissions policies and mentoring practices that foster a more diverse future faculty. She also worked to establish funding mechanisms for graduate students from marginalized backgrounds to carry out independent research projects that would help to establish their careers as academic researchers, mentors, and professors. As the inaugural Associate Dean for Diversity and Inclusion for the College of Agriculture and Life Sciences at Cornell, Professor Specht has focused on graduate initiatives including working with DGSs across the college to develop inclusive admissions policies and support graduate student well-being and retention through encouraging faculty participation in programs designed to improve mentoring and increase inclusivity in research labs. She meets with graduate students one-on-one or as groups to help identify and abolish practices that are limiting their ability to thrive and developed a workshop to support students and postdocs in writing honest and authentic statements of diversity, equity, and inclusion that highlight their contributions to inclusive excellence as they prepare for future faculty positions. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}