{
  "id": 3,
  "date": "2024-05-18T18:07:21.727814",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/three-minute-thesis/3mt-2022/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Three Minute Thesis 3MT 2022 3MT 2022 Asian Literature, Religion, and Culture Ph.D. Candidate Wins Three Minute Thesis Competition Bruno Shirley’s winning presentation “So, this is a coin from 12 th century Sri Lanka. And, like many coins, it’s inscribed with the name of the monarch who commissioned it,” began Bruno Shirley, a doctoral candidate in Asian literature, religion, and culture at the seventh annual Cornell University Three Minute Thesis (3MT) competition. Alongside seven other finalists, Shirley presented his dissertation research in just three minutes to a panel of judges and a virtual audience from across campus and around the world. Presentations were judged by how clearly and compellingly students summarized their research to a general audience, using only one static slide. His presentation, “Constructing Buddhist kingship in medieval Sri Lanka,” earned him first place and $1,500. Second place and $1,000 was awarded to physics doctoral candidate Vaibhav Sharma for his presentation, “What happens when atoms colder than outer space are spun around?” After nearly 100 audience members cast their ballots, votes were tallied and the People’s Choice Award and $250 were presented to plant pathology and plant-microbe biology doctoral candidate Juliana González-Tobón for her presentation, “Can bacteria smell their food?” For Shirley, whose fieldwork plans were disrupted by the pandemic, entering the 3MT enabled him to reengage with his dissertation research. “These three-minute talks are more than just elevator pitches; the process helped me to really hone-in on what’s most important in my dissertation topic,” he said. “It’s so easy to lose sight of the woods for the trees when we’re deep into dissertation-land, and this was a valuable opportunity to step back and re-orient.” Sharma, while enthusiastic about his research, struggled to articulate it clearly and compellingly to friends and family in the past. Through the 3MT, he learned valuable skills about concisely summarizing his complex research. “Before 3MT, I didn’t believe I could talk about my research in just three minutes. The 3MT preparation stage was an eye-opener for me, and I realized the value of each and every sentence. There was no benefit to adding a single ‘filler’ or useless word. I learned how to cut down on verbosity and explain even difficult concepts in brief and easy to understand language. It will help me in the long run if I write shorter and better papers,” he said. “And now if anyone asks me about my research, I can just give them the link to my 3MT video.” González-Tobón wanted to enter the 3MT since she began her doctoral program and appreciated that this year’s virtual platform allowed for a larger audience. “It was a great opportunity to invite friends and family from around the world. As an international student, being able to invite everyone felt fantastic and was so heart-warming!” she said. “Also, since the finalists were both international and domestic and from several different research areas, it was amazing to see how diverse this community is and how different our expertise areas are.” The 3MT competition was first held in 2008 at the University of Queensland and has since been adopted by over 900 universities in over 85 countries. 3MT challenges research degree students to present a compelling story on their dissertation or thesis and its significance in just three minutes, in language appropriate to a non-specialist audience. Cornell’s Graduate School first hosted a 3MT competition in 2015 and the event has grown steadily since that time. Cornell’s winner will go on to compete in the Northeastern Association of Graduate Schools 3MT competition in late April. “We are so proud of each and every one of our finalists,” said Jan Allen, associate dean for academic and student affairs. “They not only gave excellent presentations, but learned important skills about research communication in the process that will benefit them as they graduate and move into new roles.” Cornell’s seventh 3MT final round competition was held on March 22, 2022, at 4:00 p.m. on Zoom. Spring 2022 3MT Finalists Watch the 2022 Three Minute Thesis competition finale . First Place: Bruno Shirley , Asian literature, religion, and culture doctoral candidate Watch Bruno Shirley’s presentation . Presentation Title: “Constructing Buddhist kingship in medieval Sri Lanka” Special Committee Chair: Anne M. Blackburn Area of Research: Buddhist political thought Biography: Originally from Aotearoa (New Zealand), Bruno is an intellectual historian of medieval South Asian Buddhism, de- and re-constructing ideas about political thought, gender, and devotion. He is interested in theories and methods that challenge our assumption both about “the past” and about possible futures. Favorite Thing About Cornell: The view out over the lake from up in Olin Library. Second Place: Vaibhav Sharma , physics doctoral candidate Watch Vaibhav Sharma’s presentation . Presentation Title: “What happens when atoms colder than outer space are spun around?” Special Committee Chair: Erich Mueller Area of Research: Ultra-cold atoms and quantum information Biography: Vaibhav Sharma is a Ph.D. student in theoretical physics. His research focuses on studying atoms cooled down to almost absolute zero temperatures. Vaibhav does calculations to understand and explain their quantum mechanical behavior. He grew up in Delhi, India. Outside physics, he enjoys playing tennis, traveling to stunning landscapes, and learning to speak Spanish. Favorite Thing About Cornell: The open culture of respect and fostering a free flow of ideas. People’s Choice: Juliana González-Tobón , plant pathology and plant-microbe biology doctoral candidate Watch Juliana González-Tobón’s presentation . Presentation Title: “Can bacteria smell their food?” Special Committee Chair: Melanie Filiatrault Area of Research: Bacterial plant pathogens, host-pathogen molecular interactions, RNA regulation, chemotaxis Biography: Juliana, a Ph.D. candidate at PPPMB, studies bacteria that infect potatoes and how they sense the environment. She is originally from Colombia, a writing/presenting tutor at ELSO, and has created a community in social media to communicate science to the general public, mainly in Spanish, and a support network with tips and challenges about academia. Favorite Thing About Cornell: At Cornell, I feel like I can take on any project I can think of. So many great minds and a supportive community around me every day! Sebastian Diaz Angel, history doctoral candidate Watch Sebastian Diaz Angel’s presentation . Presentation Title: “Nuclear excavations to dam the Amazon, clear the jungles, and prevent Communism (1964-1973)” Special Committee Chair: Raymond B. Craib Area of Research: Latin American history, historical geography, environmental history, map studies, history of technology, Cold War Biography: Sebastian has a B.A. in political science, a B.A. in history, and an M.A. in geography. His dissertation, “Weaponizing the Wilds. Counterinsurgency mappings and the geographical engineering of development in Cold War Latin America,” traces intersecting histories of technology, environment, and politics in the Cold War. Favorite Thing About Cornell: Its diversity. Fernanda Fontenele, mechanical engineering doctoral candidate Watch Fernanda Fontenele’s presentation . Presentation Title: “The tension of a crush” Special Committee Chair : Nikolaos Bouklas Area of Research: Mechanics of composite materials Biography: Fernanda Fontenele joined the field of mechanical and aerospace engineering as a Ph.D. student in 2018. She is studying how composite materials, such as tendons, fail under conditions of overuse and repetitive loading. The ultimate goal of her research is to develop treatment methods and preventive strategies for diseases such as tendinopathy. Favorite Thing About Cornell: Adherence to the motto, “any person…any study.” Shagun Gupta , computational biology doctoral candidate Watch Shagun Gupta’s presentation . Presentation Title: “Sparking joy with LAVA!” Special Committee Chair: Haiyuan Yu Area of Research: Mass spectrometry-based proteomics Biography: Shagun Gupta is a Ph.D. candidate in computational biology. She is working on finding the best ways to accurately quantify signal from noisy datasets produced with mass spectrometers and using structure-based approaches to shed light on the role of proteins in our bodies. In her free time, she can be found reading sci-fi and taking hikes in Ithaca. Favorite Thing About Cornell: The clock tower and its holiday-specific versions! Andrew Legan , neurobiology and behavior doctoral candidate Watch Andrew Legan’s presentation . Presentation Title: “Chemical communication in wasps” Special Committee Chair: Michael Sheehan Area of Research: Insect molecular ecology and evolution Biography: Andrew moved from Nashville, TN to Ithaca in 2016. He is curious about animal behavior and evolution and has focused on studying paper wasps during his graduate studies. In his free time, he enjoys playing soccer and hiking with his dog. Favorite Thing About Cornell: My favorite thing about Cornell is the people. I am lucky to have met so many different curious and kind people during my time in Ithaca! Yanle Lu , civil and environmental engineering doctoral candidate Watch Yanle Lu’s presentation . Presentation Title: “How long can we trust a model prediction?” Special Committee Chair: Qi Li Area of Research: Fluid dynamics, tracer dispersion, and heat transfer in urban environments Biography: Yanle Lu is a Ph.D. candidate in the City-Climate-People lab in civil and environmental engineering. With a focus on urban climate, her research is about the fluid dynamics, tracer dispersion, and heat transfer in urban environments. Her current research topics are the predictability of dispersion in the surface layer over urban environments and the representation of urban land surface in high resolution numerical models. Favorite Thing About Cornell: Beautiful nature! 2022 Final Round 3MT Competition The Three Minute Thesis final competition for 2022 was held virtually on Tuesday, March 22 from 4:00-5:30 p.m. ET. Eight finalists competed for first and second prize in the judging and people’s choice award winner. Three Minute Thesis (3MT®) is an annual competition for doctoral students to develop and showcase their research communication skills, sponsored by the Cornell Graduate School. Preliminary Rounds 2022 Preliminary round registration was open to all current doctoral candidates with research results to present. Preliminary round virtual competitions were held live from March 1-3. Zoom Information sessions were held on the following dates and times. Tuesday, February 1 at 4:00 p.m. Wednesday, February 2 at 12:00 p.m. Friday, February 11 at 4:30 p.m. Tuesday, February 15 at 5:00 p.m. Email grad3mt@cornell.edu with any questions about the Cornell Three Minute Thesis competition. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}