{
  "id": 3,
  "date": "2024-05-18T18:14:52.293968",
  "url": "http://www.cs.cornell.edu/ms",
  "university_name": "Cornell University",
  "title": "Search form",
  "content": "Skip to Content About Diversity, Equity, and Inclusion Values of Inclusion 2020 Antiracism Task Force 2022 DEI  Report News Research News Department Life Awards Listed by Recipient Listed by Category Oral History of Cornell CS CS 40th Anniversary Booklet ABC Book for Computer Science at Cornell by David Gries Books Books by Author Books Chronologically Department Timeline The 60's The 70's The 80's The 90's The 00's The 2010's Job Postings Faculty Positions: Ithaca Faculty Positions: New York City Lecturer Position: Ithaca Post-doc Position: Ithaca Staff/Technical Positions Ugrad Course Staff Ithaca Info Internal info Events Calendar Graduation Information Cornell Learning Machines Seminar Student Colloquium BOOM Spring 2024 Colloquium Conway-Walker Lecture Series Salton 2023 Lecture Series Seminars / Lectures Spring 2024 Artificial Intelligence Seminar Spring 2024 Robotics Seminar Spring 2024 Theory Seminar Big Red Hacks Cornell University - High School Programming Contests 2024 Game Design Initiative CSMore: The Rising Sophomore Summer Program in Computer Science Explore CS Research ACSU Research Night Cornell Junior Theorists' Workshop 2024 Cornell Junior Theorists' Workshop 2023 People Chair Faculty Researchers Staff Ph.D. Students M.Eng. Students M.S. Students Ph.D. Alumni Courses List of Courses Enrollment Exams Course and Room Roster CS Advanced Standing Exam Research Architecture Artificial Intelligence Computational Biology Database Systems Graphics Human Interaction Machine Learning Natural Language Processing Programming Languages Robotics Scientific Computing Security Software Engineering Systems and Networking Theory of Computing Vision Undergraduate Admissions Contact UGrad Office Contact Academic Advisor Your First CS Course CS Major Technical Electives CS with Other Majors/Areas Transfer Credits CS Honors Program CPT for International CS Undergrads Graduation Requirements Useful Forms Electives Becoming a CS Major CS Engineering Requirements CS Arts & Sciences Requirements Graduation Information Minors CS Minor Game Design Minor Career Information Co-op Program Undergrad Research Cornell Bowers CIS Undergraduate Research Experience (BURE) Independent Research (CS 4999) Student Groups UGrad Events Undergraduate Learning Center UGrad Course Staff Info M Eng Admissions The Review Process Early M.Eng Credit Approval Financial Aid FAQ Prerequisites The Application Process Academics The Project FAQ Pre-approved Electives Degree Requirements Current Students FAQ M.Eng Lab MEng Forms The Course Enrollment Process Advising Tips Entrepreneurship Cornell Tech Programs Professional Development Graduation Information Contact MEng Office Career Success MS Admissions Applicant FAQ Current Students Computer Science Graduate Office Hours Exam Scheduling Guidelines Degree Requirements Graduate TA Handbook MS Degree Checklist MS Student Financial Support Special Committee Selection Diversity and Inclusion Graduation Information Contact MS Office PhD Admissions Ph.D. Applicant FAQ Graduate Housing Non-Degree Application Guidelines Ph. D. Visit Day Current Students Computer Science Graduate Office Hours Business Card Policy Cornell Tech Curricular Practical Training Exam Scheduling Guidelines Fellowship Opportunities Field of Computer Science Ph.D. Student Handbook Graduate TA Handbook Field A Exam Summary Form Graduate School Forms Instructor / TA Application Ph.D. Requirements Ph.D. Student Financial Support Special Committee Selection Travel Funding Opportunities Travel Reimbursement Guide The Outside Minor Requirement Diversity and Inclusion Graduation Information CS Graduate Minor Outreach Opportunities Parental Accommodation Policy Special Masters Student Spotlights Contact PhD Office Search form Search Master of Science Degree Program You are here Home Overview The CS MS is a very small, highly selective, four-semester program for students who wish to deepen their knowledge of computer science through advanced coursework, research, writing, and teaching. The program is ideal for self-motivated students who have expository skills, enjoy the research environment, and like working with undergraduates in introductory courses. Students in the program serve as teaching assistants and receive full tuition plus a stipend. Summary of Degree Requirements At least thirty-four credit hours of work is required. Six to twelve credit hours must be associated with thesis research (CS 7999). The remainder of the credit-hour requirement is fulfilled by taking between six and eight graduate-level courses. At least four of these courses must be CS courses at the 5000-level (or higher) and at least one of these must be at the 6000-level. An outside minor is required and that typically involves two or three graduate-level courses. A written thesis and oral presentation are also required. Financial Support Students who are admitted into the program serve as full time teaching assistants (TA’s) during each of the four semesters. This involves a fifteen-hour commitment to TA duties each week. In exchange, the student receives full tuition, a stipend to cover basic living expenses, and health insurance. Summer instructorships, TA-ships, and research assistantships are available but are not guaranteed. Serving as a TA is an integral part of the program. To remain in good standing in the program, students have to be among the top TAs in their assigned courses. TA performance is evaluated at the end of each semester. If you have questions regarding the MS in CS, please first check our FAQ . If you do not find the information you are looking for, feel free to send e-mail to the general information e-mail address cs-ms@cornell.edu Students wishing to earn a Ph.D. should apply directly to the Ph.D. program. All application material must be submitted through the graduate school's online application system. Click HERE to establish an account . About Diversity, Equity, and Inclusion Values of Inclusion 2020 Antiracism Task Force 2022 DEI  Report News Research News Department Life Awards Listed by Recipient Listed by Category Oral History of Cornell CS CS 40th Anniversary Booklet ABC Book for Computer Science at Cornell by David Gries Books Books by Author Books Chronologically Department Timeline The 60's The 70's The 80's The 90's The 00's The 2010's Job Postings Faculty Positions: Ithaca Faculty Positions: New York City Lecturer Position: Ithaca Post-doc Position: Ithaca Staff/Technical Positions Ugrad Course Staff Ithaca Info Internal info Events Calendar Graduation Information Cornell Learning Machines Seminar Student Colloquium BOOM Spring 2024 Colloquium Conway-Walker Lecture Series Salton 2023 Lecture Series Seminars / Lectures Spring 2024 Artificial Intelligence Seminar Spring 2024 Robotics Seminar Spring 2024 Theory Seminar Big Red Hacks Cornell University - High School Programming Contests 2024 Game Design Initiative CSMore: The Rising Sophomore Summer Program in Computer Science Explore CS Research ACSU Research Night Cornell Junior Theorists' Workshop 2024 Cornell Junior Theorists' Workshop 2023 People Chair Faculty Researchers Staff Ph.D. Students M.Eng. Students M.S. Students Ph.D. Alumni Courses List of Courses Enrollment Exams Course and Room Roster CS Advanced Standing Exam Research Architecture Artificial Intelligence Computational Biology Database Systems Graphics Human Interaction Machine Learning Natural Language Processing Programming Languages Robotics Scientific Computing Security Software Engineering Systems and Networking Theory of Computing Vision Undergraduate Admissions Contact UGrad Office Contact Academic Advisor Your First CS Course CS Major Technical Electives CS with Other Majors/Areas Transfer Credits CS Honors Program CPT for International CS Undergrads Graduation Requirements Useful Forms Electives Becoming a CS Major CS Engineering Requirements CS Arts & Sciences Requirements Graduation Information Minors CS Minor Game Design Minor Career Information Co-op Program Undergrad Research Cornell Bowers CIS Undergraduate Research Experience (BURE) Independent Research (CS 4999) Student Groups UGrad Events Undergraduate Learning Center UGrad Course Staff Info M Eng Admissions The Review Process Early M.Eng Credit Approval Financial Aid FAQ Prerequisites The Application Process Academics The Project FAQ Pre-approved Electives Degree Requirements Current Students FAQ M.Eng Lab MEng Forms The Course Enrollment Process Advising Tips Entrepreneurship Cornell Tech Programs Professional Development Graduation Information Contact MEng Office Career Success MS Admissions Applicant FAQ Current Students Computer Science Graduate Office Hours Exam Scheduling Guidelines Degree Requirements Graduate TA Handbook MS Degree Checklist MS Student Financial Support Special Committee Selection Diversity and Inclusion Graduation Information Contact MS Office PhD Admissions Ph.D. Applicant FAQ Graduate Housing Non-Degree Application Guidelines Ph. D. Visit Day Current Students Computer Science Graduate Office Hours Business Card Policy Cornell Tech Curricular Practical Training Exam Scheduling Guidelines Fellowship Opportunities Field of Computer Science Ph.D. Student Handbook Graduate TA Handbook Field A Exam Summary Form Graduate School Forms Instructor / TA Application Ph.D. Requirements Ph.D. Student Financial Support Special Committee Selection Travel Funding Opportunities Travel Reimbursement Guide The Outside Minor Requirement Diversity and Inclusion Graduation Information CS Graduate Minor Outreach Opportunities Parental Accommodation Policy Special Masters Student Spotlights Contact PhD Office NetID Login (internal use only) © 2024                                                    Cornell University 402 Gates Hall, Cornell University, Ithaca, NY 14853 Subscribe on Youtube Follow us on Twitter Like us on Facebook If you have a disability and are having trouble accessing information on this website or need materials in an alternate format, contact web-accessibility@cornell.edu for assistance."
}