{
  "id": 3,
  "date": "2024-05-18T18:08:02.765936",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/prepare-for-your-career/take-action/interviews/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Prepare for Your Career Take Action Interviews Interviews Job interviews are a critical step in the hiring process. If employers invite you to interview, it means they liked what they saw in your resume, CV, letters, research statement, etc. An interview allows you and the employer to meet and assess each other. In an interview, the employer will evaluate your: abilities and skills that match the job requirements. accomplishments. personal attributes. enthusiasm to work for this employer in this position. short- and long-term goals. Interview for Non-Academic Positions To learn more about interviewing for non-academic positions, visit the Career Services website . Interview Types for Academic Positions For some fields, the conference interview is a prerequisite for being invited to campus for an academic position. A conference interview is conducted by someone at a conference. This person may or may not be the person ultimately hiring you. Conference interviews are typically brief (about 30 minutes) but may be longer, so do not schedule interviews back to back. Focus on conveying the important information you want this person to take back to the campus search committee. Also realize that this person may see you throughout the conference and may be observing you. Search Committee Interviews These often are used to select academic candidates and sometimes to make hiring decisions. When interviewing with a search committee, direct your responses to all members of the group. You may begin by making eye contact with the person who asked you the question, but then make eye contact with others as you elaborate. Even if some members of the committee are quiet, they are still evaluating you. To involve everyone in the group, ask questions relevant to each member. One suggestion is to ask members how their position interacts with your position. Academic Mock Interview Questions Why do you especially want to teach at Nameless College or University? How do you see yourself contributing to our department? What have you contributed to your field? What is your research about and how can it be applied? What are its implications? How is it relevant? What do you plan to work on next? What is the cutting edge in your field and how does your work extend it? Can you explain the value of your work to an educated layperson? What is your basic teaching philosophy? What courses would you like to teach if you had your choice? How would you teach them? Tell us how your research has influenced your teaching. In what ways have you been able to bring the insights of your research to your courses at the undergraduate level? We are a service-based state branch university with an enrollment of three zillion student credit hours per semester, most of them in the basic required courses. Everyone, therefore, teaches the service courses. How would you teach 101? Your degree is from Prestige Research University—what makes you think you would like to (or even would know how to) teach in a small liberal arts college? This is a publish or perish institution with very high standards for tenure review—what makes you think you would be able to earn tenure here? Are you connected? (If you were organizing a special symposium or mini-conference on your topic, which scholars could you pick up the phone to call?) How long do you really plan to stay? How does your family feel about moving to ??? If your spouse/partner is not moving, how will you handle the separation? You’ve seen our mission statement. How would you see yourself contributing to our mission and campus atmosphere? Is there anything that you are nervous about being asked? Questions to Ask (and Be Prepared to Answer) During an Academic Interview The following questions have been collected from diverse resources by Kathryn L. Cottingham, assistant professor of biological sciences, Dartmouth College. Dean Big Picture What is the long-term plan for this school/institution? How does this department fit into the long-term plan? What is the outside perception of this department? Strong? Unified? Interactive? Admissions profiles: Undergraduates: Who applies? Who is accepted? Who comes here? Where do they go after graduation? Graduates: Who applies? Who is accepted? Who comes here? Where do they go after graduation? New Faculty Assimilation/Success What sorts of programs are available for new faculty members? Formal mentoring? Orientation? Written faculty handbook? Research What resources are available to initiate student research? Is there support for summer research by undergraduates? Are competitive, within-institution seed grants available? What are the indirect costs of grants? What are the expectations for the summer? On campus? Or is field work OK? Teaching What are typical teaching opportunities, across the college? How much variation is there across departments? Are teaching training opportunities available? What kinds? How often? Can one buy out of teaching obligations? Faculty Review/Tenure What is the schedule and mechanism of faculty review? How much of the department is already tenured? Is there a quota? Who decides tenure and how? Sabbatical Policies Are sabbaticals available? If so, how do they work? Do benefits continue? Details What salary range? How paid? Can grants be used to supplement summer salary? How do raises work? What are the benefits? What retirement plan(s) would be available? What type of health plans are available? Any benefits for tuition for family members? Will they pay moving expenses? Are there resources available to assist spouses in locating jobs? Who insures equipment? Who would I be negotiating with? What is the time frame for making a decision? Department Chair Big picture What is your vision for the department/school? Where is it going in the next five years? Ten? When was the last planning exercise? Can I get a copy? How does this position fit in to that vision? Is the department growing or shrinking? Which subfields? Are there tensions among the subdisciplines? What are current plans for future hires? New Faculty Assimilation/Success What sorts of programs are available for new faculty members? Formal mentoring? Written faculty handbook? Department Administration How big is the department? Is it unified, or split along disciplinary lines? How often does the department meet to discuss departmental business? How are decisions made? How is chairmanship determined? How long is the term? Students What kind of graduate students do you attract? Where do they go once they finish their degrees? Who pays for graduate students? Are there any training grants? Do students have a say in search decisions? Do students have a say in department administration? What interdisciplinary collaborations are already in place? (Are there any training grants, for example.) How many undergraduate majors come through the program each year? Research What is available as “set up” money? Is there department research support available? Of what kinds? Are there vehicles available for field trips/research use? Teaching What administrative support/help is available for working with courses? With grants/papers? What is the teaching expectation through time? How many courses? Which courses? What would this person teach over the next three years? How much flexibility in what an individual teaches? How much flexibility in when courses are scheduled (within a week, within a year)? How big are classes? Are teaching loads weighted by the number of students in the classes? Is there time to prepare the first course? Can I teach a seminar the first semester/quarter? Are TAs available? For what courses? How much funding is there for courses, particularly new ones? How do ideas for new courses get processed? What are the teaching labs like? Are there computer teaching labs? Software? Support personnel? Service What non-teaching expectations are there? What are the “standing” department committees? How does undergraduate advising work? How does graduate advising work? Promotion and Tenure Are there annual reviews before tenure? Who decides on tenure? On what criteria are decisions made? Are the criteria written down and handed out to new faculty? What are the unwritten criteria? What percent succeed? Is there a “tenuring up” policy? Schedule—when do people come up for tenure? What are the criteria for promotion to full professor? Details Can I see the space for this person? How much office space, lab space, offices for graduate students? How long to remodel? Who pays? Ethernet? Networks? Email? Who pays? Reprints? Page charges? IMPORTANT FOR YOUR SANITY: When will a decision be made? When might I be notified? Faculty Members Big Picture What do you like best about this place? What do you like least about this place? What are you looking for in this new position? (want to know: is there agreement? Or are there opposing ideas?) What are hiring priorities for the future? What else does a newcomer need to know? New Faculty Assimilation/Success What sorts of programs are available for new faculty members? when you started? now? What do you wish you’d known? Higher Administration How is the [higher] administration? Rigid? Flexible? Are they fair? Department Administration How often does the department meet? How are decisions made? Do you feel that faculty have an adequate say in day-to-day operations? In major decisions? Graduate and Undergraduate Students How about the students? Are they motivated? What do they do after graduation? What support is available for graduate student research? Enough computers? What support is available for undergrad research? Are work study students available from time to time? Is there travel support? How often? How much? Do all biology majors do research? Do they have to submit a thesis? Are there any curriculum changes in the works? Do grad students with TAs have time to get their own research done? How are most grad students funded? Research What support is available for research? How’s the library? Journal availability? Where do you go for the obscure stuff? Does the administration support travel to scientific meetings? How often? How much? How much equipment sharing is there? Do you feel like this is a congenial environment? How much collaboration is there within the department or college? How much external collaboration is there? Is this supported by the administration? Who does grant bookkeeping? Is there access to mainframe or UNIX-based computers? How much technical support is there for computing? Teaching What do you teach? What is the general teaching expectation through time? How many courses? What would you like this person to teach over the next three years? How much flexibility in what an individual teaches? How much flexibility in when courses are scheduled (within a week, within a year)? How big are classes? Are teaching loads weighted by the number of students in the classes? Can I teach a seminar the first semester/quarter? Are TAs available? For what courses? How are TAs trained? How much funding is there for courses, particularly new ones? Can you buy what you need? How do ideas for new courses get processed? What secretarial help is available for working with courses? With grants/papers? Is this a Mac-based or PC-based department? What are the student computer labs like? Who sets up equipment and washes glassware for teaching labs? Responsibilities/Loads How are administrative committee responsibilities? How about advising? How many minor committees for graduate students? What percent of your time is spent on teaching, research, and service? What is the average class size? What is the average lab size? What is your overall work load? Sabbaticals What is the policy on sabbaticals? Do they have them? When? Are they automatic? How much? Promotion and Tenure Are there annual reviews before tenure? Who decides on tenure? On what criteria are decisions made? Are the criteria written down and handed out to new faculty? What are the unwritten criteria? What percent succeed? Is there a “tenuring up” policy? Schedule—when do people come up? What are the criteria for promotion to full professor? Details How’s the salary? How do raises work? Are the benefits any good? Are they transferable to other schools? What are housing costs? Is good housing available? What’s it like to live here? Where do most people live? In town? Elsewhere? Schools? Crime rate? Cultural events on campus? Locally? Tuition assistance? Opportunities for spouse/partner? How’s the parking? Family leave policies? Maternity coverage? Day care? Who pays for photocopying, phone calls, interlibrary loans, faxes, page charges, reprints? Miscellaneous Questions Salary/Benefits (Ask administration, untenured faculty, or benefits coordinators) How much? Hard money or soft money? What are the fringe benefits like? Health insurance. Who pays? What percentage? How does copay work? Maternity coverage/leave. How long a leave is guaranteed? Sick leave? Retirement plans (TIAA-CREF? How do they do it? Matching? Who pays?) Any mortgage assistance programs? Raises (Ask administration and untenured faculty members) What are the typical ranges? On what criteria are raises granted? Who decides? Living Cost of living: high/low? Housing costs? Start Up How much money for equipment, supplies, and travel as “set up” money? Can the spending be spread over a number of years, say two or three? Summer salary included? How about summer salary for undergraduate and graduate students until grants? Is there seed money available from the college/university? Tenure What’s the schedule—when do people come up? Are there annual reviews before tenure? Who decides on tenure? On what criteria? Are the criteria written down and handed out to new faculty? What percent succeed? Is there a “tenuring up” policy? Graduate Students Big Picture What do you do? Why did you come here? What do you want to do after you finish? What’s the best thing about this department? What could be improved? What’s the best thing about this institution? What could be improved? What do you want from the new person? What skills/courses/seminars could I offer that would be especially helpful to you? Student Life: What’s it like to be a Ph.D. student here? How much camaraderie is there among the students of different professors? How much say do you have in administrative decisions? Job searches? Do students worry about support? How are the TAships? RAs? How many students have their own grants? Do you have enough money to live on? Is there a department social life? Within the grads/postdocs? Department Politics Do the faculty get along? Are there hierarchies? Clear schisms? How do things work day-to-day? Does each professor have their own lab, which works independently of other labs? Or have professors banded together in groups with more shared equipment? What do you hear from faculty about: job satisfaction? department politics? tenure issues? salaries? What do you think about these issues? Courses What’s a typical junior/senior course like? What’s a typical grad course like? Which classes are hard? How much out of class work is there? Is there a lot of variation among different sections of the same course? What’s the grad curriculum, beyond the core courses? Do students take many courses? How do you like having required core courses? What’s this statistics core course like from a student perspective? How big are the classes? Teaching Do you have time to do your own research when you’re teaching? How much teaching does the average student do? Do you get trained? If so, how? Would there be interest in seminars to improve teaching methods? Can you take a more active role in teaching, if you want to? Research Training How many of you had M.S. degrees when you started here? How many of you had research experience as undergrads or as technicians? Do you feel like you’re exposed to sufficient techniques here? Is there support to get training elsewhere if it’s not available here? Do you have enough computers/equipment to get your research done? What do you need that I could buy with startup funds to help the community? Do you have enough time to do your research if you’re also teaching? Details Do alumni come back and tell you about life after graduation? Questions to Prepare to Answer One applicant was given these four topics in advance: Future research plans: what directions do you see your research taking in the next five–10 years? What will be the topic of your first major research proposal as a new faculty member, and where will you submit it? What balance do you anticipate between field research and lab/office-based research? If field work will be important, what field sites would you want to consider in the first few years? Education: Given our curriculum needs within the X group, how will you contribute to the undergraduate and graduate curricula? In particular, what graduate course(s) would you like to teach, and what will be your basic teaching model (e.g. lecture, lecture + lab, discussion, etc.)? Graduate and undergraduate research: How will you engage graduate and undergraduate students in your research program? That is, what style of advising/mentoring will you use? Resources: What critical resources do you need in order to establish a successful research program? What critical resources may already be here? What kind of help would you want from the X group, the department, and the university for you to achieve your goals? From Everham & Smallridge, ESA Bulletin Dec 1994: What is the main point of your dissertation? What are your professional goals? What is your concept of teaching in a four-year college as opposed to a research university? What specific research will you pursue if you are selected? How do you anticipate funding it? How has your experience and training prepared you to teach the courses required? What other courses might you teach? Why do you want this job? Why should we hire YOU? What strengths would you bring to the department? What would you expect from this department and administration? What kind of start-up funds, facilities, and equipment would you need? What experiences or interests do you have in college-wide activities and service? From an underground primer by Peter Kareiva (UW–Seattle) and Dan Doak (UC–Santa Cruz): What research will you be doing when you show up here? What projects will you start next? Why would you want to come here? What teaching would you like to do? What is your philosophy of grad student training? How will you support students? What types of projects do you expect them to work on? What will you contribute to the department that is not already well covered by the faculty? What makes you think you could ever get any outside funding? What is the best idea you ever had? What do you do? (the three to five minute summary of your entire research agenda) Where do you see your work going in the next 10–20 years? From an underground list of questions used by graduate students at the University of Arizona: What kinds of tools would be available in your lab for grad student use? In what areas do you think your work would uniquely contribute to this department? With whom in the department do you envision interacting the most? Outside the department? What meetings do you attend? What societies do you belong to? What do you envision as your ideal lab: # grads, undergrads, postdocs, techs, participation of grads who are not your own students? To what degree do you see integrating grad students into your research program? Is their work usually closely related to your research focus or is it fairly independent? How do you help grad students get started on a project? What’s your perspective on grad student funding? How would you respond to a student who is floundering (early vs. late)? What types of mentoring have you experienced—and what would you do similarly or differently? What courses have you taught before? What do you see as the major challenges of teaching at a large (small) university? What do you want to teach? (grad, undergrad, seminars) Statistics? Questions that Might Catch You Off Guard The illegal questions: spouses, children, etc. For example: Will anything need to be done for your spouse/partner (like find them a job)? Would you take this job if it were offered to you? How would you handle an interpersonal conflict in your lab? What happened in a break-up between two members of the lab who were involved? How to Respond If faced with a potentially discriminatory question during an employment interview, you are under no obligation to provide an answer. Be aware that such questions might be examples of stress questions, and you should be prepared to respond to them. Based on your personal preference and experience, you may choose to answer such questions briefly, but you should understand that volunteering such information may have negative consequences. Understanding the employer’s concern, however, might help you to structure a response. Indirect Response Address the employer’s underlying concern without directly answering the question. If an employer asks a question about your plans for marriage or family, the underlying concern is likely to be your ability to travel or to be at work during business hours, or your commitment to remain with the organization. Although you need not answer the question directly, you might acknowledge the employer’s concern and give assurance that your personal life will not interfere with your career responsibilities. Example: “I understand that you are concerned about my abilities to carry out the responsibilities of this position, and I assure you I will be able to.” Direct Response A more direct but less comfortable response is to mention your concern that the issue has no apparent bearing on your qualifications or ability to do the job. You may ask for clarification of the reason such information is requested or how it relates to the job discussed. Example: “It’s not clear to me why you are asking about this. Can you please explain?” Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}