{
  "id": 3,
  "date": "2024-05-18T18:06:28.977895",
  "url": "https://international.globallearning.cornell.edu/",
  "university_name": "Cornell University",
  "title": "Search Filters:",
  "content": "Skip to main content Search: Submit Search Search Filters: Search This Site Search Cornell International Services Office of Global Learning Main Menu Search Get Advice Subscribe myStatus Home Celebrating 88 years of global learning at Cornell! In 1936, Cornell created the nation’s first university office for international students. We're your home away from home—talk with us about visas and jobs, finding your niche in Ithaca, campus resources, and more. International Services is here to help students and scholars from around the world thrive at Cornell. Get Help Spotlight Protests and Your Rights Do you feel passionate about a cause and want to get involved? As an international visitor in the United States, you have rights to protect you—but also some risks and restrictions when it comes to participating in demonstrations and protests. Learn more » Spotlight Getting Started with OPT Are you a Cornell international student thinking about applying for OPT? We've recently updated our videos outlining the process and steps. Watch the Getting Started video . Spotlight Maintaining Your F/J Status F/J students: It's easy to maintain your legal status at Cornell! Read this reminder about the key things you need to do. Alerts Protect Yourself from Fake Job Offers and Financial Scams! Be cautious about any unsolicited offers you receive for jobs or internships. Cornell students are continuing to receive fraudulent (phishing) emails with these scam offers, and some students have fallen victim. Read more ... Protect Yourself from Scams! Learn how to spot an email or phone scam. If you're a scam victim: find out how to get help fast. See all alerts Events 31 May International Scholars Coffee Hour Time: 10:00am Location: TBD 28 Jun International Scholars Coffee Hour Time: 10:00am Location: TBD See all events Top Tasks Now myStatus Portal COVID Test Status Activation/Students Status Activation/Scholars Apply for a SSN Hire a Researcher Campus Resources Cornell Health Health Resources and Patient Advocates Financial Aid Scholarships, Loans, and Student Jobs Tax Office Foreign National Questionnaire and More Global Operations Global Resources for Faculty and Staff Cornell Library Free Newspapers from 100 Countries Career Services Job Search Help for International Students Global Cornell Cornell China Center Global Hubs Global Operations Mario Einaudi Center for International Studies Migrations: A Global Grand Challenge Office of Global Learning Education Abroad International Services Campus Partners Atkinson Center for Sustainability Center for Teaching Innovation Einhorn Center for Community Engagement International Alumni Language Resource Center Library from Off-Campus Student Experience Initiative Travel Registry Office of Global Learning Part of Global Cornell Cornell University 300 Caldwell Hall Ithaca, NY 14853-2602 USA +1 (607) 255-5243 Find us on: Instagram Contact Us Cornell University © 2024 Privacy Policy | Web Accessibility Help"
}