{
  "id": 3,
  "date": "2024-05-18T18:08:50.120540",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/graduate-diversity-inclusion-awards/2023-graduate-diversity-inclusion-awardees/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Graduate Diversity & Inclusion Awards 2023 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees Exemplary Service Award for Early and Advanced Career Student Early Career Student The recipients of the 2023 Early Career Exemplary Service Award are Cátia Pinas Dombaxe, Gustavo A. Alvarez, Ph.D. Student, Rikki Serafina Laser, and Wicia Fang. Cátia Pinas Dombaxe, Ph.D. Student, Biomedical Engineering Catia Dombaxe is a model for exemplary early career service to the Cornell graduate and professional student communities. Upon arrival to the university, she immediately became engaged in chemistry outreach, graduate inclusion, and peer mentoring for Diversity Programs in Engineering. She created a nurturing environment for student success through the BGPSA faculty coffee hours that increased engagement between graduate students and faculty of color. Catia is also a speaking group facilitatory through the English Language Support Office where she supports a small group of international, multilingual graduate students by meeting weekly discussions about culture, academic interests, and campus life. Not only is she a Big Red Barn & GPSA mentor, Catia also serves on the Graduate Student Life Advisory Council to identify synergistic collaborative activities across organizations to meet the needs of the community. She is a person dedicated to applying her skills to create change in innovative ways to help graduate students succeed at Cornell, making her the perfect candidate for the early career service award. Gustavo A. Alvarez, Ph.D. Student, Mechanical Engineering and Rikki Serafina Laser, Ph.D. Student, Psychology As a team, Gustavo and Rikki have demonstrated an unwavering commitment to fostering a supportive graduate and professional student community at Cornell. For the last two academic years, they have served as the co-chairs of the Multicultural Academic Council and lead the MAC Peer Mentoring Program. In these leadership roles, they have organized, led, and participated in events that help first-year doctoral students manage their transition into and progression in their graduate studies at Cornell. Individually and collectively, Gustavo and Rikki provide guidance to advanced graduate student mentors about best mentoring practices and ensure they are knowledgeable about various resources helpful to them and their mentees. In addition to their service to our broader graduate community as the co-chairs of MAC, Rikke and Gustavo also serve as positive agents of change within their respective graduate programs. Wicia Fang, Ph.D. Student, Psychology Wicia has an excellent track record of service to the graduate and professional student community within and beyond the Psychology department. She is an elected student representative on the department’s Diversity, Equity, and Inclusion Committee where she brings attention to the various challenges experienced by students within the department. In leading the diversity breakfasts during graduate student recruitment weekends, Wicia creates a safe space for current graduate students to share aspects of their identities and experiences creating an open space for admitted students to ask candid questions. Wicia has also designed and implemented a new initiative focused on revealing the hidden curriculum of academia as a means of supporting access and success. Following the philosophy of “you don’t know what you don’t know”, she also co-chairs the Professional Development and Mentorship planning committee to organize events for both undergraduate and graduate students which has only broadened her impact on our community. Advanced Career Student The recipients of the 2023 Advanced Career Exemplary Service Award are Arianna Broad, Christine E. Ohenewah, Karla Yvonne García-Martínez, Kimberly Hochstedler, Ky’ara Daniqua Carr, Maya Martiossyan, and Naya Alexandra Eady. Arianna Broad, Ph.D. Candidate, Biochemistry Molecular and Cell Biology Arianna Broad has demonstrated an extensive track record of exemplary service in and outside of Cornell, by serving as a co-lead peer mentor for the MBG NSF REU, a senior member of the MBG diversity council, a GPSA member representing the graduate field of Biochemistry Molecular and Cell Biology (BMCB), a previous data team lead of Vaccination Conversations with Scientists (VaCS), a chemistry teacher for Upward Bound, the Resident Hall Director (RHD) for the Cornell engineering CURIE Academy, and the lead biological sciences mentor for Lumiere Education. Ari’s dedication to increasing diversity, inclusion, outreach, and student engagement at all levels is extraordinary and far reaching. Christine E. Ohenewah, Law Student Christine Ohenewah has an extensive track record of identifying and addressing inequities, advancing diversity and inclusion, and promoting human rights. Among other activities, she is a three-year member of the Cornell Law Students Association, where she currently serves as the Executive Chair to the Graduate and Professional Student Assembly and is a voting member of GPSA. In her first-year, she compiled a 23-page report to communicate student needs and resolutions to the Law School administration. The report addressed the unique needs and concerns precipitated by the Covid-19 pandemic. Since 2021, Christine has served as a mentor in the Law School’s Diversity Matters Outreach Program, where she leads bi-weekly meeting and outings for Black pre-law students. She is also an Advisory Officer for Corporate Connect, where she mentors 1L and 2L students on strategies and alternate avenues to securing summer-associate positions. This semester, Christine founded a group where she meets weekly with Cornell Black women undergraduates who are interested in applying to law school. Karla Yvonne García-Martínez, Ph.D. Candidate, Biomedical and Biological Sciences Karla Garcia-Martinez has exemplified outstanding service and advocacy within the Cornell graduate and professional student community. As a founding member of the Biomedical and Biological Sciences Diversity & Inclusion Council, she has organized inclusive events and initiatives focused on supporting the success and wellbeing of her peers. Karla’s commitment to mental health advocacy is evident through her establishment of counseling services for PhD students in partnership with Mindwell. Karla’s dedication and tireless efforts have brought positive changes to the College of Veterinary Medicine and the life sciences more broadly. Kimberly Hochstedler, Ph.D. Candidate, Statistics and Data Science Kimberly Hochstedler is a prime example of a graduate student who has provided exemplary service for the Advanced Career Award at Cornell University. As the past president of the Cornell Statistics Graduate Society (SGS) group, Kimberly worked tirelessly to build a stronger graduate student community through peer mentorship and support. She has also served as a Senior Lead Graduate Teaching Fellow, drawing on her extensive experience as a teaching assistant and mentor to advocate for students in her program. As a Teaching Fellow, she collaborates with CTI staff to design and implement teaching workshops, events, and resources to foster teaching excellence, innovation, and networking across the university. Kimberly Hochstedler has been a driving force behind efforts to promote diversity and inclusion within the Cornell community. Ky’ara Daniqua Carr, Ph.D. Candidate, Biochemistry Molecular and Cell Biology Ky’ara has shown unwavering, tireless dedication to advocacy and service as a member of various organizations at Cornell University. As co-lead for Communication and Outreach in the Molecular Biology and Genetics+ Diversity Council, she created platforms for trainees to address concerns and promoted work-life balance. As co-chair, she organized the inaugural Power Hour event focused on mental health awareness. Additionally, Ky’ara played a vital role as the chair of the Adult Panel/Keynote Speaker team for Expanding Your Horizons, showcasing prominent speakers and celebrating women scientists. She actively built community as a member of the CVG-Trainee Executive Committee and provided mentorship through the NIH funded Initiative for Maximizing Student Development. Maya Martiossyan, Ph.D. Candidate, Materials Science and Engineering Maya Martiossyan is a doctoral student in Material Science and Engineering where she has established and conducted annual programming beginning with interdepartmental collaboration to shine a light on severe issues such as the student strike for black lives in 2020. Her actions played a pivotal role in the founding of the Justice, Equity, Diversity, and Inclusion initiative in Materials Science. Through JEDI, Maya directed MSE grad recruitment efforts targeted at historically underrepresented groups, as well as presented findings from the Doctoral Experience Survey and the Graduate Exit Survey to department leadership to show how the department is underperforming compared to other Physical Sciences departments in terms of student welfare/well-being. Additionally, Maya has helped to spearheaded an initiative with her lab group Cape Crystal called REACT to bring K-12 educators to Cornell to learn about the research being done here and further develop their skills so that they in turn could create more inclusive, robust, and diverse classrooms. Maya’s contributions to diversity, equity, and inclusion within and beyond our Cornell community have been nothing short of outstanding. Naya Alexandra Eady, Ph.D. Candidate, Biomedical and Biological Sciences Naya Eady’s tenure at Cornell University has been dedicated to strengthening our broader graduate student community. As co-chair of the Multicultural Academic Council (MAC), she transformed the organization into a peer-to-peer mentoring platform, providing vital support and training to new students. Naya’s leadership recognized the challenges of graduate education and implemented safeguards to ensure ongoing support. She also played a pivotal role as a founding member of the Biomedical and Biological Sciences Diversity and Inclusion Council, advocating for reflection, improved services, and equitable practices. Additionally, Naya co-led the Thrive Seminar Series, addressing important topics such as microaggressions, bias, and self-love. Her kind and thoughtful approach has significantly impacted graduate student experiences within and beyond STEM. Excellence in Leadership Award The recipients of the 2023 Excellence in Leadership Award are Alaa R. Farghli, Alexandra Khlyustova, Chloe Cheng, Jennifer Houtz, and Kara Zielinski. Alaa R. Farghli, Ph.D. Candidate, Genetics, Genomics, and Development Alaa Farghli is an exceptional community champion. He founded the Arab Graduate Student Association, serves as the OISE Graduate Coordinator for Community Engagement, and organizes and attends campus events as a Dean’s Scholar. He was a founding member of the MBG Diversity Council and has recurringly participated in GRASSHOPPR and EYH event. To Alaa, these positions are not discrete; community is holistic and the enthusiasm, love, and openness that he brings to these roles are as essential in everyday interactions as they are when he speaks at a podium. Alaa’s greatest strength lies in his ability to energize those around him, to build community no matter the size through his earnest commitment to inclusion. For example, when Alaa first founded the Arab Graduate Student Association there were only 13 members. Attendance at events was regularly in the single digits. In a context like Cornell, and for a racial-ethnic group that is generally underrepresented in elite spaces and especially so within the Ivy Leagues, it’s easy to be demoralized. Alaa understands that there is strength in every form and scale of representation. His attitude, consistent positivity, and endurance allowed AGSA to thrive. In a space where numbers are often the most valued justification for inclusion, Alaa has actively worked to engage with diversity at every level. Unfortunately for us, Alaa will be graduating soon. While his absence in the Cornell community will be greatly felt and we can honor his work by presenting him with the excellence in leadership award. Alexandra Khlyustova, Ph.D. Candidate, Chemical and Biomolecular Engineering Alexandra is a PhD candidate in chemical and biomolecular engineering and the current leader of CBE Women, a graduate student organization aimed at promoting gender equity within STEM and advocating for women within and beyond the CBE department. Alexandra is also a fourth year Big Red Barn fellow who has made significant contribution by leading and co-leading to programming in support of our broader graduate and professional student community. As the wellness fellow, Alex hosted virtual and in person events to offer opportunities for grad students to reflect on their wellness and combat loneliness due to Covid isolation. Alexandra’s nominator shared, “As a leader, Alexandra is the rare combination of being extremely prepared and spearheading and managing the work, while also allowing other members independence and freedom. Her leadership skills are exceptional, and she has made outstanding contributions to the department and the broader community as a whole.” Chloe Cheng, Ph.D. Candidate, Biomedical and Biological Sciences Chloe Cheng serves as the President of the Biomedical & Biological Sciences Graduate Student Society (BBS GSS). In this role, she has exhibited exceptional leadership skills and positively impacted the BBS PhD program. This is especially exemplified through her leadership in the BBS-specific Empathy, Assistance and Referral Service. Additionally, she has improved processes, increased productivity, and documented group initiatives for future leaders. Chloe’s dedication and contributions have significantly enhanced the connections and experiences of graduate students in BBS and the life sciences more broadly. Her leadership in professional development workshops, diversity and inclusion efforts, and trainee executive committee activities further demonstrate her outstanding leadership capabilities. Chloe has demonstrated excellence in leadership through her remarkable contributions to enhancing the experiences of graduate and professional students. Jennifer Houtz, Ph.D. Candidate, Ecology and Evolutionary Biology Jennifer Houtz is a PhD candidate in Ecology and Evolutionary Biology who recently completed her B exam. She is an exceptional leader with a strong commitment to Diversity, Equity, Inclusion, Justice, and Belonging (DEIJB). As co-president of Cornell’s First-Generation and Low-Income Graduate Student Organization (FIGLI), Jenn connects students and allies, providing valuable resources and fostering community. She also played a vital role in expanding Consider Cornell, a program that demystifies graduate education and mentors prospective students through the graduate admissions process. Jenn’s efforts as a Graduate Student Ambassador, member of various committees, and reviewer for the National Science Foundation demonstrate her dedication to graduate student success. She also engages in national and international societies, serving in leadership positions and organizing career-focused workshops. Additionally, Jenn mentors undergraduate researchers, facilitates outreach programs and contributes significantly to preparing undergraduates for future careers. Her commitment to access, equity, and inclusion within the academy at every level is exceptional. Kara Zielinski, Ph.D. Candidate, Biophysics Kara Zielinski has been an exceptional leader in promoting diversity, equity, and inclusion (DEI) within the MBG+ community and the Graduate Fields of BMCB, GGD, and Biophysics at Cornell. As Chair of the MBG+ Diversity Council, she has advocated for resources and developed impactful tools to foster inclusion and support the well-being of trainees and faculty. Kara has also been an active member of the MBG Diversity Committee, spearheading community-building events, student activities during recruitment, and initiatives addressing knowledge privilege. Her dedication and organizational skills have had an enormous impact on the department and the broader life sciences community at Cornell. Social Justice Award The recipients of the 2023 Social Justice Award are Claire Sandman Malcomb, Dyese R. Matthews, Héctor G. Loyola Irizarry and Jawuanna McAllister. Claire Sandman Malcomb, Ph.D. Student, Organizational Behavior As a PhD student in the department of Organizational Behavior within the field of Industrial and Labor Relations, Claire has spent her career-to-date focusing on research centered around the importance of inclusive workplaces, allyship behavior within organizations, stigma and discrimination, and diversity, equity, and inclusion in the workplace. Over the past year, Claire has connected broadly with the Cornell community to share her DEI related research in a variety of ways, such as presenting her work as part of the Building Allyship Series and presenting at the Spring 2023 ILR Student Experience Team meeting.  Claire also engages closely with the ILR undergraduate population and has made instrumental contributions to pedological developments in DEI for the benefit of students at all levels. Dyese R. Matthews, Ph.D. Candidate, Fiber Science and Apparel Design Dyese Matthews is passionate about promoting equity and addressing fashion-related inequalities. She curated an exhibition focused on Black women’s styles, social justice, and activism on college campuses. Presently, she is working on another exhibition at Cornell, scheduled for May 2024, which will highlight Black women’s style and memory work in Harlem. Matthews’ work examines how middle-aged and elderly Black women in Harlem use fashion as a tool for activism and empowerment. Dyse has also organized a community-focused workshop on social justice “art-ivism” through the Social Justice Sewing Academy. She is a member of the Human Ecology Promoting Justice and Equity Committee and the Costume Society of America’s Diversity, Equity, Accessibility, and Belonging Committee. Her commitment to identifying and addressing inequities in fashion and beyond is extraordinary. Héctor G. Loyola Irizarry, Ph.D. Candidate, Biomedical and Biological Sciences Hector Loyola Irizarry has demonstrated a strong commitment to addressing inequities, promoting diversity and inclusion, and creating avenues of access within and beyond Cornell. As one of the founders of the BBS D&I council, he has spearheaded initiatives such as student speaking events, journal clubs, and workshops to foster discussions about diversity and inclusion. Recognizing inequities in the support systems and mentoring available to graduate students, Hector developed a course to support all graduate students in preparing for the A-Exam. Hector has also organized and contributed to supply drives in Puerto Rico in response to the devastation caused by natural disasters. Additionally, he serves as a STEM mentor and volunteer in science outreach programs. Though his many service activities, Hector consistently and tirelessly advocates for a more just and equitable community in STEM and beyond. Jawuanna McAllister, Ph.D. Candidate, Biochemistry Molecular and Cell Biology Jawuanna is engaged in several social justice-oriented service and leadership activities. She has played a crucial role in the recruitment efforts of the MBG+ Diversity Council, and has coordinated MBG-specific programming for the Consider Cornell program. She has also led aspects of the MBG recruitment weekends, contributed to faculty searches, and has facilitated sharing of journeys through science. Jawuanna also initiated a program to connect incoming students with safe housing options by personally vetting apartment listings. Jawuanna’s contributions extend beyond MBG as she started the Weill Institute Diversity Council, serves as co-president of BGPSA, is an organizing member of the Building Allyship Series committee. She also serves as the new BMCB student representative on the MBG Departmental DEI committee and is exploring new ways to assess the outcomes of past DEI efforts. Community Outreach Award The recipients of the 2023 Community Outreach Individual Award are Camille M. Holmes, Caroline Steingard, and Dahae Julia Jun. Camille M. Holmes, Ph.D. Candidate, Biomedical and Biological Sciences As a dedicated STEM advocate, Camille Holmes has made a profound impact on the Ithaca community. Through her innovative outreach initiatives, she has inspired a new generation of scientists. As a peer mentor coordinator, she creates inclusive events for graduate students, fostering a supportive community. Camille’s commitment extends to K-12 students, where she has developed interactive biology programs, captivating young minds with topics like immunology and genetics. Her passion for science and her tireless outreach efforts have undoubtedly strengthened the community’s curiosity and enthusiasm for scientific research. Caroline Steingard, Ph.D. Candidate, Microbiology Caroline Steingard founded and manages “Write a Researcher,” a Cornell club that connects middle and high school students predominately from underprivileged backgrounds with Cornell faculty and students in a pen pal format. Participants discuss STEM research, career guidance, and the accessibility of STEM careers. In its second year, the program has over 400 participants from the U.S., Canada, Mexico, France, and Taiwan. Caroline manages all aspects of the program, from organizing pen pals to maintaining compliance materials and promoting the program to high school students and teachers. Participants have expressed increased interest in STEM careers and higher education, and Caroline arranged for all high school participants to have their Cornell application fees waived, removing a barrier in access to higher education. Caroline recently published an article on the “Write a Researcher” program in the Journal of Microbiology & Biology Education to encourage similar outreach programs at other universities. Dahae Julia Jun, Ph.D. Candidate, Psychology Julia Jun has played a critical role in creating and leading the BRIDGE mentoring program for undocumented/DACA students at Cornell University. She developed the program’s structure and acts as its primary coordinator, ensuring that students receive the support and guidance they need throughout their academic journey. In addition to this program, Julia organizes regular community-building events and holds one-on-one meetings with students who require additional mentoring. Furthermore, Julia is a leading advocate for graduate student inclusion and well-being in the Psychology department, where she leads monthly graduate student and faculty meetings and organizes outreach activities. Through her efforts, Julia has made a significant impact on the lives of many students, providing them with a sense of belonging and support. Her passion and commitment to diversity, inclusion, and student engagement make her a deserving candidate for this recognition. The recipients of the 2023 Community Outreach Organizational Award are GRASSHOPR  and Vaccination Conversations with Scientists (VaCS). GRASSHOPR GRASSHOPR, the Graduate Student School Outreach Program, is a remarkable initiative that for over three decades, has connected Cornell graduate students with K-12 classrooms, offering mini-courses that ignite curiosity and foster mentorship. This year, with the participation of 100 dedicated graduate student fellows, GRASSHOPR reached 35 schools and impacted over 1,000 students. By bringing science to local schools, GRASSHOPR has built a strong community partnership and enriched the lives of countless young learners. Moreover, their collaboration with other outreach groups demonstrates their commitment to expanding their impact. Vaccination Conversations with Scientists (VaCS) Vaccination Conversations with Scientists (VaCS) is a collaboration between eight county health departments and Cornell Advancing Science and Policy, supported by the Provost’s Office. Over 100 volunteers engage with the community to address vaccine safety and COVID-19 concerns, including those with vaccine hesitancy or opposing views. VaCS has conducted phone-banking, tabling, canvassing, and information sessions. Through this work and subsequent feedback, they found that 29% of conversations with unvaccinated individuals increased their likelihood of vaccination. VaCS trains volunteers of all backgrounds, providing over 30 activities per semester, to improve the lives of people in the community through vaccine outreach. VaCS has adapted to new CDC guidance and viral variants, assembling many resources. The group’s commitment, drive, and energy to reach communities affected by the pandemic is fueled by the disproportionate impact on people of color and lower socio-economic backgrounds. VaCS’ impactful efforts make them a deserving recipient of recognition. Unsung Hero Award The recipients of the 2023 Unsung Hero Award Jeannine Crouse Hagadorn and Araceli Lucio-Forster. Jeannine Crouse Hagadorn, Graduate Field Assistant, Economics Jeannine Hagadorn serves as the Graduate Field Coordinator for the Economics department at Cornell. As a GFA, Jeannine goes above and beyond to ensure that students have the resources and support they need to thrive in their academic and personal lives. Jeannine has an unwavering dedication to promoting a sense of community and belonging among graduate students in the department, especially through her support in the operations of Graduate Student Association for Economics (GSAFE). Jeannine’s nominator wrote that when they expressed their struggles with sense of belonging and well-being in the program Jeannine was quick to offer them support and guidance. Jeanine provided them with resources and a confidential safe space, which together made a significant difference in their experiences as a graduate student. According to this nominator, Jeannine embodies the qualities of an Unsung Hero through her tireless efforts to support graduate students in the Economics department at Cornell University. Araceli Lucio-Forster, Lecturer, Microbiology and Immunology Dr. Araceli Lucio-Forster is a lecturer in the Department of Microbiology and Immunology and has worked tirelessly to promote diversity and inclusion for those around her. She serves as the DEI committee departmental lead for Microbiology and Immunology, and is also a member of the domain oversight group committee addressing curriculum design to implement competencies related to racial justice, diversity, equity, inclusion, and wellbeing in the College of Veterinary Medicine. Dr. Lucio-Forster commitment to fostering an inclusive community reaches beyond just Cornell, as she is also a founder of the DEI committee for the American Association of Veterinary Parasitologists (AAVP). This role has resulted in redefining AAVP documents related to policies concerning codes of conduct, anti-harassment, discrimination, and whistleblower policies. According to Lucio-Forster’s nominator, “Araceli’s talent for building accepting and positive communities within the veterinary college stems from her caring, patient, and open-minded attitude. Araceli is truly a champion of diversity and inclusion not only in the veterinary college, but throughout the nation, where her far-reaching implementations of DEI initiatives has positively impacted the lives of so many people, many of whom do not know who to thank for the feeling of acceptance and protection they feel when going to school, work, or traveling for a conference.” Faculty Champion Awards for Junior & Senior Faculty Junior Faculty The recipients of the 2023 Junior Faculty Champion Award are Heather Feaga, Julia Dshemuchadse, and Karen Jaime. Heather Feaga, Assistant Professor of Microbiology Dr. Heather Feaga demonstrates the qualities deserving of the Faculty Champion Award in so many ways: being among the first in a wave of new faculty members hired into the Microbiology Department, she projects a spirit of promise and optimism with an eye for short, middle, and long-term plans. She has been a pivotal director of departmental community building, most notably founding the weekly “community hour” that provides students an opportunity to snack, destress, and converse – three activities integral to any graduate student experience. She volunteered her time to Graduate Women in Science by speaking on our faculty panel that focused on self-advocacy and “being heard” in STEM. She maintains an open door policy-keeping the doors to her office open as much as possible to encourage anyone at anytime to pop in for a chat and ask questions. Her willingness to be transparent about the challenges and obstacles she has overcome in her pathway through academia has been incredibly insightful for numerous students. Dr. Feaga goes far above and beyond in mentoring efforts in support of all the graduate students in Microbiology and has been an influential and positive force within our community. Julia Dshemuchadse, Assistant Professor of Materials Science and Engineering Dr. Julia Dshemuchadse came to Cornell ready to make change. In addition to her research and teaching endeavors, she has started several organizations advancing equity and outreach, including helping found the REACT educational workshop and being the faculty sponsor for the new MSE Justice, Equity, Diversity, & Inclusion organization. She works tirelessly to support MSE graduate students in this role as well as engaging in a range of activities that embody JEDI values, such as organizing Wikipedia Edit-a-thons to teaching in the Cornell Prison Education Program. Dr. Dshemuchadse has supported the students in advocating for themselves and for advancing inclusion in the department. Beyond her work with official organizations, Julia is attentive to her students and makes everyone feel included. She is fully committed to enacting real change in higher education from the admissions processes to mentoring. Karen Jaime, Assistant Professor of Performing and Media Arts Karen Jaime is an Assistant Professor of Performing and Media Arts and Latina/o Studies. Dr. Jaime has twice served as Interim Faculty Director of Cornell’s Mellon Mays Fellowship Program, a program designed to address, over time, the problem of underrepresentation in the academy at the level of college and university faculties. Her mentorship and teaching have been crucial in training and supporting future generations of scholars and colleagues, and has been significant for students who have otherwise been marginalized. In the words of one of her nominators: “As an instructor, Karen has grounded my work in a way no other professor has been able to do. Her courses bring to the forefront cutting-edge scholarship and minoritarian texts so rarely given attention in academia. I cannot put into words what it means to me as a queer of color scholar to be able to engage with works, theory, and class discussion that tells of my scholarship, my passions, and (vitally) my life.” Moreover, as a mentor, Dr. Jaime is extremely committed to her advisees, mentoring them through challenging circumstances and helping them to remain on a forward path. Senior Faculty The recipients of the 2023 Senior Faculty Champion Award are Caroline Yancey and Michelle Duguid. Caroline Yancey, Associate Professor of Practice, Public and Ecosystem Health, and Associate Dean of International Programs, College of Veterinary Medicine Dr. Caroline Yancey is a dedicated educator, mentor, and advocate for diversity, equity, and inclusion. Her exceptional leadership and outreach skills have created a learning environment that prioritizes student experiences. As the Associate Dean of International Programs, she champions curriculum changes, secures opportunities for community-engaged projects, and provides outreach and leadership that supports diverse student experiences. Dr. Yancey is also a faculty mentor for the Cornell University Remote Area Medical Club, providing medical support to remote communities. One of Dr. Yancey’s nominators praised her for her support when they proposed a capstone project to increase cultural competence among veterinarians about Latinx communities. This nominator wrote “Dr. Yancey supported my vision and provided guidance that helped me create a product I am extremely proud of; I would not have gotten there without her help. Dr. Yancey is the kind of person who when she hears about an opportunity that is perfect for a specific student’s area of interest, takes it upon herself to connect that student to these opportunities, often without being prompted to do so. I know she does this because she genuinely cares about her students, especially those from underrepresented backgrounds. I believe she is the perfect candidate to receive this faculty champion award.” Michelle Duguid, Associate Professor of Management and Organizations, and Associate Dean of Diversity, Inclusion and Belonging, Johnson College of Business Michelle Duguid is a faculty member and associate Dean for Diversity, Inclusion, and Belonging in the College of Business where her leadership has been transformational. Dr. Duguid established the Leadership Council on Combating Racism and leads initiatives like Student Allies for Gender Equity. Additionally, she serves as the faculty advisor for Student Allies for Gender Equity (SAGE) and actively contributes to advisory councils and committees focused on faculty development and diversity. Her impactful teaching and mentorship empower MBA and PhD students. Dr. Duguid’s dedication extends to facilitating workshops, moderating discussions, and driving the DEI Business Leadership Summit. Her efforts create inclusive environments and foster continuous improvement. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}