{
  "id": 3,
  "date": "2024-05-18T18:06:31.737802",
  "url": "https://elso.as.cornell.edu/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Jump to main navigation Jump to section navigation Jump to main content Cornell University Department Homepage About ELSO Info Sessions Faculty, Staff and Tutors ELSO Listserv Opportunities Give to ELSO GAI Statement Courses and Programs Courses Workshop Series Speaking Groups Program Summer Writing Support Tutoring Tutoring on Writing and Presenting Tutoring on Pronunciation Resources Additional Writing Support Additional English Language Support Support for Faculty Writing and GAI Open search Open nav Search for: Empowering multilingual and international graduate and professional students to be successful English Language Support Office A division of the Knight Institute for Writing in the Disciplines, ELSO's mission is to offer writing and speaking support to multilingual and international graduate and professional students that meets the needs of students in diverse programs, from diverse linguistic backgrounds, and at diverse points in their graduate careers. ELSO Links Courses Tutoring Workshop Series Speaking Groups Program Summer Writing Support Open Hours and Contact Information Faculty Support Give to ELSO Knight Institute website 2024 Peer-Tutor Writing Center Conference ELSO News 2024 Write Together at Home Program: Summer Writing Support for Postgraduates 5/01/2024 The summer Write Together at Home Program will be running again this year! The Write Together at Home Program provides graduate students, professional students, and postdocs with community, structure, and resources to support their writing. This fully online program is designed to help you establish... Read more ELSO Info Session for DGSs and GFAs 4/16/2024 DGSs and GFAs are warmly invited to join ELSO faculty on Friday, April 26, 1:00-2:00 EDT via Zoom to learn more about ELSO services that are available to multilingual graduate and professional students. Read more ELSO Spring Break Tutoring Hours 3/28/2024 ELSO's Writing and Presenting Tutoring service will run through Spring Break! The Pronunciation service will be closed March 31-April 7. Read more ELSO Senior Lecturer Melissa Myers Recognized with Innovative Teaching Award 3/06/2024 ELSO Senior Lecturer Melissa Myers was recognized with an Innovative Teaching Award Honorable Mention for “Creative Responses to Generative AI.” Read more Sign-up for the Spring 24 Speaking Groups Program! 2/12/2024 Sign-ups for the SP24 ELSO Speaking Groups Program are open! Read more 2024 Peer-Tutor Writing Center Conference 4/11/2024 ELSO, in conjunction with the John S. Knight Institute, is hosting a Peer-Tutor Writing Center Conference Sunday, April 21, 2024 10:00-4:00 pm in Biotech G10. Read more ELSO Tutoring is Now Open! 1/29/2024 Spring 2024 ELSO tutoring is now open Read more 2024 Peer-Tutor Writing Center Conference 12/08/2023 ELSO and the John S. Knight Institute will be hosting a Peer-Tutor Writing Center Conference in April 2024. Read more More News ELSO Goals Our goals are for multilingual and international graduate and professional students to: value multilingualism, seeing it as a resource and point of pride be a part of and have a voice in the Cornell community and larger academic or professional community create community with multilingual and international graduate and professional students across fields engage in cross-cultural communication Fall 2024 ELSO Info Sessions New to Cornell? Have questions about ELSO programs? You are invited to attend an ELSO Info Session. During these online events, ELSO faculty will provide an overview of ELSO programs and answer your questions.  Zoom links will be provided through the ELSO listserv. ELSO Info Session Schedule: Friday, August 16, 4:00-5:00 pm EST Tuesday, August 20, 9:00-10:00 am EST Friday, August 23, 2:00-3:00 pm EST A Video Orientation to ELSO with Director, Michelle Crow 260 Caldwell Hall Ithaca, NY 14853 United States Email\n\t\t\t\t\tELSO Facebook Cornell University The College of Arts & Sciences Website Accessibility Privacy Policy Equal Education & Employment Emergency Information Land Acknowledgment © 2023 College of Arts & Sciences Top"
}