{
  "id": 3,
  "date": "2024-05-18T18:11:05.169357",
  "url": "https://gradschool.cornell.edu/academic-progress/requirements/student-progress-review/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Academic Progress Requirements Student Progress Review Student Progress Review The Student Progress Review (SPR) is an interactive process intended to support the regular exchange of constructive, written feedback between advisees and advisors. It codifies a process for research degree students and their special committees to have at least one formal conversation per year about academic progress and future plans. In academic disciplines where students are encouraged or required to complete an Individual Development Plan (IDP), the SPR process can help fulfill this need. Using the SPR form, students are asked to reflect on their recent accomplishments, identify challenges, and set goals. Committee chairs then review their students’ SPR forms and enter constructive feedback. Chairs indicate whether progress has been excellent, satisfactory, needs improvement, or is unsatisfactory. Feedback that is documented on the SPR will be made available to the student, all members of the student’s special committee, and the DGS/GFA of the student’s field. SPR Form Information SPR Form Tips for Students (PDF) SPR Form Tips for Faculty (PDF) Log into your SPR Forms Portal (for students and faculty approvers) to see forms history and forms awaiting your approval. Overview of the SPR Process Step 1: The deadline for students to complete the SPR is April 1. Each graduate field sets its own timing and annual due dates for the SPR process; fields send students instructions and a link to the SPR form at the appropriate time. Step 2: Student schedules the SPR meeting with their advisor/chair (some fields may expect that this occur in conjunction with a meeting of the special committee). Step 3: Student completes their portion of the SPR form. Depending on the field’s practices, the student may submit the form at this point or download a draft version to share with their chair and other special committee members prior to submitting the form through the online system. Step 4: SPR face-to-face dialog. Step 5: If the student saved their SPR form as a draft, they may edit the form after meeting with their chair and/or special committee. Upon submission by the student, the form is routed to the special committee chair (after this point the student cannot edit the SPR form unless it is returned to them by their chair). Step 6: The special committee chair enters written comments and evaluates student progress. Depending on the field’s practices, the chair may incorporate feedback provided by other members of the special committee and graduate field. Step 7: Contents of the form will be available to the student, the student’s special committee, DGS, and GFA. Frequently Asked Questions Who is required to complete a SPR? All M.A., M.S., and doctoral students in who are in the second year of their program or beyond must complete a SPR form each academic year. Students on leave of absence are excluded from this requirement. What is the deadline to complete the SPR? While the Graduate School simply requires that a SPR be completed once each academic year, each graduate field sets its own timeline for students and faculty to complete the SPR. The deadline for students to complete the SPR is April 1. To confirm when the SPR is due for your field please contact your GFA or DGS. How long will it take to fill out the SPR form? For most students it should not be difficult or time-consuming to complete the self-reflection and goal-setting portions of the SPR process. If you run into difficulties or have questions it may be helpful to discuss these with your advisor. The online form allows you to save your responses and return later. Some of the questions on the SPR don't seem relevant to me. What should I do? While most questions on the SPR form will be generally applicable to students across a range of fields and academic disciplines, some questions might not apply to your specific situation. It’s perfectly acceptable to note that a question is “Not Applicable,” or to contact your advisor or GFA for more specific instructions. Can a student share a draft of the SPR form with their chair/committee prior to electronically signing and submitting the finished form? Yes; students may save their SPR form as a draft (without submitting) to download and share with their chair and/or special committee via email. They may then return to the online form and edit it before electronically signing and submitting it. See the “SPR Form Tips for Students” (top of this page) for detailed instructions. Who will see content of the completed SPR form? The purpose of the SPR form is to document, in writing, a conversation that should be happening between students and their mentors, so the primary audience of the competed form is, of course, the student and the special committee. Graduate fields provide support and oversight to this advising relationship so the DGS and the GFA will also have access to completed forms. The final SPR, with comments from both the student and advisor, will be added to the student’s file. Staff of the Graduate School will not regularly review SPRs but may contact students who receive ratings of “needs improvement” or “unsatisfactory” to help develop support plans. Is a SPR needed if students and their advisors already communicate on a regular basis? Most faculty advisors strive to provide regular, thoughtful feedback. However, the Graduate School has frequently heard that students expect more structured feedback in writing. This is especially important for establishing shared and agreed-upon expectations, for overcoming information that may be incorrect or misunderstood, and for when problems arise. Additionally, research suggests that “formal annual evaluations tend to increase the numbers of students who complete, and are therefore preferable to sporadic and informal reviews . . . Some form of progress-tracking, annually or each semester, allows the student and supervisor to meet and establish objectives for the year. This ensures that both students and advisors be held accountable for timely progress and for constructive feedback” (Council of Graduate Schools, Ph.D. Completion and Attrition). In the SPR process, what is the role of the special committee chair? It is expected that chairs will meet in person with their students to discuss the SPR (some fields may expect that this occur in conjunction with a meeting of the special committee). The SPR meeting provides an opportunity to discuss the student’s overall progress, provide feedback, clarify expectations, and establish shared objectives for the year. When a student electronically signs and submits the form, it is routed to their chair. After the form is submitted by the student, they are not able to make edits unless the form is returned to them by the chair using the “reject” function in the online system. Chairs are expected to complete the faculty feedback section of the form after meeting with the student. Depending on the field’s practices, the chair may also incorporate feedback from the special committee. Core questions in the faculty feedback section ask for written comments about each student’s demonstrated strength and weaknesses, as well as an overall evaluation of the student’s progress. After reviewing a student’s entries, how can the advisor/chair return the SPR form to the student for further editing? The advisor/chair may use the “return” button at the bottom of the SPR form page to send the SPR form back to the student for revisions. The chair will have the opportunity to include a message to the student (e.g., “Please revise goals for the coming year and resubmit”). What categories are used by faculty to evaluate student's overall progress? Excellent – Exceeds expectations overall; progress and performance are exceptional in one or more areas. Satisfactory – Reliably meeting expectations for academic progress and performance; planning and goal setting is realistic and appropriate. Most students who are meeting the requirements of their program, making good progress, and developing and acting on thoughtful plans and goals should be assigned this rating. Needs improvement – Academic progress and performance are not consistently of the quality needed to meet expectations. This is a signal that some changes are required to get on track for successful completion of the degree. Obstacles and challenges must be addressed through appropriate planning, goal setting, and follow-through. Sometimes a short-term disruption or setback can slow progress, but such challenges can usually be overcome with careful planning and targeted support. It’s important that students and committees develop a plan, make needed adjustments, and check-in with each other frequently. This rating should serve as a clear communication to the student that improvement is needed, and to the special committee and graduate field that monitoring and support will be needed. The Graduate School will contact the graduate field, special committee chair, and student to share information about helpful resources and best practices for developing actionable improvement plans. Unsatisfactory – Academic progress has stalled and performance is below expectations. This rating indicates that the student has made little or no academic progress in the preceding one or two semesters to the extent that lack of progress endangers their ability to complete their degree in an appropriate timeframe. Students who are rated as “unsatisfactory” are not considered to be in good academic standing with the Graduate School and may be ineligible for fellowship or assistantship support until they return to good standing. The Graduate School will require that students develop a detailed improvement plan with clear timeframes in coordination with their special committee and graduate field. The Graduate School will contact the graduate field, special committee, and student with a message noting that the student is not considered to be in good academic standing. The student will be required to submit for Graduate School approval their improvement plan and a timeline for returning to good standing, developed with input from the special committee chair. The Graduate School will enforce the terms of this plan. If the terms are not met, the student may be withdrawn from their Cornell graduate program. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}