{
  "id": 3,
  "date": "2024-05-18T18:10:28.553519",
  "url": "https://gradschool.cornell.edu/academic-progress/thesis-dissertation/writing-your-thesis-dissertation/fair-use-copyright-patent-and-publishing-options/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Academic Progress Thesis & Dissertation Writing from A to B Fair Use, Copyright, Patent, and Publishing Options Fair Use, Copyright, Patent, and Publishing Options Is information that you plan to include from others considered “fair use” and are you acknowledging these sources correctly? Embargo of online copies Creative Commons license Has a patent application been filed (or will one be) on the basis of your thesis or dissertation research? Register for copyright? Supplementary materials Make your work discoverable on search engines? Make your work accessible to people with visual disabilities 1. Is information that you plan to include from others considered “fair use” and are you acknowledging these sources correctly? You are responsible for acknowledging any facts, ideas, or materials of others that you include in your work. You must follow the guidelines for acknowledging the work of others in the “Code of Academic Integrity and Acknowledging the Work of Others” (published in the Policy Notebook for the Cornell Community ) . If you use any copyrighted material in the dissertation or thesis, it is your responsibility to give full credit to the author and publisher of work quoted. The acknowledgment should be placed in a footnote at the bottom of the first page of the paper or chapter. Additionally, you must determine whether use of the material can be classified as a “fair use” by performing an analysis of your use of each copyrighted item. The Cornell Copyright Information Center’s Fair Use Checklist ) is a helpful tool for performing this analysis. (See also, Copyright Law and the Doctoral Dissertation: Guidelines to Your Legal Rights and Responsibilities , published by ProQuest, or The Chicago Manual of Style , published by the University of Chicago Press.) If your use of material is not considered a “fair use,” you must obtain written permission from the copyright owner. Two copies of each permission letter must be submitted with the dissertation or thesis. ProQuest has specific requirements for the content of the permission letter. For these guidelines, consult the ProQuest Doctoral Dissertation Agreement form (published by ProQuest). If you have already published or had accepted for publication part of your own dissertation or thesis material in a journal, depending on the terms of your publication agreement, it may be necessary to write to that journal and obtain written authorization to use the material in your dissertation. 2. Embargo of online copies The value of your dissertation extends well beyond your graduation requirements. It’s important that you make an informed decision about providing online access, via ProQuest and eCommons, to your work. This decision can expand the visibility and impact of your work, but it can also shape the options available to you for publishing subsequent works based on your dissertation. ProQuest’s ProQuest Dissertations and Theses (PQDT) database indexes almost all dissertations published in the U.S. and provides subscription access online to the full text of more recent dissertations. ProQuest also sells print copies of dissertations, paying royalties to authors, when they exceed a minimum threshold. Authors retain copyright in the works they submit to ProQuest. eCommons is a service of the Cornell University Library that provides long-term, online access to Cornell-related content of enduring value. Electronic theses and dissertations deposited in eCommons, unless subject to embargo, are freely accessible to anyone with an internet connection. When submitting to eCommons, you retain copyright in your work. Ph.D. dissertations and master’s theses submitted to ProQuest are automatically submitted to eCommons, subject to the same embargo you select for ProQuest. Electronic copies of dissertations in PQDT or eCommons may be made accessible immediately upon submission or after an embargo period of six months, one year, or two years. You may wish to consider an embargo period which helps address publishers’ interests in being the first to publish scholarly books or articles, while also ensuring that scholarship is accessible to the general public within a reasonable period of time. Your decision should be made in consultation with your special committee. 3. Creative Commons license Creative Commons licenses provide authors with a straightforward and standardized means of prospectively granting certain permissions to potential users of the author’s material. Authors may request proper attribution, permit copying and the creation of derivative works, request that others share derivative works under the same terms, and allow or disallow commercial uses. Authors may even choose to place their works directly into the public domain. You will have the option of selecting a Creative Commons license when you upload your dissertation or thesis to ProQuest, and your choice will automatically be applied to the copy of your work in eCommons. 4. Has a patent application been filed (or will one be) on the basis of your thesis or dissertation research? Cornell University Policy 1.5 governs inventions and related property rights. Inventions made by faculty, staff, and students must be disclosed to the Center for Technology Licensing at Cornell University (CTL). Theses and dissertations describing patentable research should be withheld from publication, in order to avoid premature public disclosure. Use the delayed release (embargo) option if a patent application is or will be in process, noting the reason for the delay as “patent pending.” If you have any questions, please contact Cornell’s Center for Technology Licensing at 607-254-4698 or ctl-connect@cornell.edu . 5. Register for copyright? Copyright law involves many complex issues that are relevant to you as a graduate student, both in protecting your own work and in referencing the work of others. Discussion of copyright in this publication is not meant to substitute for the legal advice of qualified attorneys. A more detailed discussion of copyright law can be found in the publication from ProQuest entitled Copyright Law and the Doctoral Dissertation: Guidelines to Your Legal Rights and Responsibilities by Kenneth D. Crews. Copyright protection automatically exists from the time the work is created in fixed form and the copyright immediately becomes the property of the author. Registration with the United States Copyright Office is not required to secure copyright; rather it is a legal formality to place on public record the basic facts of a particular copyright. Although not a condition of copyright protection itself, registering the copyright is ordinarily necessary before any infringement suits can be filed in court. To register a copyright for your dissertation or thesis, register online or download printable forms . You may also request forms by mail from the Information Section, U.S. Copyright Office, Library of Congress, Washington, D.C. 20559, or contact them by telephone at 202-707-3000. Doctoral candidates: You may authorize ProQuest to file, on your behalf, an application for copyright registration. This option will be presented to you as part of the submission process. 6. Supplementary materials If supplementary materials (audio, video, datasets, etc., up to 2GB per file) are part of your thesis or dissertation, you may submit them as supplementary files during the online submission process. For help selecting long-lived file formats, note ProQuest’s guidance in their document, “Preparing Your Manuscript for Submission (Including Supplemental Files).” File formats for which ProQuest does not guarantee migration may still have a high likelihood of preservation in Cornell’s digital repository; please see the eCommons help page for further guidance. Do not embed media files in the PDF version of your thesis or dissertation, as this can significantly increase the size of the file and make it difficult to download and access. Include a description of each supplementary file in the abstract of your thesis or dissertation. You may include an additional supplementary file containing more detailed information about the supplementary materials as a “readme” file or other form of documentation; this is particularly advisable for data sets or code. The Research Data Management Service Group ( rdmsg-help@cornell.edu ) offers assistance in preparing and documenting data sets for online distribution. 7. Make your work discoverable on search engines? ProQuest offers authors the option of making their graduate work discoverable through major search engines including Yahoo, Google, Google Scholar, and Google Books. If you chose the Search Engine option on their dissertation “paper” publishing agreement or within ProQuest’s PROQUEST ETD Administrator (electronic submission service), you can expect to have your work appear in the major search engines. If you change your mind and do not want your work to be made available through search engines, you can contact customer service at disspub@proquest.com or 800-521-0600 ext. 77020. In addition, if you did not initially adopt this option but now want your works made available through this service, contact the customer service group to change your selection. Please note that search engines index content in eCommons, regardless of the choice you make for ProQuest. 8. Make your work accessible to people with visual disabilities When creating a PDF version of your thesis or dissertation it is important to keep in mind that readers may use assistive technology such as screen readers to access your document.  Follow best practices to ensure that your thesis or dissertation is accessible to everyone.  These resources may be helpful: Cornell CIT’s guidance for creating accessible PDFs Checking accessibility using Acrobat Pro Embedding alternative text for images in Word Save a Word doc as an accessible PDF Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}