{
  "id": 3,
  "date": "2024-05-18T18:15:44.958570",
  "url": "https://gradschool.cornell.edu/academic-progress/guidelines-for-graduate-field-academic-handbooks/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Academic Progress Guidelines for Graduate Field Academic Handbooks Guidelines for Graduate Field Academic Handbooks Executive Summary Graduate fields develop and disseminate academic handbooks to support their graduate students’ academic progress and to harmonize students’ and faculty expectations by providing clarity on core requirements. Online handbooks are effective recruiting tools, as they provide prospective students with information about the program’s degree requirements, funding, and resources available to support students once admitted. The information below is designed to help fields develop a new – or update an existing – graduate field academic handbook, especially for doctoral students. These suggestions can be adapted as needed for research master’s degree students and professional degree students. Accessibility Per Cornell’s federal reporting requirements, field handbooks are required to be made available online. We encourage that fields present these as well-organized and accessible webpages or as an accessible, downloadable document. Purpose Field handbooks help the graduate community… Identify and understand essential information about the core requirements for student degree completion, differentiate among and understand requirements of the Graduate School, the field, and the special committee and chair, understand the normative timeline for completing field and Graduate School milestones, identify academic and professional development and other opportunities to support students at different stages during their degree program, and, importantly, clearly identify all the academic expectations that the field and faculty have for students so that there are no unknown or unwritten expectations. Additional Information Any additional information (such as lab manuals, student life information, building security and keys, facilities, field trips, graduate student organizations, journal clubs, photocopying, supplies, etc.) should be included elsewhere or at the bottom of the handbook via links. Additionally, please link to the Graduate School policies page rather than copying and pasting text from the Code of Legislation. Handbook Components Academic field handbooks are most easily understood when presented to students in chronological order so that students can understand the progression of their program and the required milestones to achieve each stage. Handbooks vary by field in content and scope; the checklist below includes components relevant to most degree programs. It includes suggested language and key questions that should be answered by each section. Fields that offer multiple degrees should ensure that the handbook makes clear distinctions between the different degree types (e.g., professional master’s, research master’s, doctoral) and that the handbook is divided appropriately based on this. Each degree should provide learning outcomes, field exam information, milestones, etc. Alternatively, a separate handbook can be provided for each degree. 1. Program Overview Include a general description of the graduate program, required registration, residency on campus, degrees, links to further information, and program recognitions or achievements, including program timeline and average time to degree. 2. Student Learning Outcomes List the intended program-level learning outcomes identified by the field faculty (these should match what is posted for the degree on the Graduate School Fields of Study page ). The outcomes should articulate what students are expected to know, and be able to do, upon completion of the degree. Describe any core competencies, language requirements, or learning goals. Describe how students’ achievement of the intended outcomes will be assessed (e.g., milestone exams; major papers, presentations, and projects; evaluation by the special committee). 3. Courses Include all required core courses and any required electives. Some fields have no required courses but, instead, allow the student’s special committee to advise the student on coursework. If that is the case, that should be explicitly described. Handbooks should describe the field’s policies on the following: Courses required by the department, if any. Are substitutions allowed? Is there a process for exempting students who have taken comparable courses at other institutions? What courses need to be taken and by when? What are the minimum number of credit hours required? Are required courses decided by the committee? Any process for how coursework requirements are decided should be clearly articulated. If the special committee advises on required courses, who helps the student choose their courses during their first three semesters prior to having a full committee (the DGS, a first-year advisor, etc.)? Articulate a process for how this works in your field. Minimum grades or GPA – Because Cornell’s Satisfactory Academic Progress policy stipulates that students in research degrees must maintain a minimum GPA of 2.25 to be in good academic standing or to be eligible for federal loans, it is required that a MINIMUM GPA of 2.25 be set. Incomplete (INC) grades – What are the expectations for students to complete INC grades? The Graduate School does not allow the grade to be changed after one year. Additionally, fields and instructors can set more strict deadlines if they wish. It’s often best to require INC grades to be resolved within a few weeks before students are busy with the following semester’s courses or research. Audits – Does the field have a policy on audited courses? What can be audited, taken as satisfactory/unsatisfactory (S/U), and what has to be taken for a grade? How are grades determined to be satisfactory? What happens to a student when they do not perform well in a class? Provide clarity as to what constitutes “good academic standing” and “satisfactory progress.” 4. Special Committees Per the Code of Legislation , the Graduate Faculty requires both research master’s and doctoral students to have identified (or been assigned) a special committee chair or a temporary advisor no later than three weeks after the first registration in the Graduate School (submitted to the Graduate School via Student Center). Additionally, per the Code, the Graduate Faculty requires research master’s students to have a full special committee no later than the end of the second semester and no later than the end of the third semester for doctoral students. The Code includes specific exceptions for graduate students in economics and physics (Code VI.B.6.). In this section, describe the field’s requirements for special committees. Are the committee requirements explicit and clearly explained for your field? Do students already have an advisor identified at the time of admissions, are they assigned a temporary chair upon matriculation, or will they need to identify an advisor in their first weeks? Are rotations expected? If so, how are they structured? When should a student form a full committee? Do special committee members have to represent specific areas of expertise, required by the department or by the special committee? How many members are required by the field? (The Code of Legislation requires at least three.) What is the process if a student has difficulty identifying an advisor? Is funding linked to having an advisor by a certain deadline? Should the chair or a committee member resign, what is the replacement process for students? (This can be a link to relevant sources.) Specifically, what is the process for students to find a new chair/replace committee members, and what are the time constraints to still be in good standing? 5. Student Progress Review The Student Progress Review (SPR) supports regular communication including written feedback between students and their advisors, requiring research degree students and their special committee to have at least one formal conversation each year about academic progress, accomplishments, and plans. Students complete a form describing milestones completed, accomplishments, challenges, and plans. The special committee chair responds in writing and indicates whether the student’s progress is excellent, satisfactory, needs improvement, or is unsatisfactory . Describe when students are generally expected to complete the SPR each year. Are first-year students asked to fill out a SPR? Reinforce that the SPR should identify the student and advisor’s plans for upcoming academic deliverables, milestones, expectations, and deadlines. 6. Field Exams All required field exams, such as concentration, Q, A, and B exams, should be clearly articulated regarding timing, the exam requirements, deadlines for completing exams, exam outcomes, retakes, and consequences for each outcome, including pathways for dismissal from the program. Q Exams Some fields have a qualifying exam (Q exam), or concentration exams, required in the first or second year of doctoral study designed to determine students’ ability to pursue doctoral studies. Although requirements for Q exams vary widely by field, students who pass the Q exam continue in their doctoral studies (Code F.3.). The handbook should articulate how the exam is structured and what types of content may be included. Most importantly, there should be clear information conveyed on the possible outcomes of the exam. This section should answer: Who determines the outcome? Is a field-appointed member required? When and how will results be communicated? What happens if the exam is not passed? Can the exam be retaken? Are conditional passes possible? If a student may be dismissed for failing a Q exam are there any circumstances where the student may earn a master’s degree? What is the pathway for dismissal? A Exam To advance to doctoral candidacy, doctoral programs are required by the Graduate Faculty Code of Legislation to have an A exam, which can be completed after two semesters of registration and must be completed before the start of the seventh semester (Code F.1.c.). Some fields require completion sooner. This examination has varying formats (oral, written and oral, etc.) depending on whether its requirements are set by the field or by the special committee. The exam itself must be scheduled with the Graduate School, and announced to the field, no less than one week before the exam, though students should be aware they will need to schedule the date with their committee members far in advance of that deadline. The passing of this exam certifies that the student is eligible to present a dissertation to the Graduate Faculty. This section should answer: What are the requirements of the exam and format? Is there a field or public component? Is a field-appointed member required? Who determines the outcome? When and how will results be communicated? What happens if the exam is not passed? Can the exam be retaken? Are conditional passes possible, and if so, what are the explicit steps to reach a successful outcome? Articulate what happens if the outcome is not successful. If a student has failed the A exam, is there a pathway to earn a master’s degree (thesis or non-thesis) and what is the pathway for dismissal? These questions should also be considered in advance of the A exam if an unsuccessful outcome is anticipated. Consider offering links to examples of previous A exams. B Exam In addition, all doctoral students take a final examination (the B exam, which is the oral defense of the dissertation) upon completion of all requirements for the degree, no earlier than one month before completion of the minimum registration requirement (Code F.1.d.). This section should remind students that a complete draft of their thesis or dissertation must be submitted to all members of their special committee six weeks prior to the B exam, and a final draft is due to all members five business days before the exam. The B exam should not be scheduled until the dissertation is complete and in final format. Further, the B exam must be scheduled with the Graduate School, and announced to the field, no less than one week before the exam. Please remind students they will need to schedule the date with their committee members far in advance of that deadline. This section should further answer: Who determines the outcome? When and how will results be communicated, including any required revisions? What happens if the exam is not passed? Can the exam be retaken? Are conditional passes possible, and if so, what are the explicit steps to reach a successful outcome? Articulate what happens if the outcome is not successful. If a student has failed the B exam, is there a pathway to earn a master’s degree and what is the pathway for dismissal? Additionally, the final thesis or dissertation must be submitted to the Graduate School no later than 60 days after the B exam. Enrollment in future terms is not permitted after a passed B exam. Master’s Students Per the Code of Legislation , the Graduate Faculty requires research master’s students writing a thesis to take a final examination upon completion of all degree requirements, no earlier than one month before completion of the minimum registration requirement (Code F.1.a.). Per the Code of Legislation , the Graduate Faculty requires research master’s students doing a research project report (in lieu of a thesis) to take a final examination at an appropriate time determined by the degree program. The exam may be oral or written to assess individual accomplishment of degree objectives (Code F.1.b.). The field should clarify if they allow the exam to be oral or written or if they have a more standardized approach (combination) For professional master’s students, please list any required final examinations in this section. 7. Dissertation and Thesis In general, a thesis or dissertation is required in the student’s major area of study (though a minor area can be allowed with approval) and under the supervision of the chair of their special committee. Doctoral students are required to submit a dissertation that is deemed acceptable in the scholarship and literary quality of their field. M.A. and M.S. students are required to submit a thesis or research project report that is appropriate to their program (exceptions to this include doctoral students receiving a non-thesis master’s.) Acceptance of the thesis or dissertation requires the approval of all the special committee members. This section should also address: Whether the special committee or field allows a paper option. If so, are there any requirements or expectations for publishing? Any additional requirements about the length or number of chapters, format, or content. 8. Setting Mutual Expectations for Mentoring Cornell supports the Faculty Advancing Inclusive Mentoring (FAIM) framework for faculty/student mentoring that draws upon a strengths-based and identity-informed approach to support mutual growth, development, and success ( NASEM, 2019 ; Windchief, 2019 ). The FAIM philosophy, key principles, and core mutual expectation areas for inclusive mentorship provide a foundation for fulfilling mentoring relationships by: supporting mentors and mentees as they seek to develop an understanding of one another’s expectations, cultures, values, and sources of motivation; helping mentors and mentees develop a mentorship plan better aligned to a mentor’s and mentee’s strengths, needs, and goals; and providing resources and tools that can be adapted and adopted by mentors and mentees to be contextually relevant. Please direct your students to the FAIM website , for resources and tools to support their mentoring relationships. Remind students to work with the graduate field administrator (GFA), who can serve as a liaison between faculty and students, and the director of graduate studies (DGS) in their department who can both provide advice and help navigate mentoring challenges. 9. Required Training Some fields require training or courses related to safety and other topics in addition to university-required training on research with human subjects, animal care and use, etc. Describe these requirements relevant to the field’s students, including additional training required by the funding source and when and how students should complete the requirements. Per the Code of Legislation , the Graduate Faculty requires all research degree students, both master’s and doctoral, to complete responsible conduct of research (RCR) training . This includes training on authorship, peer review, and avoidance and consequences of research misconduct. This training is through the Cornell Office of Research Integrity and Assurance (ORIA) and must be completed before the end of the second semester (Code E.2.a.). 10. Field- or Program-Specific Requirements and Resources In this section, please include any additional field-specific academic requirements that are part of the academic program in your field. Examples of items that might be included: Teaching assignments Should provide clarity as to: Is teaching or teaching assistant (TA) service an academic requirement? What are the minimum number of semesters of teaching required? Is it stated in academic terms and included in the field’s published learning outcomes? Manuscript submissions and any requirements or expectations for publishing Field awards and recognition Colloquia presentations, conference posters, or papers External fellowship applications Individual Development Plans (IDPs) Minors/concentrations available to students in the field Summer progress Table or figure of program timeline and schedule Any additional milestones or requirements for professional degrees that aren’t captured in the Graduate School milestones section 11. Field-based Professional Development Some fields have a seminar, series, or workshop to help students with writing a fellowship application, developing and writing the dissertation proposal/prospectus, the job search, and other topics. If these are required or strongly suggested in your field, please describe them in sufficient detail here. If your field expects or requires students to write grant or fellowship applications as part of either the academic requirements or funding plan, describe the deadline, criteria, and sign-off process. 12. Funding Describe methods for funding in the field, including fellowships, teaching assistantships, training grants, etc.; stipend payment schedule; requirements for receiving and maintaining specific types of funding; summer funding; expectations for writing and submitting external fellowship applications; and funding for travel, research, and conferences. Indicate that doctoral students will remain funded through the completion of the degree as long as they remain in good academic standing. For Sage fields, when is the Sage dissertation-writing fellowship typically used? Describe summer funding plans. If students are expected to secure external support, describe how funding is provided if they are unsuccessful. Are there field or departmental fellowships available? If so, is there an application process? How are teaching assistant assignments typically made? If students typically conduct field research while in absentia, describe how required funding is provided during this time. If the field limits the number of funded in absentia semesters, provide clear guidance to allow students to plan accordingly. Note that unfunded in absentia for field research is not permitted. Sample Field Handbooks These Cornell graduate fields have graduate student handbooks that are useful as examples for their content, scope, and format. Biomedical engineering Near Eastern studies Plant biology Graduate School Contacts For assistance updating field handbooks or creating new content, please contact the Associate Dean for Academics Josephine Martell ( gradacad_assoc_dean@cornell.edu or jem522@cornell.edu ). For all other student concerns, please direct students to the Graduate School staff directory, as well as to the Graduate School leadership . Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}