{
  "id": 3,
  "date": "2024-05-18T18:07:45.800766",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/p2s-symposium/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Pathways to Success Symposium Pathways to Success Symposium Pathways to Success (P2S) is the Graduate School’s framework for helping graduate and professional students and postdoctoral scholars be successful in their research and scholarship, and establish the necessary skills for their future careers. The annual Pathways to Success Symposium is a professional development opportunity focused on providing graduate and professional degree students and postdoctoral scholars with valuable career exploration and professional development learning and skill development opportunities. Participants may register for an individual session or all sessions offered within the symposium. 2024 Summer Pathways to Success Symposium June 4, 2024 9:30 am – 4:30 pm Registration now open! Contact for questions: grad_assoc_dean@cornell.edu Registration (9:30 – 10:00 am) Welcome (10:00 – 10:15 am) Opening Plenary Workshop (10:15 – 11:45 am) Leadership Visioning Speaker: Dr. Theoria Cason, CEO at Theoria in Praxis, and Director of Diversity & Inclusion at Ubisoft for Global Publishing Session Summary The characteristics of leadership are not exclusive to the most senior ranking persons within an organization; they are characteristics that any person can embody. Establishing a sentiment of safety, requires authenticity and vulnerability. This can be achieved by stepping outside of oneself to learn about the lived experiences of others. Through reflective dialogue, this session will provide you with strategies you can employ in the future in order to strategically navigate organizational culture as part of your leadership practice. Additionally, you will develop an action plan for continued learning in aspects of inclusive leadership. Networking Lunch (11:45 am – 12:30 pm) Panel Discussion (12:30 – 1:45 pm) Faculty Who Failed – Lessons Learned for Moving Forward Session Summary Graduate school is a time for students to push themselves, try new things, and explore. It’s also a time when students are likely to experience what feels like failure.  Join a panel of faculty members who will share their stories of how they “failed” and overcame setbacks in graduate school and beyond. Through personal anecdotes, panelists will share how resilience can carry you through the tough times in your degree program and come out of the experience stronger and better prepared for future challenges. Alumni Keynote (2:00 – 3:00 pm) From Books to Space: My Journey from an English Ph.D. to a Career at NASA Speaker: Dr. Abram Coetsee, Ph.D. ’22 (Literatures in English), Project Manager, National Aeronautics and Space Administration Session Summary Many times graduate students see their career options as defined by their research specialization, and feel the stress of limited job opportunities. In this talk, our alumni keynote speaker will analyze the ways that academic experiences can be leveraged for a wide horizon of careers across many industries. Skillsets earned through intellectual passion can be creatively applied to work beyond the university—often fulfilling our missions with more impact, and realizing a broader set of dreams. About the Speaker: Dr. Abram Coetsee serves under NASA’s Minority University Research and Education Project (MUREP), as a Project Manager for the NASA Community Colleges Aerospace Scholars (NCAS) team, on contract via Guardians of Honor LLC. Before that, as a project and product manager he worked across tech, law and non-profits. As an educator, he served at the McIntire School of Commerce (UVA), Carey Business School (Johns Hopkins), Cornell and UC Berkeley. His public speaking experience includes TED, Facebook/Instagram at Cannes Lions, the Smithsonian Museum of Design – Cooper Hewitt, and elsewhere. Roundtable Discussions (3:00 – 4:15 pm) Diverse Career Pathways in a University Ecosystem Session Summary Within the academy, a multitude of career pathways exist well beyond faculty roles on the tenure track. During these roundtable discussions, you will have the opportunity to engage in conversations led by staff with doctorates throughout Cornell University who significantly contribute to the vitality of the university, including technology and licensing, alumni affairs, publishing, student success, faculty development, and other key roles! You will also have the opportunity to learn about technology resources to connect you to additional alumni with graduate degrees willing to serve as career mentors. Ice Cream Social (4:15 – 4:30 pm) Session Summary End your day with us by enjoying some of the best ice cream and sorbet in the world while engaging with peers, symposium organizers, and invited discussants! Previous Symposia View Summer 2022 P2S Session Descriptions and Presenters View Summer 2021 P2S Series Descriptions and Presenters View Winter 2021 P2S Series Descriptions, Presenters, and Recordings View Summer 2020 P2S Series Descriptions and Presenters View Winter 2019 P2S Session Descriptions and Presenters View Summer 2019 P2S Session Descriptions and Presenters View Spring 2019 P2S Session Descriptions and Presenters Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}