{
  "id": 3,
  "date": "2024-05-18T18:09:12.676558",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/signature-initiatives/colman-leadership-program/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Signature Initiatives Colman Inclusive Leadership Program Colman Inclusive Leadership Program The Colman Inclusive Leadership Program seeks to enroll 30-40 research degree graduate students for an immersive three-day virtual program focused on providing participants with skills and knowledge that will support their development as leaders in graduate school and beyond. The 2023 program includes doctoral students from Cornell as well as doctoral students from institutions affiliated with the Alfred P. Sloan Foundation’s University Centers for Exemplary Mentoring and master’s degree and doctoral students from institutions affiliated with the Sloan Indigenous Graduate Partnership programs. Program Goals The Colman Inclusive Leadership Program introduces students to a range of practical skills, theories pertaining to leadership, and special topics relevant for application in both academic and professional contexts. With a varied format including readings, interactive group activities, case studies, and discussions, program participants will engage in the following topics: What is Emotional Intelligence? Inclusion and Belonging – We All Want It, How Do We Get It? Inclusive Leadership Frameworks Conflict Management Culture – Power, Awareness, and Humility Leadership Visioning Facilitation Team Judith Rowe An experienced coach, trainer and facilitator, Judy Rowe is the principal of Judith A. Rowe Consulting, LLC.  She enjoys helping people and organizations to discover their strengths, define a vision and create a pathway toward that vision for success. Making an impact in the areas of social justice, equity, diversity and inclusion whenever and wherever she can is also part of Judy’s mission. Judith has a career spanning more than 30 years with experience working with fortune 500 companies, small businesses, nonprofit and government organizations. During her 27-year career with Corning Incorporated she held a wide range of roles including product engineer, sales engineer, customer service supervisor, human resources, quality training coordinator and Performance Excellence facilitator. Judy earned dual undergraduate bachelor’s degrees in Civil and Industrial Engineering from the University of Tennessee-Chattanooga, and a master’s degree from Cornell University’s School of Industrial and Labor Relations. She is also certified as a Six-Sigma Green Belt, as well as StandOut TM and People Skills TM trainer. Marcus Brooks Marcus hails from New York City where he uniquely combines his formal business skill sets in leadership, organizational development, and entrepreneurship with his deep passion for human development and experiential learning.  Marcus has held finance positions in insurance, debt and equity real estate finance, as well as investment banking.  His career has also expanded into management roles in the outdoor industry where he has been an accomplished outdoor adventure guide, leading expeditions to the Canadian Rockies (9,000+ ft.), Peruvian Andes (15,000+ ft.) and Kilimanjaro (19,341 ft.). Currently, Marcus is a Senior Facilitator with Cornell’s Team & Leadership Center, Senior Management Consultant with Cornell’s Department of Organizational Development & Effectiveness and the Head Nerd in Charge of Let’s Brainstorm, LLC, a strategy, leadership & finance consulting firm.  His speeches and workshop topics of expertise include, crisis management, introductory to advanced negotiations, diversity (in the outdoor industry), sexual violence prevention, & emotional intelligence , to name a few. Dr. Theoria Cason As an educator, entrepreneur, and corporate DEI professional her commitment to lead with integrity serves as a barometer to facilitate culture change. Empowered by the resilience of her maternal elders, she identifies as an unapologetically Black woman, with an earnest desire to advocate for people who are often overlooked and underrated. As a global citizen, she makes it a point to visit at least one new country each year, to broaden her understanding of the human experience and the innumerable ways we make meaning with our piece of the world. Dr. Cason is the founder and Chief Executive Officer of her consulting firm, Theoria In Praxis. She is a Cornell Certified Diversity Professional; and she holds a bachelor’s degree in Psychology from the University of North Carolina at Charlotte, a master’s degree in College Student Personnel from Western Illinois University, and a Doctor of Education in Administration and Policy Studies from the University of Pittsburgh. Application & Program Schedule Access the Application Application Due Date: May 15, 2024 (note extended deadline) Selection Decisions released by mid-May, 2024 Virtual Program Dates and Times: June 11-13, 2024, 1:00 – 5:00 p.m. ET *For Cornell students based in Ithaca, there is an additional in-person meeting on Friday, June 14, 11:00 a.m. – 1:30 p.m. ET Should You Apply? You have a choice of leadership development opportunities within and beyond Cornell via multiple offerings of courses and programs. We would like you to choose the best of these options for yourself. If you are considering applying to the Colman Inclusive Leadership Program, you should know that it is an immersive learning experience. It is predicated on discovery, integration, and synthesis and not on prescriptive norms of leadership. We quote from former participants below to help you decide. It is for you if you are seeking what these participants have described: “Because of this program, I am more keenly aware of areas where I can be more prone to making leadership missteps. Because of this, I can now actively work on improving areas where I am far from where I want to be, and continue to put myself in situations that leverage my strengths as a leader. I especially enjoyed the visioning section and the lesson about putting up boundaries was something that I certainly needed to hear.” “The program helped me to be more aware about myself and others. In addition, it helped me identify the areas of Emotional Intelligence in which I am strong and the ones in which I need to work more. It was also great to understand the ways on how I deal with conflict the best and the ones I need to work on more to be a better and more inclusive leader.” The Colman Inclusive Leadership Program is for you if you are prepared to engage in intensive self-discovery with similarly committed peers from diverse identities, interests, and experiences. This program does not focus on the development and practice of specific managerial skills. Contact Cindy Mosqueda, Associate Director, Diversity Programs in Engineering: cmm522@cornell.edu Sara Xayarath Hernández, Associate Dean for Inclusion and Student & Faculty Engagement, Cornell Graduate School: grad_assoc_dean@cornell.edu Sponsorship In spring 2012, John and Jane Colman founded the Colman Family Endowed Fund for Leadership within Diversity Programs in Engineering (DPE) to establish the Colman Inclusive Leadership Program for Ph.D. students in engineering and other related STEM fields. In summer 2015, the Graduate School Office of Inclusion and Student Engagement (OISE) established a partnership with DPE to make the Colman Inclusive Leadership Program open to all Ph.D. and M.F.A. students from across all graduate fields at Cornell. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}