{
  "id": 3,
  "date": "2024-05-18T18:06:36.438557",
  "url": "https://gradschool.cornell.edu/student-experience/student-life-programs/book-clubs/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Student Experience Student Life Programs Book Clubs Book Clubs Meet students from other fields, read a book, and join a discussion. Hosted by the Graduate School’s Office of Academic and Student Affairs and Office of Graduate Student Life, book clubs are a great way to meet other students, learn practical life lessons, and have a good time. Summer 2022 Book Clubs “Four Thousand Weeks: Time Management for Mortals” by Oliver Burkeman Meeting Date: Wednesday, June 1 at 12:00 – 1:00 pm ET (in person, lunch provided) Rejecting the futile modern obsession with ‘getting everything done,’ Four Thousand Weeks introduces readers to tools for constructing a meaningful life by embracing rather than denying their limitations. Drawing on the insights of both ancient and contemporary philosophers, psychologists, and spiritual teachers, Oliver Burkeman sets out to realign our relationship with time – and in doing so, to liberate us from its tyranny. (2021, Farrar, Straus and Giroux) Facilitated by Associate Dean of Academic and Student Affairs Jan Allen. “The Productive Graduate Student Writer: How to Manage Your Time, Process, and Energy to Write Your Research Proposal, Thesis, and Dissertation and Get Published” by Jan Allen Meeting Date Options: Thursday, June 2 at 12:00 – 1:00 pm ET (in person, lunch provided) Monday, June 6 at 12:00 – 1:00 pm ET (remote via Zoom) Join the author, Associate Dean Dr. Jan Allen, and your peers to discuss strategies for becoming a more productive writer and completing your degree. Attendees will receive a copy of the book, “ The Productive Graduate Student Writer: How to Manage Your Time, Process, and Energy to Write Your Research Proposal, Thesis, and Dissertation and Get Published.” (2019, Stylus Publishers). “Designing Your Life: How to Build a Well-Lived, Joyful Life” by Bill Burnett and Dave Evans Meeting Date Options: Tuesday, June 7 at 12:00 – 1:30 pm ET (in person, lunch provided) Tuesday, June 14 at 12:00 – 1:30 pm ET (in person, lunch provided) In this book, Bill Burnett and Dave Evans show us how design thinking can help us create a life that is both meaningful and fulfilling, regardless of who or where we are, what we do or have done for a living, or how young or old we are. (2016, Knopf) Facilitated by Graduate Student Life Advisor Angela Yantorno. “Sister Pie: The Recipes & Stories of a Big-Hearted Bakery in Detroit” by Lisa Ludwinski Meeting Date: Tuesday, June 7,  4:00 – 5:30 pm ET (in person, dinner provided) Join Associate Dean Dr. Jan Allen to make a pie (to take home to bake), talk pie, eat pie and meet pie-loving and pie-novice friends. (2018, Lorena Jones Books) “Options are Power: Career Strategies for High Performers Who Want a Life” by Donna Peters Meeting Date: Friday, June 10 at 12:00 – 1:30 pm ET (in person, lunch provided) Quoting Amazon: “No matter where you are right now, you need options. When you have options, you’re in control. You make decisions from a position of strength. You run to something, not from something. Options Are Power provides strategies for surrounding yourself with options.” Join this session to come away with a personal plan to increase your career options. Hosted by the Executive Director of the Graduate School’s Careers Beyond Academia, Susi Varvayanis, and featuring in-person the author, Donna Peters MBA ’99. (2022, Elite Online Publishing) “Stopping the Noise in Your Head: The New Way to Overcome Anxiety and Worry” by Reid Wilson Meeting Date Options: Wednesday, June 22 at 12:00 – 1:00 pm ET (in person, lunch provided) Wednesday, June 29 at 3:00 – 4:00 pm ET (remote via Zoom) We may have experienced how crippling excessive worrying can be, especially at a moment when there are constant thoughts that are distressful. “Stopping the Noise is Your Head: The New Way to Overcome Anxiety and Worry” by Dr. Reid Wilson provides tools and strategies for how to overcome anxiety and worry by moving away from comfort and security to willingly moving towards uncertainty, distress, and discomfort. The goal of this is for readers to learn how to confront anxiety head-on and step into the face of threat. (2016, Health Communications Inc.) Facilitated by Senior Assistant Dean for Graduate Student Life Janna Lamey. “Atlas of the Heart: Mapping Meaningful Connection and the Language of Human Experience ” by Brené Brown Meeting Date Options: Thursday, June 23 at 10:00 – 11:00 am ET (remote via Zoom) Tuesday, June 28 at 12:00 – 1:00 pm ET (in person, lunch provided) Brené Brown’s newest book, “Atlas of the Heart,” is sure to provide you with a better understanding of the human experience. In “ Atlas of the Heart,” some eighty-seven emotions and experiences define what it means to be human and what is needed to cultivate meaningful connections. For the discussion, we will review “places we go when things are uncertain or too much” where we go when we are stressed, overwhelmed, anxious, worried, avoid, excited, dread, fear, and vulnerable. In addition, we will review “places we go when things don’t go as planned,” which includes, boredom, disappointment, expectations, regret, discouragement, resignation, and frustration. Finally, we will talk about “places we go when we search for connection,” including, belonging, fitting in, connection, disconnection, insecurity, invisibility, and loneliness. If these places sound familiar to you, come and join us for an open and honest conversation with Dr. Brown’s wisdom. (2021, Random House) Facilitated by Senior Assistant Dean for Graduate Student Life Janna Lamey. “Endurance: Shackleton’s Incredible Voyage ” by Alfred Lansing Meeting Date: Tuesday, July 12 at 12:00 – 1:00 pm ET (in person, lunch provided) Endurance (by first time book author Alfred Lansing) is a book about the true story of Ernest Shackleton’s South Pole adventure/fiasco; an incredible treatise of persistence and positivity despite despair, with great lessons on leadership, teamwork, looking out for each other across differences (economic backgrounds, social status, experience, age, personalities, countries of origin) and learning from failure. We’ll also look at the amazing historical images taken by the photographer, Frank Hurley, that were part of an American Museum of Natural History’s exhibition. Come be inspired! (2015, Basic Books) Facilitated by the Executive Director of the Graduate School’s Careers Beyond Academia, Susi Varvayanis. Past Book Clubs Winter 2021 Book Club Books: “Writing from A to B: A Guide to Completing the Dissertation Phase of Doctoral Studies” by Keith Hjorshoj “The Productive Graduate Student Writer: How to Manage Your Time, Process, and Energy to Write Your Research Proposal, Thesis, and Dissertation and Get Published” by Jan Allen “The Writing Workshop: Write More, Write Better, Be Happier in Academia” by Barbara W. Sarnecka “Option B: Facing Adversity, Building Resilience, and Finding Joy” by Sheryl Sandberg and Adam Grant “The Resilience Factor: 7 Keys to Finding Your Inner Strength and Overcoming Life’s Hurdles” by Karen Reivich and Andrew Shatte “Stopping the Noise in Your Head: The New Way to Overcome Anxiety and Worry” by Reid Wilson Winter 2020 Book Club Books: “The Secret Thoughts of Successful Women: Why Capable People Suffer from the Imposter Syndrome and How to Thrive in Spite of It” by Valerie Young “Happiness by Design: Change What You Do, Not How You Think” by Paul Dolan “30 Lessons For Loving: Advice from the Wisest Americans on Love, Relationships, and Marriage” by Cornell Professor Karl Pillemer “The Gifts of Imperfection: Let Go of Who You Think You’re Supposed to Be and Embrace Who You Are” by Brene Brown “Spark: The Revolutionary New Science of Exercise and the Brain” by John Ratey and Eric Hagerman “The Productive Graduate Student Writer: How to Manage Your Time, Process, and Energy to Write Your Research Proposal, Thesis, and Dissertation and Get Published” by Associate Dean Jan Allen “Cutting School: Privatization, Segregation, and the End of Public Education” by Cornell Professor Noliwe Rooks “How To Write a Lot: A Practical Guide to Productive Writing” by Paul Silva Baking Pie and Tarts Other Book Club Books: “Mama, Ph.D.: Women Write About Motherhood and Academic Life” compiled by Elrena Evans and Caroline Grant “Endurance” by Alfred Lansing “The Productive Graduate Student Writer” by Associate Dean Jan Allen “Thinking, Fast and Slow” by Nobel Prize Laureate Daniel Kahneman “Pie and Tarts: For All Seasons” by Annie Rigg Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}