{
  "id": 3,
  "date": "2024-05-18T18:16:01.610117",
  "url": "https://gradschool.cornell.edu/academic-progress/advising-guide-for-research-students-2020/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Academic Progress Advising Guide for Research Students Advising Guide for Research Students Success as a graduate student is a shared responsibility between students and faculty. For research students, the relationship with your research advisor, also known as your special committee chair, is extremely important. Your responsibility to identify and choose an advisor is one of the most critical tasks you have early in your graduate school career. It’s an opportunity to meet and get to know faculty in your field, to assess your needs for support and supervision, and to collaboratively define your goals, values, and strategic plan for your academic and professional career. Graduate School Requirement At Cornell, the faculty advisor in research degree programs is referred to as the special committee chair. Doctoral students have a special committee of at least three Cornell faculty, which includes the special committee chair and two minor committee members. Master’s students have a special committee of at least two Cornell faculty, which includes the special committee chair and one minor member. For both doctoral and master’s degree students, the special committee chair must be a graduate faculty member in the student’s own field. Definition of an Advisor Advising and mentoring are often used interchangeably, but understanding the distinctions is important as you choose an advisor. Advisor Responsibilities Guides you in meeting the requirements and expectations for your degree Helps you develop a plan for completing your program that includes specific milestones and deadlines for the following: Required coursework Exams required by the graduate field or the Graduate School Research proposal/prospectus Research project Thesis or dissertation Writes informed letters of recommendation for your job applications May be a valued colleague or collaborator after you graduate Mentor Responsibilities Provides support and guidance that extends beyond scope of advising Demystifies the structure, culture, and unstated expectations of graduate education Expands your professional network by introducing you to others Provides nominations for awards or other recognitions Brings job opportunities to your attention and writes letters of recommendation as you apply for jobs Advocates for you within the graduate program and discipline May serve as a role model and source of inspiration May become a colleague and peer in your discipline and may continue serving a mentoring role Finding an Advisor When do I select my first advisor? At Cornell, the process for obtaining your first advisor varies by field. Your faculty advisor may be assigned prior to your arrival or you may begin your program with a faculty member you met during the application process. In some graduate fields, the faculty director of graduate studies (DGS) advises all incoming students. This provides you with time to get to know faculty in your field. By the end of the first semester or year (varying by field), it’s expected that you will have identified your own, long-term advisor. In fields where students apply to study with a specific faculty member (rather than do rotations and choose a lab or research group and advisor), you will have chosen an advisor prior to arriving on campus. You can begin initial conversations about expectations and the advising relationship with your new advisor prior to the start of your program via email. Start your graduate study and research with clear expectations and thoughtful communication about your plans for an effective advising relationship and success in graduate school. How do I find an advisor? Meet and get to know faculty in your courses and in graduate field seminars and other events. Talk to advanced students about their experiences and perceptions of the faculty in your programs and ask questions about possible advisors: How would you describe their approach to advising? What can you tell me about their work style? What can you tell me about their research interests? How good are their communication skills? How clear are their expectations for their graduate students? Do they use timeliness in reviewing their students’ writing and their approach to giving feedback? How available are they to meet with their graduate students? After you have gathered information, make an appointment to meet with a potential advisor. Possible Questions Is there a typical timeline you encourage your students to follow in completing their degree programs? How often do you meet with your students at different stages of their graduate program? (For example, during coursework, research, and writing stages) What are your expectations for students to make conference presentations and submit publications? What are your authorship policies? (This is especially relevant in fields where there is collaborative research and publishing involving the student and advisor or a group of students, postdocs, and faculty.) How soon should I identify my research project? How do you describe the degree of guidance and supervision you provide with regards to your students becoming more independent in their research and scholarship? If you are joining a lab or research group: What are the sources of funding for this research? Are there any new or pending research grants? How many of your students seek, and secure, external funding? What are your expectations for students to apply for external fellowships? Do you have a statement of advising you can share that lists our respective responsibilities and clarifies mutual expectations? What’s your advice on how students can manage what they find to be the biggest challenges in their graduate program? Add other questions to your list based on your own needs and specifics of your program, such as questions about specialized equipment, lab safety, travel to field sites, support and accommodations for special health needs, communication during a faculty member’s sabbatical, funding in fields where there are fewer fellowships and research grants, etc. Getting Other Mentoring Needs Met How do I find other mentor(s)? You may find one faculty member who can serve as both advisor and mentor, but that’s not always the case. Consider identifying and cultivating additional mentors if that is the case. Suggestions on where to look for a mentor: The minor members of your special committee A faculty member who is not on your committee, and perhaps not even in your graduate field Peers and postdoctoral fellows who have knowledge and experience in pertinent issues No one mentor can meet all your needs. Good mentors have many protégés and many other demands on their time, such as teaching, research, and university or professional service. They also may not have all the expertise you need, for example, if you decide to search for jobs in multiple employment sectors. Develop a broad network of mentors whose expertise varies and who provide different functions based on your changing needs as you progress from new student to independent scholar and researcher. NCFDD offers a webinar, “ Cultivating Your Network of Mentors, Sponsors, and Collaborators “, which students can view after activating a free NCFDD membership through Cornell. Maximizing the Advising Relationship A successful relationship with your advisor depends on several different factors and varies with needs and working styles of the individuals. Some of these factors are under your control. But some are not. Suggestions for Building a Successful Advising Relationship Identify what you need from an advisor. Communicate clearly and frequently with your advisor to convey your questions, expectations, goals, challenges, and degree progress. Follow up verbal communication and meetings with an email detailing your understanding of what you both agreed to and next steps. Develop written academic and Individual Development Plans that include your career goals, your program’s degree requirements and milestones, funding and financial aid, and a timeline with your anticipated deadlines. Update your written academic plan each semester or whenever major changes or adjustments are needed. Use your annual Student Progress Review , required by the Graduate School, effectively to record your progress, articulate your goals and plans to meet academic milestones, and seek feedback from your advisor. Consider including your plans to write competitive fellowship applications and co-authored grant proposals. Consider including plans for professional development that support your skill-building objectives and career goals. Recognize that you and your advisor have distinct perspectives, backgrounds, and interests. Share yours. Listen to your advisor’s. There is mutual benefit to sharing and learning from this diversity. Work with your advisor to define a regular meeting schedule. Prepare and send written materials in advance of each meeting. These could include: your questions, academic and research plan and timeline, and drafts of current writing projects, such as fellowship applications, manuscripts, or thesis/dissertation chapters. Be prepared to negotiate, show flexibility, and compromise, as is important for any successful relationship. Be as candid as you are comfortable with about your challenges and concerns. Seek guidance about campus and other resources that can help you manage and address any obstacles. Reach out to others for advice. Anticipate challenges and obstacles in your graduate degree program and their impact on the advising relationship. Be proactive in finding resources and gathering information that can help you and your advisor arrive at solutions to any problems and optimize your time together. Making Use of Meetings First Meetings Your first meeting sets the tone for a productive, satisfying, and enduring relationship with your advisor. Your first meeting is an opportunity to discuss expectations and to review a working draft of your academic plan. Questions to ask about expectations What do your most successful students do to complete their degree on time? How often do you want us to meet? May I send you questions via email, or do you prefer I just come to your office? Would you like weekly (biweekly? monthly?) updates on my research progress? Do you prefer reviewing the complete draft of a manuscript or may I send you sections for feedback? After each meeting, I’ll make a list of what we each agreed to do before our next meeting, to help me keep moving forward with my research. Would you like a copy of that list, too, via email? Draft Academic Plan Prepare and bring a draft plan that outlines your “big picture” plans for your coursework, research, and writing, as well as an anticipated graduation date. (Or, email in advance with a message, such as, “I’m looking forward to meeting with you on [date] at [time], [location]. In advance, I’m sending a copy of my academic plan and proposed schedule for our discussion.”) Contents of the plan Include the requirements and deadlines of your degree program. (This is information you should be able to find online or in your program’s graduate student handbook.) Include a general timeline indicating when you plan to meet requirements for courses or seminars, any required papers (such as a second-year paper), exams required by the graduate field (such as the Q exam) or by the Graduate School (the A exam and the B exam for research degree students). If your graduate field has a specific set of required courses, indicate the semester you may complete each of them, and be open to suggestions from your advisor. If your field does not have required courses, have some idea about the courses you are interested in taking and solicit input and suggestions from your faculty advisor. Subsequent Meetings Use each subsequent meeting as an opportunity to update your written academic plan and stay on track to complete your required papers and exams, your research proposal or prospectus, and the chapters or articles that comprise your thesis or dissertation. In later meetings, you can elaborate on your general initial plan: Adding specific coursework or seminars Add professional development opportunities that interest you (workshops, dissertation writing boot camp, Summer Success Symposium, Colman Leadership Program, etc.) Include intentions to participate in external conferences and travel to research sites Identify a semester or summer when you would like to complete an internship. Your written plan is also important to document what your advisor has agreed to, especially when the deadline to submit a manuscript or your thesis is looming and you are awaiting feedback or approval from your advisor. Use a combination of oral and written communications to stay in touch with your advisor, establish common expectations, and mark your progress toward degree completion. Meeting Frequency The frequency of meetings between advisors and advisees varies by field and individual. Assess your own needs and understand your advisor’s expectations for frequency of communication (in person and via email). Does your advisor like to provide guidance each step of the way so that he or she is aware of the details of everything you are doing? Does your advisor want you to launch your work more independently and report back at pre-determined or regular intervals? What do you need to be productive? Are you ready to work more independently? Be proactive in seeking information. Explicitly ask how often your advisor usually meets with new students and how the advisor prefers to be updated on your progress in between meetings. Ask your peers how frequently they meet with their advisor and whether this has changed over time. There will be disciplinary differences in meeting frequency. In humanities and in some social sciences, where library, archive, and field research take students away from campus, maintaining regular communication is essential, including through scheduled meetings, whether in-person or virtual. In life sciences and physical sciences and engineering, students often see their advisors daily in the lab or meet as a research group about externally funded projects; these regular check-ins and conversations may replace formal meetings. Make sure that you are also scheduling one-on-one times to talk about your broader goals and academic and career planning progress, however. Some of your decisions about meeting frequency will be informed by talking to others, but much of it you learn through experience working together with your advisor. Even this will change over time as you become a more independent researcher and scholar. Communicate with your advisor regularly about your changing needs and expectations at each stage of your graduate career. Resolving Conflict In any relationship, there can be conflict. And, in the advisor-advisee relationship, the power dynamic created by the supervision, evaluation and, in some cases, funding role of your advisor can make conflicts with your advisor seem especially high. You have options, however, including: Reviewing the Cornell and Graduate School polices. They provide clear expectations, help you manage problems when they occur, and protect you from retribution when trying to address these problems. Examples of these policies include: Code of Legislation of the Graduate Faculty Campus Code of Conduct Policy on Academic Misconduct Research Misconduct Graduate School Grievance Policy Intellectual Property policies Graduate Student Assistantships (Policy 1.3) Talking with your advisor to clarify any miscommunication. Cornell University’s Office of the Ombudsman , one of the offices on campus that offers confidentiality, can also assist you by talking through the issue and helping you gather information you need before you speak directly with your advisor. Speaking with someone in the Graduate School, either the Associate Dean for Academics ( gradacad_assoc_dean@cornell.edu ) for academic issues, or the Senior Assistant Dean for Graduate Student Life ( janna.lamey@cornell.edu ) for other issues. These deans will listen, offer advice and support, and coach you through any conversation you might want to have with your advisor. Together, you can brainstorm possible solutions and evaluate alternative plans for resolution. Touching base with your director of graduate studies (DGS) – if this person is not also your advisor – to talk to about policies and possible solutions to the conflict. Soliciting peer advice. Discuss strategies for managing and resolving conflict with your advisor. “Do you have any suggestions for me?” “Have you ever had an issue like this…?” can be effective questions. Identifying a new advisor if the conflict can not be resolved. Your DGS can help with this, and the Graduate School (as above) can help as well. The National Center for Faculty Development and Diversity offers a webinar, “ How to Engage in Healthy Conflict “, which students can view after activating a free NCFDD membership through Cornell. Changing Advisors On occasion, students find that they need or want to change their advisor. An advisor can resign as the student’s special committee chair/faculty advisor. The Code of Legislation of the Graduate Faculty describes the rights and responsibilities of students and faculty in each of these situations. Typical reasons to seek a new advisor include: Research interests that veer from the faculty’s expertise or ability to fund a certain project Your advisor retires or resigns from the university or takes an extended leave of absence for personal or professional reasons Differences in goals, values, or an approach to work or communication style that can’t be resolved Serious issues, involving suspected inappropriate behavior, questionable research conduct, or alleged bias, discrimination, or harassment If you are considering changing advisors: Talk to a member of your committee, your director of graduate studies (DGS), or someone in the Graduate School about the proposed change. Some issues, such as funding, require timely attention. Identify other faculty members who could serve as your advisor, then meet with one or more of them. The goal is to decide together if you are a good fit with their program. Tips: Discuss or rehearse this conversation with a trusted person, especially if there were issues with your last advisor. Be transparent about these issues and address them going forward with a new advisor. Often prospective advisors are more willing to take on a new graduate student who conveys genuine enthusiasm for their area of study rather than a student who seems to be looking for a way out of a current advising relationship that has gone sour. Consider how and when to inform your advisor if you plan to change advisors. Be professional and respectful. Thank your advisor for past support and guidance. Don’t damage, or further damage, the relationship. Faculty may have professional relationships with each other and in some cases personal relationships. Consider how such relationships may influence your choices in changing advisors and consider asking the following people to help you navigate complicated situations. Your DGS, if appropriate Office of the University Ombudsman Graduate School’s Senior Assistant Dean for Graduate Student Life ( janna.lamey@cornell.edu ) Graduate School’s Associate Dean for Academics ( gradacad_assoc_dean@cornell.edu ) Forms: Use Student Center if you are changing your advisor before your A exam (for Ph.D. students). Use the Post A Committee Change Petition form for changes after the A exam. More information is available on the Graduate School’s Policy pages . Challenges and Potential Solutions All good relationships take work. To navigate an advising relationship successfully over time, you should familiarize yourself with some common challenges and possible actions to take. Challenge: Mismatch in communication needs or style One example of a communication challenge in an advising relationship is when you want input along the way during a writing project, but you have an advisor who prefers to wait to comment on a complete written draft. Some possible steps to address this might be to talk to peers about they have handled this in their relationship with their advisor or to explain to your advisor how his or her input at this earlier stage will help speed you along toward having a complete draft for review. It’s important in communicating with your advisor to show that you understand what alternative they are proposing and why (e.g., “I understand that …”). Challenge: Advisor unavailable or away Your advisor might be away from campus for a semester or more to conduct research or take a sabbatical leave. Or when a grant proposal deadline or report is looming, your advisor might be less available. Maybe you’ve emailed your advisor several times with no response. Planning and stating in advance what you need, such as feedback on a manuscript draft or signatures on a fellowship application, can help your advisor anticipate when you will have time-sensitive requests. Making plans in advance to communicate by email or video conference when either of you will be away from campus for a longer period of time is another useful strategy. Your director of graduate studies (DGS) and other faculty who serve as special committee members can also provide advice when your advisor is unavailable. Challenge: Misaligned expectations You are ready to submit a manuscript for publication. Your advisor says it needs much more work. Or you begin your job search, applying to liberal arts colleges with very high reputations, or schools in your preferred geographic location, but your advisor insists that you should apply for positions at top research universities. Discussing your needs and expectations early, and often, in the advising relationship is essential. Get comfortable, and skilled, advocating for yourself with your advisor. Use the annual Student Progress Review as an opportunity to communicate your professional interests and goals with your advisor. Use multiple mentors beyond your advisor to get advice and expertise on topics where you need a different perspective or support. Sometimes challenges can become opportunities for you to develop and refine new skills in communication, negotiation, self-advocacy, and management of conflict, time, and resources. For example, although you might feel abandoned if your advisor is unavailable for a time, even this potentially negative experience could become an opportunity to learn how to advocate for yourself and communicate about your needs and perceived difficulties in the relationship. Advising Resources On Campus Graduate School deans and directors are available to answer academic and non-academic questions and provide referrals to useful resources. Counseling and Psychological Services (CAPS) staff offer confidential, professional support for students seeking help with stress, anxiety, depression, grief, adjustment challenges, relationship difficulties, questions about identity, and managing existing mental health conditions. Let’s Talk Drop-in Consultations are informal, confidential walk-in consultations at various locations around campus. External Resources University of Michigan Rackham, How to Get the Mentoring You Want Laura Gail Lunsford & Vicki L. Baker, 2016, Great Mentoring in Graduate School: A Quick Start Guide for Protégés Michigan State University, Guidelines for Graduate Student Advising and Mentoring Relationships Michigan State University, Graduate Student Career and Professional Development Template for Meeting Notes Adapted and expanded from Maria Gardiner, Flinders University © Flinders University 2007; used with permission and published in The Productive Graduate Student Writer (Allen, 2019). Used here with permission of the author and publisher. Use this template for making notes to help you plan for a productive meeting with your advisor, keep track of plans made, and clearly identify next steps that you’ll need to take to follow up on what you discussed. Mentoring Resources Graduate School Programs Focused on Mentoring Building Mentoring Skills for an Academic Career Develop and enhance effective communication and mentorship skills that are broadly transferrable to all careers. Offered by Future Faculty and Academic Careers. Graduate and Professional Students International (GPSI) Peer Mentoring Program Share lessons learned as a new international student at Cornell as a peer mentor with new international student peer mentees. Offered by the GPSI in collaboration with the Graduate School Office of Inclusion and Student Engagement. Graduate Students Mentoring Undergraduates (GSMU) Share knowledge with and provide support to undergraduate students interested in pursuing further education. Offered in collaboration with the Office of Academic Diversity Initiatives (OADI). Multicultural Academic Council (MAC) Peer Mentoring Program Develop strategies to excel academically and personally at Cornell and beyond as a peer mentee or share strategies as a peer mentor. Offered by MAC in collaboration with the Graduate School Office of Inclusion and Student Engagement. NextGen Professors Program Learn from faculty in Power Mentoring Sessions and prepare for careers across institutional types. Offered by the Graduate School Office of Inclusion and Student Engagement and Future Faculty and Academic Careers. Graduate School Programs with a Mentoring Component Graduate School Primer: Navigating Academia Workshop Series Program for new students on navigating graduate school with sessions on mentoring. Perspectives: The Complete Graduate Student Program for continuing students on common issues with some sessions on mentoring. GPWomeN-PCCW Speaker Series Series for all students featuring talks by Cornell alumnae with an occasional mentoring focus. Future Professors Institute One-day event featuring workshops and guest speakers with occasional mentoring focus. Intergroup Dialogue Project (IDP) Peer-led courses blending theory and experiential learning to facilitate meaningful communication with occasional mentoring focus. Building Allyship Series Series for the campus community featuring panels designed for productive dialogue with occasional mentoring focus. Institutional Memberships Center for the Integration of Research, Teaching, and Learning (CIRTL) Network Access to resources on teaching and research mentoring. NCFDD Access to career development and mentoring resources. New York Academy of Sciences (NYAS) Access to resources, including webinars and articles on mentoring. Mentoring Programs Across Campus CU EMPower Give and receive advice as part of a peer mentoring program for all College of Engineering students. Offered by Diversity Programs in Engineering. Mi Comunidad/My Community Peer mentoring program run by graduate and professional students affiliated with the Latin@ Graduate Student Coalition (LGSC) and supported by the Latina/o Studies Program (LSP) and Latina/o/x Student Success Office (LSSO) at Cornell University. Additional Resources: Mentoring and Leadership Tips from Graduate School Programs Cornell University Office of Faculty Development and Diversity – Resources for Mentors and Mentees Careers Beyond Academia LibGuide CUeLinks National Research Mentoring Network Graduate School Articles on Mentoring: Alumna Addresses Importance of Mentoring Becoming Better Mentors Through Workshop Series August Offers Mentoring Advice ‘A Better Chance of Providing Access’: Future Professors Institute Fosters Inclusivity Virtual Training and External Resources How to Get the Mentoring You Want: A Guide for Graduate Students – University of Michigan, Rackham Graduate School The Science of Effective Mentorship in STEMM – National Academies of Sciences, Engineering, Medicine Mentor Training: Online Learning Modules – University of Minnesota Clinical and Translational Science Institute Mentor Curricula and Training: Entering Mentoring – Center for the Improvement of Mentored Experiences in Research For other resources, view the Advising Guide for Research Students. If there is anything not included on this list that we should consider, please send the information and a link to gradschoolnews@cornell.edu . Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}