{
  "id": 3,
  "date": "2024-05-18T18:07:06.785768",
  "url": "https://gradschool.cornell.edu/student-experience/big-red-barn/meet-the-barn-staff/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Student Experience Big Red Barn Meet the Barn Staff Meet the Barn Staff Allen Field and Degree Program: Genetic, genomics, and development, Ph.D. program What do you like the most about the Big Red Barn? The inclusive atmosphere. Bella Field and Degree Program: Public health, master’s program Home: Winchester, Virginia Most Looking Forward to this Semester: I enjoy many of the upbeat activities that the Barn hosts! I am excited for the fast paced nights of TGIF and trivia night! Chadé Field and Degree Program: Industrial and labor relations, master’s program Home: Eagleville, Pennsylvania Most Looking Forward to: Any cultural event because it’s great to see people come together to celebrate. What Do You Like Most About the Barn? I like that it is a space to foster community among graduate students. Coulter Field and Degree Program: Biomedical engineering, Ph.D. program Home: Burlington, Massachusetts Most Looking Forward to This Semester: Becoming more involved with Cornell’s program and sports, and hopefully my A exam! Deepak Field and Degree Program: Industrial and labor relations, master’s program Home: Bangalore, India Diana (Trivia Host) Field and Degree Program: Mathematics, Ph.D. program Home: Chevy Chase, Maryland Most Looking Forward to this Semester: Trivia! Diego Field and Degree Program: Geological sciences, Ph.D. program Home: Talcahuano, Chile Best Parts of Working at the Barn: Pretty much everything. It has allowed me to practice my English and meet people from different cultures. I love how inclusive the Barn is with everyone. Also it has allowed me to make new friends. Favorite Activity at the Barn: TGIF, by far. I love how many people come to the Barn, how crowded it is, and how friendly everyone is. Don Field and Degree Program: Industrial and labor relations, master’s program Home: Long Island, New York Most Looking Forward to this Semester: Making new friends Emma Field and Degree Program: Natural resources and the environment, M.P.S. program Home: Rocklin, California Most Looking Forward to this Semester: Starting my capstone project Gabi Field and Degree Program: Mathematics, Ph.D. program Home: Rio de Janeiro, Brazil Most Looking Forward to: TGIF What Do You Like Most About the Barn? Trivia nights! George (Art Fellow) Field or degree Program : Biophysics, Ph.D. program Home: Ottawa, Canada Favorite Activity at the Barn: Art shows! Hetvi (Cultural Fellow) Field and Degree Program: Developmental psychology, Ph.D. program Home: Rajkot, Gujarat, India Most Looking Forward to this Semester: I am excited to organize festival celebrations such as Diwali, and Chinese New Year. Iris Field and Degree Program: Natural resources, Ph.D. program Home: Where I’ve lived Most Looking Forward to this Semester: Festive events! I love the energy! Isaac Field and Degree Program: Biochemistry, Ph.D. program Home: Accra, Ghana Most Looking Forward to this Semester: Making new friends and developing a business community Kristina Field and Degree Program: Integrative plant science, master of professional studies program Home: Saint Petersburg, Russia Most Looking Forward to this Semester: Making friends at Cornell Lauren Field and Degree Program: Genetics, genomics, and development, Ph.D. program Home: Hingham, Massachusetts Most Looking Forward to this Semester: I am excited to participate in TGIF. It’s a nice way to kick off the weekend and relax from research work. Matt Field and Degree Program: Physics, Ph.D. program Home: Houston, Texas Most Looking Forward to this Semester: TGIFs! I also really want to try the trivia more frequently. Natalia Field and Degree Program: Health administration, master’s program Home: Chile Most Looking Forward to this Semester: Trivia night and fun activities/cultural activities too Norie (Social Fellow) Field and Degree Program: Public administration, master’s program Home: Washington, D.C. Most Looking Forward to this Semester: I’m most excited to plan and attend fun and engaging social and networking events at the Big Red Barn! What Do You Like Most About the Barn? I love that the Big Red Barn is a space where graduate students from across campus and gather together and get to know people from outside of their programs. I’ve met so many people from across campus that I wouldn’t have been able to otherwise, and I appreciate the Barn’s role in encouraging these connections. Reed Field and Degree Program: Industrial and labor relations, master’s program Home: Niagara Falls, Canada Most Looking Forward to this Semester: I’m looking forward to TGIF! Renee Field and Degree Program: Regional planning, master’s program Home: Pittsburgh, Pennsylvania What Do You Like Most About the Barn? I love the opportunity to meet students outside my program and try new activities. Ruby Field and Degree Program: Genetics, genomics, and development, Ph.D. program Home: Providence, Rhode Island Most Looking Forward to this Semester: Making friends in different grad programs Sang-O Field and Degree Program: City and regional planning, Ph.D. program Home: Seoul, South Korea What Do You Like Most About the Barn? Its atmosphere and TGIF 🙂 Sara Field and Degree Program: Mathematics, Ph.D. program Home: Calgary, Alberta, Canada Favorite Activity at the Barn: Trivia and TGIF! Shane Field and Degree Program: Genetics, genomics, and development, Ph.D. program Home: Chicago, Illinois Most Looking Forward to this Semester: TGIF, it’s a great way to begin the weekend. What Do You Like Most About the Barn? The casual environment. Sherry (Sustainability Fellow) Field and Degree Program: Operations research and information engineering, Ph.D. program Home: Vancouver, Canada Most Looking Forward to this Semester: I am excited to participate in more landscape painting events, since art is a great way to relax. What Do You Like Most About the Barn? The ambiance and the opportunity to meet grad students from other departments. Sudan (Wellness Fellow) Field and Degree Program: Ecology and evolutionary biology, Ph.D. program Home: Jamaica, Queens, NYC Most Looking Forward to this Semester: Regular yoga sessions What Do You Like Most About the Barn? Close by environment dedicated to supporting graduate students Sunita Field and Degree Program: Biomedical engineering, M.Eng. program Home: Albany, New York Most Looking Forward to this Semester: Making new friends here at Cornell Tina Field and Degree Program: Chemical engineering, Ph.D. program Home: Places where my parents live are home to me. Best Parts of Working at the Barn: I enjoy meeting new people and I like that the people at the Barn are friendly and cool to work with! Yong Field and Degree Program: Management, master of professional studies Home: Seoul, Korea Most Looking Forward to this Semester: TGIF Zachariah (Family Fellow) Field and Degree Program: Near Eastern studies, Ph.D. program Home: St. Paul, Minnesota Most Looking Forward to this Semester: I’m really excited to bring in cool guests/performers (like on St. Patrick’s day) What Do You Like Most About the Barn? The way staff and students mingle and participate in events together sometimes. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}