{
  "id": 3,
  "date": "2024-05-18T18:15:18.831871",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/faculty-resources/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Faculty Resources Faculty Resources Resources for Supporting Graduate Student Diversity, Inclusion, and Well-being Graduate School Office of Inclusion & Student Engagement Graduate School Office of Graduate Student Life Future Faculty & Academic Careers Center for Teaching Innovation Office of Faculty Development and Diversity Intergroup Dialogue Project Office of the Dean of Students, Diversity and Inclusion Student Disability Services Cornell Health Office of Institutional Equity & Title IX – Responsibility to Report The Office of Postdoctoral Studies Graduate School Office of Inclusion & Student Engagement The Office of Inclusion & Student Engagement (OISE) supports professional development programming and the advancement of the representation, inclusion, and success of graduate students from historically underrepresented and marginalized populations. This includes supporting faculty engagement in discussions and workshops on holistic admissions practices, diversity recruitment practices, establishing more inclusive research and learning environments, and developing greater understanding of the experiences and identities represented in the graduate population. Staff are also available for individual consultations. To learn more, visit the Diversity & Inclusion page . Workshops/Panels on Advancing Diversity & Inclusion in Graduate Education Exploring Diversity Strategies for Graduate Recruitment & Selection OISE provides consultations, and hosts invited speakers and facilitated panel discussions that focus on diversity recruitment strategies, equity-based holistic review practices in graduate admissions, and being aware of unconscious biases in the review of applications. For more information on diversity recruitment and holistic review resources, contact Sara Xayarath Hernández at grad_assoc_dean@cornell.edu and Anitra Douglas McCarthy at amd78@cornell.edu . Equity-Based Holistic Review Workshops & Resources for Graduate Admissions EQUITABLE PRACTICES FOR LETTERS OF RECOMMENDATION The recent SCOTUS decisions on SFFA v. Harvard/UNC have broad implications for admissions across all degree programs within and beyond Cornell. As part of our response, the Graduate School offers directors of graduate studies, graduate admissions chairs, and graduate fields assistants the opportunity to engage in workshops focused on maximizing equity and minimizing risk in graduate admissions through mission and values-driven strategies and tools. Since 2018, the Graduate School has been engaged in systemic change efforts to advance equity-based holistic review practices within graduate admissions, which have led to productive outcomes for many graduate fields. Moving forward, our efforts to maximize equity in graduate admissions must be combined with processes that will also minimize legal risk for the institution and those engaged in selection. These workshops allow us to provide an in-depth review of the Graduate School Admissions Rubric template, which all graduate fields are required to use, and how fields may build upon it to meet graduate field-specific needs to inform admissions decisions. During these sessions, we also review other aspects of holistic review practices and share recruitment, communication, and selection strategies considerate of our post-SCOTUS conditions. “Equity in Science” Book Talk with Author and Professor Julie Posselt The Graduate School Offices of Inclusion & Student Engagement and Future Faculty and Academic Careers held a discussion with Julie R. Posselt , associate professor of higher education at the University of Southern California, on her book, Equity in Science: Representation, Culture and the Dynamics of Change in Graduate Education . Equity in Science: Representation, Culture, and the Dynamics of Change in Graduate Education “STEM disciplines are believed to be founded on the idea of meritocracy; recognition earned by the value of the data, which is objective. Such disciplinary cultures resist concerns about implicit or structural biases, and yet, year after year, scientists observe persistent gender and racial inequalities in their labs, departments, and programs. In ‘Equity in Science,’ Julie Posselt makes the case that understanding how field-specific cultures develop is a crucial step for bringing about real change. She does this by examining existing equity, diversity, and inclusion efforts across astronomy, physics, chemistry, geology, and psychology. These ethnographic case studies reveal the subtle ways that exclusion and power operate in scientific organizations and, sometimes, within change efforts themselves. Posselt argues that accelerating the movement for inclusion in science requires more effective collaboration across boundaries that typically separate people and scholars—across the social and natural sciences, across the faculty-student-administrator roles, and across race, gender, and other social identities. Ultimately this book is a call for academia to place equal value on expertise, and on those who do the work of cultural translation. Posselt closes with targeted recommendations for individuals, departments, and disciplinary societies for creating systemic, sustainable change.” Cornell community members can access a recording of the “Equity in Science” book talk. Cornell community members can access a free copy of the e-book. Equity in Science book discussion guide Chapter 1: Equity Work as Science Chapter 2: Managing Complexity in Institutional Change Chapter 3: Eroded Boundaries & Everyday Interactions in Geoscience Fieldwork Chapter 4: Impression Management & Organizational Learning in Psychology & Chemistry Chapter 5: Inclusive Design & Disciplinary Boundary Work in Applied Physics Chapter 6: Advocacy and Management in Astronomy and Physics Chapter 7: Retooling Science Through Cultural Translation Exploring Strategies to Advance Inclusive Mentoring Practices Faculty Advancing Inclusive Mentoring (FAIM) is an equity-based systemic change initiative that provides a framework for inclusive mentorship applicable across graduate education and the professoriate. Bolstering this framework are resources and tools intended to be adapted and adopted to meet the contextual needs of mentors and mentees. FAIM is a collaboration of the Cornell Graduate School and Provost Office of Faculty Development and Diversity and the TRUST Alliance, which includes collaborators at Cornell, Montana State, and Purdue Universities. The Graduate School provides workshops, individual faculty consultations, and hosts invited speakers and facilitated panel discussions that focus on advancing inclusive mentoring practices and cultures within graduate education and academia. For more information on inclusive mentoring resources visit the FAIM Resource Center website or contact Associate Deans Sara Xayarath Hernández at grad_assoc_dean@cornell.edu and Colleen McLinn at cmm252@cornell.edu . My Voice, My Story: Understanding the Untold Lived Experiences of Graduate & Professional Students My Voice, My Story sessions pair video monologues constructed from real experiences of graduate students with facilitated discussions. The primary objectives of these sessions are to utilize the power of narratives to achieve greater understanding of the lived of experiences of graduate and professional students, and to develop and share strategies on how to create more inclusive and supportive research and learning environments. (Offered in partnership with Future Faculty and Academic Careers.) My Voice, My Story sessions are available for faculty and staff and graduate student and postdoc audiences. To request a My Voice, My Story session, contact either Sara Xayarath Hernández at grad_assoc_dean@cornell.edu or Colleen McLinn at futurefaculty@cornell.edu . Equity-Minded Mentorship – Why and How Identity Matters Speaker: Dr. Kimberly Griffin , Dean of the College of Education and Professor of Higher Education, University of Maryland While we know mentoring relationships are powerful interventions and a key strategy for promoting equity in the academy, we also know that these relationships often fall short of fulfilling their potential, particularly for early career colleagues with marginalized and minoritized identities. We will talk about what gets in our way of leveraging the power of mentorship to close equity gaps in the academy, and I will offer a framework for thinking about identity in the context of our relationships. We will also talk about promising practices and strategies that can enhance our ability to form mentoring relationships grounded in equity, affirmation, and care. Cornell community members can access a recording of this talk. Culturally Attuned Mentoring Paradigms – Relationships in Community Context Speaker: Dr. Sweeney Windchief (Fort Peck Assiniboine Tribe), Associate Professor of Adult and Higher Education at Montana State University How do mentors learn to mentor? Professional mentoring in higher education typically mirrors higher education in the contemporary American context, meaning that we tend to mentor the way we were mentored. This presentation builds upon the implementation of a program designed to develop the knowledge, skills, and dispositions of faculty who mentor American Indian and Alaska Native graduate students in the STEM fields and is recalibrated for current faculty in other fields as well as those considering academia as a career. The goal of this session is for participants to consider how they can become active in co-constructing their own, identity informed, professional mentor/mentee platform. We also will discuss the concept of self-authorship in order to activate one’s own agency in developing a “constellation of mentors”. Different Institutional types and the specific disciplines in which we work have their own unique cultures, geographies, infrastructure, and resources that need to be considered. Cornell community members can access a recording of this talk . Faculty Roundtable Discussion Series on Graduate Student Mentoring The Office of Faculty Development and Diversity and the Graduate School Offices of Inclusion and Student Engagement , and Future Faculty and Academic Careers collaboratively host faculty roundtable discussions on topics related to graduate student mentoring practices. Topics for these discussions include defining and managing expectations, recognizing and managing power dynamics, productively managing conflict, matching work style preferences, and understanding motivation. Roundtables provide faculty with the opportunity to engage in candid conversations and to receive and exchange resources to support their mentoring practices. Access recordings and resources from the faculty roundtable discussions at the following links: Authorship and Recognition: Establishing, Communicating, and Managing Expectations resources How to navigate authorship of scientific manuscripts ICJME: Defining the Role of Authors and Contributors Equity in Author Order: A Feminist Laboratory’s Approach Graduate Mentoring and Well-being: Translating Research into Practice ( slide-deck ; video recording ) Difficult Conversations, Conflict and Feedback within Mentoring Relationships (Recording) Establishing and Managing Mutual Expectations in Your Mentoring Relationships (Recording) Mentoring and Supporting International Scholars (Recording) Supporting Graduate Student Mental Health and Well-being in Your Mentoring Relationships (Recording) Additional Resources to Support Diversity and Equity-Based Practices in Graduate Education Equity in Graduate Education Equitable Practices for Writing, Reading, and Soliciting Letters of Recommendation Practical Guidance on Making and Keeping Graduate Admissions Equitable and Inclusive Preparing Graduate Admissions and Recruitment for Effects of COVID-1 Alfred P. Sloan Foundation: Understanding Investments and Outcomes in STEM Higher Education DEI Efforts CIRTL AGEP Toolkit: Advancing Inclusion in Doctoral Education & the Professoriate AAAS & EducationCounsel Diversity and the Law Resources SABER Striving Towards Inclusive Academic Biology Virtual Seminar Series (relevant content for those across the disciplines) Council of Graduate Schools: Social Justice and Anti-Racism Resources for Graduate Education Cornell Graduate School Pipeline Report: Bachelor Degree Production by University, Program, Race, and Gender (Data from the National Center for Education Statistics) Building Allyship Initiative Initiated by the GPSA Diversity and International Students Committee , the Building Allyship Series is a collaboration of the Graduate and Professional Student Diversity Council and the Graduate School Office of Inclusion and Student Engagement (OISE). This series provides an opportunity for members of the Cornell community to engage in productive dialogue focused on fostering a greater understanding of the many aspects of allyship and how we can better support one another through active, informed, and critical allyship . Each event seeks to create a safe space for critical dialogue where we can bridge gaps in knowledge, learn from each other, and create understanding without fear of judgment. Examples of topics explored through the Building Allyship Initiative include the following: Supporting Trans and Nonbinary People During Turbulent Times Understanding the Fundamentals of Allyship Understanding and Combating Insidious Forms of Anti-Asian Racism The Marginalization and Racialization of International Scholar Identities within the U.S. Context The Dangers of Performative Allyship – Understanding Intent versus Impact Combating Anti-Blackness: A Virtual “Fireside Chat” with Cornell Bouchet Scholars Coming Out for Allyship with the LGBTQ+ Community Existing and Acting at the Crossroads: Understanding Intersectionality to be Better Allies More information on upcoming and previous sessions in this series can be accessed on the Building Allyship Series page. Graduate School Office of Graduate Student Life The Office of Graduate Student Life develops and coordinates student life focused programs on topics related to maintaining a healthy student life, including mental health and stress management, sense of community, life-academic balance, and support for students’ personal development. Faculty can utilize this office to discuss navigating difficult academic/personal situations and resources available to support students with families. To learn more, visit the Office of Graduate Student Life page . Cornell community members can access additional resources and articles in support of graduate student well-being, mental health, and persistence in Cornell Box . RESOURCES FOR SUPPORTING GRAD STUDENT WELLBEING Cornell Workshops on Student Mental Health and Well-being Promoting a Culture of Well-Being This session is designed to encourage discussion among graduate faculty about the value of promoting a culture of well-being for the graduate student community in your graduate field. With the Graduate Student Experience data to demonstrate the strengths and areas of improvement from the perspective of your students, we discuss your community environment. We review best practices as identified by external groups and our Graduate and Professional Student Assembly. Finally, actionable strategies to promote a culture of well-being are provided to stimulate discussion. Promoting a Culture of Well-Being is available for faculty audiences. To request a session, please contact Janna Lamey at jsl62@cornell.edu. An Introduction to Mental Health This session is designed to define and normalize mental health, along with serving as an introduction on how best to support personal mental health. Key concepts of resilience are provided with an emphasis on sense of belonging, along with an opportunity to reflect on knowledge and commitment to self-care practices. Graduate Student Experience data is shared to help provide context to what peers are experiencing. Both university and local resources are provided. Perfect for first-year students, but can be modified for all levels. An Introduction to Mental Health is for graduate student audiences. To request a session, please contact Janna Lamey at jsl62@cornell.edu . Thrive (Don’t Just Survive!) Managing change and the multiple demands placed on a graduate student’s time, energy, and attention can feel overwhelming at times and affect physical and mental health. This session helps students learn ways to meet academic priorities and personal and social needs with skill and confidence. Participants explore 1) strategies to manage stress and build their resilience in order to successfully navigate the ups and downs of daily life and to maintain the ability to bounce back from challenging experiences and 2) the campus resources that help students thrive (not just survive) at Cornell. Workshops can range in time from 60–90 minutes depending on the group’s needs. Thrive (Don’t Just Survive!) is available for graduate student audiences. To request a session, please contact Janna Lamey at jsl62@cornell.edu. Additional programming opportunities for the graduate and professional student community are available through the Graduate School Primer: Navigating Academia Workshop Series . External Mental Health Resources for Scholars from Minoritized Identities ACE Report: Well-being for Students with Minoritized Identities Equity in Mental Health Toolkit National Alliance on Mental Health: Identity and Cultural Dimensions Consejos w/ Dr. Lisette Latinx Therapy Therapy for Black Girls Therapy for Black Men Asian Mental Health Collective Therapy Den Inclusive Therapists Open Path Psychotherapy Collective One Sky Center Protecting Student Mental Health in the Face of Antisemitism and Islamophobia WeRNative StrongHearts Native Helpline Future Faculty and Academic Careers Future Faculty and Academic Careers prepares graduate students and postdocs to excel as teachers, researchers, and as mentors. Through our membership in the CIRTL Network of nearly 40 institutions nationwide, graduate students and postdocs in all fields can prepare for academic careers in a wide range of settings. Future Faculty and Academic Careers programs are housed in the Cornell University Graduate School and offer both local and online professional development opportunities. To learn more, visit the Future Faculty and Academic Careers website . Cornell Programs on Mentoring and Inclusive Teaching Building Mentorship Skills for Academic Careers In this series of lunchtime workshops, graduate students and postdocs will develop essential research mentoring skills, particularly in disciplines where research is conducted collaboratively in a laboratory or field setting. Effective mentoring of students is a key skill influencing everything from research productivity to personal satisfaction. Learn best practices for mentoring undergraduate, graduate, and postdoctoral researchers, and develop advising and communication skills needed to lead a research team. Interested participants should apply prior to the start of the series with the expectation of attending all workshops. Building Mentoring Skills program completion certificates will be provided for fully participating in at least four of five sessions. Building Mentoring Skills is offered annually in the spring semester. Inclusive Teaching Institute for Graduate Students and Postdocs The Inclusive Teaching Institute is a two-day workshop offered every spring for graduate students and postdoctoral scholars to explore strategies for engaging diversity and fostering inclusion in teaching and learning. Participants identify ways to increase accessibility and boost student engagement and belongingness, discuss inclusive course design, and create an action plan for future teaching. (Offered in Partnership with the Center for Teaching Innovation.) Center for Teaching Innovation The Center for Teaching Innovation (CTI) supports Cornell University teaching community members with a full complement of individualized services, programs, institutes, and campus-wide initiatives. Their vision is a Cornell teaching community that embraces the research on learning, catalyzes innovative instructional practices, and creates learning environments where every student can thrive. To learn more, visit the Center for Teaching Innovation website . The Center for Teaching Innovation offers instructors a range of individual and small group resources and consultation services related to teaching and learning in the inclusive classroom. Examples of these opportunities include: Consultations CTI staff can provide faculty with confidential, formative consultations. CTI staff can also meet with your department to facilitate a discussion on a range of topics such as addressing student belongingness, increasing student engagement, creating more inclusive learning environments, and facilitating student concerns when they arise. Email cornellcti@cornell.edu to request a consultation. “Teaching and Learning in the Diverse Classroom” Online Course In Fall 2018, CTI launched a new online course, “Teaching and Learning in the Diverse Classroom.” This course is open every semester and is open to any Cornell instructor, including graduate students and postdocs, with all disciplines and any level of diversity expertise welcome. “Teaching and Learning in the Diverse Classroom” explores a framework for inclusive course design centered on intersecting social identities in the learning environment, pedagogical practices that support active student engagement, curriculum design from a diversity perspective, and strategies for individual and institutional change. The course runs for four weeks. Register on the Center for Teaching Innovation website . Faculty Institute for Diversity This two-day Faculty Institute for Diversity offers an opportunity for an interdisciplinary peer-group of faculty to transform a course through the lens of diversity and inclusion. Explore a five-dimensional framework that invites entry from all disciplinary perspectives: consider who you are, who you teach, how you teach, what you teach, and how this influences the learning environment. By the end of this institute, participants create an action plan for next semester’s teaching. Any Person, Many Stories: Histories of Exclusion and Inclusion at Cornell The Any Person, Many Stories project features stories in sketch, biography, podcast, interview, and video formats that can be used as learning resources for courses, workshops, and other meaningful purposes. The stories featured delve into powerful, sometimes painful histories, many of which are not broadly known. These stories also help to bring recognition to many of those who fought for a more inclusive Cornell and how their efforts are ever more critical to informing our ongoing and future DEI efforts at Cornell and beyond. Office of Faculty Development and Diversity The Office of Faculty Development and Diversity (OFDD) provides a range of resources, including training and support for deans, department chairs, and individual faculty members, in the areas of faculty development and diversity. To learn more, visit the Office of Faculty Development and Diversity website . Resources for Engaging in Conversations About Race and Anti-Racism This compilation of resources , adapted by the Office of Faculty Development and Diversity from materials sourced from the University of Michigan, provides information on anti-racist literature and other materials that you can read, watch, or listen to educate yourself and others as you seek to engage in conversations about race and anti-racism. Workshops on Implicit Bias in Recruitment and Retention It Depends on the Lens: Effective Search Practices A workshop focused on establishing an effective search and addressing issues such as unconscious bias and active recruitment. Best Practices in Academic Interviewing A workshop on best practices in academic interviewing, issues of legality, setting an inclusive tone at interviewing, etc. Viewpoints on Tenure and Promotion Discussion of issues like gender and teaching evaluation, how to address tenure clock extensions, service, and collaborative work. LGBTQ+ Resource Guide for Faculty and Staff Developed by the Provost’s Office of Faculty Development and Diversity and the Cornell LGBT Resource Center, the LGBTQ+ Resource Guide for Faculty and Staff offers best practices and tips, such as using gender-inclusive greetings in meetings and classrooms, integrating LGBTQ issues into curricula and hiring, or including statements in course syllabi and other gatherings that stimulate discussion and ensure civil discourse. Intergroup Dialogue Project The Intergroup Dialogue Project (IDP) is an academic initiative grounded in theory and practice that creates community across difference through dialogue. IDP collaborates with individuals, departments, programs, and student organizations to develop and deliver offerings ranging from customized three-hour introductory experiences to intensive semester-long academic courses. These intimate, peer-facilitated sessions address topics of identity and communication across difference while providing participants with the skills to engage in productive conflict and create new shared meanings. Consultations The IDP team provides individual consultation for faculty and staff on issues related to identity, communication across difference, and conflict. For more information about offerings and support for faculty and staff, contact the IDP team at dialogue@cornell.edu . IDP Workshop Program IDP offers workshops to members of the Cornell community including groups and organizations consisting of undergraduate students, graduate students, professional students, postdoctoral scholars, faculty, and/or staff. If you are interested in having a workshop provided by IDP, please fill out the Workshop Inquiry Form on the IDP Trainings and Workshops webpage . IDP Resources and Guides Community Agreements Community agreements are ‘ground rules’ that we establish early on to set expectations for how we want to communicate with each other. These agreements help set both practical norms and broader intentions of how we want to approach the conversation. ( This guide is for the broader Cornell community.) Listening & Learning with “I” Statements This guide is an accompaniment to our podcast, “I” Statements , where people with different identities come together to share their own beliefs, experiences, and perspectives, demonstrating both the power and the possibility inherent in communicating across difference. This guide is for people who would like to incorporate the podcast into their work with students and/or colleagues. (This guide is for educators more broadly.) Political Conversations This guide was prepared in advance of the 2020 U.S. presidential election. Although it refers specifically to this election, we believe the content here is applicable to many conversations people may wish to engage in surrounding politics. (This guide is for the broader Cornell community.) Using LARA LARA stands for listen, affirm, respond, and add information. The overarching aim of this tool is to encourage communication across difference (whether of identities, perspectives, or experiences). As a communication tool, LARA can be useful in building connection and trust with others, creating space for the exploration of multiple – even conflicting – perspectives, and bringing emotions, assumptions, and social identities into the conversation. The aim of LARA is to help steer a conversation towards mutual understanding of each other’s identities, lived experiences, and positions. (This guide is for the broader Cornell community.) Office of the Dean of Students, Equity and Belonging Training and Workshops The Dean of Students Identity Resources include the Asian and Asian American Center, LGBT Resource Center, Women’s Resource Center, Multicultural Student Leadership and Empowerment (affinity student organization advising support), the Office of Spirituality and Meaning-Making, Office for First-Generation and Low Income Support, and Office for Undocumented and DACA Student Support. The Dean of Students’ diversity and inclusion team offers a variety of workshops and training on topics related to diversity, equity, inclusion; social justice; allyship and bystander intervention; and identity and belonging. While these sessions are available to all Cornell community members, priority is given to student groups and student organizations. Learn more about these offerings on the Dean of the Students website. Undocu-Ally A program for faculty and staff to help create a more inclusive and supportive campus culture for undocumented/DACAmented students. Sessions reveal the lived experiences of undocumented students on campus, provide information on laws and policies and their effects, resources available on campus for undocumented students, and how to become an ally to this student population. For more information, visit the Undocumented/DACA Support Office website. Student Disability Services Student Disability Services includes resources for planning for accessibility, understanding accommodations, and universal design for instruction. For more information on their resources for faculty and students, visit the Student Disability Services website . Cornell Health Cornell Health provides counseling and health services and training programs for students, faculty, and staff. More information is available on the Cornell Health website . Guidance for Faculty and Staff Supporting Student Mental Health At Cornell, we all have a role to play in building a caring, inclusive community of students, faculty, and staff that takes seriously its responsibility to look out for one another. As a caring community, we value and prioritize one another’s mental health and well-being. As educators, mentors, and role models, faculty and staff have a profound impact on student well-being. Research has demonstrated that students’ academic experiences and relationships with faculty and staff have a considerable impact on their mental health and – in turn – students’ mental health has a significant impact on their academic performance. The Guidance for Faculty and Staff Supporting Student Mental Health resource page provides critical guidance for supporting students and provides details on resources available to support faculty and staff mental health and well-being. For questions and consultation, contact cornellhealth@cornell.edu . Intervene In the Intervene workshop, students view a brief video demonstrating ways in which student bystanders can successfully intervene in problematic situations. Seven different situations are addressed, including: sexual assault, sexual harassment, intimate partner violence (emotional abuse), an alcohol emergency, emotional distress, hazing, and racial bias. Following the video, there is an opportunity for students to engage in a facilitated conversation to reflect upon the attitudes and behaviors that influence the process of intervening as an individual or with assistance. To schedule a session, please contact Laura Santacrose at LBS65@cornell.edu . Sexual Violence Awareness & Response Interactive discussions are tailored for groups requesting programs on sexual violence, sexual harassment, dating violence, domestic violence, stalking, healthy and unhealthy relationships, etc. Participants are given tools and information to help them understand definitions and concepts, available resources, how to be an active bystander, and how to respond to a friend, colleague, or student who has shared an experience of abuse or violence. To schedule a session, please contact Laura Weiss at lbw26@cornell.edu . Office of Institutional Equity and Title IX – Responsibility to Report As part of its commitment to diversity and inclusion, Cornell makes a concerted effort to ensure that our community can identify potential acts of sexual and related misconduct and knows who to contact and consult with if they learn about or experience sexual or related misconduct. Our aim is to make sure campus remains a safe and respectful academic and workplace environment focused on education. The staff of the Office of the Title IX Coordinator , together with our community partners, is available to provide in-person trainings to staff or faculty. If your department or unit is interested in a training, please contact titleix@cornell.edu . Sexual Assault and Sexual Harassment Training HR 200 “Respect@Cornell” “Addressing Sexual Assault and Sexual Harassment” is required of all new employees at Cornell, replacing our previous program, “Building a Culture of Respect at Cornell.” This program, with an introduction from Cornell University President Martha Pollack, provides information on Cornell employee rights, responsibilities, and resources with respect to sexual and related misconduct and sexual harassment. It addresses how to respond should faculty or staff learn a member of our community has experienced any type of sexual violence or stalking and also lets faculty and staff know how to file a complaint. Federal law requires all faculty and staff to receive information about sexual assault/violence, domestic violence, dating violence (also known as intimate partner violence), and stalking prevention and response. The Title IX Office hopes and expects all current faculty and staff take this online course as part of their ongoing education and training mandates. HR 201 “Maintaining a Harassment-Free Workplace” HR 201 is a brief review of Cornell’s policy prohibiting sexual harassment in the workplace, including video examples of how to address and counsel employees subjected to workplace harassment and resources available to all Cornell employees on these topics. “Duty to Consult” Training There is a community responsibility for creating a safer, more caring campus culture in which bias, harassment, and violence have no place—and every member of our community is free to flourish. One of the many ways in which Cornell lives up to this commitment is through the “Duty to Consult” with the Title IX Coordinator, a responsibility set forth in Policy 6.4 and long incumbent upon all staff and faculty members (with the important exception of confidential resources), when they become aware of an alleged incident of sexual and related misconduct under this policy, such as dating violence, domestic violence, and stalking, that involves a student as either the complainant or respondent. This brief online training reviews the “Duty to Consult,” the importance of maintaining a student’s privacy, available confidential resources, and what does and does not happen when a member of the staff or faculty consults with the Title IX Coordinator, as well as providing information and resources for handling difficult conversations with students who choose to share experiences of sexual and related misconduct with you. Sexual Harassment and Assault – Response and Education (SHARE) SHARE offers resources and education related to sexual harassment and assault. Visit the SHARE website for more information. Office of Postdoctoral Studies The Office of Postdoctoral Studies monitors the status and needs of the postdoctoral campus community and serves as an advocate for postdoctoral issues to the vice provost for research and Cornell’s administration. For more information, visit the Office of Postdoctoral Studies website . Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}