{
  "id": 3,
  "date": "2024-05-18T18:16:47.248534",
  "url": "https://gradschool.cornell.edu/about/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts About Vision and Mission Land Acknowledgement Leadership Dean’s Statements Governance and Structure Organizational Chart General Committee Graduate Program Registration History of Graduate Study at Cornell Publications and Reports Program Metrics Graduate School News and Events Graduate School Alumni Newsletter Graduate School Original Stories Subscribe to Graduate School Newsletters Graduate School News You Belong at Cornell Safety and Security Reports Program Metrics Graduate School Mental Health & Faculty Mentor Development Initiatives Graduate and Professional Community Initiative Union Representation Contacts Staff Directory Events Calendar Resources Policies Forms Alumni Alumni Newsletter Spring 2024 Donor’s New Fund to Support Students, Mentoring Ten Inducted into Bouchet Graduate Honor Society Physics Ph.D. Candidate Wins 2024 Three Minute Thesis Competition Doctoral Candidate Selected as World Food Prize Council of Advisors Youth Representative Doctoral Alumna Selected for SUNY Chancellor Distinguished Ph.D. Graduate Dissertation Award Alumni in the News Alumni Newsletter Fall 2023 Donor-Funded Fellowship Helping Doctoral Candidate Improve Grapevines’ Climate Resilience Leveling Up: Graduate School, GPSA Provide New Air Conditioning, Other Improvements at the Big Red Barn Learning to Lead Inclusively Funding for Fluency: Grants Support Summer Language Study Alumni in the News Alumni Newsletter Spring 2023 ‘Like Having an Older Sibling’: Graduate Students Benefit from Peer Mentoring Donor-funded Scholarship Making a Difference for Ph.D. Students Ten Inducted into Bouchet Graduate Honor Society Doctoral Alumna Selected for SUNY Chancellor Distinguished Ph.D. Graduate Dissertation Award Alumni in the News Alumni Newsletter Fall 2022 Two Cornell Alumni Named Schmidt Science Fellows Travel Grants Help Graduate Students Conduct Research Across the Globe New Graduate School Program Demystifies Graduate Study for Diverse Students Alumni in the News Alumni Newsletter Spring 2022 Graduate School Dean Named Chair of Blue Ribbon Committee for National Academies Asian Literature, Religion, and Culture Ph.D. Candidate Wins Three Minute Thesis Competition Cornell Doctoral Candidate Wins National 3MT Competition First Generation Graduate Students Give Back Any Person…Any Career…Greater Impact Alumni in the News Alumni Newsletter Fall 2021 ‘Lights Along the Path’: Bouchet Alumni Give Back Grants Help Students Present Research Online Student Spotlight: Alex Ogbonna Student Spotlight: Charlotte Logan Student Spotlight: Lyrianne González Student Spotlight: Ngoc Truong Alumni in the News Alumni Newsletter Winter 2021 Nine Questions for Dean Boor Graduate School Associate Dean Wins National Leadership Award Can You Describe Your Research in Three Minutes? Multilingual Students Find Expanded Support Cornell Responds to Changing Student-Parent Needs Students’ Vaccine Videos go Viral Students, Alumni Celebrate Black Graduate Excellence Student Spotlight: Drea Darby Student Spotlight: Jason Chang Student Spotlight: David Dunham Student Spotlight: Tianyao Qu Alumnus Spotlight: Adem Efe Gencer, Ph.D. ’17 Alumna Spotlight: Malika Grayson, M.S. ’14, Ph.D. ’16 Alumni in the News Alumni Newsletter Summer 2020 Zoom Fatigue? Not for This Graduate School Staff. Degrees in Hand, New Alumni Discuss Remote Defenses Expanding Opportunities while Expanding Horizons New Group Supports First-Generation and Low-Income Students Workshops Offer Judgement-free Zone to Learn How to Be an Ally Becoming Better Mentors Through Workshop Series “Future Faculty and Academic Careers,” a New Name for a Long-Running Program Student Spotlight: Piyawat Louilarpprasert Student Spotlight: Michael Dunaway Student Spotlight: Tibra Wheeler Student Spotlight: Aditi Sahasrabuddhe Alumnus Spotlight: Javier Jaimes, Ph.D. Alumna Spotlight: Brooke Zanetell, Ph.D. ‘Speak and Be Heard’: Communication Tips from Eliza VanCort Alumni in the News Alumni Newsletter Fall 2019 New NSF GRFP Fellows Recognized Seven Graduate Students Awarded Wu Scholarships Data Transparency Expressing Gratitude at Orientation 2019 Careers Beyond Academia Expanded for All Ph.D.s Boot Camp Encourages Productivity Student Spotlight: Pichaya (Mint) Damrongpiwat Student Spotlight: Christian Posbergh Student Spotlight: Hirokazu Togo Student Spotlight: Chinasa Okolo Alumni in the News Alumni Newsletter Spring 2019 Plant Breeding Graduate Student Wins 2019 3MT Longtime Big Red Barn Manager Retires Grants Help Graduate Students Do Research Around the World Alumna Addresses Importance of Mentoring Using Stories Toward Greater Inclusion Carriage House to Student Center: The Big Red Barn Over the Years Changing Your Fixed Mindset into a Growth Mindset Alumni Newsletter Fall 2018 Alumni Newsletter Winter 2018 President Martha Pollack Q&A The Gratitude Project The Student Partner Career Fair Graduate School About About Graduate study has been a part of the Cornell experience since the founding of the University in 1865. About the Graduate School Cornell is one of the first institutions of higher education in the United States to offer advanced degrees, and one of the very first to admit women and African American students. Today, our Graduate School is an intellectually-stimulating, warm, vibrant community of nearly 100 fields of study. Vision and Mission Leadership Dean’s Statements Governance and Structure General Committee Roster History Publications and Reports Using electronic and printed materials , the Graduate School celebrates and promotes our system of graduate education both internally and externally. Program Metrics Graduate School Announcements Graduate School Alumni Newsletter Graduate School Original Stories Graduate School News You Belong at Cornell Safety and Security Reports Graduate and Professional Community Initiative The Graduate and Professional Community Initiative (GPCI) 2013, created by the Graduate and Professional Student Assembly in 2013 as a strategic five-year plan, provided a framework to identify and address issues related to graduate and professional student life. Progress reports as of Spring 2018 and Spring 2020 provide summaries of progress on GPCI-related issues that have been achieved through effective partnerships between graduate/professional students and many offices across campus, including the Graduate School. Union Representation Cornell Graduate Students United (CGSU) and their affiliate union, the United Electrical, Radio & Machine Workers of America (UE) filed a petition for representation with the National Labor Relations Board (NLRB) on September 28, 2023. We created a Union Representation section of our website to address information needs of the Cornell community related to this important issue. Contacts As a large research institution, Cornell has a variety of offices and resources to help you navigate everything from application to graduation. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}