{
  "id": 3,
  "date": "2024-05-18T18:07:19.869098",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/three-minute-thesis/3mt-2021/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Three Minute Thesis 3MT 2021 3MT 2021 Biochemistry, Molecular and Cell Biology Ph.D. Candidate Wins Three Minute Thesis Competition Bhargav Sanketi’s winning presentation. “My thesis explores the blueprint behind building a small intestine. I call it ‘to be or “knot” to be’,” began Bhargav Sanketi, a doctoral candidate in biochemistry, molecular and cell biology, at the sixth Cornell University Three Minute Thesis (3MT) competition. Alongside seven other finalists, Sanketi presented his dissertation research in just three minutes to a panel of judges and an audience from across campus. Presentations were judged by how clearly and compellingly they summarized their research using only one static slide to a general audience. His presentation, “To be or ‘knot’ to be: Blueprint for a small intestine,” earned him first place and $1,500. Second place and $1,000 was awarded to food science and technology doctoral candidate Rachel Allison for her presentation, “What CAN we do about stinky wine?” After nearly 200 audience members cast their ballots, votes were tallied and the People’s Choice Award and $300 were presented to entomology doctoral candidate Kara Fikrig for her presentation, “Are mosquitoes picky eaters?” Having enjoyed the 3MT as an audience member in the past, Sanketi appreciated the opportunity to participate in – and win – this year’s competition. “I think as scientists, we get so lost in our work that it’s easy to lose sight of what’s important,” he said. “I had attended previous editions of 3MT and always found them really entertaining. The idea of getting a diverse audience excited about a pretty heavy academic topic forces you to zoom out and see the big picture.” For Allison, undertaking the challenge of distilling a dense topic into accessible and engaging content was a primary motivator for her participation. “Going through the job interview process, I realized how challenging it could be to communicate my research experience to a non-specialist audience,” she said. “My career goal is to one day combine technical and business consulting in the wine industry, and adaptable communication skills will be essential. As a result, I have been trying to practice by taking advantage of more speaking opportunities.” The 3MT competition was first held in 2008 at the University of Queensland and has since been adopted by over 600 graduate schools in over 65 countries. 3MT challenges research degree students to present a compelling story on their dissertation or thesis and its significance in just three minutes, in language appropriate to a non-specialist audience. Cornell’s Graduate School first hosted a 3MT competition in 2015. The event has grown steadily since that time and this year, Cornell’s winner will compete in the Northeastern Association of Graduate Schools regional competition next month, and the top two winners from that event will showcase their research at the Council of Graduate Schools annual meeting in December 2021. “I am so impressed with each and every one of this year’s competitors,” said Jan Allen, associate dean for academic and student affairs. “They are all to be recognized for their successful presentations. In addition to presenting their complex research in just three minutes, everyone rose to the challenge of doing so in a virtual format. These skills will prove beneficial in academic work as well as in future careers.” Understanding the importance of communicating scientific topics clearly, Fikrig looked at the 3MT as a way to learn techniques for getting and holding listeners’ attention when sharing her research broadly. “I value science communication and recognize the importance of being able to explain my science in a way that is both comprehensible and interesting to the public. This is especially true since I study mosquitoes – the threat of disease transmission underscores the need to effectively communicate about my study system,” she said. “After watching videos of past 3MT presenters, I thought that the competition would be a great opportunity to learn and practice science communication skills. And I was not disappointed!” Cornell’s sixth 3MT final round competition was held on Thursday, March 18, 2021 at 4:15 p.m. on Zoom. This story is also available on the Cornell Chronicle website . Spring 2021 3MT Finalists Watch the 2021 Three Minute Thesis competition finale . First Place: Bhargav Sanketi, biochemistry, molecular, and cell biology doctoral candidate Watch Bhargav Sanketi’s 3MT presentation . Presentation Title: “To be or ‘knot’ to be – blueprint to a small intestine” Special Committee Chair: Natasza Kurpios Area of Research: Developmental biology of the small intestine Biography: Bhargav Sanketi is a Ph.D. candidate in the Kurpios lab studying how the small intestine obtains its looped structure during development. His investigations use a combination of chicken embryology, mouse genetics, and single cell genomics. Bhargav is from Bangalore, India and spends his free time cooking, writing music, or watching international cinema. Favorite Thing About Cornell: All the waterfalls and gorges nearby. What did you learn from the 3MT? How did it help you? I think as scientists, we get so lost in our work that it’s easy to lose sight of what’s important. I had attended previous editions of 3MT and always found them really entertaining. The idea of getting a diverse audience excited about a pretty heavy academic topic forces you to zoom out and see the big picture. It feels nostalgic, like the first time I started thinking about the project and the analogies I used to understand it better. Second Place: Rachel Allison, food science and technology doctoral candidate Watch Rachel Allison’s 3MT presentation . Presentation Title: “What CAN we do about stinky wine?” Special Committee Chair : Gavin Sacks Area of Research: Wine flavor chemistry Biography: Rachel Allison is a Ph.D. candidate and aspiring consultant in the field of food science. With a focus in wine flavor chemistry, her research looks at the development of reductive off-aromas during wine storage, particularly related to the stability of enological treatments with copper and interactions between wine and aluminum can packaging. Favorite Thing About Cornell: Curiosity is always encouraged. What did you learn from the 3MT? How did it help you? Going through the job interview process, I realized how challenging it could be to communicate my research experience to a non-specialist audience. My career goal is to one day combine technical and business consulting in the wine industry, and adaptable communication skills will be essential. As a result, I have been trying to practice by taking advantage of more speaking opportunities. I credit my lab group for helping me to develop my presentation skills over the last few years. I have always received insightful feedback from my friends and colleagues, and they encouraged me to participate in the 3MT. I received many different perspectives so I learned to interpret and condense a lot of presentation lessons alongside building the thesis story. Every comment helped me to construct an effective final product. I’m sure the experience will help me as I write my thesis. People’s Choice: Kara Fikrig, entomology doctoral candidate Watch Kara Fikrig’s 3MT presentation . Presentation Title: “Are mosquitoes picky eaters?” Special Committee Chair: Laura Harrington Area of Research: Mosquito feeding ecology Biography: Kara Fikrig studies mosquito feeding behavior and hopes that her research will help public health efforts to reduce global suffering from mosquito-borne diseases. She believes that science communication is critical to achieve that goal. As such, she is dedicated to ensuring that science is understood and valued by the public and elected representatives. Favorite Thing About Cornell: The easy access to beautiful nature! What did you learn from the 3MT? How did it help you? First, I would like to thank my family, friends, and lab for their support, both during this competition and throughout my development as a scientist. I decided to participate in the 3MT competition because I value science communication and recognize the importance of being able to explain my science in a way that is both comprehensible and interesting to the public. This is especially true since I study mosquitoes – the threat of disease transmission underscores the need to effectively communicate about my study system. After watching videos of past 3MT presenters, I thought that the competition would be a great opportunity to learn and practice science communication skills. And I was not disappointed! I learned new techniques, such as portraying enthusiasm despite being nervous, and had the opportunity to practice techniques that I had learned previously, like employing a hook to grab the listeners’ attention and using relatable metaphors. It was challenging to condense my project into three minutes – but the process of doing so helped me to realize that many of the details that I considered crucial were in fact unnecessary to understand the overarching message. The skills that I developed through participating in the 3MT competition will help me to more effectively and confidently communicate my science in the future. And I’m sure that the condensed explanation of my work will come in handy once social gatherings begin again! Xiangkun (Elvis) Cao, mechanical engineering doctoral candidate Watch Xiangkun (Elvis) Cao’s 3MT presentation . Presentation Title: “Turning our carbon liability into an opportunity” Special Committee Chair: David Erickson Area of Research: Artificial photosynthesis, solar fuels, CO2 conversion Biography: Xiangkun (Elvis) Cao is a Ph.D. candidate in mechanical engineering working on artificial photosynthesis at Cornell University. He is a Lindau Nobel Alumnus (2020), UNICEF Young Changemaker on Sustainable WASH Solutions (2020), Forbes 30 Under 30 Honoree (2019), and BP Future Energy Leader (2019), among others. Favorite Thing About Cornell: The ice cream at the Cornell Dairy Bar. Olivia Graham, ecology and evolutionary biology doctoral candidate Watch Olivia Graham’s 3MT presentation . Presentation Title: “Small bugs, big impacts: Herbivores, seagrass, and disease” Special Committee Chair: Drew Harvell Area of Research: Marine ecology, disease ecology, community ecology Biography: Olivia Graham is a Ph.D. candidate in Drew Harvell’s lab. By combining field and laboratory approaches, she studies the role of environment and biodiversity—host genetics, herbivores, and microbes—on disease dynamics in seagrass. Outside of all things marine, Olivia enjoys baking, adventures with her puppy, and science communication. Favorite Thing About Cornell: Cornell is truly an institution where anyone can study anything. The opportunities are boundless, creating a diverse, collaborative learning environment and community. Jessica Maya, genetics, genomics, and development doctoral candidate Watch Jessica Maya’s 3MT presentation . Presentation Title: “Fueling the cells in chronic fatigue syndrome” Special Committee Chair: Maureen Hanson Area of Research: Immunology and metabolism of chronic fatigue syndrome Biography: Jessica Maya is a fourth year graduate student originally from Birmingham, Alabama. She has been doing scientific research since high school and has worked on projects involving human diseases for the majority of that time. Maya comes from a big Colombian family, and when she’s not in lab, she enjoys painting, quilting, and salsa dancing. Favorite Thing About Cornell: My favorite thing about Cornell is how collaborative all of the labs and departments are with each other. The interdisciplinary approach that is fostered here allows for some amazing work to get done! Seema Singh, city and regional planning doctoral candidate Watch Seema Singh’s 3MT presentation . Presentation Title: “Women and transport: What are the planners missing?” Special Committee Chair: Michael A. Tomlan Area of Research: Transport planning, gender-sensitive planning, and urban governance Biography: Seema Singh studies gender and transport linkages in India. She hopes to reduce gender-based inequalities in cities by mainstreaming women’s needs in transport planning and policymaking. She is enthusiastic about sustainable living and was selected as a Young leader in Sustainable Transport in 2019. Favorite Thing About Cornell: Cornell’s motto: “… an institution where any person can find instruction in any study.” Alan Sulpizio, biochemistry, molecular, and cell biology doctoral candidate Watch Alan Sulpizio’s 3MT presentation . Presentation Title: “Legionella, aliens of the microscopic world” Special Committee Chair: Yuxin Mao Area of Research: Biochemistry and structural biology Biography: Alan Sulpizio is interested in learning about proteins of unknown function. He considers the infectious bacteria Legionella an excellent organism to study because they use many alien-like protein weapons to hijack our cells. By discovering how these unique legionella proteins act, we can learn more about our biology and potential therapeutics. Favorite Thing About Cornell: Hiking through the beautiful nature surrounding campus. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}