{
  "id": 3,
  "date": "2024-05-18T18:07:23.878802",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/three-minute-thesis/3mt-2023/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Three Minute Thesis 3MT 2023 3MT 2023 Computer Science and Statistics Ph.D. Candidates Win Three Minute Thesis Competition Yurong You, Kim Hochstedler, and Lidia Komondy For the first time in Graduate School history, two doctoral candidates tied for first place in the eighth Cornell Three Minute Thesis (3MT) competition, held on March 30, on Zoom. Yurong You, a doctoral candidate in computer science, and Kim Hochstedler, a doctoral candidate in statistics, wowed the judges and took home co-first place for their presentations, “Can Autonomous Vehicles Learn from Their Own Memories?” and “The Heart of Misdiagnosis,” respectively. Each were awarded the top prize of $1,500. Alongside six other finalists, Hochstedler and You presented their dissertation research in just three minutes to a panel of judges and a virtual audience from across campus and around the world. Presentations were judged by how clearly and compellingly students summarized their research to a general audience, using only one static slide. Second place and $1,000 was awarded to entomology doctoral candidate Lidia Komondy for her presentation, “Seeing is Believing, if You Know Where to Look,” and after nearly 100 audience members cast their ballots, votes were tallied and the People’s Choice Award and $250 were also presented to You. This year’s judges included Eldora Ellison, Ph.D. ‘94, a member of Cornell’s Board of Trustees; Kim Wagner ‘85, a member of Cornell’s Board of Trustees; Bruno Shirley, an Asian literature, religion, and culture doctoral candidate and 2022 first place winner; and Matt Ranieri ‘06, M.S. ’09, Ph.D. ‘13, president of the College of Agriculture and Life Sciences Alumni Association. “The presentations were fascinating and came from finalists with expertise in so many impressive and diverse research topics. It was amazing to see how impactful these research projects were to the world,” said Komondy. “This experience helped me realize how important scientific research is outside the lab and how important it is to keep the public updated on the implications of our research findings.” Kim Hochstedler, Yurong You, and Fangming Cui attend the 3MT reception at the Big Red Barn. Each of the winners agreed that participating in the 3MT was a great way to practice talking about their research in a way that engages and excites individuals outside of their fields and that the experience will influence the way they share their research going forward. “The best way to explain things is to stand in the audience’s shoes and use simple words,” said You. “Participation in 3MT will undoubtedly shape my future presentations.” Hochstedler said, “As I continue to communicate my research in future presentations and projects, I think these lessons of how to connect with an audience and explain my work succinctly will remain valuable. I now feel very prepared for the next family reunion when people ask me what I’m working on at Cornell!” The 3MT competition was first held in 2008 at the University of Queensland and has since been adopted by over 900 universities in over 85 countries. 3MT challenges research degree students to present a compelling story on their dissertation or thesis and its significance in just three minutes, in language appropriate to a non-specialist audience. Cornell’s Graduate School first hosted a 3MT competition in 2015 and the event has grown steadily since that time. “The 3MT is an excellent way for our doctoral students to practice communicating complex ideas to a broader audience, which is a skill beneficial not only for their time as students but for when they enter the professional world as well,” said Kathryn J. Boor, dean of the Graduate School and vice provost for graduate education. “We are so proud of each and every one of this year’s finalists.” 2023 3MT Finalists Watch the 2023 Three Minute Thesis competition finale. Co-First Place and People’s Choice Award: Yurong You , computer science doctoral candidate Watch Yurong You’s presentation . Presentation Title: “Can Autonomous Vehicles Learn from Their Own Memories?” Special Committee Chair: Killian Weinberger and Bharath Hariharan Area of Research: Machine learning, computer vision Biography: Yurong You is a Ph.D. candidate in computer science, advised by Prof. Kilian Q. Weinberger and Prof. Bharath Hariharan. Before he came to Cornell, he received his bachelor’s degree from Shanghai Jiao Tong University (ACM honors class). His Ph.D. research focuses on enhancing 3D perception for autonomous vehicles, particularly through innovative methods. Favorite Thing About Cornell: Amazing people at Cornell! Co-First Place: Kimberly Hochstedler, statistics doctoral candidate Watch Kimberly Hochstedler’s presentation . Presentation Title: “The Heart of Misdiagnosis” Special Committee Chair: Martin Wells Area of Research: Correcting for misclassification/misdiagnosis in medical studies Biography: Kim Hochstedler is a Ph.D. candidate in statistics. She received her M.S. in biostatistics from the University of Michigan in 2020 and graduated with her B.S. in statistics and psychology from Carnegie Mellon University in 2018. Her research involves developing statistical methods for misclassified outcome data in healthcare and criminal justice settings. Favorite Thing About Cornell: The ice cream. Second Place: Lidia Komondy, entomology doctoral candidate Watch Lidia Komondy’s presentation . Presentation Title: “Seeing is Believing, if You Know Where to Look” Special Committee Chair: Brian Nault Area of Research: Precision agriculture, insect vector ecology, integrated pest management Biography: Lidia Komondy is a Ph.D. candidate in the field of entomology. Her research focuses on the vector ecology of insect-transmitted plant pathogens and the use of precision agricultural tools to solve modern problems in the ecological sciences. She hopes that her research will help alleviate the escalating challenges that growers are facing. Favorite Thing About Cornell: The Big Red Barn! Fangming Cui, psychology doctoral candidate Watch Fangming Cui’s presentation . Presentation Title: “An Upside to Disappointment in Close Relationships: Evidence for a Motivational, Relationship-Promoting Role” Special Committee Chair: Vivian Zayas Area of Research: Close relationships, emotion, motivation Biography: Originally from China, Fangming is a Ph.D. candidate in psychology with an emphasis on social psychology. Her research mainly focuses on the downstream consequences of diverse emotional expressions in close relationships. She is fascinated with the idea of the “positivity of negativity,” wherein negative emotional expressions can, at times, exert positive relational outcomes. Favorite Thing About Cornell: Taverna Banfi brunch and salads at the Terrace restaurant. Sharada Gopal, biomedical and biological sciences doctoral student Watch Sharada Gopal’s presentation . Presentation Title: “Worming Our Way Through a Longer Life” Special Committee Chair: Siu Sylvia Lee Area of Research: Aging Biography: Sharada Gopal am a third-year graduate student in Dr. Sylvia Lee’s lab, where she studies the molecular mechanisms that regulate aging. Originally from Bangalore, India, Gopal came to Cornell for her master’s degree before transitioning to the BBS program to pursue a Ph.D. Beyond her research, she enjoys swimming in Ithaca’s picturesque lakes, singing, and cooking. Favorite Thing About Cornell: The BBS community. Yuexing Hao, design and environmental analysis doctoral student Watch Yuexing Hao’s presentation . Presentation Title: “AI-Enhanced Patient-Centered Clinical Shared Decision-Making (SDM): A ‘Black Box’ Study with Older Adults” Area of Research: Health intelligence, human-computer interaction Biography: Yuexing Hao is a Ph.D. student in design and environmental analysis with a concentration in human centered design at Cornell University. She earned two computer science degrees from Rutgers University (B.A.) and Tufts University (M.S). Currently, her research focus is on health intelligence and human-computer interaction. Favorite Thing About Cornell: P.E classes! I took ice hockey, squash, water skiing, and yoga, all of which were fantastic experiences. Sangwoo Park, biophysics doctoral candidate Watch Sangwoo Park’s presentation . Presentation Title: “Sugar Barrier on the Cancer Cells” Special Committee Chair: Matthew Paszek Area of Research: Glycobiology, immunotherapy, biophysics Biography: Sangwoo Park is from Changwon, South Korea. His current research focuses on developing new immunotherapies targeting the cancer cell glycocalyx. He has developed an optical microscopy method to understand the physical properties of glycocalyx. The ultimate goal of his research is to find treatment methods to eradicate cancers. Favorite Thing About Cornell: Wineries and hiking. Susannah Sharpless , English language and literature doctoral candidate Watch Susannah Sharpless’s presentation . Presentation Title: “How Did Maritime Trade Shape the Imaginations of American Women Writers?” Special Committee Chair: Shirley Samuels Area of Research: 19th-century American Literature Biography: Susannah Sharpless is a Ph.D. candidate studying nineteenth-century literature. Her dissertation is titled, “‘Subtle Cargoes’: The Terraqueous Romantic in Nineteenth-Century Women’s Writing.” 2023 Final Round 3MT Competition The live virtual Three Minute Thesis Competition Final Round took place at 3:00 pm ET on March 30, 2023. Eight finalists competed for first and second prize in the judging and People’s Choice Award winner. A post-event reception was held at the Big Red Barn starting at approximately 4:30 pm ET, and was open to the Cornell community and families and friends of the finalists and judges. Three Minute Thesis (3MT®) is a competition to help doctoral students develop and showcase their research communication skills. Cornell’s 3MT challenges graduate students to present their dissertation as a compelling story in just three minutes, with one slide, in language appropriate to a non-specialist audience. Preliminary Round Events All competitors submitted a recorded presentation of their talk by noon ET on Monday, March 13, 2023 in order to compete in the Preliminary Rounds that selected finalists. We thank all of our wonderful preliminary round presenters for participation in the 2023 competition. Those who are still enrolled as doctoral students next year are welcome to enter the competition again. Thank you also to our preliminary round judges, including Evelyn Ambríz, Merry Buckley, Anitra Douglas-McCarthy, Christine Holmes, Janna Lamey, Nathan Lindberg, Heidi Marshall, and Christian Miller. Registration was opened from February – March 13, 2023, and an information was held on March 6. View the information session recording . Need assistance recording your video submission? Timeslots were available on Thursday, March 9 to record your preliminary round video in the Big Red Barn greenhouse with the help of a Barn staff member. Recording equipment was provided. If you should have questions or concerns regarding the 3MT Competition, please email us at: grad3mt@cornell.edu . Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}