{
  "id": 3,
  "date": "2024-05-18T18:08:11.707654",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/prepare-for-your-career/explore-options/find-a-postdoc-position/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Prepare for Your Career Explore Options Find a Postdoc Position Find a Postdoc Position A postdoc is a person who has received a doctoral degree and is pursuing additional research, training, or teaching to have better skills to pursue a career in academia, research, or other fields. Postdocs work closely with a faculty mentor. Postdocs play a crucial role in the university; they supplement the research expertise of faculty by sharing new techniques, collaborating with other institutions, and helping to manage the daily operations of a laboratory or research site. They also contribute teaching and advising support to undergraduate and graduate students. Consider your long-term goals and why you want to do a postdoc: Do you want to stay in academia or are you looking at industry? Do you want to focus on teaching, research, or a combination of both? Are you getting a postdoc to learn new skills? Are you getting a postdoc to publish? Are you getting a postdoc to develop better teaching skills? Are you getting a postdoc to further develop your existing skills? Prepare for the job search: Develop your CV. You need a strong CV to get a position, so get help writing it from a career counselor in your college or in Career Services in Barnes Hall. This is a very important document, which you will keep updating for the rest of your career. Do mock interviews. Work on your interviewing skills and develop your job talk. Ask your advisor and other faculty members to be your references. Letters of recommendation are a key part of the application process. You need strong references who know you well. Give each reference an updated copy of your CV. Network. Let everyone know that you are looking for a postdoc. For details, go to Resumes and CVs . Talk with your advisor and others to identify universities/labs: Once you know what you hope to accomplish during a postdoc and have made a list of prospective labs, talk to your advisor and other faculty members to shorten this list. Also, talk with postdocs in your department to get their opinions. Investigate the labs/PIs and university: Check out the lab’s most recent publications and the lab’s website. Find out the record of past postdocs/grad students in the lab. Talk with current and former postdocs/grad students about their experiences there, as well as where they are now. Choosing the right PI is vital to your future career. Consider: Is the PI well connected? Does the PI have tenure? Does the PI have a solid record in getting grants? Does the PI have a solid record publishing? Check the university salary and benefit package for postdocs; call the Postdoc Office if they have one. Find out if they offer: health benefits for postdocs and their families retirement benefit career counseling housing (can be essential in a large city) Start applying: Send out your CV and cover letter to the labs you are interested in. If you do not get a reply within a month, follow up with an email. Conferences are a great place to meet PIs and network; so before the conference, contact the PI/labs to schedule an informational meeting. Interview: Before an interview, prepare and practice your presentation. Make your presentation distinctive, interesting, and understandable. Research the universities where you will be interviewing so you can ask informed questions. During the interview, ask questions to make sure this is the right position for you. Talk to other postdocs and grad students in the lab. Send thank you notes after each interview. For details, go to Interviews . Making the decision: By now you should have a good idea of each lab you applied to, and which is the best place for your research. Once you make a decision you need to stay with it, so think carefully before accepting an offer. For details, go to Evaluate Offers . For more information, contact Director of Postdoctoral Studies Christine Holmes ( ch18@cornell.edu ). Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}