{
  "id": 3,
  "date": "2024-05-18T18:06:29.420897",
  "url": "https://assembly.cornell.edu/shared-governance-cornell/graduate-and-professional-student-assembly",
  "university_name": "Cornell University",
  "title": "Office of the Assemblies",
  "content": "Skip to main content Search: Search Search Context This Site Cornell Resolutions Meetings Committees Members Office of the Assemblies Resolutions Meetings Committees Members Graduate and Professional Student Assembly Home Home Get Involved Input & Issues University Hearing & Review Boards Undergraduate Students Graduate and Professional Students Staff Members Faculty Members Shared Governance Employee Assembly Staff Conversations Resolutions Meetings Committees Members Governing Documents Staff Awards Graduate and Professional Student Assembly Resolutions Meetings Committees Members Governing Documents Student Assembly Resolutions Meetings Committees Members Governing Documents University Assembly Resolutions Meetings Committees Members Governing Documents Board of Trustees Faculty Senate Archival Documents Elections Undergraduate Students Graduate and Professional Students Staff Members Faculty Members Constituent-Elected Trustees Tools & Resources General Resources Student Code of Conduct Funding Undergraduate Student Funding Graduate & Professional Student Forms and Accounts About The Office History of Shared Governance Legislative Process and Parliamentary Procedure Quick Links Assemblies Directory Archive Website Is [title] accepting applications? [field_active] The Graduate and Professional Student Assembly ensures direct and continued involvement of graduate and professional school students in the governance of non-academic affairs of the University. The GPSA brings together Cornell’s community of graduate and professional students to address non-academic issues of common concern. Drawing upon the strengths of its diverse community, the GPSA is responsible for setting and distributing the graduate student activity fee and representatives to University committees. The GPSA voting member body is composed of 36 voting members including delegates from each graduate division, the graduate and professional schools, and standing committee chairpersons, elected from the larger body of field representatives. Join the Graduate and Professional Student Assembly See a listing of open voting members seats, as well as available committee positions, for the 2021-2022 term. Graduate and Professional Community Initiative (GPCI) Share your ideas to enhance graduate & professional student life at Cornell. Graduate and Professional Student Assembly Faculty Awards See current and prior year GPSA Faculty awardees. Meet the Leadership View All Members Melia Doyas Matthews Melia Doyas Matthews President mdm345@cornell.edu Melia Matthews is a Biomedical and Biological Science PhD candidate in the lab of Professor Karl Lewis. She studies bone cells in the lab and outside of the lab she is an avid swimmer, scuba diver, and skier. At Cornell she has also been involved with Graduate Women in Science, the Cornell Undergraduate Research Journal, the Club Swim Team, and MAC Peer Mentoring. Michelle Ming-Yu Heeney Michelle Ming-Yu Heeney Executive Vice President mmh265@cornell.edu Michelle (she/they) is a third-year Plant Biology Ph.D. student. In her research, she focuses on intercellular RNA signaling in grafted plants. As Executive Vice President for the Graduate and Professional Student Assembly, Michelle aims to work on issues facing transportation and medical access. In addition she is looking for other large funding projects GPSA may be able to support with the reserve funds. Last year Michelle helped GPSA fund Big Red Barn renovations. In her free time, Michelle shoots film, gardens, and spends time with her kitten Ez. Andi Garcia-Ortiz Andi Garcia-Ortiz Vice President for Communications asg259@cornell.edu Andi (she/her) is a second-year Biomedical Engineering Ph.D. student in the Dr. Karl Lewis Lab. She previously served as the Communications Director for the graduate student chapter of the Biomedical Engineering Society (BMES). She is originally from North Plains, OR, and received an Honors Bachelor of Science in Bioengineering from Oregon State University. In her free time, Andi enjoys playing competitive soccer with other Cornell graduate students. David Axel Browne David Axel Browne db827@cornell.edu Annika Marie McGraw Annika Marie McGraw Vice President for Operations amm573@cornell.edu Annika McGraw (she/her) is a second-year student pursuing a Master of Public Administration degree, concentrating in Science, Technology, and Infrastructure Policy. She currently acts as Editor-in-Chief for the Cornell Policy Review and President of the Daring Discussion Club. As Vice President of Operations for the Graduate and Professional Student Assembly, Annika hopes to fully revise the organization's bylaws to ensure efficiency in guidelines and streamline the bureaucratic process. Annika enjoys learning Norwegian and German in her free time, reading, and playing with her cat, Luna. Join Us for a Meeting Latest Meeting Cornell University - Graduate and Professional Student Assembly 05/06/2024 5:00pm Physical Sciences Building Room 401 // Zoom View All Meetings Actions on the floor Read More Read More Read More Read More Read More Read More View All Resolutions Join a Committee Graduate and Professional Student Assembly GPCI Ad Hoc Committee The Graduate and Professional Community Initiative (GPCI) is a needs assessment and strategic planning document for the Graduate and Professional community. This ad hoc committee reviews the current GPCI and develops a new document every five years. More Information Apply Now Graduate and Professional Student Assembly Diversity and International Students Committee Connects and advocates specifically for international graduate students and graduate students from diverse backgrounds. More Information Apply Now Graduate and Professional Student Assembly Communications Committee The Communications Committee maintains the accessible flow of information from the GPSA to the graduate and professional student body and the Cornell community. More Information Apply Now View All Committees Contact the Assembly Contact the Graduate and Professional Student Assembly Name Email I am a * Cornell Undergraduate Student Cornell Graduate/Professional Student Cornell Staff Member Cornell Faculty Member External Community Member Message * Subscribe to Email Updates Name * Email * Subscription Options SA Info/Agenda List UA Info/Agenda List GPSA Info/Agenda List EA Info/Agenda List Get Involved Input & Issues University Hearing & Review Boards Undergraduate Students Graduate and Professional Students Staff Members Faculty Members Shared Governance Employee Assembly Graduate and Professional Student Assembly Student Assembly University Assembly Board of Trustees Faculty Senate Archival Documents Elections Undergraduate Students Graduate and Professional Students Staff Members Faculty Members Constituent-Elected Trustees Tools & Resources General Resources Student Code of Conduct Funding About The Office History of Shared Governance Legislative Process and Parliamentary Procedure Quick Links Assemblies Directory Archive Website © 2024 Cornell University | Managed by the Office of the Assemblies |109 Day Hall | 607-255-3715 | Staff Login | Sitemap | Site Info | Web Accessibility Assistance"
}