{
  "id": 3,
  "date": "2024-05-18T18:11:21.657241",
  "url": "https://gradschool.cornell.edu/financial-support/fellowships/nsf-grfp-fellowship/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Financial Support Fellowships NSF GRFP Fellowship NSF GRFP Fellowship Cornell is proud to have over 200 current participants in the NSF Graduate Research Fellowship Program (GRFP) enrolled in our doctoral programs.  Cornell’s NSF GRFP Grant number for 2021-25 is DGE – 2139899. For 2016-21, Cornell’s NSF GRFP Grant number is DGE -1650441. NSF policies can be found in their administrative guide . It is the responsibility of the fellow to review understand and comply with all policies, rules, and regulations contained in the Administrative Guide, and the terms and conditions found in the NSF GRFP Offer letter, the annual NSF GRFP Program Solicitation, and the NSF GRF Award Notice. The NSF GRFP fellowship provides three years of fellowship stipend and two years of reserve status. All fellows must declare a fellowship status by the due date in the GRFP Online Module. On Tenure Status During On Tenure status, fellows must be enrolled and engaged in full-time research and will receive a fellowship stipend.  Fellows may use On Tenure status for three years in 12-month increments over the five-year period.  Summer is not considered a vacation period, students should be actively enrolled and engaged in full-time research.  Fellows are required to check with The Graduate School’s Fellowship Office regarding GRFP fellowship and paid activities. Additionally, fellows are limited to 8 hours of additional paid work if it does not interfere with full-time research.  Fellows on tenure may not hold teaching assistantships concurrently. Fellowship stipend payment for fellows on tenure 2023 summer-start or fall-starts: The current fellowship stipend rate is $37,000 per 12-month year Stipends disburse approximately five days before the start of classes for the fall and spring terms Stipends amounts are approximately $3,083 per month so disbursements are as follows: Summer term (three months) – $9,250 Academic year (nine months) – $27,750.  Additionally, the Graduate School will supplement the academic year stipend payment by $4,744. Fellows will receive a total stipend of $32,494 for the 2023-2024 academic year. The stipend is disbursed in two lump sums, half in the fall semester and half in the spring semester. Fellowship stipend payment for fellows on tenure 2024 summer-start or fall-starts: The current fellowship stipend rate is $37,000 per 12-month year Stipends disburse approximately five days before the start of classes for the fall and spring terms Stipends amounts are approximately $3,083 per month so disbursements are as follows: Summer term (three months) – $9,250.  Some advisors may offer additional summer funding opportunities. Academic year (nine months) – $27,750.  Additionally, the Graduate School will supplement the academic year stipend payment by $6,180. Fellows will receive a total stipend of $33,930 for the 2023-2024 academic year. The stipend is disbursed in two lump sums, half in the fall semester and half in the spring semester. On Reserve Status During Reserve Status, fellows do not receive a stipend from NSF GRFP, students must be enrolled and engaged in full-time research.  On reserve status allows students to incorporate teaching assistantships and other paid positions of up to 20 hours a week into their professional development if it does not interfere with full-time research. Fellows may use Reserve Status for two years, in 12-month increments, during the five-year Fellowship Period Additional information The administrative guide provides information on all NSF GRFP status options along with in-depth explanations regarding the rules and regulations.  Each fellow is responsible for understanding and abiding by the National Science Foundation Graduate Research Fellowship Program Administrative Guide and relevant university policies. GRFP Fellowships cannot be concurrently accepted or combined with support from another individual federal graduate fellowship. Cornell NSF GRFP fellows must complete the Full RCR training within 60 days of the activation of their fellowship regardless of their status. The training required covers a number of RCR-related topics, and is called “Full Course” in RCR. A passing grade is 80% or higher. If an individual does not complete the training by the deadline, they may not be paid as a NSF GRFP fellow. To take the Full Course on RCR, please click here . Fellows must remain enrolled full-time and make satisfactory academic progress.  This means students need to meet their academic milestones on time and be engaged in full-time research. For doctoral students, this includes completion of the RCR, forming a special committee by the end of the third semester, and fully passing the A-exam by the start of the seventh semester.  Annually fellows must complete Student Progress Review (SPR) form annually and a rating of “satisfactory” or “excellent” is required. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}