{
  "id": 3,
  "date": "2024-05-18T18:08:41.854868",
  "url": "https://gradschool.cornell.edu/diversity-inclusion/graduate-diversity-inclusion-awards/graduate-diversity-inclusion-awardees/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Diversity & Inclusion Graduate Diversity & Inclusion Awards 2019 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Exemplary Service Awards for Early & Advanced Career Students Early Career Janani Hariharan Janani Hariharan, Ph.D. student in the field of soil and crop sciences, is the recipient of the 2019 Early Career Exemplary Service Award. Since her arrival on campus in fall 2017, Janani has been an exemplary advocate for creating inclusive spaces at Cornell, both in her own department and in numerous organizations. In her field, Janani is leading an initiative to remove the GRE as a metric in admissions for the School of Integrative Plant Sciences (SIPS) and engages with the leadership in SIPS on efforts to assess and further the inclusiveness in the school. Outside of her field, Janani goes above and beyond creating and deepening connections within the graduate student community. She serves as the Graduate and Professional Student Diversity Council Liaison for Graduate Womxn in Science, in which she has helped develop an inclusion statement for the organization, focusing on challenges in the intersectionality of identities, including advocating for international women of color. For the past two years, Janani has also been involved in the Diversity Preview Weekend, organizing workshops, panels, and discussion groups to provide practical skills in applying to grad school and to discuss topics of identity and culture in the sciences, supporting the success of students from underrepresented identities. As a co-facilitator of the winter 2019 Intergroup Dialogue sessions for graduate students and postdoctoral scholars, Janani led a diverse group of participants through an intensive process of social identity development and critical dialogue across differences. She also helped the IDP staff to reevaluate the course design from a graduate student perspective. In addition to all of this, Janani has also served as a mentor and organizer of mentors (Master Mentor) for the 1000 Girls, 1000 Futures program with the Global STEM Alliance at the New York Academy of Sciences and is also a Graduate Student Ambassador, supporting the recruitment of graduate students from diverse backgrounds to Cornell. Janani’s commitment and passion for her scholarship, and advocacy work in all spheres of her graduate experience thus far make her a most deserving recipient of the Early Career Exemplary Service Award. Advanced Career Mariela Nunez Santos The recipient of the 2019 Advanced Career Exemplary Service Award is Mariela Nunez Santos , a Ph.D. candidate in the field of biochemistry, molecular and cell biology. In the three years that she’s been a part of the Cornell graduate community Mariela has demonstrated an exceptional level of commitment to serving others in a number of capacities. Mariela has advocated and worked towards diversity and inclusion within her field, biochemistry, molecular and cell biology, as a founding member of its Diversity Council, within the graduate community as a Graduate School Ambassador and co-president of the Cornell chapter of the Society for the Advancement of Chicanos/Hispanics and Native Americans in Science (SACNAS), at the institutional level as a member of the Presidential Task Force on Campus Climate, and even more broadly through her engagement with an astounding number of STEM pipeline initiatives that include Kids’ Science Day, STEAM INTO STEM, Expanding Your Horizons, Cornell Center for Materials Research K-12 Outreach in Ithaca and New York City, and Cornell’s Science and Technology Entry Program. As one of her nominators states, “Mariela is innately energetic, enthusiastic, passionate, and optimistic, and she brings those qualities to the various outreach programs, committees, and organizations that she is involved with. Mariela realizes that her involvement in these programs has lasting effects. She is keenly aware that her presence inspires kids that share her background. Her enthusiasm is contagious and makes her a role model for both her fellow organizers and the participants.” For these reasons we are thrilled to be able to present Mariela with the Advanced Career Exemplary Service Award. Excellence in Leadership Award Ekarina Winarto The recipient of the 2019 Excellence in Leadership Award is Ekarina Winarto , Ph.D. candidate in the field of linguistics. Ekarina has spent a large portion of her time at Cornell serving the student body, most notably in her two years as the president of the Graduate and Professional Student Assembly (GPSA). This role has given her the opportunity to strongly advocate for the graduate and professional community through her involvement in too many committees to count. In addition to her many commitments through the GPSA, Ekarina has also served as the president of the Society for Asian American Graduate Affairs (SAAGA), playing a crucial role in organizing events for SAAGA as well as in collaborating with other organizations within the Graduate and Professional Student Diversity Council. In all of her leadership roles, Ekarina works hard to support the members of the organizations professionally so that they can continue on to become leaders in the future, but also personally by providing a sounding board to listen to any barriers or problems they are facing and then using her vast institutional knowledge to connect them with the best resources to provide assistance. Ekarina is so involved because she truly wants to support the student community and often passes off any recognition she receives to everyone else who was involved, but we would like to recognize her specifically for all of the work she has done to improve the graduate and professional student experience here at Cornell. Social Justice Award Rediet Abebe The recipient of the 2019 Social Justice Award is Rediet Abebe , Ph.D. candidate in the field of computer science. Rediet is a graduate affiliate in the Center for the Study of Inequality and the Artificial Intelligence Policy and Practice Initiative. The center has become nationally and internationally known for its work on applying algorithms and AI ideas for social good and to increase the presence and inclusion of Black researchers in AI. To that end, Rediet is the co-founder of two major initiatives in the artificial intelligence research space, Black in AI and the Mechanism Design for Social Good (MD4SG), and they also serve on the National Institutes of Health Advisory Committee to the Director – Artificial Intelligence Working Group. Additionally, Rediet serves as a mentor for underrepresented students in computing and information science and has personally led efforts to recruit underrepresented minority students to Cornell’s computer science Ph.D. program, leading to an unprecedented increase in admissions. Rediet will be joining the Harvard Society of Fellows as a junior fellow in the fall of 2019. We are pleased to present the 2019 Social Justice Award to Rediet for their commitment in promoting human rights, dignity, and equity in their field at Cornell and beyond. Community Outreach Award Jayme Kilburn The recipient of the 2019 Community Outreach Award is Jaym e Kilburn , Ph.D. candidate in the field of performing and media arts. Jayme is being recognized for her extensive engagement with numerous communities through multiple outreach programs. Jayme is an instructor with the Cornell Prison Education Program where she teaches and directs the Phoenix Players, a group of inmates that creates original theatre productions based on stories from the men’s personal lives with the goal of fostering agency, dignity, and changes in the prison industrial complex. Jayme has also hosted a series of workshops for women-identified participants to talk about their personal lives and socially relevant themes, then transforms these stories into a series of community-based theatre productions titled “She Persists” that have been performed in Ithaca and Baltimore. Finally, Jayme has intentionally confronted the lack of gender and racial parity in theatre by creating a two-day symposium, “Feminist Directions: Performance, Power, and Leadership”, where artists and activists from across the country came together to address misogyny in the performing arts. Jayme not only created this initiative, she also obtained all the funding needed to hold the event as well as to ensure that all performers would be paid by pursuing multiple grants and sponsorships. Jayme also mentored undergraduate women that worked as assistant managers and employed women-owned catering companies to provide the meals. Jayme’s nominator states, “Jayme is committed to breaking cycles of violence, harnessing the utopian power of theater to dramatize alternative worlds, and providing a platform for underrepresented people to share their stories in their own words.” It is our honor to recognize Jayme with the Community Outreach Award for these efforts to empower marginalized communities at Cornell and beyond. Unsung Hero Award Belinda Floyd, Graduate Field Assistant for the Field of Biomedical Engineering Belinda is being recognized for her extraordinary efforts supporting graduate and professional degree students in the biomedical engineering graduate field in their sense of belonging, overall well-being, progression, and achievement. Belinda’s nominators state that while her official title is graduate field assistant, her unofficial and better-fitting title is “mother of all BME graduate students”. In her role she provides support and guidance to almost 200 Ph.D. and master’s of engineering students from a wide variety of diverse backgrounds, helping them to transition into graduate school, overcome obstacles they may face in their professional or personal lives while here, and even checking in with students after they’ve left Cornell to make sure that they are still doing well. Her personal relationships with students have allowed her to follow up with her supervisors if she notices students in distress so that they can collectively provide those students with any help that they might need. In some cases, this has made the difference between a student finishing their degree and leaving the program early. Her nominators say that “The biomedical engineering community is a better place because of Belinda, and she has been instrumental in promoting the well-being and inclusion of the diverse BME community.” It is our pleasure to recognize Belinda for her contributions to the field of biomedical engineering by presenting her with an Unsung Hero Award. The 2019 Unsung Hero Awardees (from left to right) Belinda Floyd, Eric Maroney, and Tara Reed Eric Maroney , Graduate Field Assistant for the Field of Policy Analysis and Management Eric is being recognized for his contributions to the well-being of students in the field of policy analysis and management where he consistently exceeds what is expected in his role as graduate field assistant. Some examples of times where Eric has gone above and beyond include the creation of a guide to the policy analysis and management graduate program that informs students of necessary deadlines and forms within days of it being requested by students in the program, the implementation of a survey of graduate students’ needs, followed by taking steps to address those needs with the field’s DGS, and assisting students with job searches by setting up a placement website and helping to organize application materials such as letters of recommendation. And as his nominator emphasizes, “He does all of this with such competence and in such a serene manner that he is a calming influence for all of the students.” In recognition of all that he does to support the graduate students in policy analysis and management we are glad to present him with an Unsung Hero Award. Tara Reed , Conference Coordinator for the School of Integrative Plant Sciences Tara is being recognized for going above and beyond in supporting the Diversity Preview Weekend, a program that promotes diversity and inclusion in several life sciences graduate programs by bringing undergraduate students from underrepresented backgrounds to Cornell to learn about graduate education at Cornell, network with students, faculty, and staff, and gain a better understanding of the graduate school admissions process. As SIPS conference coordinator Tara lent her expertise in organizing large events to the DPW throughout the planning process and the event itself. She arranged travel and lodging for over 40 visiting students, reserved numerous rooms, assisted with the catering for more than a dozen meals, receptions, and snack breaks, and attended every event during the weekend, including on Saturday and Sunday, to provide support and address any problems that came up. One graduate student leader on the DPW organizing committee appreciated how Tara’s support gave them the time to be engaged with the visiting students instead of having to worry about logistics, saying, “Tara provided the energy, making sure nothing was missing, and giving us the opportunity to be fully engaged and focused on our participants.” A final quote from Tara’s nominations says it all: “The expansion of DPW would not be possible without Tara’s support and positive attitude”. We are happy to be able to recognize Tara’s contributions to the DPW and SIPS with an Unsung Hero Award. Faculty Champion Awards for Junior & Senior Faculty Junior Faculty Jamila Michener The recipient of the 2019 Junior Faculty Champion Award is Assistant Professor of Government Jamila Michener . We recognize Professor Michener for being a dedicated and tireless advocate for diversity, inclusion, and equity in her scholarship, in her exemplary pedagogy, mentorship, and advising of undergraduate and graduate students, in her campus leadership activities as a co-organizer of two new minors, as an Engaged Faculty Fellow, a contributor to Cornell’s Inequality Studies and Prison Education programs, a member of university-wide diversity and inclusion committees, and also in her outreach activities in surrounding communities. Professor Michener has made significant contributions toward promoting the growth and personal, professional, and intellectual development of graduate students in political science across social, political, ethnic, racial, class, and gender diversities, and making students feel more included in the academy. Her students had the following to say about her. For one student, who “felt a lot of pressure to write a dissertation that ‘looked like’ mainstream political science,” conversations with Jamila were some of the most helpful in terms of developing the confidence to pursue a topic that was a bit outside of the ordinary. Another credits her for “helping to develop the confidence to follow their instincts.” Another student said, “She helps me to envision my trajectory as a scholar because she demonstrates a constant example of what I hope to achieve as a researcher, educator, and person.” It is our pleasure to recognize Professor Michener for these efforts to promote equity and inclusivity and support graduate student development with the 2019 Junior Faculty Champion Award. Senior Faculty The recipients of the 2019 Senior Faculty Champion Awards are Susan Daniel, associate professor in the Robert Frederick Smith School of Chemical and Biomolecular Engineering, and Hadas Kress-Gazit, associate professor in the Sibley School of Mechanical and Aerospace Engineering. Susan Daniel Professor Susan Daniel’s work as an advocate for students from underrepresented groups and to foster a more diverse and inclusive department started when she arrived at Cornell as an assistant professor. During that time, she worked to create the Graduate Women’s Group in Chemical and biomolecular engineering (CBE WOMEN), which provides a space to celebrate the success of women in the department as well as provide access to outreach and career development opportunities. One such opportunity is the Women’s Outreach in Materials, Energy, and Nanobiotechnology event, which brings in high school students from the upstate region, to offer hands-on experience to research and education about STEM fields and college. This event has shown great success, with a large portion of participants going on to a college education and inciting strong leadership within the graduate students that help to organize the event. Professor Daniel is also the founding faculty mentor of the Science Blender podcast that works to combine the identity and personal experiences of diverse scientists with their professional work to provide role models for underrepresented students. During her time as the director of graduate studies for CBE, Professor Daniel worked to increase recruitment of diverse students to the department, with this past year yielding the most diverse incoming class yet. Most recently, she led the creation of her department’s Diversity and Inclusion Program (DIP). The DIP has worked to create initiatives that identify the challenges the department faces in terms of climate and inclusion and ways to address them. Professor Daniel has dedicated herself to each and every one of these endeavors to not only create a more diverse and inclusive environment in her department, but also to foster strong engagement and leadership from graduate students, and for that we would like to recognize her as a Senior Faculty Champion. Hadas Kress-Gazit Throughout her time at Cornell, Professor Hadas Kress-Gazit has been committed to fostering diversity, inclusion, and equity and has had an impact on a number of different communities. Twice, she has led the research project for the CURIE academy, a one-week residential summer program for high school women focused on helping them explore engineering through experiential learning and multiple tiers of mentoring from engineering faculty, graduate students, and undergraduates. Nearly all of the rising high school seniors that participated in the CURIE Academy research projects led by Professor Kress-Gazit applied to Cornell engineering, with almost half enrolling. Professor Kress-Gazit was also the Keynote Speaker for the 2016 Expanding Your Horizons conference, a one-day event for 7th-9th grade girls intended to stimulate interest in STEM fields through hands-on workshops. She has worked to bring in speakers with a focus on engineering and scientific culture to gain insight into making communities for inclusive. Professor Kress-Gazit has also influenced the robotics community as a whole by starting initiatives that provide travel grants for students from underrepresented groups to attend the Robotics: Science and Systems conference and to provide networking opportunities for late career graduate students and postdocs. This past spring, Professor Kress-Gazit led a faculty search committee for the school of mechanical and aerospace engineering, and in doing so made several changes to the search process in order to increase diversity, such as adding an engagement statement from all applicants. Her passion and commitment to increasing diversity and inclusion throughout not only the School of Mechanical and Aerospace Engineering at Cornell, but also in the field of robotics more broadly, is extraordinary, and because of that, we would like to recognize her as a Senior Faculty Champion. OISE Diversity & Inclusion Change Agent Award This year’s OISE Diversity & Inclusion Change Agent Award Recipient is Kelly Zamudio , the Goldwin Smith Professor of Ecology and Evolutionary Biology, Faculty Curator of Herpetology for the Cornell University Museum of Vertebrates, and recent inductee to the American Academy of Arts and Sciences. Professor Zamudio demonstrates incredible dedication to educating, influencing, inspiring, and promoting others. She cares deeply about the experiences of others and takes seriously her ability to make this world and the lives of others better by producing great science, leading by example, and providing sincere mentorship. She is an ally, advocate, and excellent mentor to undergraduate and graduate students, postdocs, fellow faculty, and other scientists. At Cornell, Professor Zamudio’s substantial contributions to diversity recruitment efforts have benefitted not only her own graduate field, but many other STEM graduate fields as well. Throughout her career, she has demonstrated an unwavering commitment to advancing the representation and inclusion of those historically underrepresented and marginalized in the academy including but not limited to scholars of color, women in STEM, first generation college students, and members of the LGTBTQ+ community. Professor Zamudio is not only a leading researcher in her field, but has also published research on the effects of active learning enhancing diversity in the sciences and has been recognized with Cornell’s highest teaching award for faculty. Professor Zamudio is a leader, role model, mentor, collaborator, and friend to us and so many others. She is fearless in her advocacy and she is never afraid to stand up for what is right. It is for all of these reasons more that we recognize her this evening with this award. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}