{
  "id": 3,
  "date": "2024-05-18T18:08:08.380841",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/prepare-for-your-career/take-action/resumes-and-cvs/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Prepare for Your Career Take Action Resumes and CVs Resumes and CVs Depending on the type of job, you will need to create a curriculum vitae (CV) or a resume. Both documents put your qualification in writing, but they are used for different audiences and use a different format. When to use a Resume In the United States, most employers use resumes for non-academic positions, which are one or two page summaries of your experience, education, and skills.  Employers rarely spend more than a few minutes reviewing a resume, and successful resumes are concise with enough white space on the page to make it easy to scan. For more information on developing your resume, please visit Cornell Career Services’ Career Development Toolkit . Students often find it helpful to review resumes from graduate students who got their first job outside of academe. When to use a Curriculum Vitae (CV) A CV is a longer synopsis of your educational and academic background as well as teaching and research experience, publications, awards, presentations, honors, and additional details. CVs are used when applying for academic, scientific, or research positions. International employers often use CVs as well. A CV is a comprehensive statement emphasizing: professional qualifications education experience accomplishments activities special qualifications A CV can vary from two pages to several pages. Professionals seeking academic positions and non-academic positions in science, higher education, research, and health care typically use a CV. It is also used to seek a fellowship or grant and is expected for some positions overseas. Consult with faculty members in your field to determine what is expected and appropriate for your field. Guidelines for Preparing a CV The order of topics in a CV format is flexible. Arrange sections to highlight strengths for the position you are seeking. Elaborate on accomplishments and skills within categories. List items within each category chronologically, the most recent appearing first. Include additional headings when appropriate to reflect certifications/licensures, workshops/training, languages, book reviews, etc. Present information in an easily accessible and attractive style. Resources Faculty advisors are the most knowledgeable resource for determining what constitutes effective content in your discipline. For formatting assistance and to see more examples of  CVs, visit the Cornell Career Services Library in 103 Barnes Hall. The following books also may help: How to Prepare Your Curriculum Vitae and The Curriculum Vitae Handbook . Sample CVs Non-academic samples from the University of California, San Francisco Academic samples from the University of California, San Francisco Samples from Columbia University Samples from University of Pennsylvania Chronicle of Higher Education’s CV Doctor Electronic Version of CV When sending electronic versions, attach a file or cut and paste the CV into the text of the email message. State your objectives and career interests in the first few lines since they may be the only items seen on a screen. Other tips: Use language and acronyms recognized in your field. Avoid using bold, italics, underlining, lines, or graphics. Use all caps for emphasis. Put your name at the top followed by address and each phone number on a separate line. Many employers use websites for applicants to apply for positions. Although each form may be different, some elements may be similar. Save parts of your CV in a format that can be cut and pasted for each individual web-based form, such as saving a bulleted list of work experience. Transforming Your CV into a Resume You may need both a CV and a resume for your job search. Sending the appropriate document (CV or resume) tells employers that you can distinguish the differences between the academic and non-academic environments and that you can adapt your skills to either environment. Most employers in industry prefer a resume. When rearranging your CV to make it a resume: Do not exceed two pages. Re-evaluate your experience. Think creatively about how your academic experience can be translated into the necessary skills for a non-academic environment. Consider skills of project management, leadership, teamwork, effective communication, and meeting deadlines. Choose action verbs to describe your experience. Put your strengths first. List your professional experience or your degree first, depending on which is most important for a specific position. Include a well-written job objective; state the type of position and work setting you are seeking, skills or abilities you possess, and long-term goals. Be sure that your resume supports your job objective. Emphasize skills and accomplishments. List relevant presentations, publications, and papers, but not all. Have someone proofread it. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}