{
  "id": 3,
  "date": "2024-05-18T18:07:25.598788",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/three-minute-thesis/3mt-2024/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Three Minute Thesis 3MT 2024 3MT 2024 Physics Ph.D. Candidate Wins 2024 Three Minute Thesis Competition Meagan Sundstrom says a few words after being announced first place winner. Photo: Simon Wheeler for Cornell University “I want you to remember a time when you were in a setting where you felt like you didn’t belong. I want you to remember how you felt in that setting, maybe isolated or out of place, and how much you felt like you wanted to continue going back to that setting—probably not much. These feelings are all too familiar for undergraduate women pursuing their studies in science, and in physics specifically,” began Meagan Sundstrom, a doctoral candidate in physics at the ninth annual Cornell University Three Minute Thesis (3MT) competition. Alongside seven other finalists, Sundstrom presented her dissertation research in just three minutes on March 20 to a panel of judges and an audience from across campus while additional friends, family, advisors, and lab mates watched online. In the first in-person Cornell 3MT since 2019, presentations were judged by how clearly and compellingly students summarized their research to a general audience, using only one static slide. Sundstrom’s presentation, “Recognizing and Removing Barriers for Women in Physics,” earned her first place and $1,500. Second place and $1,000 was awarded to information science doctoral student Sterling Williams-Ceci for her presentation, “AI Helps us Write – but at What Cost?” After nearly 60 in-person and 70 virtual audience members cast their ballots, votes were tallied and the People’s Choice Award and $250 were presented to biomedical and biological sciences doctoral candidate Sharada Gopal for her presentation, “Worming Our Way to a Longer Life.” This year’s judges included Jane Bunker, director of Cornell University Press; Joe Ellis, director of online degree program development at eCornell; David Lodge, the Francis J. DiSalvo Director of the Cornell Atkinson Center for Sustainability; and Bob Riter, patient advocate for the Cornell Community Cancer Partnership. Organization of the competition and coaching of presenters was provided by the Graduate School Office of Career and Professional Development. “As grad students, there are a lot of opportunities to give your elevator pitch at conferences and more professional settings to more senior people in your field, and I thought this would be a really cool opportunity for me to try to tailor that pitch to a more general audience—how would I describe my research to my family and friends?—so that was fun,” said Sundstrom. Being able to “zoom out” and view her topic from a different perspective was also helpful for Sundstrom, who is currently writing her dissertation and appreciates having both formulated a storyline and thought about the broader impacts of her work. Williams-Ceci similarly enjoyed the chance to speak to a different type of audience than she is used to addressing. “I hadn’t really had an opportunity in grad school to try communicating to a broad audience, it’s always just to my lab, so I wanted to practice having a chance to really tell a story and not just go through the slides,” she said. “It really helped me know for a fact that I can tell a convincing story about a project that I’ve done.” 2024 Three Minute Thesis finalists. Photo: Simon Wheeler for Cornell University Gopal shared that the 3MT was a fun way to combine her longtime artistic interests with her science. “It seemed like such a fun event. I did a lot of theatre in college so I thought, ‘What can I do artistically here?’ and this seemed like a good mix of my scientific interest and my artistic theatre interests,” she said, adding that she also benefitted from looking at the bigger picture of her work and its impacts. The 3MT competition was first held in 2008 at the University of Queensland and has since been adopted by over 900 universities in over 85 countries. 3MT challenges research degree students to present a compelling story on their dissertation or thesis and its significance in just three minutes, in language appropriate to a non-specialist audience. Cornell’s Graduate School first hosted a 3MT competition in 2015 and the event has grown steadily since that time. As the winner of Cornell’s competition, Sundstrom will now go on to compete in northeast regional competitions. “Our Three Minute Thesis final round is a highlight of the year for those of us in the Graduate School—literally we talk about it all year long,” said Kathryn J. Boor, dean of the Graduate School and vice provost for graduate education. “We look forward to it because it’s just plain fun, and it’s an opportunity for us to watch and learn from our accomplished and creative graduate researchers.” “I could not possibly be more proud of the work we saw,” she said. 2024 3MT Finalists Watch the 2024 Three Minute Thesis final competition . First Place: Meagan Sundstrom, physics doctoral candidate Watch Meagan Sundstrom’s presentation . Presentation Title: “Recognizing and Removing Barriers for Women in Physics” Special Committee Chair: Natasha Holmes Area of Research: Physics education research, peer recognition Biography: Meagan Sundstrom is a doctoral candidate in physics. Her research uses social network analysis to examine undergraduate physics students’ recognition of their strong peers, with a particular focus on the role of gender in such recognition. Favorite Thing About Cornell: State parks and ice cream! Second Place: Sterling Williams-Ceci, information science doctoral student Watch Sterling Williams-Ceci’s presentation . Presentation Title: “AI Helps us Write – but at What Cost?” Special Committee Chairs: Michael Macy and Mor Naaman Area of Research: Psychological impacts of technology Biography: Sterling Williams-Ceci is a Ph.D. student in information science co-advised by Michael Macy and Mor Naaman. She graduated summa cum laude as a Merrill Presidential Scholar from Cornell University in 2021 with a B.A. in psychology and as a college scholar. She studies how our interactions with technologies shape our attitudes and beliefs. Favorite Thing About Cornell: The wonderful people I’ve gotten to work with and learn from. People’s Choice Award: Sharada Gopal, biomedical and biological sciences doctoral candidate Watch Sharada Gopal’s presentation . Presentation Title: “Worming Our Way to a Longer Life” Special Committee Chair: Siu Sylvia Lee Area of Research: Aging Biography: Sharada is a fourth year doctoral candidate. Prior to starting her Ph.D. she obtained her master’s in biomedical engineering from Cornell. Apart from her Ph.D. she enjoys public speaking, cooking, hiking with her dog, and swimming in beautiful waterfalls and lakes in Ithaca. Favorite Thing About Cornell: Beebe Lake Cátia Dombaxe, biomedical engineering doctoral candidate Watch Cátia Dombaxe’s presentation . Presentation Title: “Hope for Spinal Cord Regeneration in Mammals” Special Committee Chair: Yadong Wang Area of Research: Tissue regeneration, drug delivery, and biomaterials Biography: Cátia P. Dombaxe is a biomedical engineering Ph.D. candidate whose research focuses on tissue regeneration and functional recovery after spinal cord injury. She founded STEAMpact Foundation, aiding STEM education in rural Angola. Dombaxe is passionate about STEM and photography, and she aims to empower young minds worldwide. Favorite Thing About Cornell: The staff!!! Amanda Domingues, science and technology studies doctoral candidate Watch Amanda Domingues’s presentation . Presentation Title: “Advancing Science by Not Doing Science: Archaeology and Native American Cultural Patrimony” Special Committee Chair: Rachel Prentice Area of Research: Ethics in scientific research Biography: Amanda Domingues is a Ph.D. candidate in science and technology studies (STS). STS scholars study the social implications of science and technology. Her research explores how scientists have approached the challenges of incorporating community partners in their research projects. She is interested in what is at stake when science and ethics intersect. Favorite Thing About Cornell: The supportive intellectual community Viviana Maymi, biomedical and biological sciences doctoral candidate/doctor of veterinary medicine candidate Watch Viviana Maymi’s presentation . Presentation Title: “Young Guns: Baby T Cells Killing Cancer” Special Committee Chair: Brian Rudd Area of Research: CD8+ T cell immunology, T cell exhaustion Biography: Viviana is a dual D.V.M./Ph.D. candidate in biomedical and biological sciences. She graduated with a B.A. in neurobiology from Harvard in 2018. Her Ph.D. research focuses on the T cell response to chronic infection. She hopes her findings will push forth new treatments for humans and animals alike. Favorite Thing About Cornell: The vibrant nature that surrounds us! Agustín Olivo, animal science doctoral candidate Watch Augstín Olivo’s presentation . Presentation Title: “Annual Nitrogen Health Check-up for Corn” Special Committee Chair: Quirine Ketterings Area of Research: Dairy systems’ environmental sustainability Biography: Agustín Olivo is Ph.D. candidate in the department of animal science, part of the Nutrient Management Spear Program. His work focuses on assessing and benchmarking greenhouse gas emissions and nutrient use efficiency in New York dairies. He holds a B.S. from the National University of Córdoba, Argentina, and a M.S. from the University of Nebraska-Lincoln. Jerry Richardson, psychology doctoral candidate Watch Jerry Richardson’s presentation . Presentation Title: “Costs and Self/Other Differences When Reporting Good Deeds” Special Committee Chair: David Pizarro and Tom Gilovich Area of Research: Moral psychology Biography: Jerry is a Ph.D. candidate in psychology mentored by David Pizarro and Tom Gilovich. He holds degrees from the University of Maryland (B.A.) and Cornell University (M.A.). Following a 24-year arts career, his research explores moral psychology, focusing on altruism, empathy, cynicism, prosocial behavior, and moral emotions’ origins and impacts. Favorite Thing About Cornell: The academic freedom to explore any questions that pique my interest. 2024 Final Round 3MT Competition The 2024 final round competition was held in person on March 20, 2024 at 3 pm ET. At the live competition, First Place, Second Place and People’s Choice awards were selected by judges and audience members. The First Place winner will be eligible to represent Cornell in any additional Ivy League or northeast regional competitions or showcases held in 2024. Three Minute Thesis (3MT®) is an international competition to help graduate students develop and showcase their research communication skills. The annual university-wide competition hosted by Cornell Graduate School challenges research-degree students to present their dissertation as a compelling story in just three minutes, with one slide, in language appropriate to a non-specialist audience. Preliminary Round Competition All competitors submitted a recorded presentation of their talk by 11:59 p.m. ET on Friday, March 1, 2024 in order to compete in the Preliminary Round. All enrolled graduate research degree students at the research stage (with at least some results to share) are eligible. Past competitors who did not place, and are still enrolled as graduate research degree students this year are welcome to enter the competition again. Registration opened in January 2024, and an information session was held on January 31, 2024. View the information session recording . If you should have questions or concerns regarding the 3MT Competition, please email us at: grad3mt@cornell.edu . Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}