{
  "id": 3,
  "date": "2024-05-18T18:07:31.608236",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/p2s-symposium/june-2019-p2s-symposium-sessions/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Pathways to Success Symposium Summer 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Opening Plenary: Why You Should Be Communicating Your Research With All Audiences Bruce Lewenstein, Ph.D. Professor of science and technology at Cornell University Many funders require you to demonstrate “broader impacts.” That often gets translated to “give public talks.” And learning to communicate with diverse audiences is often sold as a “soft skill” useful no matter what direction your career goes. But a richer reason is that communication is the essence of scholarship. Your research doesn’t become reliable knowledge until multiple audiences have heard it, played with it, reacted to it, engaged with you about it. In the process, you learn to identify what’s important about your work. You also gather information from multiple sources, get new ideas, new perspectives, new insights. Oh, yeah, and along the way you get some useful professional skills and satisfy your funders. Career Panel Discussion: Careers Leveraging Your Communication Skills Ray Jayawardhana, Ph.D. Moderator, dean of the College of Arts & Sciences at Cornell University Oné Pagán, Ph.D. Panelist, professor of biology at West Chester University Melanie Dreyer-Lude, M.F.A. Panelist, chair of drama at University of Alberta Rebecca Robbins, Ph.D. Panelist, postdoctoral fellow at New York University Langone Medical Center and co-author of “Sleep for Success” Career Mini-Panel Discussion: Careers in Museums, Non-Profits, and Libraries Denise DiRienzo, Ed.D. Moderator, experiential program director for the BEST Program at Cornell University Anke Wessels Panelist, executive director, Center for Transformative Action Susanne Bruyere, Ph.D. Panelist, professor and director of the Yang-Tan Institute at the School of Industrial and Labor Relations at Cornell University Christian Miller, M.L.I.S. Panelist, research and instruction librarian at Catherwood Library and lecturer at the School of Industrial and Labor Relations at Cornell University Kate Addleman-Frankel The Gary and Ellen Davis Curator of Photography, Johnson Museum of Art, Cornell University Workshop: The Craft of Revision Rachael Cayley, Ph.D. Associate professor at the Graduate Centre for Academic Communication, University of Toronto In this session, we will discuss strategies for revising academic writing. I will begin by framing revision as the most powerful route to better writing. The ability to revise our own writing improves not just the final writing product, but also the writing process. Having a good handle on revision helps us get started with a writing project and then move through the multiple iterations necessary for strong final drafts. We will consider different types of revision and establish the optimal way to sequence the revision process. Throughout this presentation, there will be opportunities to raise writing questions and to practice relevant strategies. Academic writing is a crucial and challenging aspect of the research process; during our time together, we will explore why it is so hard and how revision can help us become more confident writers. Workshop: Communicating Professional Boundaries – When and How You Can Say No! Janna Lamey Assistant dean for graduate student life at Cornell University Marika Nell Ph.D. candidate in civil and environmental engineering at Cornell University To manage your most valuable resource, time, you have to balance your professional and personal priorities. Since you cannot do everything, you need to learn when and how to say no. Through small-group discussion, we will describe common barriers associated with saying no and develop a list of criteria to help you determine when to say no. Finally, leave the session with strategies that can help you be more confident and effective in the art of saying no to others. Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}