{
  "id": 3,
  "date": "2024-05-18T18:08:06.590750",
  "url": "https://gradschool.cornell.edu/career-and-professional-development/pathways-to-success/prepare-for-your-career/take-action/research-statement/",
  "university_name": "Cornell University",
  "title": "",
  "content": "Skip to main content Search: Submit Search Search Context: Search This Site Search Cornell Graduate School Main Menu About Events Calendar Resources Policies Forms Alumni Search Home Home Admissions Degrees & Fields Explore Prepare Apply Admitted Students Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Assistantships Fellowships Loans Emergency Fund Program Stipend Rates Tax Information Travel Funding Opportunities Academic Progress Requirements Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Access & Recruitment Signature Initiatives Bouchet Honor Society Graduate Diversity & Inclusion Awards Funding and Resources Faculty Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Three Minute Thesis Student Experience Big Red Barn Office of Graduate Student Life Help and Support Student Communities Student Life Programs Student Governance Student Perks and Discounts Admissions Degrees & Fields Fields of Study – Graduate Catalog Understanding the Field Structure Graduate School Degrees Graduate Degrees Administered by Colleges Other Than the Graduate School Explore Non-Degree Admissions Faculty Research and Scholarship Prepare Required Tests Recommendations Academic Statement of Purpose Personal Statement Transcript Requirements English Language Proficiency Requirement International Degree Equivalencies Apply Important Application Policies Application Fees Admissions Costs for International Students Apply Now Application Status Accepting, Deferring, and Reapplying Funding and Next Steps Admitted Students You Belong at Cornell Navigating Graduate School Resources for First-Year Students Living in Ithaca Visiting and Getting Around Housing Housing Tips Dining Admissions and Admitted Student FAQ Contact Graduate Admissions Financial Support Tuition Rates Tuition Rates by Field Health Insurance Rates Cost of Attendance Assistantships Fellowships New Student Fellowships Continuing Student Fellowships External Fellowships Fellowship Resources and Workshops Letters of Recommendation Writing Your Research Statement Financial Supplementation of External Fellowships NSF GRFP Fellowship Graduate Fellowships Listserv Loans Emergency Fund Program Stipend Rates Receiving Your Stipend Tax Information Understanding the 1098-T Form Tax Preparation FAQs Travel Funding Opportunities Academic Progress Requirements Academic Structure Enrollment in Your Program Enrolling in Courses Finding Administrative Help Making Academic Progress Nominating Your Special Committee Student Progress Review Advancing to Doctoral Candidacy Defending Your Thesis or Dissertation Taking Exams Petitioning for Exceptions Responsible Conduct of Research Open Researcher and Contributor ID (ORCID) Changing Your Committee Changing Your Field or Program Changing Your Status Educational Opportunities Off Campus Faculty Guides to Advising & Mentoring Research Degree Students Advising Guide for Research Students Advising Guide for Professional Students Guidelines for Graduate Field Academic Handbooks Office of Academic Affairs Thesis & Dissertation Understanding Deadlines and Requirements Guide to Writing Your Thesis/Dissertation Required Sections, Guidelines, and Suggestions Formatting Requirements Fair Use, Copyright, Patent, and Publishing Options Fields Permitting the Use of Papers Option Templates Writing from A to B Scheduling and Taking Exams Submitting Your Thesis/Dissertation Submission Fees Graduation Requirements Commencement Diversity & Inclusion Office of Inclusion and Student Engagement Contact OISE Staff Access & Recruitment Prospective Students Requesting Letters of Recommendation Writing Your Academic Statement of Purpose Understanding & Preparing Your Personal Statement Summer Research Internships for Undergraduates Consider Cornell Consider Cornell Explore Consider Cornell Experience Recruitment Calendar Become an Ambassador Signature Initiatives Graduate School Dean’s Scholars Summer Success Symposium Graduate Students Mentoring Undergraduates My Voice, My Story Colman Inclusive Leadership Program NextGen Professors Program Application Information 2023-2024 Cohort NextGen Professors Alumni Future Professors Institute Building Allyship Initiative MAC Peer Mentoring Program MAC Public Keynote on Mentoring within the Academy Advocacy Day Bouchet Honor Society Bouchet Graduate Honor Society Scholars Graduate Diversity & Inclusion Awards 2024 Graduate Diversity & Inclusion Awardees 2023 Graduate Diversity & Inclusion Awardees 2022 Graduate Diversity & Inclusion Awardees 2021 Graduate Diversity & Inclusion Awardees 2020 Graduate Diversity & Inclusion Awardees 2019 Graduate Diversity & Inclusion Awardees Funding and Resources Graduate School Fellowships in Support of Diversity External Resources and Support Diversity Fellowship Instructions for DACA Applicants Faculty Resources Inclusive Mentoring Practical Steps Implicit Bias Resources Student Organizations Reporting Bias Professional Development Office of Career and Professional Development Pathways to Success Navigate Academia Build Your Skills Tips and Takeaways Tips for TAs Leadership Opportunities Create Your Plan Prepare for Your Career Understand Yourself Present Your Key Skills to an Employer Explore Options Find a Postdoc Position Take Action Resumes and CVs Research Statement Teaching Philosophy Statement Interviews Present Your Research Evaluate Offers Consider Job Satisfaction Evaluate the Compensation Package Negotiate a Salary Package Delay Your Response Protect Your Good Name Respond to an Offer Pathways to Success Symposium Summer 2022 Pathways to Success Symposium Summer 2021 Pathways to Success Series Sessions Winter 2021 Pathways to Success Series Sessions Summer 2020 Pathways to Success Series Sessions Winter 2019 P2S Symposium Sessions Summer 2019 P2S Symposium Sessions Spring 2019 P2S Symposium Sessions Free Memberships for Cornell Graduate Students and Postdocs Three Minute Thesis 3MT 2024 3MT 2023 3MT 2022 3MT 2021 3MT 2019 3MT 2018 3MT 2017 Student Experience Big Red Barn Signature Events Hours and Dining Reserving the Barn Meet the Barn Staff Office of Graduate Student Life Help and Support Mental Health While Away from Campus Student Communities International Students LGBTQ+ Students Students of Color Students with Partners and Families Student Veterans Women’s Communities Student Life Programs Graduate School Primer: Navigating Academia Workshop Series Perspectives: The Complete Graduate Student Becoming a Resilient Scientist Discussion Series Weekly Walks Book Clubs Student Governance Student Perks and Discounts Graduate School Career and Professional Development Pathways to Success Prepare for Your Career Take Action Research Statement Research Statement What is a Research Statement? The research statement (or statement of research interests) is a common component of academic job applications. It is a summary of your research accomplishments, current work, and future direction and potential of your work. The statement can discuss specific issues such as: funding history and potential requirements for laboratory equipment and space and other resources potential research and industrial collaborations how your research contributes to your field future direction of your research The research statement should be technical, but should be intelligible to all members of the department, including those outside your subdiscipline. So keep the “big picture” in mind. The strongest research statements present a readable, compelling, and realistic research agenda that fits well with the needs, facilities, and goals of the department. Research statements can be weakened by: overly ambitious proposals lack of clear direction lack of big-picture focus inadequate attention to the needs and facilities of the department or position Why a Research Statement? It conveys to search committees the pieces of your professional identity and charts the course of your scholarly journey. It communicates a sense that your research will follow logically from what you have done and that it will be different, important, and innovative. It gives a context for your research interests—Why does your research matter? The so what? It combines your achievements and current work with the proposal for upcoming research. Helps hiring committees assess: areas of specialty and expertise potential to get funding academic strengths and abilities compatibility with the department or school ability to think and communicate like a serious scholar and/or scientist Formatting of Research Statements The goal of the research statement is to introduce yourself to a search committee, which will probably contain scientists both in and outside your field, and get them excited about your research. To encourage people to read it: make it one or two pages, three at most use informative section headings and subheadings use bullets use an easily readable font size make the margins a reasonable size Organization of Research Statements Think of the overarching theme guiding your main research subject area. Write an essay that lays out: The main theme(s) and why it is important and what specific skills you use to attack the problem. A few specific examples of problems you have already solved with success to build credibility and inform people outside your field about what you do. A discussion of the future direction of your research. This section should be really exciting to people both in and outside your field. Don’t sell yourself short; if you think your research could lead to answers for big important questions, say so! A final paragraph that gives a good overall impression of your research. Writing Research Statements Style: Avoid jargon. Make sure that you describe your research in language that many people outside your specific subject area can understand. Ask people both in and outside your field to read it before you send your application. A search committee won’t get excited about something they can’t understand. Write as clearly, concisely, and concretely as you can. Keep it at a summary level; give more detail in the job talk. Ask others to proofread it. Be sure there are no spelling errors. Content: Convince the search committee not only that you are knowledgeable, but that you are the right person to carry out the research. Include information that sets you apart (e.g., publication in Science, Nature, or a prestigious journal in your field). What excites you about your research? Sound fresh. Include preliminary results and how to build on results. Point out how current faculty may become future partners. Acknowledge the work of others. Use language that shows you are an independent researcher. BUT focus on your research work, not yourself. Include potential funding partners and industrial collaborations. Be creative! Provide a summary of your research. Put in background material to give the context/relevance/significance of your research. List major findings, outcomes, and implications. Describe both current and planned (future) research. Communicate a sense that your research will follow logically from what you have done and that it will be unique, significant, and innovative (and easy to fund). Describe Your Future Goals or Research Plans Major problem(s) you want to focus on in your research. The problem’s relevance and significance to the field. Your specific goals for the next three to five years, including potential impact and outcomes. If you know what a particular agency funds, you can name the agency and briefly outline a proposal. Give broad enough goals so that if one area doesn’t get funded, you can pursue other research goals and funding. Identify Potential Funding Sources Almost every institution wants to know whether you’ll be able to get external funding for research. Try to provide some possible sources of funding for the research, such as NIH, NSF, foundations, private agencies. Mention past funding, if appropriate. Be Realistic There is a delicate balance between a realistic research statement where you promise to work on problems you really think you can solve and over-reaching or dabbling in too many subject areas. Select an over-arching theme for your research statement and leave miscellaneous ideas or projects out. Everyone knows that you will work on more than what you mention in this statement. Consider Also Preparing a Longer Version A longer version (five–15 pages) can be brought to your interview. (Check with your advisor to see if this is necessary.) You may be asked to describe research plans and budget in detail at the campus interview. Be prepared. Include laboratory needs (how much budget you need for equipment, how many grad assistants, etc.) to start up the research. Samples of Research Statements To find sample research statements with content specific to your discipline, search on the internet for your discipline + “Research Statement.” University of Pennsylvania Sample Research Statement Advice on writing a Research Statement (Plan) from the journal Science Land Acknowledgement Cornell University is located on the traditional homelands of the Gayogo̱hó꞉nǫ Ɂ (the Cayuga Nation). The Gayogo̱hó꞉nǫ Ɂ are members of the Hodinǫ̱hsǫ́:nih Confederacy, an alliance of six sovereign Nations with a historic and contemporary presence on this land. The Confederacy precedes the establishment of Cornell University, New York state, and the United States of America. We acknowledge the painful history of Gayogo̱hó꞉nǫ Ɂ dispossession, and honor the ongoing connection of Gayogo̱hó꞉nǫ Ɂ people, past and present, to these lands and waters. This land acknowledgment has been reviewed and approved by the traditional Gayogo̱hó꞉nǫ Ɂ leadership. Quick Links Intranet Events Resources Forms Policies Affiliated Offices Career Services Center for Teaching Innovation English Language Support Office Graduate and Professional Student Assembly Office of Global Learning Office of Postdoctoral Studies Cornell University Graduate School Caldwell Hall Cornell University Ithaca, NY 14853-2602 (607) 255-5820 Contact Us Web Accessibility and Privacy Help Cornell University © 2024"
}